{"auto_keywords": [{"score": 0.03692054235004238, "phrase": "satisfiability_problems"}, {"score": 0.014446380335810284, "phrase": "np"}, {"score": 0.009524742486402499, "phrase": "satisfiability_problem"}, {"score": 0.004797535448556658, "phrase": "connectedness_constraints"}, {"score": 0.004780183091824403, "phrase": "euclidean_spaces"}, {"score": 0.004719940271469571, "phrase": "widely-studied_formalism"}, {"score": 0.004694353795114243, "phrase": "topological_arrangements"}, {"score": 0.004677372885331908, "phrase": "spatial_regions"}, {"score": 0.004626796109657584, "phrase": "language_range"}, {"score": 0.004544094860407016, "phrase": "euclidean"}, {"score": 0.004342430078306461, "phrase": "key_question"}, {"score": 0.004287680323820891, "phrase": "finite_set"}, {"score": 0.003980531478122155, "phrase": "common_satisfiability_problem"}, {"score": 0.003866703096145935, "phrase": "spatial_region"}, {"score": 0.0038457240885563146, "phrase": "'single_piece"}, {"score": 0.003811010743703935, "phrase": "present_article"}, {"score": 0.003525074461418428, "phrase": "connected_interior"}, {"score": 0.003308195943172624, "phrase": "finite_sets"}, {"score": 0.0032310733124059567, "phrase": "'wild'_regions"}, {"score": 0.003213531823374009, "phrase": "possible_physical_meaning"}, {"score": 0.002460876181416983, "phrase": "simplest_satisfying_assignment"}, {"score": 0.0022967713922705, "phrase": "smallest_configuration"}, {"score": 0.00217496508306238, "phrase": "exponentially_large_satisfying_diagrams"}, {"score": 0.002128067018576581, "phrase": "infinitely_many_components"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Qualitative spatial reasoning", " Spatial logic", " Euclidean space", " Connectedness", " Satisfiability", " Complexity"], "paper_abstract": "The language RCC8 is a widely-studied formalism for describing topological arrangements of spatial regions. The variables of this language range over the collection of non-empty, regular closed sets of n-dimensional Euclidean space, here denoted RC+(R-n), and its non-logical primitives allow us to specify how the interiors, exteriors and boundaries of these sets intersect. The key question is the satisfiability problem: given a finite set of atomic RCC8-constraints in m variables, determine whether there exists an m-tuple of elements of RC+(R-n) satisfying them. These problems are known to coincide for all n >= 1, so that RCC8-satisfiability is independent of dimension. This common satisfiability problem is NLoGSPAcE-complete. Unfortunately, RCC8 lacks the means to say that a spatial region comprises a 'single piece', and the present article investigates what happens when this facility is added. We consider two extensions of RCC8: RCC8c, in which we can state that a region is connected, and RCC8c degrees, in which we can instead state that a region has a connected interior. The satisfiability problems for both these languages are easily seen to depend on the dimension n, for n <= 3. Furthermore, in the case of RCC8c degrees, we show that there exist finite sets of constraints that are satisfiable over RC+(R-2), but only by 'wild' regions having no possible physical meaning. This prompts us to consider interpretations over the more restrictive domain of non-empty, regular closed, polyhedral sets, RCP+(R-n). We show that (a) the satisfiability problems for RCC8c (equivalently, RCC8c degrees) over RC+(R) and RCP+(R) are distinct and both NP-complete; (b) the satisfiability problems for RCC8c over RC+(R-2) and RCP+(R-2) are identical and NP-complete; (c) the satisfiability problems for RCC8c degrees over RC+(R-2) and RCP+(R-2) are distinct, and the latter is NP-complete. Decidability of the satisfiability problem for RCC8c degrees over RC+(R-2) is open. For n >= 3, RCC8c and RCC8c degrees are not interestingly different from RCC8. We finish by answering the following question: given that a set of RCC8c- or RCC8c degrees-constraints is satisfiable over RC+(R-n) or RCP+(R-n), how complex is the simplest satisfying assignment? In particular, we exhibit, for both languages, a sequence of constraints Phi(n), satisfiable over RCP+(R-2), such that the size of Phi(n) grows polynomially in n, while the smallest configuration of polygons satisfying Phi(n) cuts the plane into a number of pieces that grows exponentially. We further show that, over RC+(R-2), RCC8c again requires exponentially large satisfying diagrams, while RCC8c degrees can force regions in satisfying configurations to have infinitely many components. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Spatial reasoning with RCC8 and connectedness constraints in Euclidean spaces", "paper_id": "WOS:000345180400003"}