{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "environmental_and_resource_economics"}, {"score": 0.004670597652149685, "phrase": "environmental_economics"}, {"score": 0.004300133642951283, "phrase": "leading_journal"}, {"score": 0.004189337956225294, "phrase": "previous_studies"}, {"score": 0.004153041453795458, "phrase": "general_economic_journals"}, {"score": 0.004099183062034004, "phrase": "empirical_evidence"}, {"score": 0.004010960493946656, "phrase": "intellectual_collaboration"}, {"score": 0.0037903327482565097, "phrase": "previous_study"}, {"score": 0.0033553473725594003, "phrase": "jeem"}, {"score": 0.0032404677650217407, "phrase": "potential_drivers"}, {"score": 0.003129509028432954, "phrase": "descriptive_analysis"}, {"score": 0.002957222630196853, "phrase": "empirical_methods"}, {"score": 0.002652039172817654, "phrase": "also_other_potentially_relevant_drivers"}, {"score": 0.002583597507349819, "phrase": "e.g._external_funding"}, {"score": 0.0025389513338018414, "phrase": "empirical_support"}, {"score": 0.0024306740161601625, "phrase": "key_characteristics"}, {"score": 0.0022768346311104735, "phrase": "external_funding"}, {"score": 0.0021049977753042253, "phrase": "jointly_written_publications"}], "paper_keywords": ["Environmental and resource economics", " Co-authorship", " Production of knowledge"], "paper_abstract": "We examine the incidence and extent of co-authorship in environmental and resource economics by investigating the leading journal of environmental and resource economics: the Journal of Environmental Economics and Management. Previous studies of general economic journals have offered empirical evidence for the fact that intellectual collaboration is most prevalent in the field of environmental and resource economics. However, no previous study has examined this finding more carefully. This is a gap in the literature we hope to fill. Accordingly, we investigate all 1,436 papers published in JEEM from 1974 until 2010 with respect to potential drivers of co-authorship. We start with a descriptive analysis in order to depict the most important trends in the past 36 years. We then employ empirical methods to test several hypotheses that are commonly used to analyze the structure of co-authorship. However, we do not stick to hypotheses but investigate also other potentially relevant drivers of co-authorship as e.g. external funding. We find empirical support for a relation between the number of authors and key characteristics of an article like the number of equations, tables or the presence of external funding. Research in environmental and resource economics is demanding in terms of both disciplinary and interdisciplinary skills, so the likelihood of collaboration and jointly written publications is present and significant.", "paper_title": "Incidence and extent of co-authorship in environmental and resource economics: evidence from the Journal of Environmental Economics and Management", "paper_id": "WOS:000335905000002"}