{"auto_keywords": [{"score": 0.042630188250273066, "phrase": "sbml"}, {"score": 0.010612383866950226, "phrase": "biopax"}, {"score": 0.0069189727590671666, "phrase": "sbml."}, {"score": 0.004205226397573506, "phrase": "data_exchange_languages"}, {"score": 0.004166129325245761, "phrase": "systems_biology"}, {"score": 0.004032118497047498, "phrase": "quantitative_modeling"}, {"score": 0.003994624397219346, "phrase": "dynamic_simulation"}, {"score": 0.003884212965525665, "phrase": "biopax_specification"}, {"score": 0.0037768417338850274, "phrase": "qualitative_analysis"}, {"score": 0.003741712498615481, "phrase": "pathway_maps"}, {"score": 0.0034884152484429207, "phrase": "quantitative_processes"}, {"score": 0.0033761303704612734, "phrase": "sbml_qualitative_models"}, {"score": 0.002598333022293788, "phrase": "entire_nature_pathway_interaction_database"}, {"score": 0.0022793032191981404, "phrase": "new_qual_extension_package"}, {"score": 0.0021649437083408425, "phrase": "sbml_conversions"}, {"score": 0.0021247934141234988, "phrase": "previous_conversion_tools"}], "paper_keywords": [""], "paper_abstract": "Motivation: The biological pathway exchange language (BioPAX) and the systems biology markup language (SBML) belong to the most popular modeling and data exchange languages in systems biology. The focus of SBML is quantitative modeling and dynamic simulation of models, whereas the BioPAX specification concentrates mainly on visualization and qualitative analysis of pathway maps. BioPAX describes reactions and relations. In contrast, SBML core exclusively describes quantitative processes such as reactions. With the SBML qualitative models extension (qual), it has recently also become possible to describe relations in SBML. Before the development of SBML qual, relations could not be properly translated into SBML. Until now, there exists no BioPAX to SBML converter that is fully capable of translating both reactions and relations. Results: The entire nature pathway interaction database has been converted from BioPAX (Level 2 and Level 3) into SBML (Level 3 Version 1) including both reactions and relations by using the new qual extension package. Additionally, we present the new webtool BioPAX2SBML for further BioPAX to SBML conversions. Compared with previous conversion tools, BioPAX2SBML is more comprehensive, more robust and more exact.", "paper_title": "Qualitative translation of relations from BioPAX to SBML qual", "paper_id": "WOS:000309881200012"}