{"auto_keywords": [{"score": 0.049558064870310475, "phrase": "optical_mesh_networks"}, {"score": 0.00481495049065317, "phrase": "maximum_reliability"}, {"score": 0.004387225575447685, "phrase": "simultaneous_failures"}, {"score": 0.004339459955098738, "phrase": "multiple_fiber_links"}, {"score": 0.004222299135545249, "phrase": "shared-risk_link_group"}, {"score": 0.0037226570791514184, "phrase": "lightpath-ring_problems"}, {"score": 0.003524227590204673, "phrase": "special_problems"}, {"score": 0.0032819448594643853, "phrase": "srlg"}, {"score": 0.00319324425647735, "phrase": "distinct_color"}, {"score": 0.0031411751440831165, "phrase": "fiber_link"}, {"score": 0.0027996401456881806, "phrase": "minimum-color_lightpath_problems"}, {"score": 0.0026070408483940535, "phrase": "failure_probability"}, {"score": 0.002273025527678093, "phrase": "general_problems"}, {"score": 0.0022359278646792153, "phrase": "failure_probabilities"}, {"score": 0.0021516991383785985, "phrase": "heuristic_algorithms"}, {"score": 0.0021049977753042253, "phrase": "larger_instances"}], "paper_keywords": [""], "paper_abstract": "We consider the problem of maximizing the reliability of connections in optical mesh networks against simultaneous failures of multiple fiber links that belong to a shared-risk link group (SRLG). We study the single-lightpath, parallel-lightpaths, and lightpath protection problems for connections between two end nodes, as well as the lightpath-ring problems for connections of three or more end nodes. We first study the special problems where all SRLGs have the same failure probability. In these problems, every SRLG is represented by a distinct color and every fiber link is associated with one or more colors, depending on the SRLGs to which the link belongs. We formulate the problems as minimum-color lightpath problems. By minimizing the number of colors on the lightpaths, the failure probability of the lightpaths can be minimized. We prove the problems to be NP-hard. We then extend the results to the general problems where the failure probabilities of the SRLGs may differ. Heuristic algorithms are proposed for larger instances of the problems, and the heuristics are evaluated through simulations. (C) 2008 Optical Society of America.", "paper_title": "Lightpath routing for maximum reliability in optical mesh networks", "paper_id": "WOS:000255731300007"}