{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "promoter_regions"}, {"score": 0.00461575768501871, "phrase": "bacterial_genomes"}, {"score": 0.004261617028111862, "phrase": "rapid_and_reliable_annotation"}, {"score": 0.003953068310598579, "phrase": "transcription_unit"}, {"score": 0.0038431888954930083, "phrase": "present_work"}, {"score": 0.0037188360359702182, "phrase": "generic_method"}, {"score": 0.003531474887552889, "phrase": "dna_double_helical_sequences"}, {"score": 0.003401148484767927, "phrase": "non-promoter_regions"}, {"score": 0.0032602525602322832, "phrase": "neighboring_regions"}, {"score": 0.003081400693055518, "phrase": "large_scale"}, {"score": 0.002967634471075658, "phrase": "average_free_energy_values"}, {"score": 0.0027395968397212053, "phrase": "threshold_values"}, {"score": 0.0025171669791790438, "phrase": "microbial_genomes"}, {"score": 0.0024128022009415476, "phrase": "complete_genome_sequences"}, {"score": 0.0023789822182914877, "phrase": "average_recall_value"}, {"score": 0.0022589720760078274, "phrase": "rna_coding_genes"}, {"score": 0.0022378101636842296, "phrase": "predicted_promoter_regions"}], "paper_keywords": [""], "paper_abstract": "Motivation: The number of bacterial genomes being sequenced is increasing very rapidly and hence, it is crucial to have procedures for rapid and reliable annotation of their functional elements such as promoter regions, which control the expression of each gene or each transcription unit of the genome. The present work addresses this requirement and presents a generic method applicable across organisms. Results: Relative stability of the DNA double helical sequences has been used to discriminate promoter regions from non-promoter regions. Based on the difference in stability between neighboring regions, an algorithm has been implemented to predict promoter regions on a large scale over 913 microbial genome sequences. The average free energy values for the promoter regions as well as their downstream regions are found to differ, depending on their GC content. Threshold values to identify promoter regions have been derived using sequences flanking a subset of translation start sites from all microbial genomes and then used to predict promoters over the complete genome sequences. An average recall value of 72% (which indicates the percentage of protein and RNA coding genes with predicted promoter regions assigned to them) and precision of 56% is achieved over the 913 microbial genome dataset.", "paper_title": "High-quality annotation of promoter regions for 913 bacterial genomes", "paper_id": "WOS:000284947700006"}