{"auto_keywords": [{"score": 0.04586846484671967, "phrase": "multi-path_routing_protocols"}, {"score": 0.00481495049065317, "phrase": "multi-path_wireless"}, {"score": 0.004620093797504386, "phrase": "minimum_cost_blocking"}, {"score": 0.004494570360108983, "phrase": "wireless_mesh_networks"}, {"score": 0.0042928648367867835, "phrase": "provable_superiority"}, {"score": 0.004081385289516914, "phrase": "network-partitioning_type_attacks"}, {"score": 0.0036218682585355895, "phrase": "source_nodes"}, {"score": 0.0032457746093442, "phrase": "scenario"}, {"score": 0.003127118769159901, "phrase": "np"}, {"score": 0.002673957615079041, "phrase": "best_case_scenario"}, {"score": 0.002214297250267208, "phrase": "first_work"}, {"score": 0.002124461969404541, "phrase": "multi-path_protocols"}, {"score": 0.0021049977753042253, "phrase": "network_node_mobility"}], "paper_keywords": ["Attacks", " blocking", " multi-path routing", " max SNP problems (MAXSNP)", " wireless networks", " #P-hardness"], "paper_abstract": "We present a class of Minimum Cost Blocking (MCB) problems in Wireless Mesh Networks (WMNs) with multi-path routing protocols. We establish the provable superiority of multi-path routing protocols over conventional protocols against blocking, node-isolation and network-partitioning type attacks. In our attack model, an adversary is considered successful if he is able to capture/isolate a subset of nodes such that no more than a certain amount of traffic from source nodes reaches the gateways. Two scenarios, viz. (a) low mobility for network nodes, and (b) high degree of node mobility, are evaluated. Scenario (a) is proven to be NP-hard and scenario (b) is proven to be #P-hard for the adversary to realize the goal. Further, several approximation algorithms are presented which show that even in the best case scenario it is at least exponentially hard for the adversary to optimally succeed in such blocking-type attacks. These results are verified through simulations which demonstrate the robustness of multi-path routing protocols against such attacks. To the best of our knowledge, this is the first work that theoretically evaluates the attack-resiliency and performance of multi-path protocols with network node mobility.", "paper_title": "Minimum Cost Blocking Problem in Multi-Path Wireless Routing Protocols", "paper_id": "WOS:000338511000013"}