{"auto_keywords": [{"score": 0.02657270965539299, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "strategy_selection"}, {"score": 0.0044199701363984495, "phrase": "social_insects"}, {"score": 0.004319255461225845, "phrase": "advantageous_way"}, {"score": 0.004165586713723931, "phrase": "potential_advantages"}, {"score": 0.003938740137673181, "phrase": "individuals'_skills"}, {"score": 0.0038871782153080485, "phrase": "energy_efficiency"}, {"score": 0.00384894851099016, "phrase": "higher_parallelism"}, {"score": 0.003147972261878234, "phrase": "individual_robots"}, {"score": 0.0028234043335210895, "phrase": "explicit_communication"}, {"score": 0.0027408292745619233, "phrase": "simulation_experiments"}, {"score": 0.002474408907166139, "phrase": "good_performance"}, {"score": 0.0022264684349099775, "phrase": "environmental_conditions"}, {"score": 0.002161313898853851, "phrase": "scalability_experiments"}], "paper_keywords": ["Task partitioning", " Foraging", " Swarm robotics", " Self-organization"], "paper_abstract": "Task partitioning is the decomposition of a task into two or more sub-tasks that can be tackled separately. Task partitioning can be observed in many species of social insects, as it is often an advantageous way of organizing the work of a group of individuals. Potential advantages of task partitioning are, among others: reduction of interference between workers, exploitation of individuals' skills and specializations, energy efficiency, and higher parallelism. Even though swarms of robots can benefit from task partitioning in the same way as social insects do, only few works in swarm robotics are dedicated to this subject. In this paper, we study the case in which a swarm of robots has to tackle a task that can be partitioned into a sequence of two sub-tasks. We propose a method that allows the individual robots in the swarm to decide whether to partition the given task or not. The method is self-organized, relies on the experience of each individual, and does not require explicit communication between robots. We evaluate the method in simulation experiments, using foraging as testbed. We study cases in which task partitioning is preferable and cases in which it is not. We show that the proposed method leads to good performance of the swarm in both cases, by employing task partitioning only when it is advantageous. We also show that the swarm is able to react to changes in the environmental conditions by adapting the behavior on-line. Scalability experiments show that the proposed method performs well across all the tested group sizes.", "paper_title": "Task partitioning in swarms of robots: an adaptive method for strategy selection", "paper_id": "WOS:000297595700006"}