{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "hierarchical_soft_correspondence_detection"}, {"score": 0.013934121100829597, "phrase": "hammer"}, {"score": 0.009952270286226823, "phrase": "hierarchical_soft_correspondence_detection_technique"}, {"score": 0.004739056045644449, "phrase": "new_approach"}, {"score": 0.004195418010131832, "phrase": "relative_long_time"}, {"score": 0.003936955192151039, "phrase": "linux"}, {"score": 0.0036359780843400625, "phrase": "correspondence_detection"}, {"score": 0.0033937776228549557, "phrase": "complex_structures"}, {"score": 0.003322540556404882, "phrase": "image_warping"}, {"score": 0.0031845067058084583, "phrase": "long_time"}, {"score": 0.0026168641536413978, "phrase": "hammer_registration_framework"}, {"score": 0.0024553821147953463, "phrase": "low_average_registration_error"}, {"score": 0.002378408229095287, "phrase": "experimental_results"}, {"score": 0.0023532890136269986, "phrase": "real_and_simulated_data"}, {"score": 0.0023038418282549274, "phrase": "new_registration_algorithm"}, {"score": 0.0021049977753042253, "phrase": "similar_registration_accuracy"}], "paper_keywords": ["Deformable registration", " Non-rigid registration", " Feature matching", " Local descriptor"], "paper_abstract": "A new approach, based on the hierarchical soft correspondence detection, has been presented for significantly improving the speed of our previous HAMMER image registration algorithm. Currently, HAMMER takes a relative long time, e.g., up to 80 min, to register two regular sized images using Linux machine (with 2.40 GHz CPU and 2-Gbyte memory). This is because the results of correspondence detection. used to guide the image warping, can be ambiguous in complex structures and thus the image warping has to be conservative and accordingly takes long time to complete. In this paper, a hierarchical soft correspondence detection technique has been employed to detect correspondences more robustly, thereby allowing the image warping to be completed straightforwardly and fast. By incorporating this hierarchical soft correspondence detection technique into the HAMMER registration framework, both the robustness and the accuracy of registration (in terms of low average registration error) can be achieved. Experimental results on real and simulated data show that the new registration algorithm, based on the hierarchical soft correspondence detection, can run nine times faster than HAMMER while keeping the similar registration accuracy. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Fast image registration by hierarchical soft correspondence detection", "paper_id": "WOS:000263431200033"}