{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "extensible_motifs"}, {"score": 0.04966229511350135, "phrase": "saturation_constraints"}, {"score": 0.0041136473765874815, "phrase": "wild_cards"}, {"score": 0.003623453648863547, "phrase": "prescribed_maximum_length"}, {"score": 0.0034835017385881385, "phrase": "extensible_motif"}, {"score": 0.003247868216333148, "phrase": "motif_pattern"}, {"score": 0.0031223774204093713, "phrase": "statistical_measure"}, {"score": 0.0029755458462182565, "phrase": "appropriate_saturation_conditions"}, {"score": 0.0029110999689379497, "phrase": "probabilistic_scores"}, {"score": 0.002860546817196148, "phrase": "constant_frequency"}, {"score": 0.002823207272381655, "phrase": "significant_parsimony"}, {"score": 0.0027863537694678094, "phrase": "generation_and_testing_of_candidate_overrepresented_motifs"}, {"score": 0.002328238264850759, "phrase": "protein_sequence_families"}, {"score": 0.002297831085501592, "phrase": "equal_importance"}, {"score": 0.002208966376185464, "phrase": "surprising_motifs"}], "paper_keywords": ["Computational genomics", " pattern discovery", " data mining", " motif", " protein sequence", " protein family"], "paper_abstract": "The discovery of motifs in biosequences is frequently torn between the rigidity of the model on one hand and the abundance of candidates on the other hand. In particular, motifs that include wild cards or \"don't cares\" escalate exponentially with their number, and this gets only worse if a don't care is allowed to stretch up to some prescribed maximum length. In this paper, a notion of extensible motif in a sequence is introduced and studied, which tightly combines the structure of the motif pattern, as described by its syntactic specification, with the statistical measure of its occurrence count. It is shown that a combination of appropriate saturation conditions and the monotonicity of probabilistic scores over regions of constant frequency afford us significant parsimony in the generation and testing of candidate overrepresented motifs. A suite of software programs called Varun(1) is described, implementing the discovery of extensible motifs of the type considered. The merits of the method are then documented by results obtained in a variety of experiments primarily targeting protein sequence families. Of equal importance seems the fact that the sets of all surprising motifs returned in each experiment are extracted faster and come in much more manageable sizes than would be obtained in the absence of saturation constraints.", "paper_title": "VARUN: Discovering Extensible Motifs under Saturation Constraints", "paper_id": "WOS:000283559100018"}