{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "usability_evaluation_methods"}, {"score": 0.048418776007488694, "phrase": "evaluation_methods"}, {"score": 0.00478672147169923, "phrase": "indivisible_wholes"}, {"score": 0.004716867446922295, "phrase": "usability_practice"}, {"score": 0.004620773128779254, "phrase": "new_ideas"}, {"score": 0.004593677275091001, "phrase": "usability_research"}, {"score": 0.0045266275871436975, "phrase": "new_evaluation_methods"}, {"score": 0.0043185468826678185, "phrase": "important_deficiencies"}, {"score": 0.0042429960722503305, "phrase": "usability_practitioners"}, {"score": 0.00419336149335416, "phrase": "specific_method"}, {"score": 0.004156515375354328, "phrase": "particular_situation"}, {"score": 0.004083787598482644, "phrase": "human-computer_interaction"}, {"score": 0.003953729274556226, "phrase": "standard_\"unit"}, {"score": 0.0038731214776085046, "phrase": "larger_units"}, {"score": 0.003640989676914951, "phrase": "specific_aspects"}, {"score": 0.003483718784873684, "phrase": "method_innovations"}, {"score": 0.0034126606309263694, "phrase": "loose_incomplete_collections"}, {"score": 0.0033627909221532527, "phrase": "successful_practitioners_configure"}, {"score": 0.0032845057772800273, "phrase": "specific_project_circumstances"}, {"score": 0.003226986367585129, "phrase": "existing_research"}, {"score": 0.0031425844781944896, "phrase": "specific_evaluation_methods"}, {"score": 0.0030784630179366353, "phrase": "existing_methods"}, {"score": 0.0029628208989202166, "phrase": "generic_classification_scheme"}, {"score": 0.0029454183793671054, "phrase": "evaluation_resources"}, {"score": 0.0028599227029302353, "phrase": "project_specific_resources"}, {"score": 0.0028264213957619236, "phrase": "effective_use"}, {"score": 0.002594961351159294, "phrase": "culinary_analogies"}, {"score": 0.00237539960152304, "phrase": "usability_work"}, {"score": 0.0021174453532942115, "phrase": "culinary_dishes"}, {"score": 0.002105011882358329, "phrase": "hci"}], "paper_keywords": [""], "paper_abstract": "To better support usability practice, most usability research focuses on evaluation methods. New ideas in usability research are mostly proposed as new evaluation methods. Many publications describe experiments that compare methods. Comparisons may indicate that some methods have important deficiencies, and thus often advise usability practitioners to prefer a specific method in a particular situation. An expectation persists in human-computer interaction (HCI) that results about evaluation methods should be the standard \"unit of contribution\" rather than favoring larger units (e. g., usability work as a whole) or smaller ones (e. g., the impact of specific aspects of a method). This article argues that these foci on comparisons and method innovations ignore the reality that usability evaluation methods are loose incomplete collections of resources, which successful practitioners configure, adapt, and complement to match specific project circumstances. Through a review of existing research on methods and resources, resources associated with specific evaluation methods, and ones that can complement existing methods, or be used separately, are identified. Next, a generic classification scheme for evaluation resources is developed, and the scheme is extended with project specific resources that impact the effective use of methods. With these reviews and analyses in place, implications for research, teaching, and practice are derived. Throughout, the article draws on culinary analogies. A recipe is nothing without its ingredients, and just as the quality of what is cooked reflects the quality of its ingredients, so too does the quality of usability work reflect the quality of resources as configured and combined. A method, like a recipe, is at best a guide to action for those adopting approaches to usability that are new to them. As with culinary dishes, HCI needs to focus more on what gets cooked, and how it gets cooked, and not just on how recipes suggest that it could be cooked.", "paper_title": "Ingredients and Meals Rather Than Recipes: A Proposal for Research That Does Not Treat Usability Evaluation Methods as Indivisible Wholes", "paper_id": "WOS:000299772300002"}