{"auto_keywords": [{"score": 0.04532174198801801, "phrase": "surgical_technician"}, {"score": 0.01466783750628864, "phrase": "conceptual_model"}, {"score": 0.013853900096621765, "phrase": "communication_events"}, {"score": 0.004782024889485564, "phrase": "medical_care"}, {"score": 0.004762377182821785, "phrase": "principal_cause"}, {"score": 0.004749323365717064, "phrase": "inpatient_mortality"}, {"score": 0.00468470410475463, "phrase": "usa"}, {"score": 0.004658938373208752, "phrase": "ineffective_team_communication"}, {"score": 0.004627074654078283, "phrase": "operation_room"}, {"score": 0.004582829542018412, "phrase": "major_root"}, {"score": 0.004410021079229461, "phrase": "object-process_methodology"}, {"score": 0.0043738432231020885, "phrase": "intricate_interactions"}, {"score": 0.004320129741648975, "phrase": "surgical_instruments"}, {"score": 0.0043023738378892866, "phrase": "or."}, {"score": 0.004272936067126038, "phrase": "software-_and_hardware-independent_description"}, {"score": 0.0041457838633217675, "phrase": "task-related_objectives"}, {"score": 0.0041287394089001405, "phrase": "surgical_procedure"}, {"score": 0.00392956895931878, "phrase": "operating_room"}, {"score": 0.003875962465099124, "phrase": "compact_ontology"}, {"score": 0.003865331486427273, "phrase": "opm"}, {"score": 0.0038336022513584173, "phrase": "stateful_objects"}, {"score": 0.0037041764202130436, "phrase": "modeled_communication_modalities"}, {"score": 0.003648617060320522, "phrase": "\"sunny_day\"_scenario"}, {"score": 0.0036336091369948945, "phrase": "opm_refinement_mechanism"}, {"score": 0.0036037775645776683, "phrase": "key_processes"}, {"score": 0.0034487493082822835, "phrase": "iterative_process"}, {"score": 0.0033460404850446284, "phrase": "tool_handling"}, {"score": 0.003233021751961707, "phrase": "separate_diagram"}, {"score": 0.0031670453748397095, "phrase": "whole_model"}, {"score": 0.003145352865188648, "phrase": "verbal_and_non-verbal_modalities"}, {"score": 0.003110952512844786, "phrase": "resulting_conceptual_model"}, {"score": 0.00309814929802876, "phrase": "solid_basis"}, {"score": 0.0030600539712413804, "phrase": "large_variety"}, {"score": 0.0029404505888511955, "phrase": "surgical_instrumentations"}, {"score": 0.002833289844823831, "phrase": "specific_person"}, {"score": 0.00280614894376236, "phrase": "technological_solutions"}, {"score": 0.0027945966402685278, "phrase": "tool-related_errors"}, {"score": 0.002737542646150701, "phrase": "structured_questionnaire"}, {"score": 0.0025521085778978042, "phrase": "detailed_conceptual_model"}, {"score": 0.0024121610928417325, "phrase": "exact_circumstances"}, {"score": 0.0023824806252532352, "phrase": "concise_specification"}, {"score": 0.0023564039938288217, "phrase": "surgical_instrument_requests"}, {"score": 0.002330612108529907, "phrase": "methodical_analysis"}, {"score": 0.002279870230452658, "phrase": "significant_potential_value"}, {"score": 0.0022642405772592866, "phrase": "tool-handling-related_errors"}, {"score": 0.0022425385043433397, "phrase": "solid_formal_basis"}, {"score": 0.0022302306304023602, "phrase": "cybernetic_agent"}, {"score": 0.00220885381105235, "phrase": "routine_tool_handling_activities"}, {"score": 0.002175673985064338, "phrase": "quality_assurance"}, {"score": 0.0021548189632658063, "phrase": "cybernetic_agent_activities"}, {"score": 0.002140044760360403, "phrase": "critical_step"}, {"score": 0.002128298209776029, "phrase": "next_generation"}, {"score": 0.0021224490836605804, "phrase": "cybernetic_or_assistants"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Surgical robots", " Concept formation", " Conceptual modeling", " Operative surgical procedures", " Process model"], "paper_abstract": "Objective: Errors in the delivery of medical care are the principal cause of inpatient mortality and morbidity, accounting for around 98,000 deaths in the United States of America (USA) annually. Ineffective team communication, especially in the operation room (OR), is a major root of these errors. This miscommunication can be reduced by analyzing and constructing a conceptual model of communication and miscommunication in the OR. We introduce the principles underlying Object-Process Methodology (OPM)-based modeling of the intricate interactions between the surgeon and the surgical technician while handling surgical instruments in the OR. This model is a software- and hardware-independent description of the agents engaged in communication events, their physical activities, and their interactions. The model enables assessing whether the task-related objectives of the surgical procedure were achieved and completed successfully and what errors can occur during the communication. Methods and material: The facts used to construct the model were gathered from observations of various types of operations miscommunications in the operating room and its outcomes. The model takes advantage of the compact ontology of OPM, which is comprised of stateful objects things that exist physically or informatically, and processes things that transform objects by creating them, consuming them or changing their state. The modeled communication modalities are verbal and non-verbal, and errors are modeled as processes that deviate from the \"sunny day\" scenario. Using OPM refinement mechanism of in-zooming, key processes are drilled into and elaborated, along with the objects that are required as agents or instruments, or objects that these processes transform. The model was developed through an iterative process of observation, modeling, group discussions, and simplification. Results: The model faithfully represents the processes related to tool handling that take place in an OR during an operation. The specification is at various levels of detail, each level is depicted in a separate diagram, and all the diagrams are \"aware\" of each other as part of the whole model. Providing ontology of verbal and non-verbal modalities of communication in the OR, the resulting conceptual model is a solid basis for analyzing and understanding the source of the large variety of errors occurring in the course of an operation, providing an opportunity to decrease the quantity and severity of mistakes related to the use and misuse of surgical instrumentations. Since the model is event driven, rather than person driven, the focus is on the factors causing the errors, rather than the specific person. This approach advocates searching for technological solutions to alleviate tool-related errors rather than finger-pointing. Concretely, the model was validated through a structured questionnaire and it was found that surgeons agreed that the conceptual model was flexible (3.8 of 5, std = 0.69), accurate, and it generalizable (3.7 of 5, std = 0.37 and 3.7 of 5, std = 0.85, respectively). Conclusion: The detailed conceptual model of the tools handling subsystem of the operation performed in an OR focuses on the details of the communication and the interactions taking place between the surgeon and the surgical technician during an operation, with the objective of pinpointing the exact circumstances in which errors can happen. Exact and concise specification of the communication events in general and the surgical instrument requests in particular is a prerequisite for a methodical analysis of the various modes of errors and the circumstances under which they occur. This has significant potential value in both reduction in tool-handling-related errors during an operation and providing a solid formal basis for designing a cybernetic agent which can replace a surgical technician in routine tool handling activities during an operation, freeing the technician to focus on quality assurance, monitoring and control of the cybernetic agent activities. This is a critical step in designing the next generation of cybernetic OR assistants. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Operation room tool handling and miscommunication scenarios: An object-process methodology conceptual model", "paper_id": "WOS:000348015600002"}