{"auto_keywords": [{"score": 0.04786124949424475, "phrase": "hrm"}, {"score": 0.04678864793717076, "phrase": "scm"}, {"score": 0.021465964831565192, "phrase": "scmo"}, {"score": 0.014147580948874082, "phrase": "cs"}, {"score": 0.013696218143367609, "phrase": "mediating_role"}, {"score": 0.008662487355151759, "phrase": "supply_chain_management"}, {"score": 0.00481495049065317, "phrase": "human_resources"}, {"score": 0.004730158389701481, "phrase": "purpose-the_purpose"}, {"score": 0.0046194096969523315, "phrase": "human_resource_management"}, {"score": 0.004379572106088617, "phrase": "significant_impact"}, {"score": 0.0043537008514226445, "phrase": "customer_satisfaction"}, {"score": 0.004127601533040351, "phrase": "hrm_and_scm_outcomes"}, {"score": 0.003754140294151593, "phrase": "five_constructs"}, {"score": 0.003527550673371394, "phrase": "existing_model"}, {"score": 0.0034756411557513916, "phrase": "different_geographical_context"}, {"score": 0.003294990915005896, "phrase": "empirical_results"}, {"score": 0.0032464924707850556, "phrase": "significant_direct_and_indirect_impacts"}, {"score": 0.003198705576491802, "phrase": "scmi"}, {"score": 0.0030685999966886734, "phrase": "scmo."}, {"score": 0.0029090444046528563, "phrase": "successful_implementation"}, {"score": 0.002637705034367748, "phrase": "supply_chain"}, {"score": 0.002515384834484012, "phrase": "better_business_outcomes"}, {"score": 0.0024563633541195124, "phrase": "original_analysis"}, {"score": 0.0022874602835499195, "phrase": "mediating_effects"}], "paper_keywords": ["Supply chain management", " Structural equation modelling", " Customer satisfaction", " Human resource management", " Human resource management in the supply chain", " Organisational performance"], "paper_abstract": "Purpose-The purpose of this paper is to demonstrate that human resource management (HRM) has an impact on supply chain management (SCM), which in turn has a significant impact on customer satisfaction (CS) and organisational performance (OP), playing a mediating role in the relationship between HRM and SCM outcomes (SCMO). Design/methodology/approach-The model is first validated and the hypotheses formulated are tested using the partial least squares structural equation model (SEM), based on five constructs: HRM, SCM implementation (SCMI), SCMO, customer satisfaction and organisational performance, taken from an existing model tested previously in a different geographical context. To do this, a survey was conducted and 231 valid responses were obtained. Findings-The empirical results reveal that HRM had significant direct and indirect impacts on SCMO, and SCMI, which in turn played a mediating role in the relationships between HRM and SCMO. CS also played a mediating role in the relationships between SCMO and OP. This finding suggests that the successful implementation of SCM not only directly improves SCMO, but it also indirectly increases CS and OP. Research limitations/implications-A firm's human resource practices need to be aligned with its SCM to foster the involvement of the members of the supply chain (SC), promote the integration of the SC and, consequently, ensure better business outcomes. Originality/value-The study provides an original analysis not only in terms of the measurement of the relationship between HRM and SCM, but also with regard to its examination of the mediating effects, thus shedding light on the mechanisms by which these relationships are produced, and how this impacts CS and OP. This has allowed us to obtain more insightful results than those reported in the literature to date.", "paper_title": "Impact of human resources on supply chain management and performance", "paper_id": "WOS:000349644500007"}