{"auto_keywords": [{"score": 0.027965575599963963, "phrase": "clinical_information"}, {"score": 0.012794878586930252, "phrase": "automated_text_de-identification"}, {"score": 0.010819640135621986, "phrase": "vha_clinical_notes"}, {"score": 0.00481495049065317, "phrase": "text_de-identification"}, {"score": 0.00478999749469106, "phrase": "privacy_protection"}, {"score": 0.004703671193348433, "phrase": "clinical_text_information_content"}, {"score": 0.004583027362399501, "phrase": "secondary_uses"}, {"score": 0.004547438494330851, "phrase": "clinical_research"}, {"score": 0.004430784015995566, "phrase": "patient_privacy"}, {"score": 0.004239268958511757, "phrase": "tedious_manual_process"}, {"score": 0.004119762981892093, "phrase": "subsequent_uses"}, {"score": 0.004087756756529841, "phrase": "automatically_de-identified_clinical_narratives"}, {"score": 0.00396218934254591, "phrase": "larger_project"}, {"score": 0.0038907236419588255, "phrase": "veterans_health_administration"}, {"score": 0.003850464100878052, "phrase": "clinical_notes"}, {"score": 0.0037224647319912293, "phrase": "stepwise_manner"}, {"score": 0.0036648265911110164, "phrase": "high-level_assessment"}, {"score": 0.0035522043770933828, "phrase": "detailed_study"}, {"score": 0.0035063024767122684, "phrase": "select_clinical_information_types"}, {"score": 0.0034881076466982226, "phrase": "protected_health_information"}, {"score": 0.003268456693603525, "phrase": "five_different_existing_text_de-identification_systems"}, {"score": 0.003054634946102482, "phrase": "clinical_information_extraction"}, {"score": 0.00300730617788096, "phrase": "snomed-ct_concepts"}, {"score": 0.0029761605501582343, "phrase": "open_source_information_extraction_application"}, {"score": 0.002752594862770681, "phrase": "de-identified_versions"}, {"score": 0.0022642601698943687, "phrase": "automated_text_de-identification's_impact"}, {"score": 0.0021831803612759855, "phrase": "clinical_acronyms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Natural Language Processing", " Medical informatics", " Confidentiality, patient data privacy", " De-identification, Anonymization", " Electronic health records", " United States department of veterans affairs"], "paper_abstract": "As more and more electronic clinical information is becoming easier to access for secondary uses such as clinical research, approaches that enable faster and more collaborative research while protecting patient privacy and confidentiality are becoming more important. Clinical text de-identification offers such advantages but is typically a tedious manual process. Automated Natural Language Processing (NLP) methods can alleviate this process, but their impact on subsequent uses of the automatically de-identified clinical narratives has only barely been investigated. In the context of a larger project to develop and investigate automated text de-identification for Veterans Health Administration (VHA) clinical notes, we studied the impact of automated text de-identification on clinical information in a stepwise manner. Our approach started with a high-level assessment of clinical notes informativeness and formatting, and ended with a detailed study of the overlap of select clinical information types and Protected Health Information (PHI). To investigate the informativeness (i.e., document type information, select clinical data types, and interpretation or conclusion) of VHA clinical notes, we used five different existing text de-identification systems. The informativeness was only minimally altered by these systems while formatting was only modified by one system. To examine the impact of de-identification on clinical information extraction, we compared counts of SNOMED-CT concepts found by an open source information extraction application in the original (i.e., not de-identified) version of a corpus of VHA clinical notes, and in the same corpus after de-identification. Only about 1.2-3% less SNOMED-CT concepts were found in de-identified versions of our corpus, and many of these concepts were PHI that was erroneously identified as clinical information. To study this impact in more details and assess how generalizable our findings were, we examined the overlap between select clinical information annotated in the 2010 i2b2 NLP challenge corpus and automatic PHI annotations from our best-of-breed VHA clinical text de-identification system (nicknamed 'BOB'). Overall, only 0.81% of the clinical information exactly overlapped with PHI, and 1.78% partly overlapped. We conclude that automated text de-identification's impact on clinical information is small, but not negligible, and that improved clinical acronyms and eponyms disambiguation could significantly reduce this impact. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Text de-identification for privacy protection: A study of its impact on clinical text information content", "paper_id": "WOS:000340704200012"}