{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "\"prediction-observation-explanation\"_inquiry_model"}, {"score": 0.004620093797504386, "phrase": "science_learning"}, {"score": 0.004453488286477661, "phrase": "information_technology"}, {"score": 0.004372442291178139, "phrase": "ipad_applications"}, {"score": 0.004253618550301311, "phrase": "constructivist_teaching_methods"}, {"score": 0.004157058883925715, "phrase": "present_study"}, {"score": 0.0038624981944755813, "phrase": "\"attention-to-affect\"_model"}, {"score": 0.0034751259234824913, "phrase": "students'_continuance_intentions"}, {"score": 0.003427540517249369, "phrase": "poe_inquiry"}, {"score": 0.0030554300179552415, "phrase": "confirmatory_factor_analysis"}, {"score": 0.003027462227648001, "phrase": "structural_equation_modeling"}, {"score": 0.00290473242917264, "phrase": "internet_cognitive_failure"}, {"score": 0.002748775748298028, "phrase": "high_levels"}, {"score": 0.0025655216052760093, "phrase": "learning_interest"}, {"score": 0.0023944552329463035, "phrase": "poe_mode"}, {"score": 0.002297327670408112, "phrase": "intelligent_mobile_device"}, {"score": 0.002265833357217618, "phrase": "young_students'_interest"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Pedagogical issues", " Teaching/learning strategies", " Improving classroom teaching", " Multimedia/hypermedia systems", " Elementary education"], "paper_abstract": "The development of information technology, such as iPad applications, facilitates the implementation of constructivist teaching methods. Thus, the present study developed a \"prediction-observation-explanation\" (POE) inquiry-based learning mode to teach science concepts using the iPad2. The study used the \"attention-to-affect\" model with a self-report measure to determine the antecedent factor - Internet cognitive failure - related to learning interest based on students' continuance intentions to practice POE inquiry using the iPad2. A total of 96 elementary 6th grade students participated in the study and completed the questionnaires, of which 81 effective questionnaires were validated for the confirmatory factor analysis with structural equation modeling. The results of this study indicated that Internet cognitive failure was negatively associated with three types of learning interest as indicated by high levels of liking, enjoyment, and engagement. On the other hand, three types of learning interest were positively correlated to continuance learning through iPad2 interactions. The results suggested that the POE mode of inquiry is suitable for implementing at an intelligent mobile device to enhance young students' interest and continuance intentions with respect to the learning of science. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Using a \"prediction-observation-explanation\" inquiry model to enhance student interest and intention to continue science learning predicted by their Internet cognitive failure", "paper_id": "WOS:000330928800011"}