{"auto_keywords": [{"score": 0.04895515574977882, "phrase": "leaf_area"}, {"score": 0.00481495049065317, "phrase": "leaf_area_measurement"}, {"score": 0.00477697450538617, "phrase": "novel_idea"}, {"score": 0.004531308346870945, "phrase": "visual_basic"}, {"score": 0.004483705545285162, "phrase": "computer_monitor"}, {"score": 0.004448330443523693, "phrase": "working_surface"}, {"score": 0.004413233203505802, "phrase": "leaf_outline"}, {"score": 0.003939444927169915, "phrase": "known_properties"}, {"score": 0.0038980354874628325, "phrase": "regular_polygons"}, {"score": 0.0037763907319002194, "phrase": "autocad_precision_drawings"}, {"score": 0.0037564875159378217, "phrase": "direct_leaf_samples"}, {"score": 0.0036974027232000335, "phrase": "egg_plant"}, {"score": 0.0036488733208062166, "phrase": "varied_shapes"}, {"score": 0.003525646552423009, "phrase": "existing_graphical_and_digital_planimetric_methods"}, {"score": 0.003406605575613751, "phrase": "auc"}, {"score": 0.0033796614187448, "phrase": "pixel_count"}, {"score": 0.0032914962368897046, "phrase": "pixel_count-inside"}, {"score": 0.0032741494797149853, "phrase": "pci"}, {"score": 0.003248277096147059, "phrase": "pixel_count-total"}, {"score": 0.0029768783231803072, "phrase": "pc_methods"}, {"score": 0.002945556972573912, "phrase": "object_orientation"}, {"score": 0.002914564207517315, "phrase": "traced_transparent_samples"}, {"score": 0.002883896601057183, "phrase": "appreciable_improvement"}, {"score": 0.00285355076155907, "phrase": "opaque_samples"}, {"score": 0.002720887157191701, "phrase": "geometrical_objects"}, {"score": 0.002409141581517314, "phrase": "auc_method"}, {"score": 0.0023964270270827367, "phrase": "perimeter_determination"}, {"score": 0.002364932746984067, "phrase": "developed_software"}, {"score": 0.0023338514021359843, "phrase": "accurate_method"}, {"score": 0.0022135486371828795, "phrase": "personal_computers"}, {"score": 0.00213869043367662, "phrase": "additional_hardware"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["leaf area", " measurement", " software development", " perimeter", " pixel"], "paper_abstract": "A novel idea of utilizing only a computer to determine leaf area and perimeter was developed. The procedure is essentially computer software developed in Visual Basic that uses the computer monitor as the working surface to trace leaf outline and determines leaf area, perimeter, length, and width. Testing the software for effects of orientation, shape, and size of objects was carried out using opaque (paper) and transparent (polyvinyl chloride sheet) geometrical planar objects of known properties, such as regular polygons (three to eight sides), rectangles, and circles, developed by AutoCAD precision drawings. Direct leaf samples of mango, guava, egg plant, and castor representing varied shapes and sizes were used in measurements and results were also compared with existing graphical and digital planimetric methods. Component methods used in determination were area under the curve (AUC) and pixel count (PC), which was further divided into pixel count-inside (PCI) and pixel count-total (PCT). In general, geometrical objects area and perimeter measurements were found to be independent of orientation, shape, and size. However, perimeters of squares and rectangles obtained by PC methods were affected by object orientation. As the traced transparent samples do not offer appreciable improvement in estimations, opaque samples are recommended because they are convenient and directly used in measurements. Based on the performance with geometrical objects, the software was considered to handle objects of any shape and size equally well. Measurements with direct leaf samples compared well with the graphical (-4.62% to 7.81% deviation) and digital planimetric (-4.05% to 8.48% deviation) results, and variation was found to exist even among these basic methods possibly due to unavoidable manual tracing errors. Based on this study, PCI method for area and AUC method for perimeter determination are recommended. The developed software proved to be an accurate method for measurements of area and perimeter of leaves and other planar objects, such as maps; extends the application of personal computers to such measurements; and was less expensive as it does not require additional hardware. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Interactive computer software development for leaf area measurement", "paper_id": "WOS:000236131200001"}