{"auto_keywords": [{"score": 0.03669884834098149, "phrase": "computer_use"}, {"score": 0.00481495049065317, "phrase": "large_lecture_classes"}, {"score": 0.0044277810648955624, "phrase": "potential_benefits"}, {"score": 0.004322967486451877, "phrase": "laptop_use"}, {"score": 0.004220624516321415, "phrase": "presented_research"}, {"score": 0.00374399358035391, "phrase": "unmonitored_and_unrestricted_class"}, {"score": 0.003677280504320636, "phrase": "large_lecture-based_university_class"}, {"score": 0.0030904433394138963, "phrase": "similar_descriptions"}, {"score": 0.003053598205821532, "phrase": "laptop_activities"}, {"score": 0.0027741761880779535, "phrase": "social_media_web_sites"}, {"score": 0.002597012212823168, "phrase": "off-task_computer_activities"}, {"score": 0.0022895278869126848, "phrase": "individual_activities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Improving classroom teaching", " Teaching/learning strategies"], "paper_abstract": "Students often have their own individual laptop computers in university classes, and researchers debate the potential benefits and drawbacks of laptop use. In the presented research, we used a combination of surveys and in-class observations to study how students use their laptops in an unmonitored and unrestricted class setting a large lecture-based university class with nearly 3000 enrolled students. By analyzing computer use over the duration of long (165 min) classes, we demonstrate how computer use changes over time. The observations and student-reports provided similar descriptions of laptop activities. Note taking was the most common use for the computers, followed by the use of social media web sites. Overall, the data show that students engaged in off-task computer activities for nearly two-thirds of the time. An analysis of the frequency of the various laptop activities over time showed that engagement in individual activities varied significantly over the duration of the class. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Unregulated use of laptops over time in large lecture classes", "paper_id": "WOS:000341675100008"}