{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large_image_collections"}, {"score": 0.004315249628884236, "phrase": "facial_expression"}, {"score": 0.0037626342268042997, "phrase": "face_space"}, {"score": 0.003711409222544974, "phrase": "compelling_animations"}, {"score": 0.0035945701438887282, "phrase": "smooth_transition"}, {"score": 0.0032805541677236325, "phrase": "key_contribution"}, {"score": 0.0027954035431845344, "phrase": "shortest_paths"}, {"score": 0.0027197343489967322, "phrase": "processing_pipeline"}, {"score": 0.0026949679939994226, "phrase": "face_detection"}, {"score": 0.002527788827701828, "phrase": "frontal_views"}, {"score": 0.002493333098814506, "phrase": "image_comparison"}, {"score": 0.0024593458703463474, "phrase": "local_binary_patterns"}, {"score": 0.0023386327847292805, "phrase": "time-lapse_photography"}, {"score": 0.0023173287402646577, "phrase": "personal_photo_collections"}, {"score": 0.0021049977753042253, "phrase": "google's_picasa"}], "paper_keywords": ["Face animation", " photo collections", " cross dissolve", " Picasa"], "paper_abstract": "We present an approach for generating face animations from large image collections of the same person. Such collections, which we call photobios, sample the appearance of a person over changes in pose, facial expression, hairstyle, age, and other variations. By optimizing the order in which images are displayed and cross-dissolving between them, we control the motion through face space and create compelling animations (e. g., render a smooth transition from frowning to smiling). Used in this context, the cross dissolve produces a very strong motion effect; a key contribution of the paper is to explain this effect and analyze its operating range. The approach operates by creating a graph with faces as nodes, and similarities as edges, and solving for walks and shortest paths on this graph. The processing pipeline involves face detection, locating fiducials (eyes/nose/mouth), solving for pose, warping to frontal views, and image comparison based on Local Binary Patterns. We demonstrate results on a variety of datasets including time-lapse photography, personal photo collections, and images of celebrities downloaded from the Internet. Our approach is the basis for the Face Movies feature in Google's Picasa.", "paper_title": "Exploring Photobios", "paper_id": "WOS:000297216400035"}