{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quorum_systems"}, {"score": 0.00477513738640734, "phrase": "group_resources_allocation"}, {"score": 0.004412881870378388, "phrase": "model_allocation"}, {"score": 0.004376378707877484, "phrase": "group_resources"}, {"score": 0.0043401761815767, "phrase": "bounded_capacity"}, {"score": 0.004146327465630697, "phrase": "identical_resources"}, {"score": 0.004112020122418323, "phrase": "n_processes"}, {"score": 0.003721735062704032, "phrase": "different_groups"}, {"score": 0.0035113478590679133, "phrase": "mutual_exclusion"}, {"score": 0.002735972929840289, "phrase": "basic_and_general_results"}, {"score": 0.002549146857303602, "phrase": "general_case"}, {"score": 0.0022782315534795516, "phrase": "classical_problems"}, {"score": 0.002231310272815607, "phrase": "finite_projective_geometries"}], "paper_keywords": [""], "paper_abstract": "We present a problem, called (n, m, k, d)-resource allocation, to model allocation of group resources with bounded capacity. Specifically, the problem concerns the scheduling of k identical resources among n processes which belong to m groups. Each resource can be used by at most d processes of the same group at a time, but no two processes of different groups can use a resource simultaneously. The problem captures two fundamental types of conflicts in mutual exclusion: k-exclusion's amount constraint on the number of processes that can share a resource, and group mutual exclusion's type constraint on the class of processes that can share a resource. We then study the problem in the message passing paradigm, and investigate quorum systems for the problem. We begin by establishing some basic and general results for quorum systems for the case of k = 1, based on which quorum systems for the general case can be understood and constructed. We found that the study of quorum systems for (n, m, 1, d)-resource allocation is related to some classical problems in combinatorics and in finite projective geometries. By applying the results there, we are able to obtain some optimal/near-optimal quorum systems.", "paper_title": "On quorum systems for group resources allocation", "paper_id": "WOS:000275146300005"}