{"auto_keywords": [{"score": 0.03330740392858847, "phrase": "side-channel_attacks"}, {"score": 0.00481495049065317, "phrase": "different_approaches"}, {"score": 0.004669845451682529, "phrase": "differential_power_analysis"}, {"score": 0.004238452771031322, "phrase": "target_device"}, {"score": 0.0034911335714333507, "phrase": "statistical_tests"}, {"score": 0.00342054627009158, "phrase": "statistical_artefacts"}, {"score": 0.0032336801561165113, "phrase": "correlation_coefficient"}, {"score": 0.0031845067058084613, "phrase": "conditional_entropy"}, {"score": 0.003088384809415812, "phrase": "first-order_attack_scenario"}, {"score": 0.0029196116767956273, "phrase": "standard_dpa_attacks"}, {"score": 0.002731971103291716, "phrase": "key_recovery"}, {"score": 0.002676692093594358, "phrase": "information_theoretic_metric"}, {"score": 0.0024918548761791435, "phrase": "practical_scenario"}, {"score": 0.002261204313587616, "phrase": "dpa_attacks"}, {"score": 0.0021928902836049384, "phrase": "key_and_algorithm_independence"}, {"score": 0.0021375377706211686, "phrase": "theoretical_strategies"}, {"score": 0.0021049977753042253, "phrase": "sound_evaluation"}], "paper_keywords": [""], "paper_abstract": "In this study, the authors examine the relationship between and the efficiency of different approaches to standard (univariate) differential power analysis (DPA) attacks. The authors first show that, when fed with the same assumptions about the target device (i.e. with the same leakage model), the most popular approaches such as using a distance-of-means test, correlation analysis and Bayes attacks are essentially equivalent in this setting. Differences observed in practice are not because of differences in the statistical tests but because of statistical artefacts. Then, the authors establish a link between the correlation coefficient and the conditional entropy in side-channel attacks. In a first-order attack scenario, this relationship allows linking currently used metrics to evaluate standard DPA attacks (such as the number of power traces needed to perform a key recovery) with an information theoretic metric (the mutual information). The authors results show that in the practical scenario defined formally in this study, both measures are equally suitable to compare devices with respect to their susceptibility to DPA attacks. Together with observations regarding key and algorithm independence the authors consequently extend theoretical strategies for the sound evaluation of leaking devices towards the practice of side-channel attacks.", "paper_title": "One for all - all for one: unifying standard differential power analysis attacks", "paper_id": "WOS:000295123100003"}