{"auto_keywords": [{"score": 0.05007834503226343, "phrase": "second_language"}, {"score": 0.04147666283590141, "phrase": "ctd"}, {"score": 0.030844943151983297, "phrase": "ctd_characteristics"}, {"score": 0.004642852977065663, "phrase": "critical_thinking_disposition"}, {"score": 0.004348363291608004, "phrase": "research_paper"}, {"score": 0.004192872425727907, "phrase": "research_questions"}, {"score": 0.0040873354289955605, "phrase": "ct_dispositions"}, {"score": 0.003998983496539902, "phrase": "online_writing_environments"}, {"score": 0.0038841330270679097, "phrase": "online_collaborative_peer_review"}, {"score": 0.0036111802520421665, "phrase": "ctd."}, {"score": 0.003419084516677794, "phrase": "discriminate_analysis"}, {"score": 0.003357343256340741, "phrase": "viable_clusters"}, {"score": 0.003284740793826487, "phrase": "anova"}, {"score": 0.0031903162513050804, "phrase": "qualitative_interview_data"}, {"score": 0.0030986183831544487, "phrase": "ctd_measurement"}, {"score": 0.003009548189374684, "phrase": "p_variable"}, {"score": 0.002707541142254756, "phrase": "small_sample_size"}, {"score": 0.0026683288015968243, "phrase": "researcher's_anticipations"}, {"score": 0.0025727581823022268, "phrase": "larger_sample"}, {"score": 0.0024268966855267153, "phrase": "broader_subject_matter"}, {"score": 0.0024004805502253427, "phrase": "online_educational_web_site"}, {"score": 0.002314481096847367, "phrase": "interface_designers"}, {"score": 0.002272641094287882, "phrase": "different_ctds"}, {"score": 0.0021992217442375157, "phrase": "first_step"}, {"score": 0.0021752783872387173, "phrase": "online_collaborative_educational_games"}], "paper_keywords": ["Taiwan", " Students", " Games (curriculum)", " Language", " Online operations"], "paper_abstract": "Purpose - The importance of critical thinking disposition (CTD) in second language (1-2) university students' writing is a topic rarely discussed. The purpose of this research paper is to examine L2 university students' CTD during the writing process. Research questions discussed ill (his paper encompass the CT dispositions and characteristics of L2 university student in online writing environments. Measuring CTD and CTD training via online collaborative peer review were the two grounding themes of this Study. Design/methodology/approach - A five-point Likert scale online questionnaire which included two open-ended questions was developed to assess CTD. A factor analysis and a cluster analysis were preformed on the data. A discriminate analysis determined the number of viable clusters and a one-way ANOVA was performed to compare differences, With qualitative interview data to supplement, The data Set for CTD measurement was a matrix consisting of 27 participants and P variable. Findings - The findings reveal that the CTD characteristics of L2s include open-mindedness. systematically and inquisitiveness, and low interaction/trotivation. Research limitations/implications - Limitations include a small Sample size that mimics the researcher's anticipations, but the findings would be Strengthened by a larger sample. A lack of sensitivity and generalisability could be corrected in the future by using broader Subject matter within an online educational web site. Originality/value - Knowledge of the CTD characteristics of L2s Would allow interface designers to take into account different CTDs in developing L2 online collaborative educational web sites. This Study outlines the first step in developing online collaborative educational games that allow L2 university 7 students to improve their writing abilities by considering various CTDs.", "paper_title": "Educational games with blogs Collaborating to motivate second language undergraduate critical thinking", "paper_id": "WOS:000261439400002"}