{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spatial_relations"}, {"score": 0.0047472380621488616, "phrase": "voronoi-based_nine-_intersection_model"}, {"score": 0.004528301408585875, "phrase": "chen_et_al"}, {"score": 0.004401920964199975, "phrase": "voronoi"}, {"score": 0.004238576355081601, "phrase": "international_journal"}, {"score": 0.004198722289738563, "phrase": "geographical_information_science"}, {"score": 0.003378385493203297, "phrase": "spatial_entities"}, {"score": 0.0030446120560494155, "phrase": "topological_constraints"}, {"score": 0.00297346171320082, "phrase": "voronoi_regions"}, {"score": 0.0025678829712650437, "phrase": "connected_interior"}], "paper_keywords": ["Voronoi region", " 9-intersection", " topological relation", " qualitative spatial reasoning"], "paper_abstract": "In this article we show that the Voronoi-based nine-intersection (V9I) model proposed by Chen et al. (2001, A Voronoi-based 9-intersection model for spatial relations. International Journal of Geographical Information Science, 15 (3), 201-220) is more expressive than what has been believed before. Given any two spatial entities A and B, the V9I relation between A and B is represented as a 3x3 Boolean matrix. For each pair of types of spatial entities that is, points, lines, and regions, we first show that most Boolean matrices do not represent a V9I relation by using topological constraints and the definition of Voronoi regions. Then, we provide illustrations for all the remaining matrices. This guarantees that our method is sound and complete. In particular, we show that there are 18 V9I relations between two areas with connected interior, while there are only nine four-intersection relations. Our investigations also show that, unlike many other spatial relation models, V9I relations are context or shape sensitive. That is, the existence of other entities or the shape of the entities may affect the validity of certain relations.", "paper_title": "A complete classification of spatial relations using the Voronoi-based nine- intersection model", "paper_id": "WOS:000325519900010"}