{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "potential_cognitive_abilities"}, {"score": 0.02522607067724401, "phrase": "potential_abilities"}, {"score": 0.004761968711051715, "phrase": "machine_kingdom"}, {"score": 0.004342430078306461, "phrase": "'animal_kingdom"}, {"score": 0.003390886284555397, "phrase": "'machine_kingdom"}, {"score": 0.003243871564587106, "phrase": "cognitive_abilities"}, {"score": 0.0031494088980556934, "phrase": "big_challenge"}, {"score": 0.0031032109441552287, "phrase": "'universal_psychometrics"}, {"score": 0.0027571412070078703, "phrase": "potential_cognitive_ability"}, {"score": 0.0024768883044869023, "phrase": "permanent_and_temporal_potentials"}, {"score": 0.0022918601312169676, "phrase": "environment_distribution"}, {"score": 0.0021049977753042253, "phrase": "different_levels"}], "paper_keywords": ["Cognitive abilities", " Machine intelligence measurement", " (Universal) Turing machines", " Universality probability", " Potential intelligence", " (Universal) Psychometrics"], "paper_abstract": "Animals, including humans, are usually judged on what they could become, rather than what they are. Many physical and cognitive abilities in the 'animal kingdom' are only acquired (to a given degree) when the subject reaches a certain stage of development, which can be accelerated or spoilt depending on how the environment, training or education is. The term 'potential ability' usually refers to how quick and likely the process of attaining the ability is. In principle, things should not be different for the 'machine kingdom'. While machines can be characterised by a set of cognitive abilities, and measuring them is already a big challenge, known as 'universal psychometrics', a more informative, and yet more challenging, goal would be to also determine the potential cognitive abilities of a machine. In this paper we investigate the notion of potential cognitive ability for machines, focussing especially on universality and intelligence. We consider several machine characterisations (non-interactive and interactive) and give definitions for each case, considering permanent and temporal potentials. From these definitions, we analyse the relation between some potential abilities, we bring out the dependency on the environment distribution and we suggest some ideas about how potential abilities can be measured. Finally, we also analyse the potential of environments at different levels and briefly discuss whether machines should be designed to be intelligent or potentially intelligent.", "paper_title": "On Potential Cognitive Abilities in the Machine Kingdom", "paper_id": "WOS:000318794500002"}