{"auto_keywords": [{"score": 0.03617273118657328, "phrase": "decision_makers"}, {"score": 0.00481495049065317, "phrase": "fuzzy_perspective"}, {"score": 0.004745665541429529, "phrase": "well-known_game"}, {"score": 0.004700027722284931, "phrase": "prisoner's_dilemma"}, {"score": 0.004587835274176236, "phrase": "basic_situation"}, {"score": 0.004165105357908494, "phrase": "fuzzy_approach"}, {"score": 0.0038364365168131586, "phrase": "fully_or_partially_conflicting_objectives"}, {"score": 0.0034826993555190765, "phrase": "mental_and_subjective_attitudes"}, {"score": 0.002997572637726648, "phrase": "potential_benefits"}, {"score": 0.0027876387169652717, "phrase": "incomplete_or_fuzzy_information"}, {"score": 0.0025059724686541263, "phrase": "fuzzy_procedure"}, {"score": 0.002387507583705495, "phrase": "subjective_attitudes"}, {"score": 0.0021987994275190314, "phrase": "game_theory"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["cooperative games", " fuzzy logic", " decision making", " prisoner's dilemma", " trust"], "paper_abstract": "The well-known game of Prisoner's Dilemma, which reflects a basic situation in which one must decide whether or not to cooperate with a competitor, is systematically solved using a fuzzy approach to modeling trust. When involved in a dispute, two or more parties need to make decisions with fully or partially conflicting objectives. In situations where reaching a more favorable outcome depends upon cooperation and trust between the two conflicting parties, some of the mental and subjective attitudes of the decision makers must be considered. While the decision to cooperate with others bears some risks due to uncertainty and loss of control, not cooperating means giving up potential benefits. In practice, decisions must be made under risk, uncertainty, and incomplete or fuzzy information. Because it is able to work well with vague, ambiguous, imprecise, noisy or missing information, the fuzzy approach is effective for modeling such multicriteria conflicting situations. The fuzzy procedure is used to take into account some of the subjective attitudes of the decision makers, especially with respect to trust, that are difficult to model using game theory. (c) 2007 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "Trust and cooperation from a fuzzy perspective", "paper_id": "WOS:000252665700011"}