{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "haptic_processing_of_facial_expressions_of_emotion"}, {"score": 0.004260800171269249, "phrase": "haptic_classification"}, {"score": 0.004154332348800334, "phrase": "face-inversion_effects"}, {"score": 0.004067635935640407, "phrase": "upright_orientation"}, {"score": 0.003932654396285872, "phrase": "third_condition"}, {"score": 0.0038668462001710314, "phrase": "normal_configuration"}, {"score": 0.003818210967854446, "phrase": "upright_features"}, {"score": 0.0036914757355166966, "phrase": "configural_processing"}, {"score": 0.0036450381529042103, "phrase": "critical_role"}, {"score": 0.003599182629885611, "phrase": "upright_fees"}, {"score": 0.0032387402145603412, "phrase": "inverted_conditions"}, {"score": 0.0031710903727066313, "phrase": "feature_processing"}, {"score": 0.0027937732927852646, "phrase": "emotional_valence"}, {"score": 0.0025892330566358503, "phrase": "haptic_presentation"}, {"score": 0.0024926348205500715, "phrase": "new_face-inversion_effect"}, {"score": 0.0022051664509486206, "phrase": "emotional_impact"}, {"score": 0.0021049977753042253, "phrase": "potential_applications"}], "paper_keywords": ["Cognition", " perception and psychophysics", " social communication", " education"], "paper_abstract": "Participants haptically (versus visually) classified universal facial expressions of emotion (FEEs) depicted in simple 2D raised-line displays. Experiments 1 and 2 established that haptic classification was well above chance; face-inversion effects further indicated that the upright orientation was privileged. Experiment 2 added a third condition in which the normal configuration of the upright features was spatially scrambled. Results confirmed that configural processing played a critical role, since upright FEEs were classified more accurately and confidently than either scrambled or inverted FEEs, which did not differ. Because accuracy in both scrambled and inverted conditions was above chance, feature processing also played a role, as confirmed by commonalities across confusions for upright, inverted, and scrambled faces. Experiment 3 required participants to visually and haptically assign emotional valence (positive/negative) and magnitude to upright and inverted 2D FEE displays. While emotional magnitude could be assigned using either modality, haptic presentation led to more variable valence judgments. We also documented a new face-inversion effect for emotional valence visually, but not haptically. These results suggest that emotions can be interpreted from 2D displays presented haptically as well as visually; however, emotional impact is judged more reliably by vision than by touch. Potential applications of this work are also considered.", "paper_title": "Haptic Processing of Facial Expressions of Emotion in 2D Raised-Line Drawings", "paper_id": "WOS:000207897900004"}