{"auto_keywords": [{"score": 0.03302410636663472, "phrase": "secure_network_coding"}, {"score": 0.014788358415917703, "phrase": "minimum_rank_distance"}, {"score": 0.011253863217626912, "phrase": "rgrw"}, {"score": 0.010785976001355812, "phrase": "rdip"}, {"score": 0.010337335090623602, "phrase": "error_correction_capability"}, {"score": 0.009954078464450435, "phrase": "underlying_network_code"}, {"score": 0.00704727389191445, "phrase": "open_problem"}, {"score": 0.00481495049065317, "phrase": "linear_codes"}, {"score": 0.0042354707960660706, "phrase": "field_extension"}, {"score": 0.0031996871318754685, "phrase": "security_performance"}, {"score": 0.002868116925014397, "phrase": "secure_network_coding_scheme"}, {"score": 0.002607786559475656, "phrase": "kschischang"}, {"score": 0.0024513404432665153, "phrase": "secret_message"}, {"score": 0.0021971473452127126, "phrase": "explicit_construction"}], "paper_keywords": ["Network error correction", " rank distance", " relative dimension/intersection profile", " relative generalized Hamming weight", " relative generalized rank weight", " secure network coding"], "paper_abstract": "By extending the notion of minimum rank distance, this paper introduces two new relative code parameters of a linear code C-1 of length n over a field extension F(q)m and its subcode C-2 (sic) C-1. One is called the relative dimension/intersection profile (RDIP), and the other is called the relative generalized rank weight (RGRW). We clarify their basic properties and the relation between the RGRW and the minimum rank distance. As applications of the RDIP and the RGRW, the security performance and the error correction capability of secure network coding, guaranteed independently of the underlying network code, are analyzed and clarified. We propose a construction of secure network coding scheme, and analyze its security performance and error correction capability as an example of applications of the RDIP and the RGRW. Silva and Kschischang showed the existence of a secure network coding in which no part of the secret message is revealed to the adversary even if any dimC(1)-1 links are wiretapped, which is guaranteed over any underlying network code. However, the explicit construction of such a scheme remained an open problem. Our new construction is just one instance of secure network coding that solves this open problem.", "paper_title": "Relative Generalized Rank Weight of Linear Codes and Its Applications to Network Coding", "paper_id": "WOS:000356301600017"}