{"auto_keywords": [{"score": 0.027542938023672033, "phrase": "relevance_model"}, {"score": 0.015559189221623443, "phrase": "japanese"}, {"score": 0.011600590547300746, "phrase": "target_document"}, {"score": 0.008912931293075963, "phrase": "term_dependence"}, {"score": 0.00803629652609263, "phrase": "structured_query"}, {"score": 0.00481495049065317, "phrase": "two-stage_term_dependence"}, {"score": 0.004500414250942443, "phrase": "new_term_dependence_model"}, {"score": 0.004272456401437226, "phrase": "theoretical_framework"}, {"score": 0.00422826362023938, "phrase": "markov_random_fields"}, {"score": 0.0032430426853131346, "phrase": "compound_word"}, {"score": 0.002968424524565369, "phrase": "short-range_term_dependencies"}, {"score": 0.002633425544817301, "phrase": "query_expansion"}, {"score": 0.0024868131939261716, "phrase": "retrieval_results"}, {"score": 0.0021945833590668973, "phrase": "compound_words"}, {"score": 0.0021049977753042253, "phrase": "web_documents"}], "paper_keywords": ["Japanese web retrieval", " Term dependence", " Structured queries"], "paper_abstract": "In this paper, we propose a new term dependence model for information retrieval, which is based on a theoretical framework using Markov random fields. We assume two types of dependencies of terms given in a query: (i) long-range dependencies that may appear for instance within a passage or a sentence in a target document, and (ii) short-range dependencies that may appear for instance within a compound word in a target document. Based on this assumption, our two-stage term dependence model captures both long-range and short-range term dependencies differently, when more than one compound word appear in a query. We also investigate how query structuring with term dependence can improve the performance of query expansion using a relevance model. The relevance model is constructed using the retrieval results of the structured query with term dependence to expand the query. We show that our term dependence model works well, particularly when using query structuring with compound words, through experiments using a 100-gigabyte test collection of web documents mostly written in Japanese. We also show that the performance of the relevance model can be significantly improved by using the structured query with our term dependence model.", "paper_title": "Query structuring and expansion with two-stage term dependence for Japanese web retrieval", "paper_id": "WOS:000265040100003"}