{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "timed_stgs"}, {"score": 0.009134620460764131, "phrase": "based_synthesis_method"}, {"score": 0.004330321475256457, "phrase": "decomposition_based_logic_synthesis"}, {"score": 0.004072275820209647, "phrase": "sufficient_input_signal"}, {"score": 0.003829548069657859, "phrase": "timed_stg"}, {"score": 0.0036621225944272256, "phrase": "input_signal"}, {"score": 0.002977835845437357, "phrase": "untimed_version"}, {"score": 0.0028635111041882956, "phrase": "important_timing_information"}, {"score": 0.0027690086059100495, "phrase": "non-optimal_circuits"}, {"score": 0.0026330549554033876, "phrase": "timing_information"}, {"score": 0.002531933388815139, "phrase": "small_class"}, {"score": 0.002164738347530834, "phrase": "synthesized_circuits"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "This paper presents a way to contract timed STGs effectively for a decomposition based logic synthesis of timed circuits. In the decomposition based synthesis method, a sufficient input signal set for each output is first obtained, and the timed STG is contracted to include only transitions on this input signal set and the output of interest, from which the circuit for the output is synthesized. Care is, however, needed for the contraction of timed STGs. A simple contraction algorithm used for the untimed version can result in the loss of important timing information, causing it to synthesize non-optimal circuits. On the other hand, exact contraction that preserves the timing information precisely is applied only to a small class of transitions, which degrades the performance of the decomposition based synthesis method. This paper proposes a way to contract timed STGs effectively without losing the optimality of the synthesized circuits, and shows some experimental results.", "paper_title": "Effective contraction of timed STGs for decomposition based timed circuit synthesis", "paper_id": "WOS:000241648200019"}