{"auto_keywords": [{"score": 0.04463185587847004, "phrase": "collocation_points"}, {"score": 0.007740489563401459, "phrase": "transient_and_steady-state_hyperbolic_problems"}, {"score": 0.006908841258046593, "phrase": "problem_domain"}, {"score": 0.006694005773340794, "phrase": "nodal_points"}, {"score": 0.005899038500355548, "phrase": "proposed_method"}, {"score": 0.005230983040668771, "phrase": "shocked_solution"}, {"score": 0.004769444094319619, "phrase": "collocated_discrete_least_squares_meshless_method"}, {"score": 0.004608955355281231, "phrase": "steady-state_problems"}, {"score": 0.004434491600123024, "phrase": "squared_residuals"}, {"score": 0.004392565073466714, "phrase": "governing_differential_equation"}, {"score": 0.004019797503157808, "phrase": "moving_least_squares_method"}, {"score": 0.003944112858235306, "phrase": "shape_functions"}, {"score": 0.0038821277513157973, "phrase": "coefficient_matrix"}, {"score": 0.0037849637558311972, "phrase": "non-symmetric_hyperbolic_differential_equations"}, {"score": 0.0037019348293573675, "phrase": "iterative_methods"}, {"score": 0.0036322130692776375, "phrase": "truly_meshless_method"}, {"score": 0.0035751121405295026, "phrase": "numerical_integration"}, {"score": 0.0030317852687729878, "phrase": "smooth_solutions"}, {"score": 0.0028095957871860653, "phrase": "resulting_algorithm"}, {"score": 0.0026536779296945138, "phrase": "one-dimensional_transient_and_steady-state_benchmark_examples"}, {"score": 0.0025626745650279346, "phrase": "sensitivity_analysis"}, {"score": 0.0024747842618794255, "phrase": "base_polynomials"}, {"score": 0.0024513404432665153, "phrase": "accuracy_and_convergence_characteristics"}, {"score": 0.0023079225317714815, "phrase": "difficult_hyperbolic_problems"}, {"score": 0.0021728771392034462, "phrase": "inherent_stabilizing_mechanism"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["meshless method", " collocated discrete least squares", " transient", " steady state", " hyperbolic problems"], "paper_abstract": "A collocated discrete least squares meshless method for the solution of the transient and steady-state hyperbolic problems is presented in this paper. The method is based on minimizing the sum of the squared residuals of the governing differential equation at some points chosen in the problem domain as collocation points. The collocation points are generally different from nodal points, which are used to discretize the problem domain. A moving least squares method is employed to construct the shape functions at nodal points. The coefficient matrix is symmetric and positive definite even for non-symmetric hyperbolic differential equations and can be solved efficiently with iterative methods. The proposed method is a truly meshless method and does not require numerical integration. Advantages of the collocation points are shown to be threefold: First, the collocation points are shown to be responsible for stabilizing the method in particular when problems with shocked solution are attempted. Second, the collocation points are also shown to improve the accuracy of the solution even for problems with smooth solutions. Third, the collocation points are shown to contribute to the efficiency of the method when solving steady-state problems via faster convergence of the resulting algorithm. The ability of the method and in particular the effect of collocation points are tested against a series of one-dimensional transient and steady-state benchmark examples from the literature and the results are presented. A sensitivity analysis is also carried out to investigate the effect of the base polynomials on the accuracy and convergence characteristics of the method in solving steady-state problems. The results show the ability of the proposed method to accurately solve difficult hyperbolic problems considered. The method is also shown to be particularly stable for problems with shocked solution due to the inherent stabilizing mechanism of the method. Copyright (C) 2008 John Wiley & Sons, Ltd.", "paper_title": "Collocated discrete least squares meshless (CDLSM) method for the solution of transient and steady-state hyperbolic problems", "paper_id": "WOS:000268431900001"}