{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "reliability_demonstration_testing"}, {"score": 0.008671913892664114, "phrase": "failure_times"}, {"score": 0.004267004541988167, "phrase": "stated_confidence_level"}, {"score": 0.0036553070575015344, "phrase": "specific_design_problem"}, {"score": 0.002814759530655965, "phrase": "practical_and_theoretical_standpoints"}, {"score": 0.0027741761880779535, "phrase": "detailed_discussions"}, {"score": 0.0025059724686541263, "phrase": "similar_designs"}, {"score": 0.002469830206270585, "phrase": "weibull_distribution"}, {"score": 0.0024107449502335583, "phrase": "relevant_mathematical_derivations"}, {"score": 0.0021049977753042253, "phrase": "equivalent_rdt_designs"}], "paper_keywords": ["Binomial distribution", " reliability demonstration test", " Weibull distribution"], "paper_abstract": "Reliability Demonstration Testing (RDT) has been widely used in industry to verify whether a product has met a certain reliability requirement with a stated confidence level. To design RDTs, methods have been developed based on either the number of failures or the failure times. However, practitioners often have difficulty in determining which method to use for a specific design problem. In particular, the method based on the number of failures cannot be used when all the units are tested to failure, while the alternative based on failure times falls short in dealing with cases where no failures are expected. This paper elaborates on the two methods, and compares them from both practical and theoretical standpoints. The detailed discussions regarding the relationship between the two methods will help practitioners design RDTs, and understand when the two methods will lead to similar designs. A Weibull distribution is used in the relevant mathematical derivations, but the results can be extended to other widely used failure time distributions. Case studies are provided to demonstrate the use of the two methods in practice, and in developing equivalent RDT designs.", "paper_title": "Methods of Reliability Demonstration Testing and Their Relationships", "paper_id": "WOS:000301198500026"}