{"auto_keywords": [{"score": 0.046888273895838106, "phrase": "ncree"}, {"score": 0.04577680896363523, "phrase": "inelastic_structural_analysis"}, {"score": 0.00481495049065317, "phrase": "nonlinear_structural_analysis_framework"}, {"score": 0.004666598697538815, "phrase": "numerical_simulation_software"}, {"score": 0.004637478829869904, "phrase": "earthquake_engineering_research"}, {"score": 0.004565468027464384, "phrase": "analysis_kernel"}, {"score": 0.003940706575253453, "phrase": "nonlinear_systems"}, {"score": 0.00389164348807591, "phrase": "load_effects"}, {"score": 0.0038431888954930083, "phrase": "static_or_cyclic_loads"}, {"score": 0.003795335309109018, "phrase": "earthquake_ground_accelerations"}, {"score": 0.003759835076089236, "phrase": "earthquake_aftershocks"}, {"score": 0.0035094132888607134, "phrase": "different_types"}, {"score": 0.003487489029588045, "phrase": "structural_analyses"}, {"score": 0.0034440491386068545, "phrase": "object-oriented_techniques"}, {"score": 0.0032859049843201437, "phrase": "opengl"}, {"score": 0.003244965901259379, "phrase": "mfc"}, {"score": 0.0032246835734680377, "phrase": "graphical_user_interface"}, {"score": 0.003134986603941304, "phrase": "new_input_formats"}, {"score": 0.0031153941769781926, "phrase": "new_element_types"}, {"score": 0.0029909851863915283, "phrase": "analytical_results"}, {"score": 0.0028805474861014722, "phrase": "structural_model"}, {"score": 0.0028625406368744995, "phrase": "mode_shapes"}, {"score": 0.0027916287357898544, "phrase": "plastic_hinges"}, {"score": 0.002655017467085696, "phrase": "pre-processing_framework"}, {"score": 0.0024241817763927163, "phrase": "\"model_generation"}, {"score": 0.0024014759148123736, "phrase": "mouse_motion"}, {"score": 0.002305510336172047, "phrase": "mouse_clicking"}, {"score": 0.002220326414611295, "phrase": "networked_sub-structural_pseudo_dynamic_tests"}, {"score": 0.0021049977753042253, "phrase": "actual_structural_engineering_projects"}], "paper_keywords": ["PISA3D", " GISA3D", " VISA3D", " GUI", " Design pattern", " Object-oriented", " Nonlinear structural analysis"], "paper_abstract": "This paper describes the framework and application of numerical simulation software on earthquake engineering research and practice. The analysis kernel is developed at the National Center for Research on Earthquake Engineering (NCREE) and is entitled as \"Platform of Inelastic Structural Analysis for 3D systems (PISA3D)\". The design of PISA3D framework adopts the Design Pattern and the Unified Process. PISA3D provides structural modeling and high computational efficiency for engineers and researchers to simulate the responses of nonlinear systems under various kinds of load effects. It includes static or cyclic loads, displacements, earthquake ground accelerations, and earthquake aftershocks. PISA3D is easy to extend and maintain due to its object-oriented nature. Advanced users can derive or compose its objects' libraries to perform different types of structural analyses. Based on object-oriented techniques, VISA3D (Visualization of Inelastic Structural Analysis for 3D systems) has been implemented with usage of OpenGL for 3D graphics and MFC for graphical user interface (GUI). Its framework allows further extension on new input formats and new element types. VISA3D has been mainly developed as a post-processor to examine the analytical results of PISA3D through 2D/3D static or dynamic graphic approaches. It includes graphical checking of the structural model, mode shapes, deformations, extents and locations of plastic hinges, plotting of nodal velocity, acceleration, and energy distribution time histories. This paper then introduces NCREE's recent development on the pre-processing framework GISA3D (Graphical Interface of Inelastic Structural Analysis for 3D systems). The GISA3D does not only supply features as a \"post-processor', but also fully supports operations of \"model generation\" via mouse motion. Users can create, remove, modify and set elements/nodes through mouse clicking, dragging and selecting. Finally, this paper illustrates the networked sub-structural pseudo dynamic tests using PISA3D as the analysis engine, and concludes with several successful applications of PISA3D/VISA3D/GISA3D on various researches and actual structural engineering projects. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Object-oriented development and application of a nonlinear structural analysis framework", "paper_id": "WOS:000260729000009"}