{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "routing-packing_problem"}, {"score": 0.004716031208088975, "phrase": "complex_real-world_problem"}, {"score": 0.004358240019060018, "phrase": "three-dimensional_loading_capacitated_vehicle_routing_problem"}, {"score": 0.0042157995925335544, "phrase": "gendreau"}, {"score": 0.004181876497589193, "phrase": "ion"}, {"score": 0.004146327773753156, "phrase": "laporte"}, {"score": 0.003706299561774348, "phrase": "total_routing_cost"}, {"score": 0.0035113478590679133, "phrase": "loading_constraints"}, {"score": 0.00345344412693677, "phrase": "additional_constraints"}, {"score": 0.0030231983220281836, "phrase": "split_deliveries"}, {"score": 0.002828556054338357, "phrase": "local_search_approach"}, {"score": 0.0027818804382539444, "phrase": "overall_problem"}, {"score": 0.0027473784878300133, "phrase": "single_stage"}, {"score": 0.002668524425703961, "phrase": "composite_strategy"}, {"score": 0.002602734354498382, "phrase": "large-neighborhood_search"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Routing", " Packing", " Loading constraints", " Local search"], "paper_abstract": "We propose a complex real-world problem in logistics that integrates routing and packing aspects. It can be seen as an extension of the Three-Dimensional Loading Capacitated Vehicle Routing Problem (3L-CVRP) introduced by Gendreau, Ion, Laporte, and Martello (2006). The 3L-CVRP consists in finding a set of routes that satisfies the demand of all customers, minimizes the total routing cost, and guarantees a packing of items that is feasible according to loading constraints. Our problem formulation includes additional constraints in relation to the stability of the cargo, to the fragility of items, and to the loading and unloading policy. In addition, it considers the possibility of split deliveries, so that each customer can be visited more than once. We propose a local search approach that considers the overall problem in a single stage. It is based On a composite strategy that interleaves simulated annealing with large-neighborhood search. We test our solver on 13 real-world instances provided by our industrial partner, which are very diverse in size and features. In addition, we compare our solver on benchmarks from the literature of the 3L-CVRP showing that our solver performs well compared to other approaches proposed in the literature. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Local search techniques for a routing-packing problem", "paper_id": "WOS:000328234000049"}