{"auto_keywords": [{"score": 0.042294571292837035, "phrase": "darwin"}, {"score": 0.004814954781412796, "phrase": "fittest"}, {"score": 0.004590496414177077, "phrase": "darwin's_insight"}, {"score": 0.004360412703519539, "phrase": "natural_selection"}, {"score": 0.0039053194919285725, "phrase": "..._natural_selection"}, {"score": 0.0038483286199081, "phrase": "main_but_not_exclusive_means"}, {"score": 0.0036822794196763506, "phrase": "oxford_univeristy_press"}, {"score": 0.003655336407424135, "phrase": "oxford"}, {"score": 0.003471933181807712, "phrase": "fundamental_strategy"}, {"score": 0.0033220706785945815, "phrase": "popular_view"}, {"score": 0.0032021226849872054, "phrase": "systems_fault-tolerant"}, {"score": 0.0025963890234079333, "phrase": "fundamental_mechanism"}, {"score": 0.002521064923851732, "phrase": "fundamental_feature"}, {"score": 0.0024389277933858054, "phrase": "sub-optimal_systems"}, {"score": 0.002136226584784576, "phrase": "fundamentally_new_design_approaches"}], "paper_keywords": ["Robustness", " Computing", " Artificial intelligence", " Biology"], "paper_abstract": "Darwin's insight that species are mutable, and descent, and origin by means of natural selection is one of the most widely acknowledged strategies for the origin of species and their survival in nature. In his famous contribution, however, Darwin also writes that he is convinced that \"... Natural Selection has been the main but not exclusive means of modification\" (Darwin in The origin of species. Oxford Univeristy Press, Oxford, p. 7, 1996). This research suggests robustness as another fundamental strategy for survival in nature. The paper does not contradict the popular view, which usually sees robustness as a feature making systems fault-tolerant, thereby focusing on the identification of strategies and techniques for making systems robust (i.e., how to achieve robustness). The paper rather extends this view with an interpretation resting on the question-WHY is robustness omnipresent in the world around us? From this point of view, robustness is interpreted as a fundamental mechanism that is in place because of another fundamental feature in nature-the design and use of sub-optimal systems. The paper argues that, in a sense, nature under-specifies systems but compensates for this by providing systems with various degrees of robustness. We believe that this interpretation may lead to fundamentally new design approaches and insights in several fields.", "paper_title": "The Survival of the Fittest and the Reign of the Most Robust: In Biology and Elsewhere", "paper_id": "WOS:000271751000004"}