{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "oa_journals"}, {"score": 0.004614643339546038, "phrase": "subscription_prices"}, {"score": 0.004571269461883144, "phrase": "peer-reviewed_journals"}, {"score": 0.004339867166576126, "phrase": "scientific_quality"}, {"score": 0.004159241394996858, "phrase": "bundled_e-licenses"}, {"score": 0.0039114753002009485, "phrase": "article_processing_charges"}, {"score": 0.0035755653799043, "phrase": "apc_payments"}, {"score": 0.003459191419478298, "phrase": "apc_pricing"}, {"score": 0.003176986603753607, "phrase": "systematic_survey"}, {"score": 0.0030590636298684862, "phrase": "scopus"}, {"score": 0.0029039692582303904, "phrase": "normalized_impact"}, {"score": 0.0027961342030212353, "phrase": "citation_rates"}], "paper_keywords": ["Open Access", " Business model", " SNIP value"], "paper_abstract": "The subscription prices of peer-reviewed journals have in the past not been closely related to the scientific quality. This relationship has been further obscured by bundled e-licenses. The situation is different for Open Access (OA) journals that finance their operations via article processing charges (APCs). Due to competition and the fact that authors are often directly involved in making APC payments from their own or other limited funds, APC pricing has so far been sensitive to the quality and services offered by journals. We conducted a systematic survey of prices charged by OA journals indexed in Scopus and this revealed a moderate (0.40) correlation between the APCs and Source Normalized Impact per Paper values, a measure of citation rates. When weighted by article volumes the correlations between the quality and the price were significantly higher (0.67). This would seem to indicate that while publishers to some extent take the quality into account when pricing their journals, authors are even more sensitive to the relationship between price and quality in their choices of where to submit their manuscripts.", "paper_title": "Article processing charges in OA journals: relationship between price and quality", "paper_id": "WOS:000352995000003"}