{"auto_keywords": [{"score": 0.045563865001511814, "phrase": "search_engines"}, {"score": 0.013708967711484277, "phrase": "individual_user"}, {"score": 0.008015761366316418, "phrase": "search_results"}, {"score": 0.00481495049065317, "phrase": "users_issue"}, {"score": 0.0047363569540686936, "phrase": "web_search_engines"}, {"score": 0.004508155639663496, "phrase": "diverse_backgrounds"}, {"score": 0.0044491728131708505, "phrase": "different_expectations"}, {"score": 0.004234749377133962, "phrase": "overall_interests"}, {"score": 0.003951736710391294, "phrase": "user_interests"}, {"score": 0.0034409976875396596, "phrase": "personalized_web_search_engine"}, {"score": 0.003158367829177805, "phrase": "first_challenge"}, {"score": 0.0030559337757849634, "phrase": "click_history"}, {"score": 0.00294707794932759, "phrase": "topical_ontology"}, {"score": 0.002908459938852865, "phrase": "user's_topic_preferences"}, {"score": 0.0027228088474257426, "phrase": "semantic_similarity"}, {"score": 0.0026959995147791188, "phrase": "user's_current_query"}, {"score": 0.0026694534457234933, "phrase": "query-matching_pages"}, {"score": 0.0026085220231994955, "phrase": "user's_current_topic_preference"}, {"score": 0.002574328937802055, "phrase": "second_challenge"}, {"score": 0.002523875743494305, "phrase": "ranking_function"}, {"score": 0.002490789449396715, "phrase": "learned_past_and_current_topic_preferences"}, {"score": 0.002324055400492893, "phrase": "google_query-stream"}, {"score": 0.0022486192232506388, "phrase": "user_preferences"}, {"score": 0.0021189380172266454, "phrase": "learned_user_preferences"}, {"score": 0.0021049977753042253, "phrase": "significant_improvements"}], "paper_keywords": ["Personalized search", " Web search", " User preferences", " Topical ontology", " Topic-specific rankings"], "paper_abstract": "Thousands of users issue keyword queries to the Web search engines to find information on a number of topics. Since the users may have diverse backgrounds and may have different expectations for a given query, some search engines try to personalize their results to better match the overall interests of an individual user. This task involves two great challenges. First the search engines need to be able to effectively identify the user interests and build a profile for every individual user. Second, once such a profile is available, the search engines need to rank the results in a way that matches the interests of a given user. In this article, we present our work towards a personalized Web search engine and we discuss how we addressed each of these challenges. Since users are typically not willing to provide information on their personal preferences, for the first challenge, we attempt to determine such preferences by examining the click history of each user. In particular, we leverage a topical ontology for estimating a user's topic preferences based on her past searches, i.e. previously issued queries and pages visited for those queries. We then explore the semantic similarity between the user's current query and the query-matching pages, in order to identify the user's current topic preference. For the second challenge, we have developed a ranking function that uses the learned past and current topic preferences in order to rank the search results to better match the preferences of a given user. Our experimental evaluation on the Google query-stream of human subjects over a period of 1 month shows that user preferences can be learned accurately through the use of our topical ontology and that our ranking function which takes into account the learned user preferences yields significant improvements in the quality of the search results.", "paper_title": "Search personalization through query and page topical analysis", "paper_id": "WOS:000262685500002"}