{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nestor"}, {"score": 0.008970691479798733, "phrase": "digital_library"}, {"score": 0.00471003041684707, "phrase": "digital_archives"}, {"score": 0.004624337472244542, "phrase": "extremely_valuable_part"}, {"score": 0.004408729661992651, "phrase": "physical_or_juridical_person"}, {"score": 0.0037643920253363776, "phrase": "formal_and_foundational_frameworks"}, {"score": 0.0034975571855450373, "phrase": "object_hierarchies"}, {"score": 0.003249574947858394, "phrase": "central_role"}, {"score": 0.003213920601037463, "phrase": "archival_realm"}, {"score": 0.0029860085187784534, "phrase": "ins"}, {"score": 0.0029100802280971065, "phrase": "hierarchical_relationships"}, {"score": 0.002857041057269513, "phrase": "inclusion_property"}, {"score": 0.00247509835229599, "phrase": "specific_features"}, {"score": 0.0022994427535192514, "phrase": "full_wealth"}, {"score": 0.0022825763382627443, "phrase": "dl_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Foundation", " Digital archive", " Digital library", " Hierarchy", " Set-based model", " Application"], "paper_abstract": "Archives are an extremely valuable part of our cultural heritage since they represent the trace of the activities of a physical or juridical person in the course of their business. Despite their importance, the models and technologies that have been developed over the past two decades in the Digital Library (DL) field have not been specifically tailored to archives. This is especially true when it comes to formal and foundational frameworks, as the Streams, Structures, Spaces, Scenarios, Societies (5S) model is. Therefore, we propose an innovative formal model, called NEsted SeTs for Object hieRarchies (NESTOR), for archives, explicitly built around the concepts of context and hierarchy which play a central role in the archival realm. NESTOR is composed of two set-based data models: the Nested Sets Model (NS-M) and the Inverse Nested Sets Model (INS-M) that express the hierarchical relationships between objects through the inclusion property between sets. We formally study the properties of these models and prove their equivalence with the notion of hierarchy entailed by archives. We then use NESTOR to extend the 5S model in order to take into account the specific features of archives and to tailor the notion of digital library accordingly. This offers the possibility of opening up the full wealth of DL methods and technologies to archives. We demonstrate the impact of NESTOR on this problem through three example use cases. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "NESTOR: A formal model for digital archives", "paper_id": "WOS:000324354600003"}