{"auto_keywords": [{"score": 0.042051296116313676, "phrase": "daclatasvir"}, {"score": 0.004756805752518494, "phrase": "daclatasvir_explains_drug-resistant"}, {"score": 0.004614483128885678, "phrase": "divergent_genotypes"}, {"score": 0.00436890075128947, "phrase": "hepatitis_c_virus"}, {"score": 0.0032431667821391044, "phrase": "low_barrier"}, {"score": 0.0032039415997394817, "phrase": "resistance_mutations"}, {"score": 0.0029422942175866057, "phrase": "state-of-the-art_modeling_techniques"}, {"score": 0.0027184540871935284, "phrase": "atomic_interactions"}, {"score": 0.0026209522797963447, "phrase": "different_hcv_genotypes"}, {"score": 0.002526938673434697, "phrase": "proposed_model"}, {"score": 0.002421499421848063, "phrase": "detailed_binding_mode"}, {"score": 0.0022371907579775796, "phrase": "second_generation_drugs"}, {"score": 0.0021049977753042253, "phrase": "hcv."}], "paper_keywords": [""], "paper_abstract": "Many direct-acting antiviral agents (DAAs) that selectively block hepatitis C virus (HCV) replication are currently under development. Among these agents is Daclatasvir, a first-in-class inhibitor targeting the NS5A viral protein. Although Daclatasvir is the most potent HCV antiviral molecule yet developed, its binding location and mode of binding remain unknown. The drug exhibits a low barrier to resistance mutations, particularly in genotype 1 viruses, but its efficacy against other genotypes is unclear. Using state-of-the-art modeling techniques combined with the massive computational power of Blue Gene/Q, we identified the atomic interactions of Daclatasvir within NS5A for different HCV genotypes and for several reported resistant mutations. The proposed model is the first to reveal the detailed binding mode of Daclatasvir. It also provides a tool to facilitate design of second generation drugs, which may confer less resistance and/or broader activity against HCV.", "paper_title": "A Refined Model of the HCV NS5A Protein Bound to Daclatasvir Explains Drug-Resistant Mutations and Activity against Divergent Genotypes", "paper_id": "WOS:000349943100016"}