{"auto_keywords": [{"score": 0.027611501677549284, "phrase": "proposed_approach"}, {"score": 0.019876248858286226, "phrase": "parallel_systems"}, {"score": 0.007061484731013685, "phrase": "shared_inputs"}, {"score": 0.00606807092133941, "phrase": "different_proportions"}, {"score": 0.005729323677738779, "phrase": "china"}, {"score": 0.005560468298051165, "phrase": "whole_dmu"}, {"score": 0.005298303887897198, "phrase": "proposed_model"}, {"score": 0.004770832063470752, "phrase": "data_envelopment_analysis"}, {"score": 0.004748923950808826, "phrase": "purpose_-_the_purpose"}, {"score": 0.0046408762473018955, "phrase": "parallel_subsystems"}, {"score": 0.004462781795506053, "phrase": "dedicated_inputs"}, {"score": 0.004321242146303891, "phrase": "dea"}, {"score": 0.004232613301664164, "phrase": "efficiency_evaluation_issue"}, {"score": 0.003950069028404172, "phrase": "centralized_dea_approach"}, {"score": 0.00387795022639671, "phrase": "decision-making_unit"}, {"score": 0.003860127556280589, "phrase": "dmu"}, {"score": 0.003703340165299559, "phrase": "different_dmus"}, {"score": 0.0036693696458815874, "phrase": "dmu's_efficiency"}, {"score": 0.0035940668531974566, "phrase": "operational_efficiencies"}, {"score": 0.0035041181758007282, "phrase": "proposed_dea_approach"}, {"score": 0.0033617430728433762, "phrase": "optimal_allocation_strategy"}, {"score": 0.003225134060928294, "phrase": "operational_performance"}, {"score": 0.003144389523316311, "phrase": "railway_system"}, {"score": 0.0030515584790455456, "phrase": "lower_freight_transportation_performance"}, {"score": 0.0029751466133186855, "phrase": "passenger_transportation_efficiency"}, {"score": 0.002961459921170416, "phrase": "freight_transportation_efficiency"}, {"score": 0.0029006425547761783, "phrase": "dea_model"}, {"score": 0.0028673949015200592, "phrase": "constant_returns"}, {"score": 0.002782718673983067, "phrase": "variable_returns"}, {"score": 0.002572862744611278, "phrase": "overall_efficiency"}, {"score": 0.002561021942189551, "phrase": "china's_railway_system"}, {"score": 0.0024968624833394686, "phrase": "freight_transportation"}, {"score": 0.0024739314314119235, "phrase": "firms'_disparities"}, {"score": 0.0024286976525382145, "phrase": "related_policies"}, {"score": 0.0022873089683764724, "phrase": "existing_approaches"}, {"score": 0.0022506663698086174, "phrase": "described_approach"}, {"score": 0.0021049977753042253, "phrase": "different_dmus'_sub-units"}], "paper_keywords": ["Operational efficiency", " Data envelopment analysis (DEA)", " Parallel system", " Railway firms", " Shared inputs/outputs"], "paper_abstract": "Purpose - The purpose of this paper is to measure the efficiencies of parallel subsystems with shared inputs/outputs. Each subsystem has not only a set of common inputs and outputs, but also some dedicated inputs and outputs as well as some shared inputs and outputs. A more general data envelopment analysis (DEA) approach is proposed to deal with this efficiency evaluation issue. Based on the proposed approach, mechanisms for shared inputs/outputs distribution and efficiency decomposition among sub-units are presented. Design/methodology/approach - To evaluate the efficiency of the parallel systems, this paper proposes a centralized DEA approach by assuming that the same input/output factor in a decision-making unit (DMU) has the same multiplier for all its sub-units. Furthermore, different proportions of shared inputs/outputs are imposed on sub-units within different DMUs in evaluating each DMU's efficiency. The proposed approach is applied to evaluate the operational efficiencies of 18 railway firms in China. Findings - By using the proposed DEA approach, the efficiencies of the whole DMU and its sub-units can be measured at the same time, and the optimal allocation strategy of shared inputs/outputs can also be obtained. The proposed model is more reasonable and robust for measuring the operational performance of parallel systems with shared inputs and outputs. The efficiency of railway system in China is relatively low, and its inefficiency is largely caused by lower freight transportation performance. Great disparities among firms can be found in the passenger transportation efficiency and freight transportation efficiency. Research limitations/implications - This study develops the DEA model under the assumption of constant returns to scale, which can be directly extended to a situation with variable returns to scale. Practical implications - In this paper, the proposed approach is a more effective way to evaluate the efficiencies of parallel systems with shared inputs/outputs. With respect to the application, to improve the overall efficiency of China's railway system, more efforts should be taken to improve its operational performance of freight transportation. Furthermore, firms' disparities should also be considered when making these related policies. Originality/value - The proposed approach can evaluate the whole DMU and its sub-units at the same time. Considering simultaneously the common/dedicated/shared inputs/outputs, the proposed approach is more general than the existing approaches in the literature. In the described approach, the same type of input or output is assumed to have the same weight for all sub-units within one DMU. More importantly, the proposed model imposes different proportions of shared inputs/outputs on different DMUs' sub-units when measuring the efficiency for each DMU.", "paper_title": "Measuring efficiencies of parallel systems with shared inputs/outputs using data envelopment analysis", "paper_id": "WOS:000352717100002"}