{"auto_keywords": [{"score": 0.04107868567004354, "phrase": "mgr"}, {"score": 0.006808435984386939, "phrase": "music_information_retrieval"}, {"score": 0.006280796443430463, "phrase": "mir"}, {"score": 0.00481495049065317, "phrase": "art_ten_years"}, {"score": 0.004421156723819163, "phrase": "first_review"}, {"score": 0.004322967486451877, "phrase": "'flagship_application"}, {"score": 0.004114527599108729, "phrase": "music_genre_recognition"}, {"score": 0.0037104876694493815, "phrase": "mgr_systems"}, {"score": 0.003547388349588054, "phrase": "mir."}, {"score": 0.0033011569787033297, "phrase": "massive_amount"}, {"score": 0.003071965703296204, "phrase": "paramount_reason"}, {"score": 0.0028844769395018595, "phrase": "case_study"}, {"score": 0.0028458096625791625, "phrase": "published_research"}, {"score": 0.0028076592725295646, "phrase": "most-used_benchmark_dataset"}, {"score": 0.0022118619998034742, "phrase": "music_emotion_recognition"}], "paper_keywords": ["information retrieval", " machine learning", " databases", " music analysis"], "paper_abstract": "A decade has passed since the first review of research on a 'flagship application' of music information retrieval (MIR): the problem of music genre recognition (MGR). During this time, about 500 works addressing MGR have been published, and at least 10 campaigns have been run to evaluate MGR systems. This makes MGR one of the most researched areas of MIR. So, where does MGR now lie? We show that in spite of this massive amount of work, MGR does not lie far from where it began, and the paramount reason for this is that most evaluation in MGR lacks validity. We perform a case study of all published research using the most-used benchmark dataset in MGR during the past decade: GTZAN. We show that none of the evaluations in these many works is valid to produce conclusions with respect to recognizing genre, i.e. that a system is using criteria relevant for recognizing genre. In fact, the problems of validity in evaluation also affect research in music emotion recognition and autotagging. We conclude by discussing the implications of our work for MGR and MIR in the next ten years.", "paper_title": "The State of the Art Ten Years After a State of the Art: Future Research in Music Information Retrieval", "paper_id": "WOS:000337940800002"}