{"auto_keywords": [{"score": 0.031013590618571788, "phrase": "information_processing_requirements"}, {"score": 0.015719716506582538, "phrase": "media_content"}, {"score": 0.015571915698046524, "phrase": "publishing_companies"}, {"score": 0.009377454020752636, "phrase": "content_distribution"}, {"score": 0.004376273644295806, "phrase": "publishing_firms"}, {"score": 0.00401560412621627, "phrase": "mis_research"}, {"score": 0.0036845490951857617, "phrase": "different_distribution_and_integration_requirements"}, {"score": 0.003413183361838603, "phrase": "structural_model"}, {"score": 0.0033806943112103397, "phrase": "media_content_allocation_behavior"}, {"score": 0.00326939082861424, "phrase": "contingency_theory"}, {"score": 0.0031921317979928406, "phrase": "organizational_structure"}, {"score": 0.0025737890313763407, "phrase": "magazine_publishing"}, {"score": 0.0024652715040303416, "phrase": "organizational_formalization"}, {"score": 0.002166349705365602, "phrase": "content_integration"}, {"score": 0.002105002791163301, "phrase": "elsevier"}], "paper_keywords": ["content allocatiom", " distribution", " integration", " contingency theory", " infrastructure managemem", " publishing industry", " path analysis"], "paper_abstract": "Today, articles and papers can be published in many different media and the allocation of content by publishing firms is vital for their operational efficiency, time-to-market, and customer retention. Past studies in MIS research have focused on the allocation of other objects than content, e.g., data or hardware, with different distribution and integration requirements. Such studies have ignored the allocation of media content. We developed and tested a structural model of media content allocation behavior of publishing companies. Drawing on contingency theory, we hypothesized that organizational structure (centralization, formalization, and specialization), size, distribution of IT decision-making, and information processing requirements influenced the degree of content distribution and integration. The model was tested using data from a survey of 115 companies in the book, newspaper, and magazine publishing industries. While content distribution was primarily contingent upon organizational formalization, organizational specialization, IT decision-making, and information processing requirements, only organizational standardization and information processing requirements were found to be significant in affecting the way that publishing companies carried out content integration. (c) 2007 Elsevier BN. All rights reserved.", "paper_title": "A contingency model for the allocation of media content in publishing companies", "paper_id": "WOS:000248878900005"}