{"auto_keywords": [{"score": 0.04933401710855325, "phrase": "intersection_curves"}, {"score": 0.0051710341678930715, "phrase": "transition_points"}, {"score": 0.00481495049065317, "phrase": "based_robust_algorithms"}, {"score": 0.004569630374630379, "phrase": "singularity_theory"}, {"score": 0.004359500411441827, "phrase": "generic_transitions"}, {"score": 0.0038049789989278463, "phrase": "generalized_offset_surfaces"}, {"score": 0.0033910448175165004, "phrase": "time_domain"}, {"score": 0.0032180376288035296, "phrase": "fixed_time"}, {"score": 0.003102195256794215, "phrase": "isolated_transition_points"}, {"score": 0.0030378759123133644, "phrase": "transition_events"}, {"score": 0.0027645030021576926, "phrase": "rational_system"}, {"score": 0.0025555322596460036, "phrase": "rational_constraint_solver"}, {"score": 0.0025025186963415, "phrase": "hyper-tangent_bounding_cones"}, {"score": 0.0024634797027967203, "phrase": "actual_transition_events"}, {"score": 0.002387214876538434, "phrase": "local_osculating_paraboloids"}, {"score": 0.002172266188075892, "phrase": "simple_evolution_vector_field"}, {"score": 0.0021049977753042253, "phrase": "euclidean_space"}], "paper_keywords": [""], "paper_abstract": "This paper applies singularity theory of mappings of surfaces to 3-space and the generic transitions occurring in their deformations to develop algorithms for continuously and robustly tracking the intersection curves of two deforming parametric spline surfaces, when the deformation is represented as a family of generalized offset surfaces. The set of intersection curves of 2 deforming surfaces over all time is formulated as an implicit 2-manifold I in the augmented (by time domain) parametric space R-5. Hyper-planes corresponding to some fixed time instants may touch I at some isolated transition points, which delineate transition events, i.e., the topological changes to the intersection curves. These transition points are the 0-dimensional solution to a rational system of 5 constraints in 5 variables, and can be computed efficiently and robustly with a rational constraint solver using subdivision and hyper-tangent bounding cones. The actual transition events are computed by contouring the local osculating paraboloids. Away from any transition points, the intersection curves do not change topology and evolve according to a simple evolution vector field that is constructed in the euclidean space in which the surfaces are embedded.", "paper_title": "Theoretically based robust algorithms for tracking intersection curves of two deforming parametric surfaces", "paper_id": "WOS:000239567900008"}