{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_content_creation"}, {"score": 0.026153563917107464, "phrase": "semantic_applications"}, {"score": 0.004781167345415497, "phrase": "significant_progress"}, {"score": 0.004736489828060163, "phrase": "large-scale_adoption"}, {"score": 0.004466519142879166, "phrase": "useful_semantic_content"}, {"score": 0.004414392034971581, "phrase": "almost_every_it_system"}, {"score": 0.004104456271230213, "phrase": "internet_users"}, {"score": 0.0040186038781533946, "phrase": "semantic_content"}, {"score": 0.0037101086421985224, "phrase": "high_barrier"}, {"score": 0.003649585593445665, "phrase": "semantic_technologies"}, {"score": 0.003623949225126944, "phrase": "specific_skills"}, {"score": 0.003531474887552889, "phrase": "mainstream_it_knowledge_portfolio"}, {"score": 0.003506665263162479, "phrase": "second_characteristic"}, {"score": 0.0033614129455356123, "phrase": "machine-understandable_content"}, {"score": 0.003081400693055518, "phrase": "social_semantic_web"}, {"score": 0.0029260602766930065, "phrase": "semantic_content_creation_process"}, {"score": 0.0028446460307503343, "phrase": "available_human_labor"}, {"score": 0.0027395968397212053, "phrase": "human_intervention"}, {"score": 0.0025953306514881085, "phrase": "first_contribution"}, {"score": 0.002441351603134446, "phrase": "specific_tasks"}, {"score": 0.002407132412260114, "phrase": "incentive_schemes"}, {"score": 0.0023566987138026285, "phrase": "exactly_these_tasks"}, {"score": 0.0023291369393531993, "phrase": "manual_input"}, {"score": 0.002307319246913764, "phrase": "second_contribution"}, {"score": 0.0022589720760078274, "phrase": "incentive-driven_tools"}, {"score": 0.002222068638633678, "phrase": "user_interest"}, {"score": 0.002211635717713414, "phrase": "semantic_content_creation_tasks"}, {"score": 0.0021399611054747233, "phrase": "fundamentally_new_form"}, {"score": 0.0021049977753042253, "phrase": "semantic_technologies_community"}], "paper_keywords": ["semantic technologies", " semantic content", " semantic content creation", " ontologies", " annotation", " alignment", " human intelligence", " human factor"], "paper_abstract": "Despite significant progress over the last years the large-scale adoption of semantic technologies is still to come. One of the reasons for this state of affairs is assumed to be the lack of useful semantic content, a prerequisite for almost every IT system or application using semantics. Through its very nature, this content can not be created fully automatically, but requires, to a certain degree, human contribution. The interest of Internet users in semantics, and in particular in creating semantic content, is, however, low. This is understandable if we think of several characteristics exposed by many of the most prominent semantic technologies, and the applications thereof. One of these characteristics is the high barrier of entry imposed. Interacting with semantic technologies today requires specific skills and expertise on subjects which are not part of the mainstream IT knowledge portfolio. A second characteristic are the incentives that are largely missing in the design of most semantic applications. The benefits of using machine-understandable content are in most applications fully decoupled from the effort of creating and maintaining this content. In other words, users do not have a motivation to contribute to the process. Initiatives in the areas of the Social Semantic Web acknowledged this problem, and identified mechanisms to motivate users to dedicate more of their time and resources to participate in the semantic content creation process. Still, even if incentives are theoretically in place, available human labor is limited and must only be used for those tasks that are heavily dependent on human intervention, and cannot be reliably automated. In this article, we concentrate on this step in between. As a first contribution, we analyze the process of semantic content creation in order to identify those tasks that are inherently human-driven. When building semantic applications involving these specific tasks, one has to install incentive schemes that are likely to encourage users to perform exactly these tasks that crucially rely on manual input. As a second contribution of the article, we propose incentives or incentive-driven tools that can be used to increase user interest in semantic content creation tasks. We hope that our findings will be adopted as recommendations for establishing a fundamentally new form of design of semantic applications by the semantic technologies community.", "paper_title": "Human Intelligence in the Process of Semantic Content Creation", "paper_id": "WOS:000276134100003"}