{"auto_keywords": [{"score": 0.03221581422402985, "phrase": "mu_rhythms"}, {"score": 0.00481495049065317, "phrase": "predicting_mu_rhythm_modulation"}, {"score": 0.00475413908468027, "phrase": "brain-computer_interfaces"}, {"score": 0.00454725669814484, "phrase": "severe_motor_disabilities"}, {"score": 0.004489810932879285, "phrase": "nonmuscular_input_channel"}, {"score": 0.0036864465771943933, "phrase": "formalized_process"}, {"score": 0.003593812067062062, "phrase": "user's_aptitude"}, {"score": 0.0033937776228549557, "phrase": "actual_system"}, {"score": 0.0032666255024083983, "phrase": "basic_information"}, {"score": 0.0030071857666598193, "phrase": "electrical_variations"}, {"score": 0.0029502941554043964, "phrase": "motor_cortex_region"}, {"score": 0.002421726275597666, "phrase": "hand-and-arm_movement"}, {"score": 0.0022578275190855124, "phrase": "actual_or_imagined_movements"}, {"score": 0.0021049977753042253, "phrase": "individual_characteristics"}], "paper_keywords": [""], "paper_abstract": "Brain-computer interfaces (BCIs) offer users with severe motor disabilities a nonmuscular input channel for communication and control but require that users achieve a level of literacy and be able to harness their appropriate electrophysiological responses for effective use of the interface. There is currently no formalized process for determining a user's aptitude for control of various BCIs without testing on an actual system. This study presents how basic information captured about users may be used to predict modulation of mu rhythms, electrical variations in the motor cortex region of the brain that may be used for control of a BCI. Based on data from 55 able-bodied users, we found that the interaction of age and daily average amount of hand-and-arm movement by individuals correlates to their ability to modulate mu rhythms induced by actual or imagined movements. This research may be expanded into a more robust model linking individual characteristics and control of various BCIs.", "paper_title": "Individual Characteristics and Their Effect on Predicting Mu Rhythm Modulation", "paper_id": "WOS:000286819400003"}