{"auto_keywords": [{"score": 0.033882930460188296, "phrase": "possible_worlds"}, {"score": 0.00481495049065317, "phrase": "asymmetric_bipolar_representation"}, {"score": 0.00477924690801092, "phrase": "positive_and_negative_information"}, {"score": 0.004553510708976456, "phrase": "negative_and_positive_information"}, {"score": 0.0036281710561308377, "phrase": "potential_choices"}, {"score": 0.003232341244892437, "phrase": "negative_information"}, {"score": 0.003102488033561956, "phrase": "classical_logic"}, {"score": 0.0030565692640988585, "phrase": "positive_information"}, {"score": 0.0028795712616923462, "phrase": "second_type"}, {"score": 0.002784540221128404, "phrase": "logical_tradition"}, {"score": 0.0026826140171754675, "phrase": "graded_uncertainty"}, {"score": 0.0024256208351516027, "phrase": "possibility_theory"}, {"score": 0.002398627220761345, "phrase": "bipolar_nature"}, {"score": 0.002354302193867031, "phrase": "new_light"}, {"score": 0.0021526564019119466, "phrase": "flexible_queries"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bipolarity", " Possibility theory", " Database querying"], "paper_abstract": "The paper emphasizes the interest of distinguishing between negative and positive information. While pieces of knowledge rule out what is known to be impossible, pieces of evidence, or observations, point out situations that are actually possible, i.e., do exist. But what is supposedly not impossible may never be observed. This applies as well to the modelling of the preferences of an agent when some potential choices are rejected since unfeasible or not tolerable, while other options are really satisfactory if they are available, leaving room for alternatives to which the agent is indifferent. Accumulating negative information removes possible worlds and is basically conjunctive (as done in classical logic), while positive information augments the set of possible worlds and is disjunctive or even cumulative by nature. This second type of information has been largely neglected by the logical tradition. Both types of information may be pervaded with graded uncertainty when modelling knowledge, or may be a matter of degree when handling preferences. The two types of information can be accommodated in the framework of possibility theory. The bipolar nature of information can shed new light on the revision of knowledge or preference. It is also highly relevant when making inference, or for improving the expressivity of flexible queries. (C) 2008 Elsevier B.V. All fights reserved.", "paper_title": "An overview of the asymmetric bipolar representation of positive and negative information in possibility theory", "paper_id": "WOS:000265476300003"}