{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "prior_experience"}, {"score": 0.019477925427798547, "phrase": "inclusive_design"}, {"score": 0.009761432269192398, "phrase": "older_users"}, {"score": 0.004434910775034831, "phrase": "interactive_products"}, {"score": 0.004101579688745222, "phrase": "different_definitions"}, {"score": 0.003952513974962462, "phrase": "differing_power"}, {"score": 0.0031518989079229714, "phrase": "current_discussion"}, {"score": 0.0030123335878664064, "phrase": "different_degrees"}, {"score": 0.002878930338561009, "phrase": "empirical_study"}, {"score": 0.002565345470805401, "phrase": "usability_variables"}, {"score": 0.002431570196486513, "phrase": "high_specificity"}, {"score": 0.0024017007954518065, "phrase": "best_predictors"}, {"score": 0.0023527296826339225, "phrase": "inclusive_design_principles"}, {"score": 0.002323826502178581, "phrase": "redesigned_version"}, {"score": 0.002295277579105177, "phrase": "ticket_vending_machine"}, {"score": 0.0021311850321045767, "phrase": "usability_measures"}, {"score": 0.0021049977753042253, "phrase": "enhanced_inclusiveness"}], "paper_keywords": ["Inclusive design", " Older adults", " Prior experience", " Competence", " Usability", " Ticket vending machines"], "paper_abstract": "Research in inclusive design has shown the importance of prior experience for the usability of interactive products. Prior experience, however, is an ill-defined and inconsistently used construct. A number of different definitions and operationalisations of experience exist, but the differing power of these operationalisations to predict the usability of products for older users has rarely been investigated systematically. This study seeks to fill that gap. It is argued that the construct of experience has at least three components. It is proposed that two of these components, exposure and competence, are directly relevant for the current discussion about prior experience in inclusive design and that they can predict to different degrees the usability of a product for older users. In an empirical study, these facets of expertise are each operationalised on three levels of specificity and their impact on usability is assessed. The results show that measures of competence predict usability variables more strongly than measures of exposure and that levels of medium and high specificity are the best predictors. The application of inclusive design principles to a redesigned version of a ticket vending machine-although not resulting in a difference of overall usability-changed the impact of prior experience on usability measures implying an enhanced inclusiveness of the redesign with regard to prior experience. The implications of these findings for the effectiveness of inclusive design for older users are discussed.", "paper_title": "Facets of prior experience and the effectiveness of inclusive design", "paper_id": "WOS:000322440600006"}