{"auto_keywords": [{"score": 0.036258613840235016, "phrase": "pspace"}, {"score": 0.00481495049065317, "phrase": "decision-theoretic_model_of_assistance"}, {"score": 0.004724980378009193, "phrase": "growing_interest"}, {"score": 0.004689462599037994, "phrase": "intelligent_assistants"}, {"score": 0.0042351951710402425, "phrase": "intelligent_assistance"}, {"score": 0.004187507332394002, "phrase": "decision-theoretic_framework"}, {"score": 0.004109212945115815, "phrase": "theoretical_and_empirical_results"}, {"score": 0.0034933321145368336, "phrase": "optimal_action_selection"}, {"score": 0.003467040410632942, "phrase": "hgmdps"}, {"score": 0.0033765627434550432, "phrase": "deterministic_dynamics"}, {"score": 0.003026127736667187, "phrase": "efficient_algorithms"}, {"score": 0.0029360049890445944, "phrase": "general_hamdps"}, {"score": 0.0028810424107858436, "phrase": "simple_myopic_policy"}, {"score": 0.002795228413298423, "phrase": "oracle_assistant"}, {"score": 0.0027532820796396713, "phrase": "agent's_goal"}, {"score": 0.0026411384812121503, "phrase": "general_case"}, {"score": 0.002562451837774567, "phrase": "novel_approach"}, {"score": 0.002340147988348115, "phrase": "real-world_domain"}, {"score": 0.0022963142779850562, "phrase": "folder_navigation"}, {"score": 0.00227040825063645, "phrase": "computer_desktop_environment"}, {"score": 0.002120982646893519, "phrase": "user_effort"}], "paper_keywords": [""], "paper_abstract": "There is a growing interest in intelligent assistants for a variety of applications from sorting email to helping people with disabilities to do their daily chores. In this paper, we formulate the problem of intelligent assistance in a decision-theoretic framework, and present both theoretical and empirical results. We first introduce a class of POMDPs called hidden-goal MDPs (HGMDPs), which formalizes the problem of interactively assisting an agent whose goal is hidden and whose actions are observable. In spite of its restricted nature, we show that optimal action selection for HGMDPs is PSPACE-complete even for deterministic dynamics. We then introduce a more restricted model called helper action MDPs (HAMDPs), which are sufficient for modeling many real-world problems. We show classes of HAMDPs for which efficient algorithms are possible. More interestingly, for general HAMDPs we show that a simple myopic policy achieves a near optimal regret, compared to an oracle assistant that knows the agent's goal. We then introduce more sophisticated versions of this policy for the general case of HGMDPs that we combine with a novel approach for quickly learning about the agent being assisted. We evaluate our approach in two game-like computer environments where human subjects perform tasks, and in a real-world domain of providing assistance during folder navigation in a computer desktop environment. The results show that in all three domains the framework results in an assistant that substantially reduces user effort with only modest computation.", "paper_title": "A Decision-Theoretic Model of Assistance", "paper_id": "WOS:000339310000001"}