{"auto_keywords": [{"score": 0.0492125536843633, "phrase": "parameter_space"}, {"score": 0.04549040717487418, "phrase": "pareto-optimal_set"}, {"score": 0.03386332385628929, "phrase": "mcf"}, {"score": 0.015578347252715613, "phrase": "objective_space"}, {"score": 0.013914229750618037, "phrase": "non-dominated_solutions"}, {"score": 0.013726703837354538, "phrase": "calibration_phase"}, {"score": 0.00481495049065317, "phrase": "desired_properties"}, {"score": 0.0046848707075530256, "phrase": "multi-objective_genetic_algorithms"}, {"score": 0.004537525607322823, "phrase": "hydrological_models"}, {"score": 0.003832031470970347, "phrase": "validation_phase"}, {"score": 0.0032955848190195343, "phrase": "model_characterization_framework"}, {"score": 0.003177235604998673, "phrase": "cluster_analysis"}, {"score": 0.002993887707344862, "phrase": "conditional_probability"}, {"score": 0.00274472767672686, "phrase": "calibration_output"}, {"score": 0.0026704265616705023, "phrase": "non-dominated_sorting_genetic_algorithm-ii"}, {"score": 0.002622040601739092, "phrase": "soil"}, {"score": 0.0025162511343171, "phrase": "fairchild_creek_watershed"}, {"score": 0.002493333098814506, "phrase": "southern_ontario"}, {"score": 0.002327956449278255, "phrase": "different_validation_periods"}, {"score": 0.0022649119108225564, "phrase": "robust_solutions_-_non-dominated_solutions"}], "paper_keywords": ["multi-objective evolutionary algorithms", " non-dominance", " parameter estimation", " Pareto-optimality", " robustness"], "paper_abstract": "Multi-objective genetic algorithms are increasingly being applied to calibrate hydrological models by generating several competitive solutions usually referred to as a Pareto-optimal set. The Pareto-optimal set comprises non-dominated solutions at the calibration phase but it is usually unknown whether all or only a subset of non-dominated solutions at the calibration phase remains non-dominated at the validation phase. In practice, users would like to know solutions (and their associated properties) which remain non-dominated at both the calibration and validation phases. This study investigates robustness of the Pareto-optimal set by developing a model characterization framework (MCF). The MCF uses cluster analysis to examine the distribution of solutions in parameter space and objective space, and conditional probability to combine linkages between the distributions of solutions in both spaces. The MCF has been illustrated for calibration output generated from application of the Non-dominated Sorting Genetic Algorithm-II to calibrate the Soil and Water Assessment Tool for streamflow in the Fairchild Creek watershed in southern Ontario. Our results show that not all non-dominated solutions found at the calibration phase perform the same for different validation periods. The MCF illustrates that robust solutions - non-dominated solutions which cluster in similar locations in parameter space and objective space - performed consistently well for several validation periods.", "paper_title": "Pareto-optimality and a search for robustness: choosing solutions with desired properties in objective space and parameter space", "paper_id": "WOS:000303453900002"}