{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "single_container_loading_problem"}, {"score": 0.004501453956464956, "phrase": "three-dimensional_boxes"}, {"score": 0.004419538941706716, "phrase": "three-dimensional_container"}, {"score": 0.004260134699483774, "phrase": "volume_utilization"}, {"score": 0.003982617095636925, "phrase": "similar_structure"}, {"score": 0.0033961782274326948, "phrase": "systematic_manner"}, {"score": 0.0031360786664165093, "phrase": "existing_techniques"}, {"score": 0.0026576091519087065, "phrase": "effective_strategies"}, {"score": 0.0026091594819333654, "phrase": "greedy_heuristic"}, {"score": 0.0025615908073796027, "phrase": "sclp_problem"}, {"score": 0.002530359917257626, "phrase": "computational_experiments"}, {"score": 0.0022938068444116827, "phrase": "best_parallel_approach"}, {"score": 0.0021049977753042253, "phrase": "block_building_algorithms"}], "paper_keywords": ["Greedy heuristic", " 3D packing", " Tree search", " Metaheuristics", " Block building"], "paper_abstract": "In the Single Container Loading Problem, the aim is to pack three-dimensional boxes into a three-dimensional container so as to maximize the volume utilization of the container. Many recently successful techniques for this problem share a similar structure involving the use of blocks of boxes. However, each technique comprises several seemingly disparate parts, which makes it difficult to analyze these techniques in a systematic manner. By dissecting block building approaches into 6 common elements, we found that existing techniques only differ in the strategies used for each element. This allows us to better understand these algorithms and identify their effective strategies. We then combine those effective strategies into a greedy heuristic for the SCLP problem. Computational experiments on 1,600 commonly used test cases show that our approach outperforms all other existing single-threaded approaches, and is comparable to the best parallel approach to the SCLP. It demonstrates the usefulness of our component-based analysis in the design of block building algorithms.", "paper_title": "The six elements to block-building approaches for the single container loading problem", "paper_id": "WOS:000308252700009"}