{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "coaxial_optical_scanner"}, {"score": 0.004522796947899013, "phrase": "novel_optical_setup"}, {"score": 0.004466519142879166, "phrase": "processing_pipeline"}, {"score": 0.004301834610818624, "phrase": "spatially-varying_surface_reflectance"}, {"score": 0.004040688646993605, "phrase": "digital_camera_and_a_high_frequency_spatially-modulated_light_source"}, {"score": 0.0034984340449789745, "phrase": "precise_measurements"}, {"score": 0.0029169007179202164, "phrase": "important_implications"}, {"score": 0.0028805474861014722, "phrase": "image-based_reflectometry"}, {"score": 0.002447101794397243, "phrase": "reference_data"}, {"score": 0.002158505888557746, "phrase": "reference_images"}, {"score": 0.0021049977753042253, "phrase": "view_positions"}], "paper_keywords": [""], "paper_abstract": "We present a novel optical setup and processing pipeline for measuring the 3D geometry and spatially-varying surface reflectance of physical objects. Central to our design is a digital camera and a high frequency spatially-modulated light source aligned to share a common focal point and optical axis. Pairs of such devices allow capturing a sequence of images from which precise measurements of geometry and reflectance can be recovered. Our approach is enabled by two technical contributions: a new active multiview stereo algorithm and an analysis of light descattering that has important implications for image-based reflectometry. We show that the geometry measured by our scanner is accurate to within 50 microns at a resolution of roughly 200 microns and that the reflectance agrees with reference data to within 5 : 5 %. Additionally, we present an image relighting application and show renderings that agree very well with reference images at light and view positions far from those that were initially measured.", "paper_title": "A Coaxial Optical Scanner for Synchronous Acquisition of 3D Geometry and Surface Reflectance", "paper_id": "WOS:000279806600069"}