{"auto_keywords": [{"score": 0.048942135716428165, "phrase": "metric_fluents"}, {"score": 0.014160566458840786, "phrase": "mip"}, {"score": 0.007916228359785159, "phrase": "usual_relaxation"}, {"score": 0.00481495049065317, "phrase": "modelling_numeric_resource_flows"}, {"score": 0.004534136929881113, "phrase": "fully_automated_planners"}, {"score": 0.004308304400698582, "phrase": "interval-valued_variables"}, {"score": 0.004168181737829043, "phrase": "domain_encodings"}, {"score": 0.004130760425485278, "phrase": "additional_information"}, {"score": 0.0040569185796103845, "phrase": "capacity_constraints"}, {"score": 0.003740568332108757, "phrase": "raw_materials"}, {"score": 0.0036958398682001015, "phrase": "processed_goods"}, {"score": 0.0032182214864142616, "phrase": "numeric_planning_problems"}, {"score": 0.0031797191359738356, "phrase": "propositional_relaxed_planning_graph"}, {"score": 0.003132236287543072, "phrase": "mathematical_program"}, {"score": 0.003113441660343867, "phrase": "numeric_reasoning"}, {"score": 0.0030485414351981766, "phrase": "producer-consumer_planning_problems"}, {"score": 0.0030030115662983987, "phrase": "numeric_constraints"}, {"score": 0.002931569771634119, "phrase": "mixed_integer_program"}, {"score": 0.002793730385549585, "phrase": "integrated_hybrid_heuristic"}, {"score": 0.0027519956065269126, "phrase": "resource_use"}, {"score": 0.0026225783147322953, "phrase": "rpg"}, {"score": 0.0025989960809479104, "phrase": "causal_propositional_aspects"}, {"score": 0.0024917159298274297, "phrase": "single_unified_heuristic"}, {"score": 0.0024250944519924383, "phrase": "planning_problems"}, {"score": 0.0023816709160125265, "phrase": "mip."}, {"score": 0.0023390219342052623, "phrase": "limited_subset"}, {"score": 0.0023179843199613174, "phrase": "propositional_problem"}, {"score": 0.0022155944576897862, "phrase": "propositional_landmarks"}, {"score": 0.0022022878843247257, "phrase": "propositional_resources"}, {"score": 0.0021049977753042253, "phrase": "numeric_resource_interaction"}], "paper_keywords": [""], "paper_abstract": "Although the use of metric fluents is fundamental to many practical planning problems, the study of heuristics to support fully automated planners working with these fluents remains relatively unexplored. The most widely used heuristic is the relaxation of metric fluents into interval-valued variables - an idea first proposed a decade ago. Other heuristics depend on domain encodings that supply additional information about fluents, such as capacity constraints or other resource-related annotations. A particular challenge to these approaches is in handling interactions between metric fluents that represent exchange, such as the transformation of quantities of raw materials into quantities of processed goods, or trading of money for materials. The usual relaxation of metric fluents is often very poor in these situations, since it does not recognise that resources, once spent, are no longer available to be spent again. We present a heuristic for numeric planning problems building on the propositional relaxed planning graph, but using a mathematical program for numeric reasoning. We define a class of producer-consumer planning problems and demonstrate how the numeric constraints in these can be modelled in a mixed integer program (MIP). This MIP is then combined with a metric Relaxed Planning Graph (RPG) heuristic to produce an integrated hybrid heuristic. The MIP tracks resource use more accurately than the usual relaxation, but relaxes the ordering of actions, while the RPG captures the causal propositional aspects of the problem. We discuss how these two components interact to produce a single unified heuristic and go on to explore how further numeric features of planning problems can be integrated into the MIP. We show that encoding a limited subset of the propositional problem to augment the MIP can yield more accurate guidance, partly by exploiting structure such as propositional landmarks and propositional resources. Our results show that the use of this heuristic enhances scalability on problems where numeric resource interaction is key in finding a solution.", "paper_title": "A Hybrid LP-RPG Heuristic for Modelling Numeric Resource Flows in Planning", "paper_id": "WOS:000316719800001"}