{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "parallel_and_pipelined_watershed_algorithm"}, {"score": 0.03597927187198435, "phrase": "pipelined_circuit"}, {"score": 0.0046159158660556985, "phrase": "popular_image_segmentation_technique"}, {"score": 0.004560568143816105, "phrase": "gray_scale_images"}, {"score": 0.004398457709182882, "phrase": "real-time_image_segmentation"}, {"score": 0.004165987300206134, "phrase": "hardware_implementation"}, {"score": 0.0034759420565135253, "phrase": "high_performance"}, {"score": 0.003352256019007896, "phrase": "memory_access_sequences"}, {"score": 0.0027133856739937133, "phrase": "previous_scan"}, {"score": 0.0024336917123957387, "phrase": "off-the-shelf_field-programmable_gate_array_board"}, {"score": 0.0021306081217770173, "phrase": "first_step"}, {"score": 0.0021049977753042253, "phrase": "real-time_applications"}], "paper_keywords": ["Watershed algorithm", " Segmentation", " Real time", " FPGA"], "paper_abstract": "The watershed transformation is a popular image segmentation technique for gray scale images. This paper describes a real-time image segmentation based on a parallel and pipelined watershed algorithm which is designed for hardware implementation. In our algorithm: (1) pixels in a given image are repeatedly scanned from top-left to bottom-right, and then from bottom-right to top-left, in order to achieve high performance on a pipelined circuit by simplifying memory access sequences, (2) all steps in the algorithm are executed at the same time in the pipelined circuit, (3) the amount of data that are scanned is gradually reduced as the calculation progresses by memorizing which data are modified in the previous scan, and (4) N pixels can be processed in parallel. In our current implementation on an off-the-shelf field-programmable gate array board, up to four pixels can be processed in parallel. The performance for 512 x 512 pixel images is fast enough to be the first step in real-time applications.", "paper_title": "Real-time image segmentation based on a parallel and pipelined watershed algorithm", "paper_id": "WOS:000208119000013"}