{"auto_keywords": [{"score": 0.03895000187878607, "phrase": "multi-timeslot_replication_scheme"}, {"score": 0.008713768692145006, "phrase": "multiwavelength_multicast_packet_switch"}, {"score": 0.004085579055228594, "phrase": "packet_multicasting"}, {"score": 0.004023120753104693, "phrase": "multiple_optical_packets"}, {"score": 0.0035021127041237887, "phrase": "multiple_timeslots"}, {"score": 0.0034308688638878286, "phrase": "output_contention"}, {"score": 0.003378385493203297, "phrase": "analytical_model"}, {"score": 0.0030957429853133147, "phrase": "traffic_performance"}, {"score": 0.002836679611901583, "phrase": "packet_loss_probability"}, {"score": 0.0026806884201358515, "phrase": "multicast_traffic_ratio_increases"}, {"score": 0.002357249810661667, "phrase": "multicast_traffic_ratio"}, {"score": 0.002262209824105154, "phrase": "scalability_analysis"}, {"score": 0.0021267708018655493, "phrase": "fixed_packet_loss_probability"}], "paper_keywords": ["Wavelength division multiplexing (WDM)", " Optical packet switching (OPS)", " Waveband conversion", " Multicast"], "paper_abstract": "This paper presents a multiwavelength multicast packet switch and studies its multicast traffic performance analytically and by simulation. The switch employs the broadcast-and-select architecture to realize packet multicasting and enables multiple optical packets to be concurrently transmitted to the same output fiber of the switch. By means of a multi-timeslot replication scheme, a multicast packet is allowed to be replicated in multiple timeslots to reduce the output contention. An analytical model of the switch with the multi-timeslot replication scheme is developed and then verified by simulation. We compare traffic performance of the switch with and without the multi-timeslot replication scheme through simulation. It is shown that the packet loss probability and delay of the switch are considerably deteriorated as the multicast traffic ratio increases without using the multi-timeslot replication scheme; with the multi-timeslot replication scheme, the switch can achieve a much lower packet loss probability and delay, which is not affected by the multicast traffic ratio, and thus a higher throughput. Scalability analysis indicates that the switch with more wavelengths per fiber can achieve a fixed packet loss probability with less power loss.", "paper_title": "Multiwavelength Multicast Packet Switch: Performance Analysis and Evaluation", "paper_id": "WOS:000284851400003"}