{"auto_keywords": [{"score": 0.04958720442967608, "phrase": "assistive_technology"}, {"score": 0.00481495049065317, "phrase": "physical_disabilities"}, {"score": 0.004039423410198574, "phrase": "morse_code"}, {"score": 0.0038959121068990517, "phrase": "valuable_tool"}, {"score": 0.0035681790580031998, "phrase": "spinal_cord_injuries"}, {"score": 0.003531474887552889, "phrase": "non-vocal_quadriplegics"}, {"score": 0.003234299589505403, "phrase": "mobile_phone_human-interface_system"}, {"score": 0.0031845067058084583, "phrase": "single-switch_morse_code_input_device"}, {"score": 0.0028567126120064546, "phrase": "data_format"}, {"score": 0.0028127163745564777, "phrase": "signal_transmission"}, {"score": 0.002769395841379498, "phrase": "proposed_system"}, {"score": 0.002726740692380339, "phrase": "communication_devices"}, {"score": 0.002684740763324991, "phrase": "pdu"}, {"score": 0.002358917661465133, "phrase": "experimental_results"}, {"score": 0.0022283519468680475, "phrase": "mobile_phone"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Morse code", " adaptive signal processing", " simple message service", " assistive technology"], "paper_abstract": "Assistive technology (AT) is becoming increasingly important in improving mobility, communication and learning capabilities of persons who have disabilities, enabling them to function independently and to improve their social opportunities. Morse code has been shown to be a valuable tool in assistive technology, augmentative and alternative communication, and rehabilitation for people with various conditions such as spinal cord injuries, non-vocal quadriplegics, and vocal, visual or hearing impairments. In this paper, we describe the design and implementation of a mobile phone human-interface system using a single-switch Morse code input device. The proposed system is divided into three parts: input module, control module, and display module. The data format of the signal transmission between the proposed system and the communication devices is the PDU (protocol description unit) mode. A person with disabilities would be able to send/receive SMS (Simple Message Service) messages or make/respond to a phone call. Experimental results revealed that three participants with disabilities were able to operate the mobile phone through this human-interface after two months' practice. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A mobile communication aid system for persons with physical disabilities", "paper_id": "WOS:000253267600008"}