{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "information_search_process"}, {"score": 0.026812159373844926, "phrase": "search_process"}, {"score": 0.0047747348769918, "phrase": "adolescent_students"}, {"score": 0.004636594774238505, "phrase": "information_and_communications_possibilities"}, {"score": 0.004502433187097914, "phrase": "information_systems"}, {"score": 0.004192484908247302, "phrase": "cohesive_whole"}, {"score": 0.0040882422992520925, "phrase": "information_seekers"}, {"score": 0.003936698872193083, "phrase": "cognitive_strategies"}, {"score": 0.0035148319209810128, "phrase": "great_depth"}, {"score": 0.0034130176595901104, "phrase": "qualitative_study"}, {"score": 0.00299632091372281, "phrase": "larger_purpose"}, {"score": 0.002897283610433351, "phrase": "metacognitive_knowledge"}, {"score": 0.0026637384761565605, "phrase": "school-based_information_task"}, {"score": 0.002177011650568437, "phrase": "clear_and_distinct_metacognitive_strategy"}, {"score": 0.0021049977753042253, "phrase": "one's_own_curiosity"}], "paper_keywords": [""], "paper_abstract": "In a world of increasing information and communications possibilities, the difficulty for users of information systems and services may not lie in finding information but in filtering and integrating it into a cohesive whole. To do this, information seekers must know when and how to effectively use cognitive strategies to regulate their own thinking, motivation, and actions. Sometimes this is difficult when the topic is interesting and one is driven to explore it in great depth. This article reports on a qualitative study that, in the course of exploring the thinking and emotions of 10 adolescents during the information search process, uncovered patterns of behavior that are related to curiosity and interest. The larger purpose of the study was to investigate the metacognitive knowledge of adolescents, ages 16-18, as they searched for, selected, and used information to complete a school-based information task. The study found that the curiosity experienced by adolescents during the search process was accompanied by feelings of both pleasure and pain and that both feelings needed to be managed in order to navigate a pathway through the search process. The self-regulation of curiosity and interest was a clear and distinct metacognitive strategy fueled by metacognitive knowledge related to understanding one's own curiosity and the emotions attached to it.", "paper_title": "The Self-Regulation of Curiosity and Interest During the Information Search Process of Adolescent Students", "paper_id": "WOS:000279151600003"}