{"auto_keywords": [{"score": 0.03818988992284084, "phrase": "artifact-centric_collaboration"}, {"score": 0.00481495049065317, "phrase": "distributed_scientific_collaboration"}, {"score": 0.00418134346679498, "phrase": "remote_collaborators"}, {"score": 0.004077272409331917, "phrase": "digital_artifacts"}, {"score": 0.0037235274565193665, "phrase": "complex_scientific_simulations"}, {"score": 0.0034348484776384643, "phrase": "longitudinal_ethnographic_study"}, {"score": 0.0033492947290751996, "phrase": "collaborating_scientific_researchers"}, {"score": 0.0032658649336454923, "phrase": "single_research_group"}, {"score": 0.0029374939071038146, "phrase": "detailed_analysis"}, {"score": 0.002878785759716458, "phrase": "artifact_interaction"}, {"score": 0.0025761937402886954, "phrase": "detailed_coding"}, {"score": 0.0025374674652885354, "phrase": "artifact-centric_interactions"}, {"score": 0.0021049977753042253, "phrase": "collaboration_software"}], "paper_keywords": ["distributed", " collaboration", " CSCW", " multimodal", " gesture", " scientific visualization"], "paper_abstract": "In this paper, we explore the importance of gesture in distributed, scientific collaboration. In particular, we are interested in the impact that distance has when remote collaborators are working together with digital artifacts that are complex (and often visual) in form, such as data that results from complex scientific simulations. We call this artifact-centric collaboration. In order to understand such collaborations, we performed a longitudinal ethnographic study of a group of collaborating scientific researchers. We observed a single research group during its regular research meetings, performing over 18 h of observations spanning a 5-month period. In this paper, we present a detailed analysis of two meetings where artifact interaction is prominent, one where all participants are collocated and the other where participants are distributed. Our analysis consists of a detailed coding of the artifact-centric interactions in both meetings as well as an analysis of these interactions. We conclude the paper with a summary of our findings, including a set of guidelines that can be used to inform the design of collaboration software that supports distributed, artifact-centric collaboration.", "paper_title": "Toward understanding the importance of gesture in distributed scientific collaboration", "paper_id": "WOS:000250065700003"}