{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_personality"}, {"score": 0.012224364692845262, "phrase": "facebook"}, {"score": 0.004835354918631333, "phrase": "user_interactions"}, {"score": 0.004768559572292452, "phrase": "social_interactions"}, {"score": 0.004707396263523012, "phrase": "adaptive_applications"}, {"score": 0.004602233424629559, "phrase": "users'_personality"}, {"score": 0.00447045328907701, "phrase": "wide_variety"}, {"score": 0.0033971539563683174, "phrase": "similar_personality"}, {"score": 0.003342700977158772, "phrase": "common_behavioral_patterns"}, {"score": 0.003299765620885585, "phrase": "virtual_social_networks"}, {"score": 0.002985130390111069, "phrase": "social_networks"}, {"score": 0.0027982016314450717, "phrase": "personality_traits"}, {"score": 0.002622947550220266, "phrase": "different_machine-learning_techniques"}, {"score": 0.002555950807368337, "phrase": "interaction_patterns"}, {"score": 0.00250682585023182, "phrase": "users'_personality_traits"}, {"score": 0.002304606411453748, "phrase": "wall_posts"}, {"score": 0.0022312377180023282, "phrase": "high_level"}, {"score": 0.0021883400011393564, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Data mining in social networks", " User modeling", " Personality inference"], "paper_abstract": "Adaptive applications may benefit from having models of users' personality to adapt their behavior accordingly. There is a wide variety of domains in which this can be useful, i.e., assistive technologies, e-learning, e-commerce, health care or recommender systems, among others. The most commonly used procedure to obtain the user personality consists of asking the user to fill in questionnaires. However, on one hand, it would be desirable to obtain the user personality as unobtrusively as possible, yet without compromising the reliability of the model built. On the other hand, our hypothesis is that users with similar personality are expected to show common behavioral patterns when interacting through virtual social networks, and that these patterns can be mined in order to predict the tendency of a user personality. With the goal of inferring personality from the analysis of user interactions within social networks, we have developed TP2010, a Facebook application. It has been used to collect information about the personality traits of more than 20,000 users, along with their interactions within Facebook. Based on all the collected data, automatic classifiers were trained by using different machine-learning techniques, with the purpose of looking for interaction patterns that provide information about the users' personality traits. These classifiers are able to predict user personality starting from parameters related to user interactions, such as the number of friends or the number of wall posts. The results show that the classifiers have a high level of accuracy, making the proposed approach a reliable method for predicting the user personality (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Predicting user personality by mining social interactions in Facebook", "paper_id": "WOS:000325386500006"}