{"auto_keywords": [{"score": 0.04579236087036461, "phrase": "cloud_computing"}, {"score": 0.014703351986829958, "phrase": "cloud_computing_platform"}, {"score": 0.00481495049065317, "phrase": "compromised-time-cost_scheduling_algorithm"}, {"score": 0.003911010373894104, "phrase": "workflow_execution"}, {"score": 0.003870541730075597, "phrase": "instance-intensive_cost-constrained_cloud_workflows"}, {"score": 0.003712796038920873, "phrase": "workflow_instances"}, {"score": 0.0034519997658752598, "phrase": "i._e._cost"}, {"score": 0.002592606058287124, "phrase": "instance-intensive_cost-constrained_workflows"}, {"score": 0.0024868131939261716, "phrase": "user_input"}, {"score": 0.0022760856906838814, "phrase": "mean_execution_cost"}, {"score": 0.002206045784326466, "phrase": "user-designated_deadline"}, {"score": 0.0021605514226546497, "phrase": "mean_execution_time"}, {"score": 0.0021049977753042253, "phrase": "user-designated_execution_cost"}], "paper_keywords": ["Cloud Workflows", " Workflow Scheduling Algorithms", " Instance-Intensive Workflows", " Cost-Constrained Workflows", " Cloud Computing"], "paper_abstract": "The concept of cloud computing continues to spread widely, as it has been accepted recently. Cloud computing has many unique advantages which can be utilized to facilitate workflow execution. Instance-intensive cost-constrained cloud workflows are workflows with a large number of workflow instances (i. e. instance intensive) bounded by a certain budget for execution (i. e. cost constrained) on a cloud computing platform (i. e. cloud workflows). However, there are, so far, no dedicated scheduling algorithms for instance-intensive cost-constrained cloud workflows. This paper presents a novel compromised-time-cost scheduling algorithm which considers the characteristics of cloud computing to accommodate instance-intensive cost-constrained workflows by compromising execution time and cost with user input enabled on the fly. The simulation performed demonstrates that the algorithm can cut down the mean execution cost by over 15% whilst meeting the user-designated deadline or shorten the mean execution time by over 20% within the user-designated execution cost.", "paper_title": "A Compromised-Time-Cost Scheduling Algorithm in SwinDeW-C for Instance-Intensive Cost-Constrained Workflows on a Cloud Computing Platform", "paper_id": "WOS:000284356600004"}