{"auto_keywords": [{"score": 0.044627085591387144, "phrase": "temporal_and_spatial_structure"}, {"score": 0.00481495049065317, "phrase": "public_participation"}, {"score": 0.00477513738640734, "phrase": "decision_making"}, {"score": 0.00402748353567517, "phrase": "message_exchanges"}, {"score": 0.003847546889061499, "phrase": "online_message_exchanges"}, {"score": 0.0033266163944946185, "phrase": "message_posting"}, {"score": 0.0030357976028714557, "phrase": "grapevine_visualization"}, {"score": 0.0029857124153761187, "phrase": "productive_patterns"}, {"score": 0.002960979624379786, "phrase": "fine-grained_human-computer-human_interaction"}, {"score": 0.002828556054338357, "phrase": "productive_parts"}, {"score": 0.002805121439110729, "phrase": "content_analysis"}, {"score": 0.002624482632439123, "phrase": "participatory_interactions"}, {"score": 0.002591927716261631, "phrase": "online_field_experiment"}, {"score": 0.002528021281333922, "phrase": "central_puget_sound_region"}, {"score": 0.002507089000476691, "phrase": "washington"}, {"score": 0.002268769196700254, "phrase": "general_purpose_technique"}, {"score": 0.0022220423638260015, "phrase": "participatory_learning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Grapevine", " Geovisual analytics", " Public participation", " Decision making", " Spatio-temporal events", " Human-computer-human interaction"], "paper_abstract": "This article reports on a three-dimensional (time-space) geovisual analytic called a \"grapevine.\" People often use metaphors to describe the temporal and spatial structure of online discussions, e.g., \"threads\" growing as a result of message exchanges. We created a visualization to evaluate the temporal and spatial structure of online message exchanges based on the shape of a grapevine naturally cultivated in a vineyard. Our grapevine visualization extends up through time with features like buds, nodes, tendrils, and leaves produced as a result of message posting, replying, and voting. Using a rotatable and fully interactive three-dimensional GIS (Geographic Information System) environment, a geovisual analyst can evaluate the quality of deliberation in the grapevine visualization by looking for productive patterns in fine-grained human-computer-human interaction (HCHI) data and then sub-sampling the productive parts for content analysis. We present an example of how we used the technique in a study of participatory interactions during an online field experiment about improving transportation in the central Puget Sound region of Washington called the Let's Improve Transportation (LIT) Challenge. We conclude with insights about how our grapevine could be applied as a general purpose technique for evaluation of any participatory learning, thinking, or decision making situation. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Geovisual evaluation of public participation in decision making: The grapevine", "paper_id": "WOS:000293324200006"}