{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "sensor_surveillance_systems"}, {"score": 0.04972867160744284, "phrase": "k_sensors"}, {"score": 0.03940459384552649, "phrase": "base_station"}, {"score": 0.031042443925142046, "phrase": "maximal_lifetime"}, {"score": 0.011921782736199456, "phrase": "surveillance_system"}, {"score": 0.010042859792205, "phrase": "optimal_solution"}, {"score": 0.00903302089614851, "phrase": "workload_matrix"}, {"score": 0.004641351004344458, "phrase": "maximal_lifetime_scheduling"}, {"score": 0.004360412703519539, "phrase": "euclidean_plane"}, {"score": 0.0031207372860045427, "phrase": "sensor_nodes"}, {"score": 0.002723607240517261, "phrase": "linear_programming_techniques"}, {"score": 0.0026155681847364483, "phrase": "schedule_matrices"}, {"score": 0.002502576987281976, "phrase": "sensor_surveillance_trees"}, {"score": 0.002421040737931745, "phrase": "active_sensors"}, {"score": 0.002368160970983679, "phrase": "sensed_data"}, {"score": 0.0022994427535192514, "phrase": "first_time"}, {"score": 0.0022492129111567824, "phrase": "scheduling_problem"}, {"score": 0.0021049977753042253, "phrase": "numeric_example"}], "paper_keywords": ["energy efficiency", " lifetime", " scheduling", " sensor network", " surveillance system"], "paper_abstract": "This paper addresses the maximal lifetime scheduling for sensor surveillance systems with K sensors to 1 target. Given a set of sensors and targets in an Euclidean plane, a sensor can watch only one target at a time and a target should be watched by k, k >= 1, sensors at any time. Our task is to schedule sensors to watch targets and pass data to the base station, such that the lifetime of the surveillance system is maximized, where the lifetime is the duration up to the time when there exists one target that cannot be watched by k sensors or data cannot be forwarded to the base station due to the depletion of energy of the sensor nodes. We propose an optimal solution to find the target watching schedule for sensors that achieves the maximal lifetime. Our solution consists of three steps: 1) computing the maximal lifetime of the surveillance system and a workload matrix by using linear programming techniques, 2) decomposing the workload matrix into a sequence of schedule matrices that can achieve the maximal lifetime, and 3) determining the sensor surveillance trees based on the above obtained schedule matrices, which specify the active sensors and the routes to pass sensed data to the base station. This is the first time in the literature that this scheduling problem of sensor surveillance systems has been formulated and the optimal solution has been found. We illustrate our optimal method by a numeric example and experiments in the end.", "paper_title": "Maximal lifetime scheduling for sensor surveillance systems with K sensors to one target", "paper_id": "WOS:000241411800012"}