{"auto_keywords": [{"score": 0.027894374943608247, "phrase": "best_auction"}, {"score": 0.02717735173206072, "phrase": "best_bid_amount"}, {"score": 0.00481495049065317, "phrase": "online_auctions"}, {"score": 0.004495996972278015, "phrase": "old_and_new_products"}, {"score": 0.004361077072629878, "phrase": "people's_daily_shopping_experience"}, {"score": 0.004198082549566806, "phrase": "well-documented_early_or_last-minute_bidding_strategies"}, {"score": 0.004041155193307942, "phrase": "auction_competition"}, {"score": 0.003190584226787897, "phrase": "dynamic_features"}, {"score": 0.0031542917620807093, "phrase": "auction_process"}, {"score": 0.003024705160129876, "phrase": "auction's_price"}, {"score": 0.0029902938871031637, "phrase": "model_alternatives"}, {"score": 0.0029450186031370245, "phrase": "generalized_additive_model"}, {"score": 0.0028565082986974602, "phrase": "neural_networks"}, {"score": 0.0027495914857929584, "phrase": "bidder's_surplus"}, {"score": 0.0026976391682197133, "phrase": "bidding_framework"}, {"score": 0.0024428607154967806, "phrase": "highest_predicted_surplus"}, {"score": 0.0023335099338323974, "phrase": "expected_surplus"}, {"score": 0.0021702728407945976, "phrase": "early_and_last-minute_bidding"}], "paper_keywords": ["functional data", " dynamics", " model selection", " online auction", " bidding", " forecasting", " competition", " eBay", " electronic commerce", " surplus"], "paper_abstract": "The flexibility of time and location as well as the availability of an abundance of both old and new products makes online auctions an important part of people's daily shopping experience. Whereas many bidders rely on variants of the well-documented early or last-minute bidding strategies, neither strategy takes into account the aspect of auction competition: at any point in time, there are hundreds, even thousands, of the same or similar items up for sale, competing for the same bidder. In this paper, we propose a novel automated and data-driven bidding strategy. Our strategy consists of two main components. First, we develop a dynamic, forward-looking model for price in competing auctions. By incorporating dynamic features of the auction process and its competitive environment, our model is capable of accurately predicting an auction's price and outperforming model alternatives such as the generalized additive model, classification and regression trees, or Neural Networks. Then, using the idea of maximizing a bidder's surplus, we build a bidding framework around this model that selects the best auction to bid on and determines the best bid amount. The best auction is given by the one that yields the highest predicted surplus; the best bid amount is given by its predicted auction price. Our approach maximizes expected surplus and balances the probability of winning an auction with its average surplus. In simulations, we compare our automated strategy with early and last-minute bidding and find that our approach extracts 97% and 15% more expected surplus, respectively.", "paper_title": "An Automated and Data-Driven Bidding Strategy for Online Auctions", "paper_id": "WOS:000290248600006"}