{"auto_keywords": [{"score": 0.03557137056973309, "phrase": "goal-oriented_analysis"}, {"score": 0.00481495049065317, "phrase": "software_requirements"}, {"score": 0.004743164872278112, "phrase": "software_requirements_analysis"}, {"score": 0.003940706575253453, "phrase": "requirements_analysis"}, {"score": 0.003407549468745519, "phrase": "extended_version"}, {"score": 0.0031606404966938568, "phrase": "and-or_acyclic"}, {"score": 0.002873331232538783, "phrase": "attribute_values"}, {"score": 0.0027464781499539296, "phrase": "goal_graph"}, {"score": 0.002447101794397243, "phrase": "development_project"}, {"score": 0.0021802872319258977, "phrase": "topsis_method"}], "paper_keywords": ["goal-oriented analysis", " requirements analysis", " attribute grammar", " decision making", " TOPSIS method", " attributed graph"], "paper_abstract": "During software requirements analysis, developers and stakeholders have many alternatives of requirements to be achieved and should make decisions to select an alternative out of them. There are two significant points to be considered for supporting these decision making processes in requirements analysis; 1) dependencies among alternatives and 2) evaluation based on multi-criteria and their trade-off. This paper proposes the technique to address the above two issues by using an extended version of goal-oriented analysis. In goal-oriented analysis, elicited goals and their dependencies are represented with an AND-OR acyclic directed graph. We use this technique to model the dependencies of the alternatives. Furthermore we associate attribute values and their propagation rules with nodes and edges in a goal graph in order to evaluate the alternatives with them. The attributes and their calculation rules greatly depend on the characteristics of a development project. Thus, in our approach, we select and use the attributes and their rules that can be appropriate for the project. TOPSIS method is adopted to show alternatives and their resulting attribute values.", "paper_title": "Attributed goal-oriented analysis method for selecting alternatives of software requirements", "paper_id": "WOS:000255648700006"}