{"auto_keywords": [{"score": 0.010848325961634198, "phrase": "erp"}, {"score": 0.00481495049065317, "phrase": "popular_concepts"}, {"score": 0.004691273968935458, "phrase": "information_technology_innovations"}, {"score": 0.004600596158672458, "phrase": "information_systems"}, {"score": 0.0045411156682300695, "phrase": "innovation_concepts"}, {"score": 0.004467840466181518, "phrase": "information_technology"}, {"score": 0.003960972732123083, "phrase": "organizational_boundaries"}, {"score": 0.003675198655423198, "phrase": "underlying_innovation"}, {"score": 0.003226275635740122, "phrase": "highlighted_business_problems"}, {"score": 0.0031127040190005216, "phrase": "erp's_popularity"}, {"score": 0.0030326180561817497, "phrase": "related_innovation_concepts"}, {"score": 0.002777191653403706, "phrase": "broader_climate"}, {"score": 0.0027145478956494356, "phrase": "right_type"}, {"score": 0.002568217828414509, "phrase": "dominant_paradigm"}, {"score": 0.0024696889464469805, "phrase": "innovation_concept"}, {"score": 0.00242184774931214, "phrase": "material_innovation"}, {"score": 0.002390468357001542, "phrase": "community-level_analysis"}, {"score": 0.002336527289457915, "phrase": "traditional_organizational_analysis"}, {"score": 0.0022615684627308283, "phrase": "innovation_concept's_fit"}, {"score": 0.002239552244442444, "phrase": "broader_environment"}], "paper_keywords": ["Information technology innovation", " innovation concept", " discourse", " community", " popularity", " enterprise resource planning"], "paper_abstract": "Journal the Association for Information Systems The abundance of innovation concepts in the world of information technology and their differentiated influence on the design, production, and use of IT in organizations make it important that we understand what shapes these concepts themselves. Taking the perspective that an IT innovation concept emerges and evolves beyond organizational boundaries in a community, I argue that the prevalence or popularity of the concept in IT discourse positively influences the adoption of the underlying innovation. Then with the aim to explore what makes an IT innovation concept popular, my empirical analysis of the once highly popular concept ERP (enterprise resource planning) suggests that (1) the popularity of ERP was influenced positively by the prevalence of highlighted business problems that ERP was claimed to solve; (2) ERP's popularity was influenced negatively by the prevalence of related innovation concepts; and (3) these influences largely disappeared after ERP passed its peak popularity. These results imply that the popularity of an IT innovation concept responds to the broader climate of business and relies on the right type of attention drawn and released by other concepts in a network of concepts. Going beyond the dominant paradigm, this paper helps broaden IT innovation research along two new dimensions: toward the innovation concept, as a complement to material innovation, and toward community-level analysis, as an extension of the traditional organizational analysis. The paper also suggests that practitioners evaluate an innovation concept's fit with the broader environment and relationship with other popular concepts, as a way to make sense of the innovation and anticipate its impact on IT practice. Information", "paper_title": "Popular Concepts beyond Organizations: Exploring New Dimensions of Information Technology Innovations", "paper_id": "WOS:000264274900001"}