{"auto_keywords": [{"score": 0.03493300503751909, "phrase": "dees"}, {"score": 0.022930786266886424, "phrase": "stochastic_languages"}, {"score": 0.015719713620110067, "phrase": "pseudo-stochastic_rational_languages"}, {"score": 0.007714237468530844, "phrase": "probabilistic_models"}, {"score": 0.004691684576246597, "phrase": "probabilistic_grammatical_inference"}, {"score": 0.004639822587124109, "phrase": "usual_goal"}, {"score": 0.004554650954322244, "phrase": "good_approximation"}, {"score": 0.00450429688285697, "phrase": "unknown_distribution_p"}, {"score": 0.004213601332868765, "phrase": "probabilistic_automata"}, {"score": 0.003985680946956402, "phrase": "multiplicity_automata"}, {"score": 0.0032141856243404618, "phrase": "previous_paper"}, {"score": 0.0026996706283276407, "phrase": "broader_class"}, {"score": 0.00267969955652659, "phrase": "rational_series"}, {"score": 0.002497172413754263, "phrase": "theoretical_study"}, {"score": 0.0023270490574896804, "phrase": "polynomial_time"}, {"score": 0.0022173607419126817, "phrase": "classical_inference_algorithms"}, {"score": 0.0021846715415229255, "phrase": "mdi"}], "paper_keywords": ["pseudo-stochastic rational languages", " multiplicity automata", " probabilistic grammatical inference"], "paper_abstract": "In probabilistic grammatical inference, a usual goal is to infer a good approximation of an unknown distribution P called a stochastic language. The estimate of P stands in some class of probabilistic models such as probabilistic automata (PA). In this paper, we focus on probabilistic models based on multiplicity automata (MA). The stochastic languages generated by MA are called rational stochastic languages; they strictly include stochastic languages generated by PA and admit a very concise canonical representation. Despite the fact that this class is not recursively enumerable, it is efficiently identifiable in the limit by using the algorithm DEES, introduced by the authors in a previous paper. However, the identification is not proper and before the convergence of the algorithm, DEES can produce MA that do not define stochastic languages. Nevertheless, it is possible to use these MA to define stochastic languages. We show that they belong to a broader class of rational series, that we call pseudo-stochastic rational languages. The aim of this paper is twofold. First we provide a theoretical study of pseudo-stochastic rational languages, the languages output by DEES, showing for example that this class is decidable within polynomial time. Second, we have carried out experiments to compare DEES to classical inference algorithms (ALERGIA and MDI). They show that DEES outperforms them in most cases.", "paper_title": "Using pseudo-stochastic rational languages in probabilistic grammatical inference", "paper_id": "WOS:000242124200010"}