{"auto_keywords": [{"score": 0.004730458558634266, "phrase": "binocular_stereo_vision"}, {"score": 0.004565876339189493, "phrase": "potential_accidents"}, {"score": 0.0035210572541244664, "phrase": "facial_fatigue_feature_points"}, {"score": 0.003260690513595527, "phrase": "binocular_facial_images"}, {"score": 0.0031845067058084583, "phrase": "facial_fatigue_features"}, {"score": 0.0031100973266506163, "phrase": "eye_blink"}, {"score": 0.0029489527539649737, "phrase": "facial_expressions"}, {"score": 0.0026827569390113822, "phrase": "n-times_sampling_data"}, {"score": 0.002573965014439041, "phrase": "facial_fatigue_feature"}, {"score": 0.0023976048394496446, "phrase": "linear_discriminant_analysis"}, {"score": 0.002155412043665635, "phrase": "facial_feature_points"}, {"score": 0.0021049977753042253, "phrase": "fatigue's_fusion_detection"}], "paper_keywords": ["Binocular vision", " 3D point location", " fatigue detection", " facial fatigue feature", " gaussian curvature", " fusion recognition"], "paper_abstract": "Fatigue may lead to potential accidents, but its diagnosis is difficult so it is easy to be delayed or missed. In this paper, a novel 3D facial-image-based fatigue detection method is presented. There are three steps involved: First, 3D surface curvature-based methods are combined with some 2D image-based methods to locate the position of facial fatigue feature points on the facial 3D image-based model, which is reconstructed based on a pair of binocular facial images. Secondly, facial fatigue features, such as eye blink, gaze direction, mouth morphology, and facial expressions are extracted from the facial 3D image-based model by the corresponding extraction methods. Finally, together with N-times sampling data, the attribute value of each facial fatigue feature is calculated, and then integrated together to recognize fatigue by linear discriminant analysis (LDA) algorithm. The following experimental results show that compared with only 2D image-based method, the accurate location of facial feature points, attribute value's calculation, and fatigue's fusion detection are obviously improved using the method presented in this paper.", "paper_title": "Fatigue detection with 3D facial features based on binocular stereo vision", "paper_id": "WOS:000343007400006"}