{"auto_keywords": [{"score": 0.04586846484671967, "phrase": "value_function"}, {"score": 0.004816293322450458, "phrase": "markov"}, {"score": 0.004486640769041646, "phrase": "good_approximation"}, {"score": 0.004064117897000019, "phrase": "specially_selected_set"}, {"score": 0.003681238363808568, "phrase": "unnecessary_backups"}, {"score": 0.003503497128638099, "phrase": "belief_simplex"}, {"score": 0.003310813458610484, "phrase": "point-based_value_iteration_algorithms"}, {"score": 0.00310664242361199, "phrase": "reachability_analysis"}, {"score": 0.0030414140732789186, "phrase": "pomdp_belief_space"}, {"score": 0.002640114583897493, "phrase": "third_approach"}, {"score": 0.002357457094026928, "phrase": "greater_influence"}, {"score": 0.0021654633404434623, "phrase": "empirical_evaluation"}, {"score": 0.0021049977753042253, "phrase": "point-based_value_iteration"}], "paper_keywords": [""], "paper_abstract": "Current point-based planning algorithms for solving partially observable Markov decision processes (POMDPs) have demonstrated that a good approximation of the value function can be derived by interpolation from the values of a specially selected set of points. The performance of these algorithms can be improved by eliminating unnecessary backups or concentrating on more important points in the belief simplex. We study three methods designed to improve point-based value iteration algorithms. The first two methods are based on reachability analysis on the POMDP belief space. This approach relies on prioritizing the beliefs based on bow they are reached from the given initial belief state. The third approach is motivated by the observation that beliefs which are the most overestimated or underestimated have greater influence on the precision of value function than other beliefs. We present an empirical evaluation illustrating how the performance of point-based value iteration (Pineau et al., 2003) varies with these approaches.", "paper_title": "Belief selection in point-based planning algorithms for POMDPs", "paper_id": "WOS:000239589600033"}