{"auto_keywords": [{"score": 0.04968769837358736, "phrase": "code_quality"}, {"score": 0.04942875198506348, "phrase": "platform_software"}, {"score": 0.015719716506582538, "phrase": "logging_characteristics"}, {"score": 0.014298662949228382, "phrase": "hadoop"}, {"score": 0.014221180762983118, "phrase": "jboss"}, {"score": 0.009591194109781832, "phrase": "post-release_defects"}, {"score": 0.007048379430325586, "phrase": "large_amounts"}, {"score": 0.004685012337701536, "phrase": "important_role"}, {"score": 0.004596138053721412, "phrase": "large_scale_applications"}, {"score": 0.004303975853361081, "phrase": "popular_open_source_platform_software"}, {"score": 0.0035049738376240567, "phrase": "case_study"}, {"score": 0.003382354267177914, "phrase": "logging_statements"}, {"score": 0.003363872988155591, "phrase": "higher_post-release_defect_densities"}, {"score": 0.0032196005492571796, "phrase": "prior_studies"}, {"score": 0.0031671030360367843, "phrase": "log-related_product_metrics"}, {"score": 0.0031069334778456633, "phrase": "log_lines"}, {"score": 0.0030562674358159945, "phrase": "log-related_process_metrics"}, {"score": 0.0030064251340251196, "phrase": "changed_log_lines"}, {"score": 0.0028695630268370897, "phrase": "traditional_process_metrics"}, {"score": 0.0028150302583265655, "phrase": "pre-release_defects"}, {"score": 0.0027239390917424898, "phrase": "strongest_correlation"}, {"score": 0.002664850766529523, "phrase": "log-related_metrics"}, {"score": 0.0026430237246954373, "phrase": "traditional_product"}, {"score": 0.0026285715138510773, "phrase": "process_metrics"}, {"score": 0.0025157556596249117, "phrase": "strong_indicators"}, {"score": 0.0025019976123483085, "phrase": "defect-prone_source_code_files"}, {"score": 0.0024077700683153886, "phrase": "better_code_quality"}, {"score": 0.0022359278646792153, "phrase": "code_quality_improvement_efforts"}, {"score": 0.002157609037430741, "phrase": "source_code_files"}, {"score": 0.0021049977753042253, "phrase": "log_churn"}], "paper_keywords": ["Mining software repositories", " Software logs", " Software quality"], "paper_abstract": "Platform software plays an important role in speeding up the development of large scale applications. Such platforms provide functionalities and abstraction on which applications can be rapidly developed and easily deployed. Hadoop and JBoss are examples of popular open source platform software. Such platform software generate logs to assist operators in monitoring the applications that run on them. These logs capture the doubts, concerns, and needs of developers and operators of platform software. We believe that such logs can be used to better understand code quality. However, logging characteristics and their relation to quality has never been explored. In this paper, we sought to empirically study this relation through a case study on four releases of Hadoop and JBoss. Our findings show that files with logging statements have higher post-release defect densities than those without logging statements in 7 out of 8 studied releases. Inspired by prior studies on code quality, we defined log-related product metrics, such as the number of log lines in a file, and log-related process metrics such as the number of changed log lines. We find that the correlations between our log-related metrics and post-release defects are as strong as their correlations with traditional process metrics, such as the number of pre-release defects, which is known to be one the metrics with the strongest correlation with post-release defects. We also find that log-related metrics can complement traditional product and process metrics resulting in up to 40 % improvement in explanatory power of defect proneness. Our results show that logging characteristics provide strong indicators of defect-prone source code files. However, we note that removing logs is not the answer to better code quality. Instead, our results show that it might be the case that developers often relay their concerns about a piece of code through logs. Hence, code quality improvement efforts (e.g., testing and inspection) should focus more on the source code files with large amounts of logs or with large amounts of log churn.", "paper_title": "Studying the relationship between logging characteristics and the code quality of platform software", "paper_id": "WOS:000348381800001"}