{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wormhole_attacks"}, {"score": 0.030436745232147993, "phrase": "serwa_protocol"}, {"score": 0.023074051246374752, "phrase": "sensor_networks"}, {"score": 0.022846025909191908, "phrase": "wormhole_attack"}, {"score": 0.01595652518323127, "phrase": "sensor_network"}, {"score": 0.009033846539727018, "phrase": "sensor_nodes"}, {"score": 0.008306223235312002, "phrase": "target_area"}, {"score": 0.007115981960780932, "phrase": "special_hardware"}, {"score": 0.007020861127196477, "phrase": "directional_antenna"}, {"score": 0.006950350009880133, "phrase": "precise_synchronized_clock"}, {"score": 0.006743008515367595, "phrase": "neighbor_discovery_process"}, {"score": 0.004336939968686303, "phrase": "remote_location"}, {"score": 0.004013098289856805, "phrase": "routing_protocols"}, {"score": 0.00384083110935486, "phrase": "route_request"}, {"score": 0.0033669963955215427, "phrase": "selectively_forward_data_messages"}, {"score": 0.0029614320534324104, "phrase": "secure_routing_protocol"}, {"score": 0.00266693888510356, "phrase": "real_secure_route"}, {"score": 0.0026222551419772867, "phrase": "simulation_results"}, {"score": 0.0024674880645446312, "phrase": "average_energy_usage"}, {"score": 0.0024016604071771556, "phrase": "neighbor_discovery"}, {"score": 0.002385479082527538, "phrase": "route_discovery"}, {"score": 0.0022984065518052476, "phrase": "available_energy"}, {"score": 0.002229529362571334, "phrase": "cost_analysis"}, {"score": 0.0021847592782091923, "phrase": "small_memory_usage"}], "paper_keywords": ["Sensor networking", " Wormhole attack", " Security", " Routing"], "paper_abstract": "A wormhole attack is particularly harmful against routing in sensor networks where an attacker receives packets at one location in the network, tunnels and then replays them at another remote location in the network. A wormhole attack can be easily launched by an attacker without compromising any sensor nodes. Since most of the routing protocols do not have mechanisms to defend the network against wormhole attacks, the route request can be tunneled to the target area by the attacker through wormholes. Thus, the sensor nodes in the target area build the route through the attacker. Later, the attacker can tamper the data, messages, or selectively forward data messages to disrupt the functions of the sensor network. Researchers have used some special hardware such as the directional antenna and the precise synchronized clock to defend the sensor network against wormhole attacks during the neighbor discovery process. In this paper, we propose a Secure Routing protocol against Wormhole attacks in sensor networks (SeRWA). SeRWA protocol avoids using any special hardware such as the directional antenna and the precise synchronized clock to detect a wormhole. Moreover, it provides a real secure route against the wormhole attack. Simulation results show that SeRWA protocol only has very small false positives for wormhole detection during the neighbor discovery process (less than 10%). The average energy usage at each node for SeRWA protocol during the neighbor discovery and route discovery is below 25 mJ, which is much lower than the available energy (15 kJ) at each node. The cost analysis shows that SeRWA protocol only needs small memory Usage at each node (below 14 kB if each node has 20 neighbors), which is suitable for the sensor network. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "SeRWA: A secure routing protocol against wormhole attacks in sensor networks", "paper_id": "WOS:000265858400002"}