{"auto_keywords": [{"score": 0.049781331549484484, "phrase": "sequential_patterns"}, {"score": 0.044978063067936135, "phrase": "frequency-based_approaches"}, {"score": 0.00481495049065317, "phrase": "unsupervised_learning"}, {"score": 0.004755279364266046, "phrase": "unsupervised_sequence_learning"}, {"score": 0.004594951819987416, "phrase": "unlabeled_sequential_data"}, {"score": 0.004018212085786494, "phrase": "method-pecific_limitations"}, {"score": 0.0037050791019670325, "phrase": "in-_depth_empirical_comparison"}, {"score": 0.0036591119109692545, "phrase": "popular_sequence_learning_methods"}, {"score": 0.003072174266479278, "phrase": "multiple_instances"}, {"score": 0.0030435255729392204, "phrase": "slight_variations"}, {"score": 0.0029042284259394044, "phrase": "different_approaches"}, {"score": 0.0028061343826918357, "phrase": "statistical_approaches"}, {"score": 0.0027712889576554556, "phrase": "high_levels"}, {"score": 0.0026944563649138713, "phrase": "low_levels"}, {"score": 0.0025872113569311555, "phrase": "common_deficiencies"}, {"score": 0.0025154693498317757, "phrase": "candidate_patterns"}, {"score": 0.0024842242921857705, "phrase": "relative_ranking"}, {"score": 0.002468747242613056, "phrase": "different-length_patterns"}, {"score": 0.0023556945924067475, "phrase": "sequence_similarity"}, {"score": 0.0021922980151500037, "phrase": "significant_improvements"}, {"score": 0.0021049977753042253, "phrase": "noise_settings"}], "paper_keywords": ["sequence learning", " sequential patterns", " sequence mining"], "paper_abstract": "Unsupervised sequence learning is important to many applications. A learner is presented with unlabeled sequential data, and must discover sequential patterns that characterize the data. Popular approaches to such learning include (and often combine) frequency-based approaches and statistical analysis. However, the quality of results is often far from satisfactory. Though most previous investigations seek to address method-pecific limitations, we instead focus on general (method-neutral) limitations in current approaches. This paper takes two key steps towards addressing such general quality-reducing flaws. First, we carry out an in- depth empirical comparison and analysis of popular sequence learning methods in terms of the quality of information produced, for several synthetic and real-world datasets, under controlled settings of noise. We find that both frequency-based and statistics-based approaches (i) suffer from common statistical biases based on the length of the sequences considered; (ii) are unable to correctly generalize the patterns discovered, thus flooding the results with multiple instances (with slight variations) of the same pattern. We additionally show empirically that the relative quality of different approaches changes based on the noise present in the data: Statistical approaches do better at high levels of noise, while frequency-based approaches do better at low levels of noise. As our second contribution, we develop methods for countering these common deficiencies. We show how to normalize rankings of candidate patterns such that the relative ranking of different-length patterns can be compared. We additionally show the use of clustering, based on sequence similarity, to group together instances of the same general pattern, and choose the most general pattern that covers all of these. The results show significant improvements in the quality of results in all methods, and across all noise settings.", "paper_title": "Removing biases in unsupervised learning of sequential patterns", "paper_id": "WOS:000250774800003"}