{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "watson-crick-like_complementarity"}, {"score": 0.031904874837790156, "phrase": "closure_properties"}, {"score": 0.03125187161280855, "phrase": "chomsky_hierarchy"}, {"score": 0.026612073768336634, "phrase": "iterated_superposition"}, {"score": 0.004713702303619539, "phrase": "new_formal_operation"}, {"score": 0.00410532426500952, "phrase": "classical_bio-operations"}, {"score": 0.003138242842201786, "phrase": "abstract_operation"}, {"score": 0.003121586251550337, "phrase": "formal_languages"}, {"score": 0.003055836581333328, "phrase": "formal_language_theory"}, {"score": 0.002912904241423194, "phrase": "useful_result"}, {"score": 0.0028820579879223233, "phrase": "unrestricted_iteration"}, {"score": 0.0028591372344443154, "phrase": "superposition_operation"}, {"score": 0.0027988999819725303, "phrase": "subsequent_iteration"}, {"score": 0.0027399283407250497, "phrase": "preceding_iteration_step"}, {"score": 0.002703701984504304, "phrase": "restricted_iteration"}, {"score": 0.002611733442571296, "phrase": "initial_language"}, {"score": 0.002424108425067749, "phrase": "afl_theory"}, {"score": 0.002341628146530334, "phrase": "\"adult\"_languages"}, {"score": 0.002184973043625197, "phrase": "recursive_languages"}, {"score": 0.002127545010174509, "phrase": "classical_dna_algorithms"}, {"score": 0.002105000910244816, "phrase": "adleman"}], "paper_keywords": [""], "paper_abstract": "In this paper we propose a new formal operation on words and languages, called superposition. By this operation, based on a Watson-Crick-like complementarity, we can generate a set of words, starting from a pair of words, in which the contribution of a word to the result need not be one subword only, as happens in classical bio-operations of DNA computing. Specifically, starting from two single stranded molecules x and y such that a suffix of x is complementary to a prefix of y, a prefix of x is complementary to a suffix of y, or x is complementary to a subword of y, a new word z, which is a prolongation of x to the right, to the left, or to both, respectively, is obtained by annealing. If y is complementary to a subword of x, then the result is x. This operation is considered here as an abstract operation on formal languages. We relate it to other operations in formal language theory and we settle the closure properties under this operation of classes in the Chomsky hierarchy. We obtain a useful result by showing that unrestricted iteration of the superposition operation, where the \"parents\" in a subsequent iteration can be any words produced during any preceding iteration step, is equivalent to restricted iteration, where at each step one parent must be a word from the initial language. This result is used for establishing the closure properties of classes in the Chomsky hierarchy under iterated superposition. Actually, since the results are formulated in terms of AFL theory, they are applicable to more classes of languages. Then we discuss \"adult\" languages, languages consisting of words that cannot be extended by further superposition, and show that this notion might bring us to the border of recursive languages. Finally, we consider some operations involved in classical DNA algorithms, such as Adleman's, which might be expressed through iterated superposition.", "paper_title": "Superposition based on Watson-Crick-like complementarity", "paper_id": "WOS:000238159500002"}