{"auto_keywords": [{"score": 0.049509300669177574, "phrase": "ccs's_parallel_operator"}, {"score": 0.04364011428330573, "phrase": "dynamic_logics"}, {"score": 0.0277504128817395, "phrase": "finite_model_property"}, {"score": 0.00481495049065317, "phrase": "concurrent_programs"}, {"score": 0.003857871979942733, "phrase": "concurrent_systems"}, {"score": 0.0037664981403399064, "phrase": "similar_way"}, {"score": 0.003611751858608048, "phrase": "sequential_case"}, {"score": 0.0034426417353349567, "phrase": "ccs's_operators"}, {"score": 0.0033011569787033297, "phrase": "basic_modal_logic"}, {"score": 0.0028586409810976367, "phrase": "simple_kripke_semantics"}, {"score": 0.0027575842698911173, "phrase": "complete_axiomatizations"}, {"score": 0.0025051811853674215, "phrase": "parallel_operators"}, {"score": 0.002387758958649797, "phrase": "peleg's_concurrent_pdl"}, {"score": 0.0022895278869126848, "phrase": "parallel_programs"}], "paper_keywords": ["Dynamic logic", " concurrency", " Kripke semantics", " axiomatization", " completeness"], "paper_abstract": "This work presents three increasingly expressive Dynamic Logics in which the programs are described in a language based on CCS. Our goal is to build dynamic logics that are suitable for the description and verification of properties of communicating concurrent systems, in a similar way as PDL is used for the sequential case. In order to accomplish that, CCS's operators and constructions are added to a basic modal logic. Doing this, the semantics of CCS's parallel operator allows us to build dynamic logics that support communicating and concurrent programs. We build a simple Kripke semantics for these logics, provide complete axiomatizations for them and show that they have the finite model property. This contrasts with other dynamic logics with parallel operators presented in the literature, such as Peleg's Concurrent PDL with Channels, where either the parallel programs cannot communicate, or at least one of the properties mentioned above (simple Kripke semantics, complete axiomatization and finite model property) is missing.", "paper_title": "Propositional dynamic logics for communicating concurrent programs with CCS's parallel operator", "paper_id": "WOS:000339921000009"}