{"auto_keywords": [{"score": 0.04367732323962225, "phrase": "fuzzy_distance"}, {"score": 0.004622450915803531, "phrase": "fuzzy_distances"}, {"score": 0.003866443402315402, "phrase": "numerous_applications"}, {"score": 0.0033004240095380623, "phrase": "fuzzy_object"}, {"score": 0.003088384809415812, "phrase": "distance_calculations"}, {"score": 0.002949598537993663, "phrase": "edge_weight"}, {"score": 0.0028459677232555176, "phrase": "fuzzy_sets"}, {"score": 0.002622528664187849, "phrase": "hierarchical_clustering"}, {"score": 0.0025046245057922557, "phrase": "normalised_hubert's_statistic"}, {"score": 0.002453934333239467, "phrase": "validity_index"}, {"score": 0.0021817065300196634, "phrase": "microscopy_image"}, {"score": 0.0021595094738887767, "phrase": "stem_cells"}, {"score": 0.0021049977753042253, "phrase": "promising_initial_results"}], "paper_keywords": [""], "paper_abstract": "We present a method for calculating fuzzy distances between pairs of points in an image using the A* algorithm and, furthermore, apply this method for fuzzy distance based hierarchical clustering. The method is general and can be of use in numerous applications. In our case we intend to use the clustering in an algorithm for delineation of objects corresponding to parts of proteins in 3D images. The image is defined as a fuzzy object and represented as a graph, enabling a path finding approach for distance calculations. The fuzzy distance between two adjacent points is used as edge weight and a heuristic is defined for fuzzy sets. A* is applied to the calculation of fuzzy distance between pair of points and hierarchical clustering is used to group the points. The normalised Hubert's statistic is used as validity index to determine the number of clusters. The method is tested on three 2D images; two synthetic images and one fuzzy distance transformed microscopy image of stem cells. All experiments show promising initial results.", "paper_title": "Fuzzy distance based hierarchical clustering calculated using the A* algorithm", "paper_id": "WOS:000239454300009"}