{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "large_online_data_tables"}, {"score": 0.04953663923501098, "phrase": "generalized_query_previews"}, {"score": 0.03209246959502601, "phrase": "data_distribution_information"}, {"score": 0.004223415145617665, "phrase": "large_online_relational_tables"}, {"score": 0.0038114397487574838, "phrase": "fillin_interfaces"}, {"score": 0.0032860401904845522, "phrase": "posing_queries"}, {"score": 0.0032302647179383915, "phrase": "zero-_or_mega-hit_results"}, {"score": 0.0031215289677725693, "phrase": "efficient_browsing"}, {"score": 0.0029148831519944358, "phrase": "continuous_feedback"}, {"score": 0.0026302120935562568, "phrase": "new_user_interface_architecture"}, {"score": 0.0024005409468262203, "phrase": "flexible_user_interfaces"}, {"score": 0.0022672718785099666, "phrase": "user_studies"}, {"score": 0.0021291870676682406, "phrase": "user_performance"}], "paper_keywords": ["information visualization", " Internet", " world-wide web", " online querying"], "paper_abstract": "Companies, government agencies, and other organizations are making their data available to the world over the Internet. They often use large online relational tables for this purpose. Users query such tables with front-ends that typically use menus or form fillin interfaces, but these interfaces rarely give users information about the contents and distribution of the data. Such a situation leads users to waste time and network/server resources posing queries that have zero- or mega-hit results. Generalized query previews enable efficient browsing of large online data tables by supplying data distribution information to users. The data distribution information provides continuous feedback about the size of the result set as the query is being formed. Our paper presents a new user interface architecture and discusses three controlled experiments (with 12, 16, and 48 participants). Our prototype systems provide flexible user interfaces for research and testing of the ideas. The user studies show that for exploratory querying tasks, generalized query previews can speed user performance for certain user domains and can reduce network/server load. (C) 2006 Elsevier B.V.. All rights reserved.", "paper_title": "Browsing large online data tables using generalized query previews", "paper_id": "WOS:000244019200003"}