{"auto_keywords": [{"score": 0.04126922283280391, "phrase": "existing_fonts"}, {"score": 0.00481495049065317, "phrase": "substantial_expertise"}, {"score": 0.004567129988306349, "phrase": "proficient_typographer"}, {"score": 0.0038600230206554792, "phrase": "learning_curve"}, {"score": 0.0038230844545071303, "phrase": "professional_typography_packages"}, {"score": 0.00334144503360907, "phrase": "everyday_users"}, {"score": 0.0030790429005600898, "phrase": "generative_manifold"}, {"score": 0.003049555059533735, "phrase": "standard_fonts"}, {"score": 0.0029062860108533374, "phrase": "unique_and_novel_typeface"}, {"score": 0.0027965187255008647, "phrase": "non-linear_mapping"}, {"score": 0.00236289633510808, "phrase": "new_applications"}, {"score": 0.0022626835039082746, "phrase": "single_character"}], "paper_keywords": ["digital typography", " shape matching", " modeling"], "paper_abstract": "The design and manipulation of typefaces and fonts is an area requiring substantial expertise; it can take many years of study to become a proficient typographer. At the same time, the use of typefaces is ubiquitous; there are many users who, while not experts, would like to be more involved in tweaking or changing existing fonts without suffering the learning curve of professional typography packages. Given the wealth of fonts that are available today, we would like to exploit the expertise used to produce these fonts, and to enable everyday users to create, explore, and edit fonts. To this end, we build a generative manifold of standard fonts. Every location on the manifold corresponds to a unique and novel typeface, and is obtained by learning a non-linear mapping that intelligently interpolates and extrapolates existing fonts. Using the manifold, we can smoothly interpolate and move between existing fonts. We can also use the manifold as a constraint that makes a variety of new applications possible. For instance, when editing a single character, we can update all the other glyphs in a font simultaneously to keep them compatible with our changes.", "paper_title": "Learning a Manifold of Fonts", "paper_id": "WOS:000340000100058"}