{"auto_keywords": [{"score": 0.04671870192794838, "phrase": "crossing-free_structures"}, {"score": 0.010612387000973441, "phrase": "onion_layers"}, {"score": 0.00462919213721188, "phrase": "crossing-free_structure"}, {"score": 0.004573483858954342, "phrase": "straight-edge_plane_graph"}, {"score": 0.0044237033788643715, "phrase": "spanning_cycles"}, {"score": 0.004240116703465252, "phrase": "large_amount"}, {"score": 0.0038953958723049287, "phrase": "considerable_attention"}, {"score": 0.003611276113861415, "phrase": "algorithmic_problem"}, {"score": 0.0034508157597076664, "phrase": "general_technique"}, {"score": 0.0033579708256295847, "phrase": "input_set"}, {"score": 0.0031223774204093713, "phrase": "running_time"}, {"score": 0.0029032649701963014, "phrase": "polynomial_time"}, {"score": 0.0027910516355928983, "phrase": "worst_case"}, {"score": 0.00266693888510356, "phrase": "polynomial_terms"}, {"score": 0.0026188490199688013, "phrase": "dominating_exponential_term"}, {"score": 0.0024423826953133844, "phrase": "enumeration_algorithm"}, {"score": 0.0021436720821474973, "phrase": "additional_properties"}, {"score": 0.0021049977753042253, "phrase": "considered_class"}], "paper_keywords": ["Triangulations", " Crossing-free structures", " Algorithmic geometry", " Counting algorithms", " Matchings", " Spanning cycles", " Spanning trees"], "paper_abstract": "Let be a set of points in the plane. A crossing-free structure on is a straight-edge plane graph with vertex set . Examples of crossing-free structures include triangulations and spanning cycles, also known as polygonalizations. In recent years, there has been a large amount of research trying to bound the number of such structures; in particular, bounding the number of (crossing-free) triangulations spanned by has received considerable attention. It is currently known that every set of points has at most O and at least triangulations. However, much less is known about the algorithmic problem of counting crossing-free structures of a given set . In this paper, we develop a general technique for computing the number of crossing-free structures of an input set . We apply the technique to obtain algorithms for computing the number of triangulations, matchings, and spanning cycles of . The running time of our algorithms is upper-bounded by , where is the number of onion layers of . In particular, for our algorithms run in polynomial time. Additionally, we show that our algorithm for counting triangulations in the worst case over all takes time O. [In the notations , and , we neglect polynomial terms and we just present the dominating exponential term.] Given that there are several well-studied configurations of points with at least triangulations, and some even with triangulations, our algorithm asymptotically outperforms any enumeration algorithm for such instances. We also show that our techniques are general enough to solve the Restricted-Triangulation-Counting-Problem, which we prove to be -hard in the parameter . This implies that in order to be fixed-parameter tractable, our general algorithm must rely on additional properties that are specific to the considered class of crossing-free structures.", "paper_title": "Counting Triangulations and Other Crossing-Free Structures via Onion Layers", "paper_id": "WOS:000353895400001"}