{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "split-complex_valued_multilayer_perceptron"}, {"score": 0.004313996835376177, "phrase": "split-complex_multilayer_perceptron"}, {"score": 0.00401560412621627, "phrase": "connection_weights"}, {"score": 0.0034459835582278746, "phrase": "entire_split-cmlp"}, {"score": 0.0033806943112103397, "phrase": "statistically_the_sensitivity"}, {"score": 0.0033166379485150507, "phrase": "central_limit_theorem"}, {"score": 0.00283229915062791, "phrase": "theoretical_estimation"}, {"score": 0.0025861368747446324, "phrase": "theoretical_ones"}, {"score": 0.002512926336312949, "phrase": "theoretical_results"}, {"score": 0.002488985155689794, "phrase": "experimental_results"}, {"score": 0.0024185182010749273, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "efficient_algorithm"}], "paper_keywords": ["central limit theorem (CLT)", " multilayer perceptron (MLP)", " sensitivity", " split-complex MLP (split-CMLP)"], "paper_abstract": "In this paper, we analyze the sensitivity of a split-complex multilayer perceptron (split-CMLP) due to the errors of the inputs and the connection weights between neurons. For simplicity, all the inputs and weights studied here are independent and identically distributed (i.i.d.). To develop an algorithm to estimate the sensitivity of the entire split-CMLP, we compute statistically the sensitivity by using the central limit theorem (CLT). The results show that the sensitivity is affected by the number of the layers and the number of the neurons adopted in each layer. We derive a theoretical estimation of the sensitivity. Several numerical results of the sensitivity for the split-CMLP are presented, and they match the theoretical ones. The agreement between the theoretical results and experimental results verifies the feasibility of the proposed algorithm. Thus, we not only analyze the sensitivity of the split-CMLP due to the errors of the i.i.d. inputs and weights, but also develop an efficient algorithm to estimate the sensitivity.", "paper_title": "Sensitivity analysis of the split-complex valued multilayer perceptron due to the errors of the i.i.d. inputs and weights", "paper_id": "WOS:000249279400002"}