{"auto_keywords": [{"score": 0.04896848785083955, "phrase": "stereoselective_hydroxylation"}, {"score": 0.00481495049065317, "phrase": "free_energy_calculations"}, {"score": 0.004143196873246147, "phrase": "regioselective_manner"}, {"score": 0.0034332736827447654, "phrase": "molecular_dynamics-based_free_energy_calculations"}, {"score": 0.0031845067058084583, "phrase": "one-step_perturbation_approach"}, {"score": 0.003110515172439764, "phrase": "optimized_reference_state"}, {"score": 0.002995677265350124, "phrase": "free_energy_differences"}, {"score": 0.002912331664922248, "phrase": "solution_amount"}, {"score": 0.002726740692380339, "phrase": "experimentally_obtained_dissociation_constants"}, {"score": 0.0027139447110929586, "phrase": "k-d"}, {"score": 0.002626034130205569, "phrase": "experimentally_observed_trends"}, {"score": 0.0026014425686078993, "phrase": "product_formation"}, {"score": 0.0025053520095236694, "phrase": "trans_isomers"}, {"score": 0.002447101794397243, "phrase": "free_energy"}, {"score": 0.0023127544795063263, "phrase": "trans_product"}, {"score": 0.0022589720760078274, "phrase": "cis_product"}, {"score": 0.0022168460543913787, "phrase": "highest_affinity"}, {"score": 0.0021249064184347658, "phrase": "thermodynamic_stability"}, {"score": 0.0021049977753042253, "phrase": "transition_state_energies"}], "paper_keywords": [""], "paper_abstract": "Previously, stereoselective hydroxylation of alpha-ionone by Cytochrome P450 BM3 mutants M01 A82W and M11 L437N was observed While both mutants hydroxylate alpha-ionone in a regioselective manner at the C3 position, M01 A82W catalyzes formation of trans-3-OH-alpha-ionone products whereas M11 L437N exhibits R opposite stereoselectivity, producing trans-(3S,6S)-OH-alpha-ionone and cis-(3S,6R)-OH-alpha-ionone. Here, we explore the stereoselective C3 hydroxylation of alpha-ionone by Cytochrome P450 BM3 mutants M01 A82W and M11 L437N using molecular dynamics-based free energy calculations to study the interaction between the enzyme and both the substrates and the products. The one-step perturbation approach is applied using an optimized reference state for substrates and products. While the free energy differences between the substrates free in solution amount to similar to 0 kJ mol(-1), the differences in mutant M01 A82W agree with the experimentally obtained dissociation constants K-d. Moreover, a correlation with experimentally observed trends in product formation is found in both mutants. The trans isomers show the most favorable relative binding free energy in the range of all four possible hydroxylated diastereomers for mutant M01 A82W, while the trans product from (6S)-alpha-ionone and the cis product from (6R)-alpha-ionone show highest affinity for mutant M11 L437N. Marcus theory is subsequently used to relate the thermodynamic stability to transition state energies and rates of formation.", "paper_title": "Free Energy Calculations Give Insight into the Stereoselective Hydroxylation of alpha-Ionones by Engineered Cytochrome P450 BM3 Mutants", "paper_id": "WOS:000308254200024"}