{"auto_keywords": [{"score": 0.04475367260515699, "phrase": "participating_peers"}, {"score": 0.014862137826237274, "phrase": "individual_peers"}, {"score": 0.00481495049065317, "phrase": "content_sharing"}, {"score": 0.004737579882204798, "phrase": "available_resources"}, {"score": 0.004512814529823301, "phrase": "empirical_data"}, {"score": 0.0041784516085055035, "phrase": "modeling_interactions"}, {"score": 0.0036111152143285838, "phrase": "new_solution"}, {"score": 0.0034118234596993836, "phrase": "contributing_peers"}, {"score": 0.003070340620983981, "phrase": "new_content"}, {"score": 0.0029722900280316216, "phrase": "adaptively_set_threshold"}, {"score": 0.002865710140187219, "phrase": "central_authority"}, {"score": 0.002751751956416832, "phrase": "decentralized_coalition"}, {"score": 0.002674681176379472, "phrase": "social_network"}, {"score": 0.0026103363762901423, "phrase": "optimal_upload_policies"}, {"score": 0.00241658945942583, "phrase": "considerable_improvement"}, {"score": 0.002387337550919433, "phrase": "cost-benefit_tradeoff"}, {"score": 0.0023016843709107297, "phrase": "heuristic_upload_policies"}], "paper_keywords": ["content sharing", " optimal upload policies", " resource contributions in P2P networks"], "paper_abstract": "Available resources in Peer-to-Peer (P2P) systems depend strongly on resource contributions made by individual peers. Empirical data shows that in the absence of incentives, a majority of the participating peers do not contribute resources. Modeling interactions between individual peers is often difficult as the number of peers in the system can be very large, and the relationships among them can be very complex. In this paper, we propose a new solution for P2P systems, where peers upload and download content to and from the contributing peers based on agreed-upon/determined sharing rates. We propose a P2P solution that deters free-riders by imposing constraints on participating peers; specifically, a peer is allowed access to new content only as long as its own content contribution exceeds an adaptively set threshold. The constraints are enforced either by a central authority (e.g., a tracker) or by a decentralized coalition of peers in a swarm, social network, etc. We derive optimal upload policies for the peers given their estimated future download requirements and their previous contribution (credit) to the other peers. Our results show considerable improvement in the cost-benefit tradeoff for peers that deploy such an optimal policy as compared to heuristic upload policies. We also propose mechanisms based on which the coalition of peers can provide incentives or penalties to participating peers to adjust their policies such that the availability of content and/or number of peers contributing content is maximized.", "paper_title": "Stochastic optimization for content sharing in P2P systems", "paper_id": "WOS:000251952200013"}