{"auto_keywords": [{"score": 0.03135430359176502, "phrase": "dishonest_behavior"}, {"score": 0.004468415400599571, "phrase": "emerging_paradigm"}, {"score": 0.0040890178236849825, "phrase": "critical_problem"}, {"score": 0.0040133278382101885, "phrase": "current_crowdsourcing_mechanisms"}, {"score": 0.003604421041893448, "phrase": "dishonest_users"}, {"score": 0.0031036643805367487, "phrase": "assigned_task"}, {"score": 0.0028799352389969443, "phrase": "trusted_third_party"}, {"score": 0.0026598200370569433, "phrase": "third_party"}, {"score": 0.002550167490058308, "phrase": "dff"}, {"score": 0.0022686625017583387, "phrase": "transaction-wise_budget-balance"}, {"score": 0.0022161977759646693, "phrase": "performance_evaluation"}, {"score": 0.0021049977753042253, "phrase": "utility_gain"}], "paper_keywords": ["Crowdsourcing", " false-reporting", " free-riding", " game theory", " incentive mechanisms"], "paper_abstract": "Crowdsourcing is an emerging paradigm where users can have their tasks completed by paying fees, or receive rewards for providing service. A critical problem that arises in current crowdsourcing mechanisms is how to ensure that users pay or receive what they deserve. Free-riding and false-reporting may make the system vulnerable to dishonest users. In this paper, we design schemes to tackle these problems, so that each individual in the system is better off being honest and each provider prefers completing the assigned task. We first design a mechanism EFF which eliminates dishonest behavior with the help from a trusted third party for arbitration. We then design another mechanism DFF which, without the help from any third party, discourages dishonest behavior. We also prove that DFF is semi-truthful, which discourages dishonest behavior such as free-riding and false-reporting when the rest of the individuals are honest, while guaranteeing transaction-wise budget-balance and computational efficiency. Performance evaluation shows that within our mechanisms, no user could have a utility gain by unilaterally being dishonest.", "paper_title": "Keep Your Promise: Mechanism Design Against Free-Riding and False-Reporting in Crowdsourcing", "paper_id": "WOS:000373098800011"}