{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cognitive_activities"}, {"score": 0.004776853267973129, "phrase": "student_collaboration"}, {"score": 0.004273951631010383, "phrase": "collaborating_groups"}, {"score": 0.004026598712747509, "phrase": "task_material"}, {"score": 0.0037935066882208235, "phrase": "collaborative_process"}, {"score": 0.003674738405118697, "phrase": "important_role"}, {"score": 0.003503497128638099, "phrase": "adaptive_support"}, {"score": 0.0033803056981691866, "phrase": "students'_activities"}, {"score": 0.003313741359811683, "phrase": "relevant_events"}, {"score": 0.0031592690527974285, "phrase": "available_information"}, {"score": 0.0030000149283621255, "phrase": "present_experimental_study"}, {"score": 0.002737615043512257, "phrase": "students'_cognitive_activities"}, {"score": 0.00252812242767189, "phrase": "problematic_groups"}, {"score": 0.002279508335630797, "phrase": "teachers'_confidence"}, {"score": 0.0021559025985688255, "phrase": "teacher's_presence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cooperative/collaborative learning", " Secondary education", " Teaching/learning strategies"], "paper_abstract": "By collaboratively solving a task, students are challenged to share ideas, express their thoughts, and engage in discussion. Collaborating groups of students may encounter problems concerning cognitive activities (such as a misunderstanding of the task material). If these problems are not addressed and resolved in time, the collaborative process is hindered. The teacher plays an important role in monitoring and solving the occurrence of problems. To provide adaptive support, teachers continuously have to be aware of students' activities in order to identify relevant events, including those that require intervention. Because the amount of available information is high, teachers may be supported by learning analytics. The present experimental study (n = 40) explored the effect of two learning analytics tools (the Concept Trail and Progress Statistics) that give information about students' cognitive activities. The results showed that when teachers had access to learning analytics, they were not better at detecting problematic groups, but they did offer more support in general, and more specifically targeted groups that experienced problems. This could indicate that learning analytics increase teachers' confidence to act, which in turn means students could benefit more from the teacher's presence. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Teacher regulation of cognitive activities during student collaboration: Effects of learning analytics", "paper_id": "WOS:000364882400007"}