{"auto_keywords": [{"score": 0.048953123174008836, "phrase": "dissimilarity_data"}, {"score": 0.00481495049065317, "phrase": "fitting_tree"}, {"score": 0.004766090327062509, "phrase": "hierarchical_clustering"}, {"score": 0.004452731043379068, "phrase": "tree_metric"}, {"score": 0.004333208536635007, "phrase": "additive_error"}, {"score": 0.003993472712847928, "phrase": "m-level_hierarchical_clustering"}, {"score": 0.003545024951402818, "phrase": "correlation_clustering_problem"}, {"score": 0.0033685408148574846, "phrase": "hierarchical_clustering_problem"}, {"score": 0.0033229756875116597, "phrase": "approximation_ratio"}, {"score": 0.0032117325375830407, "phrase": "previous_factor"}, {"score": 0.0031467766123827717, "phrase": "complete_graphs"}, {"score": 0.0030831303297783877, "phrase": "tree_metrics"}, {"score": 0.0029596622424171264, "phrase": "evolution_tree"}, {"score": 0.002618064695883912, "phrase": "previous_results"}, {"score": 0.002547663224855668, "phrase": "closest_tree"}, {"score": 0.00240426758768164, "phrase": "novel_linear_program_formulation"}], "paper_keywords": ["approximation algorithms", " phylogenic reconstructions", " hierarchical clustering"], "paper_abstract": "Given dissimilarity data on pairs of objects in a set, we study the problem of fitting a tree metric to this data so as to minimize additive error (i.e., some measure of the difference between the tree metric and the given data). This problem arises in constructing an M-level hierarchical clustering of objects (or an ultrametric on objects) so as to match the given dissimilarity data-a basic problem in statistics. Viewed in this way, the problem is a generalization of the correlation clustering problem (which corresponds to M - 1). We give a very simple randomized combinatorial algorithm for the M-level hierarchical clustering problem that achieves an approximation ratio of M+2. This is a generalization of a previous factor 3 algorithm for correlation clustering on complete graphs. The problem of fitting tree metrics also arises in phylogeny where the objective is to learn the evolution tree by fitting a tree to dissimilarity data on taxa. The quality of the fit is measured by taking the l(p) norm of the difference between the tree metric constructed and the given data. Previous results obtained a factor 3 approximation for finding the closest tree metric under the l(infinity) norm. No nontrivial approximation for general l(p) norms was known before. We present a novel linear program formulation for this problem and obtain an O((log n log log n)(1/p))-approximation to the closest ultrametric under the l(p) norm using this. Our techniques are based on representing and viewing an ultrametric as a hierarchy of clusterings and may be useful in other contexts.", "paper_title": "FITTING TREE METRICS: HIERARCHICAL CLUSTERING AND PHYLOGENY", "paper_id": "WOS:000296584900004"}