{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mismatch_problem"}, {"score": 0.00865589899657979, "phrase": "xml_keyword_search"}, {"score": 0.004745629779492866, "phrase": "id_references"}, {"score": 0.004268591456106124, "phrase": "empty_result"}, {"score": 0.004128196245045884, "phrase": "mismatch"}, {"score": 0.0037713445867641393, "phrase": "node_type"}, {"score": 0.003721171512886929, "phrase": "target_node_type"}, {"score": 0.0036349635956605675, "phrase": "query_result"}, {"score": 0.0035626938349065324, "phrase": "distinguishability"}, {"score": 0.0034568750690264034, "phrase": "query_keywords"}, {"score": 0.003354223660940168, "phrase": "low-cost_post-processing_algorithm"}, {"score": 0.0032112897905024976, "phrase": "helpful_suggestions"}, {"score": 0.002799080959445996, "phrase": "query_results"}, {"score": 0.0026707727531746447, "phrase": "lowest_common_ancestor-based_matching_semantics"}, {"score": 0.0025827463870477406, "phrase": "steiner"}, {"score": 0.002514387630447547, "phrase": "xml_data"}, {"score": 0.0024643161985886085, "phrase": "tree_structures"}, {"score": 0.002375087848055933, "phrase": "result_retrieval_method"}, {"score": 0.0022284920601703595, "phrase": "whole_query_evaluation_time"}, {"score": 0.0021049977753042253, "phrase": "search_engine"}], "paper_keywords": ["XML", " Keyword search", " MisMatch problem"], "paper_abstract": "When users issue a query to a database, they have expectations about the results. If what they search for is unavailable in the database, the system will return an empty result or, worse, erroneous mismatch results. We call this problem the MisMatch problem. In this paper, we solve the MisMatch problem in the context of XML keyword search. Our solution is based on two novel concepts that we introduce: target node type and Distinguishability. Target Node Type represents the type of node a query result intends to match, and Distinguishability is used to measure the importance of the query keywords. Using these concepts, we develop a low-cost post-processing algorithm on the results of query evaluation to detect the MisMatch problem and generate helpful suggestions to users. Our approach has three noteworthy features: (1) for queries with the MisMatch problem, it generates the explanation, suggested queries and their sample results as the output to users, helping users judge whether the MisMatch problem is solved without reading all query results; (2) it is portable as it can work with any lowest common ancestor-based matching semantics (for XML data without ID references) or minimal Steiner tree-based matching semantics (for XML data with ID references) which return tree structures as results. It is orthogonal to the choice of result retrieval method adopted; (3) it is lightweight in the way that it occupies a very small proportion of the whole query evaluation time. Extensive experiments on three real datasets verify the effectiveness, efficiency and scalability of our approach. A search engine called XClear has been built and is available at <http://xclear.comp.nus.edu.sg.", "paper_title": "A general framework to resolve the MisMatch problem in XML keyword search", "paper_id": "WOS:000358255800002"}