{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "medical_structure"}, {"score": 0.004684157900507474, "phrase": "mathematical_model"}, {"score": 0.004592905436175987, "phrase": "statistical_system_approach"}, {"score": 0.0041625173012740544, "phrase": "clinical_outcome"}, {"score": 0.0041136473765874815, "phrase": "existing_medical_ward"}, {"score": 0.004001828274595483, "phrase": "possible_readjustments"}, {"score": 0.003527998934981411, "phrase": "perceived_social_and_organizational_climate"}, {"score": 0.00290855128461017, "phrase": "patients'_needs"}, {"score": 0.002851790448644913, "phrase": "livable_environment"}, {"score": 0.002807178116892454, "phrase": "medical_staff"}, {"score": 0.0025537472239953807, "phrase": "deepest_importance"}, {"score": 0.0025237171554924128, "phrase": "social_and_health-care_point"}, {"score": 0.002474447780553576, "phrase": "proposed_interdisciplinary_approach"}, {"score": 0.00241658945942583, "phrase": "physical_and_mathematical_models"}, {"score": 0.0023415390666563177, "phrase": "social_sciences"}, {"score": 0.0022509878391826867, "phrase": "scientific_community"}, {"score": 0.0021983430142660373, "phrase": "higher_possibilities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Generalized kinetic theories", " Mathematical models", " Social sciences", " Quality of health care", " Complex systems"], "paper_abstract": "A mathematical model, based on a statistical system approach, has been implemented and tested on the basis of a four-year-long experimental data set, with the aim of analyzing the performance and clinical outcome of an existing medical ward, and predicting the effects that possible readjustments and/or interventions on the structure may produce on it. The dynamics of the system is assumed to be connected to a variable called \"atmosphere\" that refers to the perceived social and organizational climate, as well as the comfort and ease realized in the ward. In this context, the atmosphere is intuitively related to the \"quality\" that is (or is perceived as being) offered by the service, as it affects the ability to satisfy the patients' needs, to provide a livable environment for patients and medical staff, and to guarantee more efficient performances and a more complete professional development. Identifying variables, parameters and events that control the atmosphere is therefore of the deepest importance from a social and health-care point of view. The proposed interdisciplinary approach, referring to paradigms of physical and mathematical models integrated with theories and methods typical of social sciences, has chances of gaining the attention of the scientific community in both fields, and higher possibilities of obtaining appreciation and generalization. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Mathematical modeling of quality in a medical structure: A case study", "paper_id": "WOS:000293829300020"}