{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "possible_binding_sites"}, {"score": 0.004714023408114857, "phrase": "nicardipine"}, {"score": 0.004217708394188058, "phrase": "multidrug_resistance"}, {"score": 0.0037336520904376687, "phrase": "potential_drug_binding_sites"}, {"score": 0.0036359780843400625, "phrase": "molecular_dynamics_simulations"}, {"score": 0.003522124318486352, "phrase": "free_energy_profile"}, {"score": 0.0031676593724896075, "phrase": "key_residues"}, {"score": 0.0030521898646210413, "phrase": "mutational_studies"}, {"score": 0.0028944757265206332, "phrase": "transmembrane_pore"}, {"score": 0.002833689453299307, "phrase": "distinct_but_involved_overlapping_sets"}, {"score": 0.0027015344365793016, "phrase": "binding_location"}, {"score": 0.0024037949232582462, "phrase": "important_implications"}, {"score": 0.0023532890136269986, "phrase": "substrate_uptake"}, {"score": 0.0021049977753042253, "phrase": "experimental_studies"}], "paper_keywords": [""], "paper_abstract": "The multidrug transporter P-glycoprotein (P-gp) is central to the development of multidrug resistance in cancer. While residues essential for transport and binding have been identified, the location, composition, and specificity of potential drug binding sites are uncertain. Here molecular dynamics simulations are used to calculate the free energy profile for the binding of morphine and nicardipine to P-gp. We show that morphine and nicardipine primarily interact with key residues implicated in binding and transport from mutational studies, binding at different but overlapping sites within the transmembrane pore. Their permeation pathways were distinct but involved overlapping sets of residues. The results indicate that the binding location and permeation pathways of morphine and nicardipine are not well separated and cannot be considered as unique. This has important implications for our understanding of substrate uptake and transport by P-gp. Our results are independent of the choice of starting structure and consistent with a range of experimental studies.", "paper_title": "Identification of Possible Binding Sites for Morphine and Nicardipine on the Multidrug Transporter P-Glycoprotein Using Umbrella Sampling Techniques", "paper_id": "WOS:000356903200013"}