{"auto_keywords": [{"score": 0.03819984039067194, "phrase": "push_model"}, {"score": 0.034692465572853035, "phrase": "high_probability"}, {"score": 0.011192417651126278, "phrase": "small_spectral_expansion"}, {"score": 0.010194507706964449, "phrase": "complete_graphs"}, {"score": 0.010027781617757385, "phrase": "random_graph"}, {"score": 0.00481495049065317, "phrase": "network_topology"}, {"score": 0.004748887399153146, "phrase": "popular_and_well-studied_push_model"}, {"score": 0.004263625683531584, "phrase": "succeeding_rounds"}, {"score": 0.004147364535298904, "phrase": "random_neighbour"}, {"score": 0.0038171874077517274, "phrase": "huge_constants"}, {"score": 0.00374399358035391, "phrase": "direct_comparison"}, {"score": 0.00372333905856154, "phrase": "different_network_topologies"}, {"score": 0.0035522970873051304, "phrase": "tight_runtime_estimates"}, {"score": 0.003464938608764737, "phrase": "almost-regular_graph"}, {"score": 0.0032423089921154503, "phrase": "first_result"}, {"score": 0.003206615786563051, "phrase": "general_graph_class"}, {"score": 0.0026198851984058735, "phrase": "almost_regularity"}, {"score": 0.0021049977753042253, "phrase": "upper_bound"}], "paper_keywords": [""], "paper_abstract": "We consider the popular and well-studied push model, which is used to spread information in a given network with n vertices. Initially, some vertex owns a rumour and passes it to one of its neighbours, which is chosen randomly. In each of the succeeding rounds, every vertex that knows the rumour informs a random neighbour. It has been shown on various network topologies that this algorithm succeeds in spreading the rumour within O(log n) rounds. However, many studies are quite coarse and involve huge constants that do not allow for a direct comparison between different network topologies. In this paper, we analyse the push model on several important families of graphs, and obtain tight runtime estimates. We first show that, for any almost-regular graph on n vertices with small spectral expansion, rumour spreading completes after log(2) n + logn + o(log n) rounds with high probability. This is the first result that exhibits a general graph class for which rumour spreading is essentially as fast as on complete graphs. Moreover, for the random graph G(n, p) with p = c log n/n, where c > 1, we determine the runtime of rumour spreading to be log(2) n + gamma(c) log n with high probability, where gamma(c) = c log(c/(c - 1)). In particular, this shows that the assumption of almost regularity in our first result is necessary. Finally, for a hypercube on n = 2(d) vertices, the runtime is with high probability at least (1 + beta) . (log(2) n + log n), where beta > 0. This reveals that the push model on hypercubes is slower than on complete graphs, and thus shows that the assumption of small spectral expansion in our first result is also necessary. In addition, our results combined with the upper bound of O(log n) for the hypercube see [11]) imply that the push model is faster on hypercubes than on a random graph G(n, c log n/n), where c is sufficiently close to 1.", "paper_title": "Randomized Rumour Spreading: The Effect of the Network Topology", "paper_id": "WOS:000348383500005"}