{"auto_keywords": [{"score": 0.04876612507369845, "phrase": "seattle"}, {"score": 0.03819323532870054, "phrase": "immigrant_day_laborers"}, {"score": 0.015173578663297254, "phrase": "washington"}, {"score": 0.014417353990701888, "phrase": "mobile_phones"}, {"score": 0.01430437195008534, "phrase": "hispanic_day_laborers"}, {"score": 0.014192262547263804, "phrase": "casa_latina"}, {"score": 0.010813066608018071, "phrase": "ict"}, {"score": 0.008231477427391793, "phrase": "daily_life"}, {"score": 0.004815120303385348, "phrase": "english"}, {"score": 0.004189863767755212, "phrase": "latino_immigrants"}, {"score": 0.003931697356115479, "phrase": "focus_group"}, {"score": 0.0038390240716280302, "phrase": "participatory_observations"}, {"score": 0.003808619097554076, "phrase": "computer_training_classes"}, {"score": 0.0037040785566765954, "phrase": "information_and_communication_technologies"}, {"score": 0.0033269488835014583, "phrase": "precarious_social_and_economic_standing"}, {"score": 0.0030481444896915504, "phrase": "future_plans"}, {"score": 0.0022434880661725493, "phrase": "new_insight"}, {"score": 0.002130298466581199, "phrase": "personal_and_employment_needs"}], "paper_keywords": [""], "paper_abstract": "Here we present an investigation of the use of computers and mobile phones by Hispanic day laborers at Casa Latina, a community-building nonprofit organization for Latino immigrants in Seattle, Washington. Drawing from 95 structured interviews, 6 in-depth interviews, a focus group, and a series of participatory observations of computer training classes at Casa Latina, we find that information and communication technologies (ICT) help immigrant day laborers remain connected with their families and their employers and facilitate their navigation of, and integration into, the society in which they have precarious social and economic standing. ICT help immigrant day laborers maintain links with their past and their roots, offer tools to navigate their present needs, and help them build future plans and aspirations. Hispanic day laborers experience ICT mostly through mobile phones used to communicate with employers and families; they use computers and the Internet to communicate with family and friends. In addition, the experience of the immigrant day laborers is strongly influenced by their English-language proficiency-which helps them navigate daily life in the United States and communicate with employers-and their use of transportation to move around the city for work and daily life. The results of this study offer new insight into the ways in which day laborers in Seattle use ICT to help them meet personal and employment needs and realize their long-term goals.", "paper_title": "Crossing New Borders: Computers, Mobile Phones, Transportation, and English Language Among Hispanic Day Laborers in Seattle, Washington", "paper_id": "WOS:000335580800009"}