{"auto_keywords": [{"score": 0.04648772583215163, "phrase": "social_sciences"}, {"score": 0.03793723623757479, "phrase": "quebec"}, {"score": 0.03699742488007431, "phrase": "individual_researchers"}, {"score": 0.03569374866930391, "phrase": "local_journals"}, {"score": 0.00481495049065317, "phrase": "social_science"}, {"score": 0.004588531238691602, "phrase": "non-english-speaking_countries"}, {"score": 0.0043404186974790706, "phrase": "standard_bibliographic_databases"}, {"score": 0.004276541976450121, "phrase": "major_drawback"}, {"score": 0.003970930401776528, "phrase": "local_database"}, {"score": 0.003912469968653304, "phrase": "erudit"}, {"score": 0.0036734281414482735, "phrase": "university_professors"}, {"score": 0.0032623526770842364, "phrase": "french"}, {"score": 0.0032141856243404618, "phrase": "english-speaking_universities"}, {"score": 0.0030288982511487835, "phrase": "bibliometric_measures"}, {"score": 0.0029185415814209055, "phrase": "anglophone_universities"}, {"score": 0.002822652835367827, "phrase": "francophone_universities"}, {"score": 0.00241509422805775, "phrase": "erudit_database"}, {"score": 0.0022757667100089243, "phrase": "\"overall\"_production"}, {"score": 0.0022589324778755533, "phrase": "ssh"}, {"score": 0.002152440300818582, "phrase": "disciplinary_and_language_differences"}], "paper_keywords": [""], "paper_abstract": "In non-English-speaking countries the measurement of research output in the social sciences and humanities (SSH) using standard bibliographic databases suffers from a major drawback: the underrepresentation of articles published in local, non-English, journals. Using papers indexed (1) in a local database of periodicals (Erudit) and (2) in the Web of Science, assigned to the population of university professors in the province of Quebec, this paper quantifies, for individual researchers and departments, the importance of papers published in local journals. It also analyzes differences across disciplines and between French-speaking and English-speaking universities. The results show that, while the addition of papers published in local journals to bibliometric measures has little effect when all disciplines are considered and for anglophone universities, it increases the output of researchers from francophone universities in the social sciences and humanities by almost a third. It also shows that there is very little relation, at the level of individual researchers or departments, between the output indexed in the Web of Science and the output retrieved from the Erudit database; a clear demonstration that the Web of Science cannot be used as a proxy for the \"overall\" production of SSH researchers in Quebec. The paper concludes with a discussion on these disciplinary and language differences, as well as on their implications for rankings of universities.", "paper_title": "Improving the Coverage of Social Science and Humanities Researchers' Output: The Case of the Erudit Journal Platform", "paper_id": "WOS:000297303100012"}