{"auto_keywords": [{"score": 0.04955461236891121, "phrase": "thermally_coupled_distillation_sequences"}, {"score": 0.03905693992741741, "phrase": "thermally_coupled_distillation_columns"}, {"score": 0.00481495049065317, "phrase": "robust_simulation"}, {"score": 0.0046073860169839305, "phrase": "novel_strategy"}, {"score": 0.004126623209579942, "phrase": "'thermal_couple"}, {"score": 0.0038838500580958744, "phrase": "material_stream"}, {"score": 0.003841263262252044, "phrase": "heat_flow"}, {"score": 0.003615217162972726, "phrase": "recycle_streams"}, {"score": 0.003536346954940087, "phrase": "conventional_simulations"}, {"score": 0.0034975571855450373, "phrase": "zeotropic_distillation_sequences"}, {"score": 0.002931569771634119, "phrase": "negligible_errors"}, {"score": 0.0028675712105299496, "phrase": "excellent_starting_points"}, {"score": 0.0028360962841331634, "phrase": "rigorous_simulations"}, {"score": 0.00280496585980086, "phrase": "actual_thermally_coupled_systems"}, {"score": 0.0027286224888843956, "phrase": "different_examples"}, {"score": 0.0021049977753042253, "phrase": "different_alternatives"}], "paper_keywords": ["Distillation", " Simulation", " Thermally coupled distillation"], "paper_abstract": "This paper presents a novel strategy for the simulation of thermally coupled distillation sequences using process simulators. First, we show that the two side stream connections involved in a 'thermal couple' can be accurately substituted by a combination of a material stream and heat flow; enabling a sequence of thermally coupled distillation columns to be simulated without recycle streams, similar to conventional simulations of zeotropic distillation sequences. In fact, using this method, a sequence of thermally coupled distillation columns is not more difficult to converge than other distillation systems without recycles. Furthermore, in most cases, this approach introduces negligible errors, and provides excellent starting points for rigorous simulations of actual thermally coupled systems with recycle streams. Different examples, including mixtures of hydrocarbons (C4s-C5s-C6s), aromatics (BTX), alcohols, non-ideal azeotropic systems (acetone, benzene, chloroform) and systems involving 4 or 5 components are presented. In addition, various thermodynamically equivalent configurations, corresponding to different alternatives for implementing this approach, are discussed. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Strategies for the robust simulation of thermally coupled distillation sequences", "paper_id": "WOS:000298548800013"}