{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "discrete_conditional_distributions"}, {"score": 0.004114787982556699, "phrase": "joint_distribution"}, {"score": 0.003950453462399077, "phrase": "conditional_distributions"}, {"score": 0.003859500298805362, "phrase": "five_methods"}, {"score": 0.0031476068430779367, "phrase": "high_dimension"}, {"score": 0.002952146666681891, "phrase": "general_algorithm"}, {"score": 0.002817639725689939, "phrase": "straightforward_fashion"}, {"score": 0.0026119782818898193, "phrase": "full-conditional_specifications"}, {"score": 0.0022974765563692776, "phrase": "different_joint_distributions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Connected site", " Consecutive site", " Full conditionals", " Support", " Odds", " Path"], "paper_abstract": "A distribution is said to be conditionally specified when only its conditional distributions are known or available. The very first issue is always compatibility: does there exist a joint distribution capable of reproducing all of the conditional distributions? We review five methods - mostly for two or three variables - published since 2002, and we conclude that these methods are either mathematically too involved and/or are too difficult (and in many cases impossible) to generalize to a high dimension. The purpose of this paper is to propose a general algorithm that can efficiently verify compatibility in a straightforward fashion. Our method is intuitively simple and general enough to deal with any full-conditional specifications. Furthermore, we illustrate the phenomenon that two theoretically equivalent conditional models can be different in terms of compatibilities, or can result in different joint distributions. The implications of this phenomenon are also discussed. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A simple algorithm for checking compatibility among discrete conditional distributions", "paper_id": "WOS:000291181000001"}