{"auto_keywords": [{"score": 0.04868068534732061, "phrase": "cca"}, {"score": 0.04031502738937586, "phrase": "unpaired_samples"}, {"score": 0.008713730422805007, "phrase": "neighborhood_correlation_analysis"}, {"score": 0.005571340101266652, "phrase": "cca."}, {"score": 0.004779406424192843, "phrase": "semi-paired_two-view_data"}, {"score": 0.004605565335682916, "phrase": "widely_used_technique"}, {"score": 0.00403026082093352, "phrase": "semi-paired_scenario"}, {"score": 0.003956234229826621, "phrase": "available_paired_samples"}, {"score": 0.003461758868675955, "phrase": "paired_samples"}, {"score": 0.0031434146012468307, "phrase": "single-view_leaning"}, {"score": 0.0031086137705026483, "phrase": "individual_views'_structure_information"}, {"score": 0.0029732094730218488, "phrase": "two-view_learning"}, {"score": 0.0028331500847209984, "phrase": "two-view_learning_method"}, {"score": 0.002760478838718213, "phrase": "novel_ccas_semi-paired_variant"}, {"score": 0.0026401983633087267, "phrase": "two-view_learning_way"}, {"score": 0.002553431170229379, "phrase": "neighborhood_relationships"}, {"score": 0.002353120949568249, "phrase": "paired_and_unpaired_data"}, {"score": 0.0021444597601392146, "phrase": "limited_paired_data"}, {"score": 0.0021206948586186903, "phrase": "experiments_results"}], "paper_keywords": ["Canonical correlation analysis", " Semi-paired learning", " Two-view learning", " Neighborhood relationship", " Neighborhood correlation"], "paper_abstract": "Canonical correlation analysis (CCA) is a widely used technique for analyzing two datasets (two views of the same objects). However, CCA needs that the samples of the two views are fully-paired. Actually, we are often faced up with the semi-paired scenario where the number of available paired samples is limited and yet the number of unpaired samples is sufficient. For such a scenario, CCA is generally prone to overfitting and thus performs poorly, since its definition itself makes it only able to utilize those paired samples. To overcome such a shortcoming, several semi-paired variants of CCA have been proposed. However, unpaired samples in these methods are just used in the way of single-view leaning to capture individual views' structure information for regularizing CCA. Intuitively, using unpaired samples in the way of two-view learning should be more natural and more attractive since CCA itself is a two-view learning method. As a result, a novel CCAs semi-paired variant named Neighborhood Correlation Analysis (NeCA), which uses unpaired samples in the two-view learning way, is developed through incorporating between-view neighborhood relationships into CCA. The relationships are acquired through leveraging within-view neighborhood relationships of each view's all data (including paired and unpaired data) and between-view paired information. Thus, it can take more sufficient advantage of the unpaired samples and then mitigate overfitting effectively caused by the limited paired data. Promising experiments results on several popular multi-view datasets show its feasibility and effectiveness.", "paper_title": "Neighborhood Correlation Analysis for Semi-paired Two-View Data", "paper_id": "WOS:000319016400006"}