{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "statistical_analysis"}, {"score": 0.0047588556219929756, "phrase": "black_tea_cream_formation"}, {"score": 0.004594443767709888, "phrase": "polyphenols_separation"}, {"score": 0.00440976345264104, "phrase": "available_polyphenols"}, {"score": 0.0040622852274783275, "phrase": "tea_cream"}, {"score": 0.004014923642015515, "phrase": "polyphenols_availability"}, {"score": 0.003698442219929622, "phrase": "edta."}, {"score": 0.00319386484766352, "phrase": "optimum_combination_range"}, {"score": 0.0030653094605910727, "phrase": "cream_formation"}, {"score": 0.002890557197908352, "phrase": "clear_phase"}, {"score": 0.002646880721119838, "phrase": "polynomial_models"}, {"score": 0.0024959247045753157, "phrase": "edta"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Polyphenols", " Tea cream", " Statistical analysis", " Design of experiments", " Optimization"], "paper_abstract": "Black tea cream formation is an inhibitor for the polyphenols separation since it decreases the amount of available polyphenols. Four factors that are considered to have an impact in the amount of tea cream and polyphenols availability are studied: temperature, amount of solids, pH and amount of EDTA. By using a design of experiments instead of a one-factor-at-a-time, additional information such as interaction effects can be obtained. The objective is to determine the optimum combination range for the factors that minimize the cream formation, while maximizing the amount of polyphenols in the clear phase. Statistical analysis is used to determine which factors significantly influence the responses and to generate polynomial models. This is a very effective tool and it indicates that EDTA is the only non-relevant factor. The optimization results in a 37% increase in the yield of theaflavins and a 20% increase in the yield of catechins. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Black tea cream effect on polyphenols optimization using statistical analysis", "paper_id": "WOS:000336373400003"}