{"auto_keywords": [{"score": 0.04786264020365327, "phrase": "computational_complexity"}, {"score": 0.015395803279812895, "phrase": "near-optimal_performance_tradeoff"}, {"score": 0.011799772698877, "phrase": "optimal_tradeoff"}, {"score": 0.008664962014630392, "phrase": "cblf"}, {"score": 0.00481495049065317, "phrase": "efficient_constant-time_bilateral_filter"}, {"score": 0.004520272777451894, "phrase": "complicated_parameter_adjustment"}, {"score": 0.0032437952431945724, "phrase": "constant-time_algorithm"}, {"score": 0.0031929098985796814, "phrase": "plenty_room"}, {"score": 0.0031262984171100856, "phrase": "performance_tradeoff"}, {"score": 0.0024144659350277954, "phrase": "fourier_analysis"}, {"score": 0.0021049977753042253, "phrase": "approximate_accuracy"}], "paper_keywords": ["Edge-preserving smoothing", " constant-time bilateral filtering", " compressibility"], "paper_abstract": "This paper presents an efficient constant-time bilateral filter that produces a near-optimal performance tradeoff between approximate accuracy and computational complexity without any complicated parameter adjustment, called a compressive bilateral filter (CBLF). The constant-time means that the computational complexity is independent of its filter window size. Although many existing constant-time bilateral filters have been proposed step-by-step to pursue a more efficient performance tradeoff, they have less focused on the optimal tradeoff for their own frameworks. It is important to discuss this question, because it can reveal whether or not a constant-time algorithm still has plenty room for improvements of performance tradeoff. This paper tackles the question from a viewpoint of compressibility and highlights the fact that state-of-the-art algorithms have not yet touched the optimal tradeoff. The CBLF achieves a near-optimal performance tradeoff by two key ideas: 1) an approximate Gaussian range kernel through Fourier analysis and 2) a period length optimization. Experiments demonstrate that the CBLF significantly outperforms state-of-the-art algorithms in terms of approximate accuracy, computational complexity, and usability.", "paper_title": "Compressive Bilateral Filtering", "paper_id": "WOS:000357093600002"}