{"auto_keywords": [{"score": 0.03590031820327418, "phrase": "molecular_descriptors"}, {"score": 0.004764220976404241, "phrase": "luminol_signal_enhancers"}, {"score": 0.004631527916092452, "phrase": "chemiluminescence-based_analytical_applications"}, {"score": 0.004534428070512318, "phrase": "forth_compound"}, {"score": 0.003813669883040509, "phrase": "possible_candidates"}, {"score": 0.0035533891890176823, "phrase": "enhancer_potency"}, {"score": 0.003287482882222731, "phrase": "current_study"}, {"score": 0.0031845067058084583, "phrase": "latent_structures"}, {"score": 0.0031397776924946526, "phrase": "partial_least_squares"}, {"score": 0.003095674983836725, "phrase": "multivariate_linear_regression_method"}, {"score": 0.002687235334499192, "phrase": "statistical_metrics"}, {"score": 0.002640114583897493, "phrase": "test_set"}, {"score": 0.0026214978443388653, "phrase": "roy's_metrics"}, {"score": 0.002468450551616404, "phrase": "internal_validity"}, {"score": 0.0023491282852109757, "phrase": "available_compounds"}, {"score": 0.0023325586335885104, "phrase": "potential_enhancers"}, {"score": 0.0022835460368487233, "phrase": "novel_analogues"}, {"score": 0.002211947103318718, "phrase": "compounds'_behaviour"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["QSPR", " Chemiluminescence", " Luminol", " Phenol", " Enhancers", " PLS-DA"], "paper_abstract": "Luminol-peroxidase-H2O2 is among the most popular systems in chemiluminescence-based analytical applications. The addition of a forth compound into this system has been thoroughly explored over the years, namely an enhancer promoting potency in the signal attained. Improvements in this regard serve to increase sensitivity and applicability of various biochemical methods. Studies exploring the ability of compounds to act as enhancers have proposed several chemical groups as possible candidates, amongst which 4-substituted phenols have been widely employed. Although some studies have explored the effect of the substituent on enhancer potency, no quantitative structure - property relationships (QSPR) employing molecular descriptors for this group of compounds have been presented. Current study provides two such cross- and externally validated models, constructed by the projection to latent structures by means of partial least squares (PLS) multivariate linear regression method: i) a PLS-DA model contributing to the classification of such compounds into classes (relative to the signal), and ii) a PLS model for predicting the signal acquired. Validation was based on statistical metrics Q(ext(F3))(2) for the test set and Roy's metrics r(2) (m(Av)) & r(2) m((delta)), assessing both predictive stability and internal validity. Applied in tandem, those models can assist in the recognition of available compounds as potential enhancers or inspire the synthesis of novel analogues. The significance of some characteristics governing the compounds' behaviour are also discussed based on the molecular descriptors chosen. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Quantitative structure-chemiluminescence intensity relationships of 4-substituted phenols acting as luminol signal enhancers", "paper_id": "WOS:000360595100052"}