{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "breakthroughs"}, {"score": 0.004582423717777699, "phrase": "game_developers"}, {"score": 0.0041345962781234435, "phrase": "game-play_experience"}, {"score": 0.003980032599437366, "phrase": "player_involvement"}, {"score": 0.0038605361756636667, "phrase": "integral_part"}, {"score": 0.0037589124802364384, "phrase": "potential_opportunities"}, {"score": 0.0036321600255449613, "phrase": "multiple_case-study_approach"}, {"score": 0.003365529624506815, "phrase": "casual_players"}, {"score": 0.0032894118890753805, "phrase": "multiple_observations"}, {"score": 0.003106541164572609, "phrase": "theoretical_claims"}, {"score": 0.0029450186031370245, "phrase": "previous_literature"}, {"score": 0.0028565082986974602, "phrase": "critical_examination"}, {"score": 0.0027812405653371503, "phrase": "resulting_theory"}, {"score": 0.0026771333996253783, "phrase": "macro_involvement"}, {"score": 0.0021049977753042253, "phrase": "commercial_and_educational_games"}], "paper_keywords": [""], "paper_abstract": "Game developers have to ensure their games are appealing to, and playable by, a range of people. However, although there has been interest in the game-play experience, we know little about how learning relates to player involvement. This is despite challenge being an integral part of game-play, providing players with potential opportunities to learn. This article reports on a multiple case-study approach that explored how learning and involvement come together in practice. Participants consisted of a mix of gamers and casual players. Data included interviews, multiple observations of game-play, postplay cued interviews, and diary entries. A set of theoretical claims representing suggested relationships between involvement and learning were developed on the basis of previous literature; these were then assessed through a critical examination of the data set. The resulting theory is presented as 14 refined claims that relate to micro and macro involvement; breakdowns and breakthroughs in action, understanding, and involvement; progress; and agency, meaning and compelling game-play. The claims emphasize how players experience learning via breakthroughs in understanding, where involvement is increased when the player feels responsible for progress. Supporting the relationship between learning and involvement is important for ensuring the success of commercial and educational games.", "paper_title": "Game-Play Breakdowns and Breakthroughs: Exploring the Relationship Between Action, Understanding, and Involvement", "paper_id": "WOS:000354542700002"}