{"auto_keywords": [{"score": 0.030077460780835362, "phrase": "multi-institutional_and_multi-national_authorship"}, {"score": 0.028436473914237585, "phrase": "correspondence_analysis"}, {"score": 0.00481495049065317, "phrase": "ten_research_areas"}, {"score": 0.004764859786310636, "phrase": "carlos_iii_university_of_madrid"}, {"score": 0.004569630374630379, "phrase": "possible_relationship"}, {"score": 0.0037066895459425824, "phrase": "single-authored_papers"}, {"score": 0.003554661425339528, "phrase": "scientific_production"}, {"score": 0.0035176353680157367, "phrase": "ten_carlos_iii_university_of_madrid_departmental_areas"}, {"score": 0.0034088473318056537, "phrase": "isi_web"}, {"score": 0.003234934827553253, "phrase": "respective_papers"}, {"score": 0.0031513240597392843, "phrase": "univariate_multifactorial_analysis"}, {"score": 0.002253461585851626, "phrase": "citing_journal"}, {"score": 0.0022299587520401747, "phrase": "multi-institutional_or_multinational_authorship"}, {"score": 0.002127186380459509, "phrase": "journal_quartile"}, {"score": 0.0021049977753042253, "phrase": "departmental_area"}], "paper_keywords": [""], "paper_abstract": "Opinions in the literature on the possible relationship between co-authorship and number of citations vary. This paper contributes to the debate with a further analysis of the subject, taking account of the number and quality of citations found for multi-(author, institution, country) and single-authored papers. The study is based on the scientific production of ten Carlos III University of Madrid departmental areas between 1997 and 2003 as reflected in the ISI Web of Science, and the number of times the respective papers were cited between 1997 and 2004. Univariate multifactorial analysis of variance (ANOVA) was used to verify the relationship between multi-authorship and visibility. The correlation between multi-institutional and multi-national authorship and the quartile of the citing journals was analyzed with correspondence analysis. The results show that while multi-institutional and multi-national authorship raise the number of citations, co-authorship and number of citations are unrelated. Correspondence analysis failed to show any correlation between the quartile of the citing journal and multi-institutional or multinational authorship, but did reveal a relationship between citing journal quartile and departmental area.", "paper_title": "Are multi-authorship and visibility related? Study of ten research areas at Carlos III University of Madrid", "paper_id": "WOS:000264487900012"}