{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "generalized_rough_sets"}, {"score": 0.03134122353461683, "phrase": "six_coverings"}, {"score": 0.031023778398368982, "phrase": "pure_reflexive_neighborhood_system"}, {"score": 0.004569630374630379, "phrase": "useful_tool"}, {"score": 0.004475022550508119, "phrase": "partition_related_uncertainty"}, {"score": 0.004224786847720058, "phrase": "classical_rough_set"}, {"score": 0.004051595625804513, "phrase": "indiscernibility_relation"}, {"score": 0.0038450179181069833, "phrase": "weaker_binary_relations"}, {"score": 0.0037066895459425824, "phrase": "systematic_approach"}, {"score": 0.003234934827553253, "phrase": "first_step"}, {"score": 0.0029593432468318745, "phrase": "rough_set_models"}, {"score": 0.0029131986574478046, "phrase": "second_step"}, {"score": 0.002678944072162297, "phrase": "inclusion_relations"}, {"score": 0.002651015392318126, "phrase": "equivalence_relations"}, {"score": 0.002301211274459965, "phrase": "seven_accuracy_measures"}, {"score": 0.0022299587520401747, "phrase": "illustrative_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Covering", " Granular computing", " Neighborhood system", " Rough set theory"], "paper_abstract": "Rough set is a useful tool to deal with partition related uncertainty, granularity, and incompleteness of knowledge. Although the classical rough set is constructed on the basis of an indiscernibility relation, it can also be generalized by using some weaker binary relations. In this paper, a systematic approach is used to study the generalized rough sets in six coverings and pure reflexive neighborhood system. After two steps, relationships among generalized rough sets in six coverings and pure reflexive neighborhood system are obtained. The first step is to study the generalized rough sets in six coverings, and to get relationships between every two covering rough set models. The second step is to study the relationships between generalized rough sets in each covering and in pure reflexive neighborhood system. The inclusion relations or equivalence relations among the seven upper/lower approximations could be acquired. Finally, the accuracy measures of generalized rough sets in six coverings and that in pure reflexive neighborhood system are compared. The relationships among seven accuracy measures are also obtained. Some illustrative examples are employed to demonstrate our arguments. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Relationships among generalized rough sets in six coverings and pure reflexive neighborhood system", "paper_id": "WOS:000305727400005"}