{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "urban_mesh_networks"}, {"score": 0.0047135086583390585, "phrase": "important_role"}, {"score": 0.0046141941030386525, "phrase": "mobile_wireless_networking_protocols"}, {"score": 0.004328576620172575, "phrase": "large-scale_urban_mesh_networks"}, {"score": 0.004148014765950199, "phrase": "networking_research_community"}, {"score": 0.003841699919521703, "phrase": "wireless_transmissions"}, {"score": 0.003542786326740931, "phrase": "\"two-ray\"_model"}, {"score": 0.0033660587983313536, "phrase": "open_space"}, {"score": 0.003211788912325178, "phrase": "wireless_signals"}, {"score": 0.003130633384437765, "phrase": "mobile_wireless_networking"}, {"score": 0.002801935384649699, "phrase": "open-space_propagation_models"}, {"score": 0.002754516260621121, "phrase": "outdoor_urban_areas"}, {"score": 0.002696366237523415, "phrase": "open-space_models"}, {"score": 0.0025183881730011597, "phrase": "extensive_background_discussion"}, {"score": 0.002372298201966367, "phrase": "propagation_measurements"}, {"score": 0.002215663255682209, "phrase": "protocol_simulators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["wireless mesh networks", " modeling and simulation", " wireless propagation"], "paper_abstract": "Simulation plays an important role in the verification of mobile wireless networking protocols. Recently, several cities have either begun deploying or are completing plans to deploy large-scale urban mesh networks (LUMNets). On the other hand, the networking research community has little expertise in simulating such networks. While the protocols are simulated reasonably realistically, the propagation of wireless transmissions and the mobility of nodes are not. Today, simulations typically model propagation with either the free-space model or a \"two-ray\" model that includes a ground reflection. Such models are only valid in open space where there are no hills and no buildings. Since wireless signals at the frequencies used for mobile wireless networking are partly reflected off of buildings and partly is transmitted into the building, the presence of buildings greatly influences propagation. Consequently, the open-space propagation models are inaccurate in outdoor urban areas. Indoors, the open-space models are not even applicable. This paper presents guidelines for simulating propagation in such urban settings. Extensive background discussion on propagation is also included. The techniques for propagation are validated against propagation measurements. The techniques discussed are implemented in a suite of tools that are compatible with protocol simulators and are freely available for use. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Realistic propagation simulation of urban mesh networks", "paper_id": "WOS:000248139800006"}