{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "new_knowledge"}, {"score": 0.008927913290790306, "phrase": "blockbuster_hypothesis"}, {"score": 0.004186534737631288, "phrase": "high_interest"}, {"score": 0.0039620308501590795, "phrase": "published_management_studies"}, {"score": 0.0037336520904376687, "phrase": "numerous_studies"}, {"score": 0.0036864465771943933, "phrase": "leading_management_journals"}, {"score": 0.003503497128638099, "phrase": "citation_data"}, {"score": 0.0034738975998176323, "phrase": "additional_tests"}, {"score": 0.0031912706211861324, "phrase": "journal_rankings"}, {"score": 0.003150900886669123, "phrase": "poor_proxy"}, {"score": 0.0031242709509664806, "phrase": "study_influence"}, {"score": 0.003032820755030689, "phrase": "editorial_boards"}, {"score": 0.002750721367040336, "phrase": "lower_ranked_journals"}, {"score": 0.0021049977753042253, "phrase": "journal_editors"}], "paper_keywords": ["Knowledge creation", " High impact knowledge", " Knowledge gatekeepers", " Academic journal quality"], "paper_abstract": "We argue that the creation of new knowledge is both difficult and rare. More specifically, we posit that the creation of new knowledge is dominated by a few key insights that challenge the way people think about an idea; generating high interest and use. We label this the blockbuster hypothesis. Using two large samples of published management studies over the period 1998-2007 we find support for the blockbuster hypothesis. We also find that numerous studies in the leading management journals are flops, having little impact on the profession as measured using citation data. Additional tests indicate that journal \"quality\" is related to the ratio of blockbusters to flops a journal publishes and that journal rankings are a poor proxy for study influence. Consistent with the notion that editorial boards are able to identify new knowledge, we find that research notes significantly under-perform articles in both the same journal and articles published in lower ranked journals. Taken together, the results imply that only a few scientific studies, out of the thousands published in a given area, change or influence the boundaries of knowledge, with many appearing to have little impact on the frontiers of knowledge. Overall, this analysis indicates that the development of new knowledge is rare even though it appears to be recognizable to knowledge gatekeepers like journal editors.", "paper_title": "The blockbuster hypothesis: influencing the boundaries of knowledge", "paper_id": "WOS:000300325800013"}