{"auto_keywords": [{"score": 0.04876112166657545, "phrase": "asia"}, {"score": 0.028422053772947427, "phrase": "healthcare_industry"}, {"score": 0.027657771609629848, "phrase": "km_projects"}, {"score": 0.00481495049065317, "phrase": "flagging_km_initiative"}, {"score": 0.004734987730139094, "phrase": "healthcare_organisation"}, {"score": 0.0037869901077566526, "phrase": "archival_data"}, {"score": 0.0036826452656927877, "phrase": "email_correspondences"}, {"score": 0.003641713874009232, "phrase": "presentation_materials"}, {"score": 0.003601235776892337, "phrase": "web_sites"}, {"score": 0.0031845067058084583, "phrase": "theoretical_km_failure_framework"}, {"score": 0.0031315358193567708, "phrase": "nuanced_perspective"}, {"score": 0.00306227185008558, "phrase": "failure_factors"}, {"score": 0.0023151088048303705, "phrase": "greater_inquiry"}, {"score": 0.0022013916728990564, "phrase": "impending_failures"}, {"score": 0.0021049977753042253, "phrase": "km_project_failure"}], "paper_keywords": ["knowledge management", " project management", " health services sector", " Asia"], "paper_abstract": "Purpose - This paper aims to examine a flagging but yet-to-be abandoned knowledge management (KM) project at a healthcare organisation in Asia through a case study approach. Design/methodology/approach - Semi-structured interviews with a variety of stakeholders familiar with the project were conducted. Additionally, archival data in the form of email correspondences, presentation materials and web sites were collected to triangulate against the responses given by the interviewees. Findings - The findings which are validated against a theoretical KM failure framework afford a nuanced perspective of how the failure factors identified in the framework were germane to the case. Practical implications - By exposing these factors, administrators and managers in the healthcare industry who intend to implement KM projects can be better informed of the risks involved. For researchers, this paper serves as a call for a greater inquiry into KM projects in the healthcare industry that are facing impending failures. Originality/value - This paper reveals that KM project failure is a reality with which administrators, managers and researchers have to reckon.", "paper_title": "Look before you leap - Learning from the experience of a flagging KM initiative at a healthcare organisation in Asia", "paper_id": "WOS:000259203400004"}