{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "disk_encryption_key"}, {"score": 0.020874053791829737, "phrase": "system_administrator"}, {"score": 0.004762893197005439, "phrase": "smart_cards"}, {"score": 0.004685855684376706, "phrase": "key-recovery_methods"}, {"score": 0.004610070885556248, "phrase": "cards"}, {"score": 0.004269562115995089, "phrase": "user's_smart_card"}, {"score": 0.004112582094962078, "phrase": "smart_card"}, {"score": 0.0036886073959526396, "phrase": "user's_disk_data"}, {"score": 0.003288231178864334, "phrase": "processing_time"}, {"score": 0.003167217223469026, "phrase": "key_authentication"}, {"score": 0.0025334249463305875, "phrase": "key-recovery_phase"}, {"score": 0.002386062690026682, "phrase": "user's_password"}, {"score": 0.00217496508306238, "phrase": "user_authentication"}, {"score": 0.0021396960731214225, "phrase": "experimental_environment"}, {"score": 0.0021049977753042253, "phrase": "virtual_machine_monitor"}], "paper_keywords": ["user authentication", " key recovery", " smart card"], "paper_abstract": "In key-recovery methods using smart Cards, a user can recover the disk encryption key in cooperation with the system administrator, even if the user has lost the smart card including the disk encryption key. However, the disk encryption key is known to the system administrator in advance in most key-recovery methods. Hence user's disk data may be read by the system administrator. Furthermore, if the disk encryption key is not known to the system administrator in advance, it is difficult to achieve a key authentication. In this paper, we propose a scheme which enables to recover the disk encryption key when the user's smart card is lost. In our scheme, the disk encryption key is not preserved anywhere and then the system administrator cannot know the key before key-recovery phase. Only someone who has a user's smart card and knows the user's password can decrypt that user's disk data. Furthermore, we measured the processing time required for user authentication in an experimental environment using a virtual machine monitor. As a result, we found that this processing time is short enough to be practical.", "paper_title": "Practical and Secure Recovery of Disk Encryption Key Using Smart Cards", "paper_id": "WOS:000279136500016"}