{"auto_keywords": [{"score": 0.049312845289349885, "phrase": "surgical_process_models"}, {"score": 0.045366511165128576, "phrase": "spm_methodology"}, {"score": 0.03649008636247004, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "surgical_practice"}, {"score": 0.004707396263523012, "phrase": "surgical_process_modelling"}, {"score": 0.00455788259881503, "phrase": "different_parameters"}, {"score": 0.004456044928556639, "phrase": "surgical_process"}, {"score": 0.003941478054422721, "phrase": "specific_parameters"}, {"score": 0.0034191818674096453, "phrase": "dynamic_time_warping"}, {"score": 0.003331915219811852, "phrase": "clustering_algorithm"}, {"score": 0.0032157980901917856, "phrase": "france"}, {"score": 0.0031950026246694886, "phrase": "germany"}, {"score": 0.003164089425741269, "phrase": "canada"}, {"score": 0.0031032109441552287, "phrase": "different_surgical_behaviors"}, {"score": 0.0029658905122290536, "phrase": "categorized_surgical_experience"}, {"score": 0.0029467742734417255, "phrase": "individual_surgeons"}, {"score": 0.0028715299874549245, "phrase": "multidimensional_scaling"}, {"score": 0.0028346293790895024, "phrase": "new_space"}, {"score": 0.0027004145919012736, "phrase": "time-based_approach"}, {"score": 0.0023880948210628933, "phrase": "first_multi-site_study"}, {"score": 0.002319566486828135, "phrase": "robust_analysis_tools"}, {"score": 0.0022676260293002706, "phrase": "new_perspectives"}, {"score": 0.0022312377180023282, "phrase": "surgical_approaches"}, {"score": 0.0021742244283295986, "phrase": "objective_assessment"}, {"score": 0.0021462652605453163, "phrase": "surgeon's_expertise"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Surgical process models", " Surgery", " Surgical skills", " Clustering"], "paper_abstract": "Surgical Process Modelling (SPM) was introduced to improve understanding the different parameters that influence the performance of a Surgical Process (SP). Data acquired from SPM methodology is enormous and complex. Several analysis methods based on comparison or classification of Surgical Process Models (SPMs) have previously been proposed. Such methods compare a set of SPMs to highlight specific parameters explaining differences between populations of patients, surgeons or systems. In this study, procedures performed at three different international University hospitals were compared using SPM methodology based on a similarity metric focusing on the sequence of activities occurring during surgery. The proposed approach is based on Dynamic Time Warping (DTW) algorithm combined with a clustering algorithm. SPMs of 41 Anterior Cervical Discectomy (ACD) surgeries were acquired at three Neurosurgical departments; in France, Germany, and Canada. The proposed approach distinguished the different surgical behaviors according to the location where surgery was performed as well as between the categorized surgical experience of individual surgeons. We also propose the use of Multidimensional Scaling to induce a new space of representation of the sequences of activities. The approach was compared to a time-based approach (e.g. duration of surgeries) and has been shown to be more precise. We also discuss the integration of other criteria in order to better understand what influences the way the surgeries are performed. This first multi-site study represents an important step towards the creation of robust analysis tools for processing SPMs. It opens new perspectives for the assessment of surgical approaches, tools or systems as well as objective assessment and comparison of surgeon's expertise. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Multi-site study of surgical practice in neurosurgery based on surgical process models", "paper_id": "WOS:000324848600007"}