{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "voip."}, {"score": 0.0047448515702010734, "phrase": "question-driven_survey"}, {"score": 0.0038827100184187805, "phrase": "next_question"}, {"score": 0.0038448988429199086, "phrase": "participants_request"}, {"score": 0.0035553221885904467, "phrase": "mobile_phone"}, {"score": 0.0034355662264234864, "phrase": "voip_technologies"}, {"score": 0.0031457622320220364, "phrase": "relevant_questions"}, {"score": 0.002966230968271199, "phrase": "proposed_encryption_technologies"}, {"score": 0.002937318465594425, "phrase": "mobile_phones"}, {"score": 0.002663208600887875, "phrase": "evoting_framework"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Privacy", " Audio streaming", " eVoting", " Survey"], "paper_abstract": "In a question-driven survey, the answers to one question may decide which question is presented next. In this case, encrypting the answers of the participants is not enough to protect their privacy since the system is able to learn them by inspection of the next question the participants request. In this article, we explore the technologies involved in surveys performed through a mobile phone. Participants receive the questions using VoIP technologies and, since their answers affect which questions are presented next, they must protect the selection of the relevant questions. In addition, this paper considers the performance of the proposed encryption technologies in mobile phones. Finally, the answers to the poll must be sent to the server. This paper proposes an eVoting framework to preserve the privacy of the users while sending the answers to the system. Such a scenery involves many different communication channels and technologies. As we will show, the decisions taken in some of the modules force some technologies and decisions in the others. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Private surveys on VoIP", "paper_id": "WOS:000362610100004"}