{"auto_keywords": [{"score": 0.04597768843054382, "phrase": "external_archive"}, {"score": 0.04404905311624432, "phrase": "pareto_dominance"}, {"score": 0.010610612127270755, "phrase": "nondominated_solutions"}, {"score": 0.00481495049065317, "phrase": "epsilon-dominance_based_grids"}, {"score": 0.004258372598568333, "phrase": "relaxed_form"}, {"score": 0.003601235776892337, "phrase": "multi-objective_evolutionary_algorithms"}, {"score": 0.0034824716857663114, "phrase": "main_objective"}, {"score": 0.0029447150254434842, "phrase": "extra_objective_function"}, {"score": 0.002815864555488112, "phrase": "nondominated_solution"}, {"score": 0.0025178072071268534, "phrase": "aforementioned_relaxed_forms"}, {"score": 0.002238664219600659, "phrase": "pareto_fronts"}, {"score": 0.002176887956041267, "phrase": "aforementioned_archiving_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "In this paper, we deal with the problem of handling solutions in an external archive with the use of a relaxed form of Pareto dominance called epsilon-dominance and a variation of it called pa epsilon-dominance. These two relaxed forms of Pareto dominance have been used as archiving strategies in some multi-objective evolutionary algorithms (MOEAs). The main objective of this work is to improve the epsilon-dominance based schemes to handle nondominated solutions, or to retain nondominated solutions in an external archive. Thus, our main contribution is to add an extra objective function only at the time of accepting a nondominated solution into the external archive, in order to preserve some solutions which are normally lost when using any of the aforementioned relaxed forms of Pareto dominance. Such a proposal is inexpensive (computationally speaking) and quite effective, since it is able to produce Pareto fronts of much better quality than the aforementioned archiving techniques. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Improving the efficiency of epsilon-dominance based grids", "paper_id": "WOS:000291714000001"}