{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_sciences"}, {"score": 0.00886921400481825, "phrase": "advanced_logic"}, {"score": 0.006400605433858282, "phrase": "different_generations"}, {"score": 0.005413151449877331, "phrase": "simulation_research"}, {"score": 0.004335603324413586, "phrase": "modem_interdisciplinary_simulation_research"}, {"score": 0.003986581218661184, "phrase": "social_science_research"}, {"score": 0.003790751492305239, "phrase": "theoretical_principles"}, {"score": 0.0035444736871640147, "phrase": "scientifically_valid_way"}, {"score": 0.003485437176235259, "phrase": "research_questions"}, {"score": 0.0034708317974593136, "phrase": "modem_complex_society"}, {"score": 0.0031512402798625056, "phrase": "autobiographic_memory"}, {"score": 0.0030089355635315005, "phrase": "individual_memories"}, {"score": 0.0029587924529332695, "phrase": "collective_memories"}, {"score": 0.002873038567884343, "phrase": "social_researchers"}, {"score": 0.002778064757980489, "phrase": "creative_synergy"}, {"score": 0.0026862220320327613, "phrase": "surprising_hypotheses"}, {"score": 0.0021953959824690316, "phrase": "sociocybernetical_theory"}, {"score": 0.0021049977753042253, "phrase": "exotic_field"}], "paper_keywords": ["scientific management", " systems theory", " cybernetics", " feedback", " self assessment", " simulation"], "paper_abstract": "Purpose - To demonstrate that the past of the social sciences contains all the elements of sociocybernetics and that those elements combined with the logic of modem interdisciplinary simulation research will meet challenges modem society poses to those sciences. Design/methodology/approach - A historical analysis, leading to an outline of advanced logic of social science research, shows the way to modern (computer) simulation research. Findings - When the theoretical principles of sociocybernetics are put into practice by doing (empirically based) simulation research, it can handle in a scientifically valid way a number of research questions modem complex society poses, such as how processes of self-organization in individuals, groups and institutes can be described and understood; self-organization of autobiographic memory of individuals can be simulated in a computer, these individual memories are related to collective memories of generations; these different generations of social researchers can work together and balance in a creative synergy between the wisdom of the past and surprising hypotheses of the future. Research limitations/implications - Social sciences researchers have to work with advanced logic of research such as is propagated in simulation research and by sociocybernetics. Practical implications - Different generations of sociocyberneticians here to work together in (empirically based) simulation research to demonstrate the usefulness of sociocybernetical theory and logic. Originality/value - Sociocybernetics is not an exotic field but a normal legitimate constituent of the social sciences.", "paper_title": "The challenge of the past for the future of the social sciences", "paper_id": "WOS:000238081100010"}