{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "scalable_feature_extraction"}, {"score": 0.004176194589991187, "phrase": "local_image_features"}, {"score": 0.0041001740903338834, "phrase": "compressed_code-stream"}, {"score": 0.004025531820226182, "phrase": "spatial_image_area"}, {"score": 0.0039341294012600085, "phrase": "code-blocks_borders"}, {"score": 0.0037402558657576124, "phrase": "integral_volumes"}, {"score": 0.0036385493850693983, "phrase": "randomized_trees"}, {"score": 0.0033037970113095577, "phrase": "noncompressed_versions"}, {"score": 0.0030135741897058844, "phrase": "image_retrieval_issue"}, {"score": 0.00286493504971388, "phrase": "highly_skewed_distribution"}, {"score": 0.002825681384008326, "phrase": "efficient_way"}, {"score": 0.002530359917257626, "phrase": "heavy_decoding_operations"}, {"score": 0.0023725232579531273, "phrase": "multilayer_paradigms"}, {"score": 0.002318566141177149, "phrase": "compression_standard"}, {"score": 0.0021049977753042253, "phrase": "better_tradeoff"}], "paper_keywords": ["Image coding", " image retrieval", " scalability", " wavelet transforms"], "paper_abstract": "In this paper, we address the issues of analyzing and classifying JPEG 2000 code-streams. An original representation, called integral volume, is first proposed to compute local image features progressively from the compressed code-stream, on any spatial image area, regardless of the code-blocks borders. Then, a JPEG 2000 classifier is presented that uses integral volumes to learn an ensemble of randomized trees. Several classification tasks are performed on various JPEG 2000 image databases and results are in the same range as the ones obtained in the literature with noncompressed versions of these databases. Finally, a cascade of such classifiers is considered, in order to specifically address the image retrieval issue, i.e., bi-class problems characterized by a highly skewed distribution. An efficient way to learn and optimize such cascade is proposed. We show that staying in a JPEG 2000 framework, initially seen as a constraint to avoid heavy decoding operations, is actually an advantage as it can benefit from the multiresolution and multilayer paradigms inherently present in this compression standard. In particular, unlike other existing cascaded retrieval systems, the features used along our cascade are increasingly discriminant and lead therefore to a better tradeoff of complexity versus performance.", "paper_title": "Scalable Feature Extraction for Coarse-to-Fine JPEG 2000 Image Classification", "paper_id": "WOS:000294132800020"}