{"auto_keywords": [{"score": 0.03447147592902459, "phrase": "food_practices"}, {"score": 0.00481495049065317, "phrase": "information_and_communication_technologies"}, {"score": 0.004266501496765747, "phrase": "cultural_values"}, {"score": 0.0037423521744765075, "phrase": "diet-related_health_challenges"}, {"score": 0.003704797078215222, "phrase": "african_americans"}, {"score": 0.0036676174658755683, "phrase": "low-income_neighborhoods"}, {"score": 0.003558294449586273, "phrase": "diet-related_disease"}, {"score": 0.0031684791285366315, "phrase": "formative_focus_groups"}, {"score": 0.0028933521924166287, "phrase": "cultural_value"}, {"score": 0.002821247621250663, "phrase": "african_american_population"}, {"score": 0.0025892330566358503, "phrase": "community-held_knowledge"}, {"score": 0.0025503112711036994, "phrase": "healthy_eating_decisions"}, {"score": 0.002400373755068185, "phrase": "collectivistic_systems"}, {"score": 0.002282166507956957, "phrase": "hci_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Community computing", " Collectivism", " Culture", " Health", " Nutrition"], "paper_abstract": "Human-Computer Interaction (HCI) researchers are increasingly examining how Information and Communication Technologies (ICTs) can help people eat more healthfully. However, within HCI, there has been little examination of the way that cultural values influence how people think about food and wellness, and how sociocultural context supports or impedes attempts to eat healthfully. Our work focuses on the diet-related health challenges of African Americans within low-income neighborhoods. This population disproportionately experiences diet-related disease, and as such, researchers have consistently advocated research that examines the way in which food practices are culturally situated. Through formative focus groups with 46 participants we identified several design implications for tools that promote healthy eating while accounting for collectivism, a cultural value often ascribed to the African American population. Based on our design implications we developed, deployed and evaluated two systems that supported the sharing of community-held knowledge about making healthy eating decisions. In our discussion, we present implications for the design of collectivistic systems that address food practices. We conclude with recommendations for HCI research that investigates the relationship between culture and food more broadly. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Collectivistic health promotion tools: Accounting for the relationship between culture, food and nutrition", "paper_id": "WOS:000328710100005"}