{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "graph_hierarchy_space"}, {"score": 0.004555028829645471, "phrase": "large_input_graph"}, {"score": 0.004416713079266374, "phrase": "superimposed_hierarchy"}, {"score": 0.004204054047427536, "phrase": "clustering_algorithms"}, {"score": 0.004152502093643003, "phrase": "topological_features"}, {"score": 0.003880017219275826, "phrase": "specific_attributes"}, {"score": 0.003515162360861593, "phrase": "unique_views"}, {"score": 0.0034506596895901003, "phrase": "input_graph"}, {"score": 0.0034083145672246067, "phrase": "grouseflocks"}, {"score": 0.002831894638104635, "phrase": "single_fixed_hierarchy"}, {"score": 0.0027457584014804574, "phrase": "simple_set"}, {"score": 0.002323826502178581, "phrase": "attribute_data"}, {"score": 0.0021049977753042253, "phrase": "interactive_exploration"}], "paper_keywords": ["graph theory", " graph drawing system", " graph hierarchy"], "paper_abstract": "Several previous systems allow users to interactively explore a large input graph through cuts of a superimposed hierarchy. This hierarchy is often created using clustering algorithms or topological features present in the graph. However, many graphs have domain- specific attributes associated with the nodes and edges, which could be used to create many possible hierarchies providing unique views of the input graph. GrouseFlocks is a system for the exploration of this graph hierarchy space. By allowing users to see several different possible hierarchies on the same graph, the system helps users investigate graph hierarchy space instead of a single fixed hierarchy. GrouseFlocks provides a simple set of operations so that users can create and modify their graph hierarchies based on selections. These selections can be made manually or based on patterns in the attribute data provided with the graph. It provides feedback to the user within seconds, allowing interactive exploration of this space.", "paper_title": "GrouseFlocks: Steerable exploration of graph hierarchy space", "paper_id": "WOS:000255550600015"}