{"auto_keywords": [{"score": 0.04923607408107278, "phrase": "overall_perceived_value"}, {"score": 0.02322730111336099, "phrase": "moderating_effect"}, {"score": 0.0167304029584996, "phrase": "uncertainty_avoidance"}, {"score": 0.00703268184016045, "phrase": "perceived_value"}, {"score": 0.004121490798711703, "phrase": "international_consumer_behavior"}, {"score": 0.004066898031169739, "phrase": "consumers'_uncertainty_avoidance"}, {"score": 0.004013025478863664, "phrase": "moderating_variable"}, {"score": 0.0038045528117455906, "phrase": "british"}, {"score": 0.003754157410911799, "phrase": "spanish"}, {"score": 0.0035749765312954093, "phrase": "sem"}, {"score": 0.0030459283281463953, "phrase": "service_-_uncertainty_avoidance"}, {"score": 0.0027741761880779535, "phrase": "overall_perceived_value_model"}, {"score": 0.0025605773834404253, "phrase": "web-based_businesses"}, {"score": 0.0023010815714140467, "phrase": "entire_purchasing_process"}, {"score": 0.0021049977753042253, "phrase": "spanish_or_british_consumers"}], "paper_keywords": ["Overall perceived value", " Online satisfaction", " Perceived quality", " Perceived risk", " Monetary price", " Uncertainty avoidance", " Consumer behaviour", " Cross cultural studies", " Internet shopping", " Customer satisfaction"], "paper_abstract": "Purpose - The aim of this study is to analyze differences in the overall perceived value of a service purchased online, and the consequences for international consumer behavior, taking consumers' uncertainty avoidance as a moderating variable. Design/methodology/approach - A questionnaire was administered to 300 international consumers (150 British and 150 Spanish) who had purchased a service via the internet. SEM was chosen to analyze the effect of uncertainty avoidance on the formation of overall perceived value. Findings - The results reveal that in the formation of overall perceived value - which embraces both the online purchase and also enjoyment of the service - uncertainty avoidance has a moderating effect. Research limitations/implications - In this study just two cultures were to analyze the moderating effect of uncertainty avoidance on an overall perceived value model. Practical implications - The paper helps in understanding the role played by uncertainty avoidance in interactions with web-based businesses. Originality/value - This paper represents an advance in the study of overall perceived value. It explores how overall perceived value is formed when the entire purchasing process is taken into account, and the variations that occur in this process depending on whether it relates to Spanish or British consumers.", "paper_title": "The moderating effect of uncertainty-avoidance on overall perceived value of a service purchased online", "paper_id": "WOS:000303299600003"}