{"auto_keywords": [{"score": 0.038789324283226886, "phrase": "macro_sociopolitical_context"}, {"score": 0.034912196795509, "phrase": "aboriginal_people"}, {"score": 0.00481495049065317, "phrase": "critical_research."}, {"score": 0.0045876189888390895, "phrase": "critical_research"}, {"score": 0.004131063310728304, "phrase": "immediate_organizational_context"}, {"score": 0.0039677715255034595, "phrase": "macro_sociopolitical_analyses"}, {"score": 0.003935892934907777, "phrase": "institutional_change"}, {"score": 0.003734810936407523, "phrase": "critical_research_perspective"}, {"score": 0.003515479934694842, "phrase": "ethnographic_study"}, {"score": 0.0033492947290751996, "phrase": "social_welfare"}, {"score": 0.003282413293067795, "phrase": "taiwan"}, {"score": 0.003077092305006702, "phrase": "national_radio"}, {"score": 0.0029434299787644445, "phrase": "underprivileged_children"}, {"score": 0.002861402531078998, "phrase": "different_story"}, {"score": 0.0026181517251690606, "phrase": "postcolonial_theory"}, {"score": 0.0024345529783611703, "phrase": "local_organizational_context"}, {"score": 0.0022006705963260433, "phrase": "traditional_approach"}, {"score": 0.002174155795026218, "phrase": "postcolonial_context"}, {"score": 0.0021049977753042253, "phrase": "real_progress"}], "paper_keywords": ["ICT4D", " development", " critical research", " postcolonial theory"], "paper_abstract": "The purpose of this paper is to demonstrate the value of critical research for information and communications technology for development (ICT4D) studies. Most previous IS research on ICT4D projects is interpretive and has focused on the immediate organizational context, but there are very few critical studies that have engaged in macro sociopolitical analyses regarding institutional change. Hence we extend previous IS research on ICT4D by adopting a critical research perspective on the macro sociopolitical context within which most ICT4D projects take place. We illustrate this with an ethnographic study of a project that was intended to improve the education and social welfare of the aboriginal people in Taiwan. On the surface the project was tremendously successful; it became a showcase on national radio and TV showing how ICT could be used to support underprivileged children. However, our research uncovered a different story altogether-a story of the aboriginal people themselves feeling marginalized and without much of a voice. We use concepts from postcolonial theory to make sense of these two contradictory stories. We found that the interrelationship between the macro sociopolitical context and the local organizational context of the ICT4D project is the key to understanding what went wrong, something which we would not have discovered if we had taken the traditional approach. The postcolonial context is powerful and pervasive, hampering any real progress.", "paper_title": "EXTENDING ICT4D STUDIES: THE VALUE OF CRITICAL RESEARCH", "paper_id": "WOS:000365390600010"}