{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "commitment_protocols"}, {"score": 0.004771435352180973, "phrase": "open_systems"}, {"score": 0.0047283116134926645, "phrase": "agent_interaction"}, {"score": 0.004664352260912174, "phrase": "fundamental_part"}, {"score": 0.00460125407969429, "phrase": "multiagent_system"}, {"score": 0.004070276454809864, "phrase": "available_protocols"}, {"score": 0.0035194572615570977, "phrase": "three-phase_framework"}, {"score": 0.0034092396400930446, "phrase": "commitment_protocol"}, {"score": 0.0033326252993345685, "phrase": "first_phase"}, {"score": 0.0032429499567088113, "phrase": "candidate_commitment_protocols"}, {"score": 0.0029610472910087176, "phrase": "generated_protocol"}, {"score": 0.002778385486855157, "phrase": "second_phase"}, {"score": 0.0027159094186967247, "phrase": "generated_protocols"}, {"score": 0.002502374576203785, "phrase": "third_phase"}, {"score": 0.0021049977753042253, "phrase": "case_study"}], "paper_keywords": ["Commitment protocol", " Generation", " Ranking"], "paper_abstract": "Agent interaction is a fundamental part of any multiagent system. Such interactions are usually regulated by protocols, which are typically defined at design-time. However, in many situations a protocol may not exist or the available protocols may not fit the needs of the agents. In order to deal with such situations agents should be able to generate protocols at runtime. In this paper we develop a three-phase framework to enable agents to create a commitment protocol dynamically. In the first phase one of the agents generates candidate commitment protocols, by considering its goals, its abilities and its knowledge about the other agents' services. We propose two algorithms that ensure that each generated protocol allows the agent to reach its goals if the protocol is enacted. The second phase is ranking of the generated protocols in terms of their expected utility in order to select the one that best suits the agent. The third phase is the negotiation of the protocol between agents that will enact the protocol so that the agents can agree on a protocol that will be used for enactment. We demonstrate the applicability of our approach using a case study.", "paper_title": "Dynamically generated commitment protocols in open systems", "paper_id": "WOS:000349337600002"}