{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "office_available"}, {"score": 0.00464976086880886, "phrase": "spatially-situated_humans"}, {"score": 0.00440394242852293, "phrase": "limited_sensing"}, {"score": 0.004319322238010043, "phrase": "actuating_capabilities"}, {"score": 0.003304224820203298, "phrase": "robot's_progress"}, {"score": 0.002617059777997427, "phrase": "available_human"}, {"score": 0.002566685388128598, "phrase": "close_proximity"}, {"score": 0.0024880904032564583, "phrase": "extended_model"}, {"score": 0.0023471384232499016, "phrase": "navigation_planner"}, {"score": 0.002188472974132732, "phrase": "available_helper"}], "paper_keywords": ["Human-robot interaction", " User study", " Asking for help", " Planning"], "paper_abstract": "Robots are increasingly autonomous in our environments, but they still must overcome limited sensing, reasoning, and actuating capabilities while completing services for humans. While some work has focused on robots that proactively request help from humans to reduce their limitations, the work often assumes that humans are supervising the robot and always available to help. In this work, we instead investigate the feasibility of asking for help from humans in the environment who benefit from its services. Unlike other human helpers that constantly monitor a robot's progress, humans in the environment are not supervisors and a robot must proactively navigate to them to receive help. We contribute a study that shows that several of our environment occupants are willing to help our robot, but, as expected, they have constraints that limit their availability due to their own work schedules. Interestingly, the study further shows that an available human is not always in close proximity to the robot. We present an extended model that includes the availability of humans in the environment, and demonstrate how a navigation planner can incorporate this information to plan paths that increase the likelihood that a robot can find an available helper when it needs one. Finally, we discuss further opportunities for the robot to adapt and learn from the occupants over time.", "paper_title": "Is Someone in this Office Available to Help Me? Proactively Seeking Help from Spatially-Situated Humans", "paper_id": "WOS:000300706800013"}