{"auto_keywords": [{"score": 0.03906597166738944, "phrase": "ehealth_system"}, {"score": 0.028540159828601436, "phrase": "information_systems"}, {"score": 0.00481495049065317, "phrase": "ehealth_systems"}, {"score": 0.004645057834614705, "phrase": "patient_self-care"}, {"score": 0.003105305189036267, "phrase": "self-care_activities"}, {"score": 0.0026126405272417783, "phrase": "precede-proceed_model"}, {"score": 0.0025752890978323873, "phrase": "health_promotion_planning"}, {"score": 0.0024842242921857705, "phrase": "double_adoption"}, {"score": 0.002448704249007665, "phrase": "ehealth_technology"}, {"score": 0.0023791769068748194, "phrase": "self-care_practices"}, {"score": 0.002245975340642921, "phrase": "biomedical_outcomes"}, {"score": 0.002197966048531954, "phrase": "long-term_diabetes_health"}, {"score": 0.0021049977753042253, "phrase": "important_implications"}], "paper_keywords": ["Adoption", " IT Use", " ehealth", " Internet", " Diabetes", " Education", " Attitudes", " Behavior", " Health Outcomes"], "paper_abstract": "The development, adoption, and acceptance of eHealth systems that change and improve patient self-care have been promising, but the results have been mixed and the work mostly atheoretical. In this paper, we respond to this opportunity by developing and assessing an eHealth system for newly diagnosed type 2 diabetes patients. Study participants used the eHealth system for a 12-month period after diagnosis in an attempt to acquire an understanding about their diabetes, develop self-care activities (e. g., blood glucose testing), and improve their biomedical outcomes. Drawing upon theories and methods from information systems and upon the Precede-Proceed model of health promotion planning, we explored the double adoption of eHealth technology and its antecedents, self-care practices and their antecedents, and improvements in biomedical outcomes important to long-term diabetes health. Path model results indicate important implications for information systems, eHealth, and health promotion practice and research, which are discussed.", "paper_title": "The Clinical Impact of eHealth on the Self-Management of Diabetes: A Double Adoption Perspective", "paper_id": "WOS:000294993500001"}