{"auto_keywords": [{"score": 0.040767795791582725, "phrase": "available_computation_time"}, {"score": 0.00481495049065317, "phrase": "unmanned_aerial_vehicles_for_assembly"}, {"score": 0.004549242970806199, "phrase": "new_system"}, {"score": 0.0043527164193299574, "phrase": "multiple_unmanned_aerial_vehicles"}, {"score": 0.003194580334752371, "phrase": "feasible_but_non-optimal_initial_solution"}, {"score": 0.0030563953060027175, "phrase": "particle_swarm_optimization"}, {"score": 0.0029241700853970013, "phrase": "initial_solution"}, {"score": 0.0028692628457408025, "phrase": "anytime_approach"}, {"score": 0.002833279695975458, "phrase": "pso"}, {"score": 0.0022142194702079866, "phrase": "multiple_uavs"}, {"score": 0.0021726139494880653, "phrase": "common_workspace"}, {"score": 0.0021049977753042253, "phrase": "indoor_testbed"}], "paper_keywords": ["Aerial robotics", " Trajectory planning", " Real-time applications"], "paper_abstract": "This paper presents a new system for assembly and structure construction with multiple Unmanned Aerial Vehicles (UAVs) which automatically identifies conflicts among them. The system proposes the most effective solution considering the available computation time. After detecting conflicts between UAVs, the system resolves them cooperatively using a collision-free 4D trajectory planning algorithm based on a simple one-at-a-time strategy to quickly compute a feasible but non-optimal initial solution and a stochastic optimization technique named Particle Swarm Optimization (PSO) to improve the initial solution. An anytime approach using PSO is applied. It yields trajectories whose quality improves when available computation time increases. Thus, the method could be applied in real-time depending on the available computation time. The method has been validated with simulations in scenarios with multiple UAVs in a common workspace and experiment in an indoor testbed.", "paper_title": "Collision-Free 4D Trajectory Planning in Unmanned Aerial Vehicles for Assembly and Structure Construction", "paper_id": "WOS:000329629400050"}