{"auto_keywords": [{"score": 0.047417308030815966, "phrase": "finite_field"}, {"score": 0.044513698991525505, "phrase": "multivariate_public_key_cryptosystems"}, {"score": 0.036787180918250326, "phrase": "kipnis_et_al"}, {"score": 0.00481495049065317, "phrase": "underdefined_multivariate_quadratic_equations"}, {"score": 0.0046079260641779755, "phrase": "multivariate_quadratic_equations"}, {"score": 0.00441155895238776, "phrase": "np"}, {"score": 0.0037311260623089436, "phrase": "equations_m"}, {"score": 0.003633927813203731, "phrase": "underdefined"}, {"score": 0.0025217065652145443, "phrase": "wider_applicable_range"}, {"score": 0.0022989268508282782, "phrase": "magma"}, {"score": 0.0021049977753042253, "phrase": "common_pc."}], "paper_keywords": ["multivariate public key cryptosystems (MPKCs)", " multivariate quadratic equations", " MQ-problem"], "paper_abstract": "It is well known that solving randomly chosen Multivariate Quadratic equations over a finite field (MQ-Problem) is NP-hard, and the security of Multivariate Public Key Cryptosystems (MPKCs) is based on the MQ-Problem. However, this problem can be solved efficiently when the number of unknowns n is sufficiently greater than that of equations m (This is called \"Underdefined\"). Indeed, the algorithm by Kipnis et al. (Eurocrypt'99) can solve the MQ-Problem over a finite field of even characteristic in a polynomial-time of n when n >= m(m + 1). Therefore, it is important to estimate the hardness of the MQ-Problem to evaluate the security of Multivariate Public Key Cryptosystems. We propose an algorithm in this paper that can solve the MQ-Problem in a polynomial-time of n when n >= m(m + 3)/2, which has a wider applicable range than that by Kipnis et al. We will also compare our proposed algorithm with other known algorithms. Moreover, we implemented this algorithm with Magma and solved the MQ-Problem of m = 28 and n = 504, and it takes 78.7 seconds on a common PC.", "paper_title": "Extended Algorithm for Solving Underdefined Multivariate Quadratic Equations", "paper_id": "WOS:000342738600031"}