{"auto_keywords": [{"score": 0.046081391722127725, "phrase": "asteraceae"}, {"score": 0.014471221371507156, "phrase": "plant_family"}, {"score": 0.007668476177714836, "phrase": "plant_sources"}, {"score": 0.00481495049065317, "phrase": "plaint_source"}, {"score": 0.004656557209439822, "phrase": "classification_model"}, {"score": 0.00447331713604276, "phrase": "exactly_one_tribe"}, {"score": 0.004355168986323418, "phrase": "stl"}, {"score": 0.004155822339559211, "phrase": "peculiar_compounds"}, {"score": 0.0034223147241452547, "phrase": "general_overview"}, {"score": 0.003343007152920687, "phrase": "multilabeled_data"}, {"score": 0.0032328778271536454, "phrase": "multilabeled_classifier"}, {"score": 0.003126365132352301, "phrase": "support_vector_machines"}, {"score": 0.002865521839875839, "phrase": "seven_tribes"}, {"score": 0.0027525658515943985, "phrase": "single-label_classification"}, {"score": 0.0026977641744883826, "phrase": "chemotaxonomic_point"}, {"score": 0.00265292826903791, "phrase": "multilabeled_approach"}, {"score": 0.0024396547357855777, "phrase": "secondary_metabolite_profiles"}, {"score": 0.00242335068996852, "phrase": "different_asteraceae_tribes"}, {"score": 0.0022661710658109916, "phrase": "presented_classification_models"}, {"score": 0.0022284920601703595, "phrase": "targeted_collection"}, {"score": 0.0021549990311897347, "phrase": "natural_compounds"}], "paper_keywords": [""], "paper_abstract": "Recently, we have built a classification model that is capable of assigning a given sesquiterpene lactone (STL) into exactly one tribe of the plant family Asteraceae from which the STL has been isolated. Although many plant species are able to biosynthesize a set of peculiar compounds, the occurrence of the same secondary metabolites in more than one tribe of Asteraceae is frequent. Building on our previous work, in this paper, we explore the possibility of assigning an STL to more than one tribe (class) simultaneously. When an object may belong to more than one class simultaneously, it is called multilabeled. In this work, we present a general overview of the techniques available to examine multilabeled data. The problem of evaluating the performance of a multilabeled classifier is discussed. Two particular multilabeled classification methods-cross-training with support vector machines (ct-SVM) and multilabeled k-nearest neighbors (M-L-kNN)were applied to the classification of the STLs into seven tribes from the plant family Asteraceae. The results are compared to a single-label classification and are analyzed from a chemotaxonomic point of view. The multilabeled approach allowed us to (1) model the reality as closely as possible, (2) improve our understanding of the relationship between the secondary metabolite profiles of different Asteraceae tribes, and (3) significantly decrease the number of plant sources to be considered for finding a certain STL. The presented classification models are useful for the targeted collection of plants with the objective of finding plant sources of natural compounds that are biologically active or possess other specific properties of interest.", "paper_title": "Multilabeled classification approach to find a plaint source for terpenoids", "paper_id": "WOS:000252713700005"}