{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_assistance"}, {"score": 0.004762202897268383, "phrase": "semiliterate_users'_perspective"}, {"score": 0.004684157900507474, "phrase": "computer-based_systems"}, {"score": 0.004506968388996092, "phrase": "increasing_number"}, {"score": 0.004457579615095599, "phrase": "illiterate_and_semiliterate_people"}, {"score": 0.004014452814186653, "phrase": "one's_day-to-day_life"}, {"score": 0.003757480190200645, "phrase": "government_services"}, {"score": 0.0036958398682001015, "phrase": "medical_information"}, {"score": 0.003555902292752528, "phrase": "current_events"}, {"score": 0.0031845067058084583, "phrase": "user_interfaces"}, {"score": 0.003030247482854539, "phrase": "online_services"}, {"score": 0.0027437235598539904, "phrase": "online_internship_application"}, {"score": 0.0026543514413663893, "phrase": "low_literacy_skills"}, {"score": 0.0025537472239953807, "phrase": "online_task"}, {"score": 0.0023900527169254744, "phrase": "semiliterate_users'_performance"}, {"score": 0.002261666793030715, "phrase": "completed_tasks"}, {"score": 0.002175913488493802, "phrase": "statistical_analysis"}, {"score": 0.0021401625519713577, "phrase": "system_usability_scale"}], "paper_keywords": [""], "paper_abstract": "As computer-based systems proliferate around the world, an increasing number of illiterate and semiliterate people come into contact with systems they do not understand. Unfortunately, these systems are increasingly important in one's day-to-day life be it seeking employment through online applications, applying and receiving government services, seeking medical information, or simply becoming aware of current events. With more than 774 million people classified as illiterate or semiliterate, there is a need to better understand how to design user interfaces to allow this group of individuals access to online services. This article presents a study contrasting four different interface design styles providing online assistance for the task of completing an online internship application. One hundred eighty subjects in the Republic of Rwanda with low literacy skills were divided into four different groups to complete online task by using one of these interfaces. The results show that semiliterate users' performance using the online assistance improved significantly and the percentage of completed tasks increased from 52% to 94%. Statistical analysis of the System Usability Scale indicates that their average subjective usability score boosted from 39 to 80 using the online assistance.", "paper_title": "Usability of Online Assistance From Semiliterate Users' Perspective", "paper_id": "WOS:000346194300005"}