{"auto_keywords": [{"score": 0.044354059535372664, "phrase": "social_constructionism"}, {"score": 0.03245716955912308, "phrase": "policy_makers"}, {"score": 0.00481495049065317, "phrase": "multi-ontological_endeavour"}, {"score": 0.004679132750290931, "phrase": "healthcare"}, {"score": 0.004565609517511076, "phrase": "researchers'_different_ontological_and_epistemological_assumptions"}, {"score": 0.004329124434198367, "phrase": "critical_realism"}, {"score": 0.0041725881174377345, "phrase": "philosophical_approaches"}, {"score": 0.004054745478848129, "phrase": "multi-ontological_evaluation"}, {"score": 0.003797690272118125, "phrase": "national_implementation_program"}, {"score": 0.0037667216301666196, "phrase": "electronic_health_records"}, {"score": 0.0030317376771013703, "phrase": "cr_philosophy"}, {"score": 0.002994701080666466, "phrase": "evaluation_research"}, {"score": 0.0024700078414481297, "phrase": "valuable_evaluative_insight"}, {"score": 0.002294294558114909, "phrase": "jointly_useful_knowledge"}, {"score": 0.0022111720236287547, "phrase": "multi-ontological_evaluation_approaches"}, {"score": 0.0021049977753042253, "phrase": "mutual_respect"}], "paper_keywords": ["Evaluation", " Information Systems", " Ontology", " Epistemology", " Critical Realism", " Social Constructionism", " Health Care", " Programs of Change"], "paper_abstract": "This paper analyzes how researchers' different ontological and epistemological assumptions shape the process and outcomes of evaluation research. Focusing on the critical realism (CR) and social constructionism (SC) philosophical approaches, it outlines the rationale for multi-ontological evaluation and develops principles for conducting it. The paper draws from experience of evaluating a national implementation program of electronic health records in hospitals, one of the projects of the English National Programme for IT. It argues that an evaluation based on SC and one based on CR are significantly different in how they use knowledge gained in the field, and in the kind of evidence and recommendations that they can offer policy makers. The CR philosophy applied to evaluation research provides foundations from which judgments and abstractions can be presented in the form expected by the policy makers and managers who commission evaluations. In line with its ontological standing, social constructionism cannot simply or directly abstract and generalize across contexts, though it can offer other types of valuable evaluative insight. We show that, despite their differences, these two philosophical positions can, when taken together, produce jointly useful knowledge. This paper argues for the use of multi-ontological evaluation approaches and provides guidelines for undertaking such endeavors by emphasizing the need for mutual respect, dialogue, negotiation, and reflection.", "paper_title": "Evaluation as a Multi-Ontological Endeavour: A Case from the English National Program for IT in Healthcare", "paper_id": "WOS:000334580400002"}