{"auto_keywords": [{"score": 0.04258499561350143, "phrase": "bayesian_problems"}, {"score": 0.0338521014368805, "phrase": "classic_mammography_problem"}, {"score": 0.00445332728705756, "phrase": "probabilistic_reasoning"}, {"score": 0.004424441580112395, "phrase": "previous_studies"}, {"score": 0.004296747096249343, "phrase": "bayesian_inference"}, {"score": 0.0042550030421781605, "phrase": "probabilistic_problems"}, {"score": 0.004092026656771699, "phrase": "decision_making"}, {"score": 0.004039094712469991, "phrase": "previous_work"}, {"score": 0.003973887756331297, "phrase": "textual_description"}, {"score": 0.0036513416285175763, "phrase": "effective_technique"}, {"score": 0.003477264432055326, "phrase": "experimental_conditions"}, {"score": 0.0031535341431377837, "phrase": "problem_structure"}, {"score": 0.00307240091019322, "phrase": "nested-set_relations"}, {"score": 0.002906836691319759, "phrase": "structure_types"}, {"score": 0.002813633198636833, "phrase": "text-only_baseline_condition"}, {"score": 0.0027862576750944277, "phrase": "text-legend_condition"}, {"score": 0.0027591477674456227, "phrase": "nested-set_problem_values"}, {"score": 0.0026274936167233515, "phrase": "seven_hundred_participants"}, {"score": 0.0026019244311765964, "phrase": "seven_conditions"}, {"score": 0.0025515282069418286, "phrase": "crowdsourcing_system"}, {"score": 0.0025266963982350523, "phrase": "micro-interaction_data"}, {"score": 0.0024456516553345966, "phrase": "user_input"}, {"score": 0.002232261129770455, "phrase": "static_visualizations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bayesian reasoning", " Decision making", " Comparability criteria", " Visualization", " Crowdsourcing", " Mammography Problem"], "paper_abstract": "Trying to make a decision between two outcomes, when there is some level of uncertainty, is inherently difficult because it involves probabilistic reasoning. Previous studies have shown that most people do not correctly apply Bayesian inference to solve probabilistic problems for decision making under uncertainty. In an effort to improve decision making with Bayesian problems, previous work has studied supplementing the textual description of problems with visualizations, such as graphs and charts. However, results have been varied and generally indicate that visualization is not an effective technique. As these studies were performed over many years with a variety of goals and experimental conditions, we sought to re-evaluate the use of visualization as an aid in solving Bayesian problems. Many of these studies used the classic Mammography Problem with visualizations portraying the problem structure, the quantities involved, or the nested-set relations of the populations involved. We selected three representative visualizations from this work and developed two hybrid visualizations, combining structure types and frequency with structure. We also included a text-only baseline condition and a text-legend condition where all nested-set problem values were given to eliminate the need for participants to estimate or calculate values. Seven hundred participants evaluated these seven conditions on the classic Mammography Problem in a crowdsourcing system, where micro-interaction data was collected from the participants. Our analysis of the user input and of the results indicates that participants made use of the visualizations but that the visualizations did not help participants to perform more accurately. Overall, static visualizations do not seem to aid a majority of people in solving the Mammography Problem. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Benefits of visualization in the Mammography Problem", "paper_id": "WOS:000361582500008"}