{"auto_keywords": [{"score": 0.03947447987613366, "phrase": "ocdma"}, {"score": 0.008333004606454367, "phrase": "communication_systems"}, {"score": 0.004647442352794694, "phrase": "successful_introduction"}, {"score": 0.0045820747375409435, "phrase": "data_networks"}, {"score": 0.004454072533034678, "phrase": "comprehensive_review"}, {"score": 0.004401794742140806, "phrase": "optical_orthogonal_codes"}, {"score": 0.004309229446929411, "phrase": "recently_developed_algorithms"}, {"score": 0.004258644418211771, "phrase": "matrix_algebra"}, {"score": 0.004149429072483132, "phrase": "ooc_generation"}, {"score": 0.004120130206000757, "phrase": "communication_systems_studies"}, {"score": 0.004014452814186653, "phrase": "incoherent_and_coherent_ocdma."}, {"score": 0.003939296259436904, "phrase": "important_aspects"}, {"score": 0.0039114753002009485, "phrase": "ocdma_technique"}, {"score": 0.0037752790801023305, "phrase": "full_scale_consideration"}, {"score": 0.0037133478610481994, "phrase": "incoherent_ocdma"}, {"score": 0.003459191419478298, "phrase": "recently_introduced_powerful_receiver_structure"}, {"score": 0.0034347494693326088, "phrase": "optical_and_logic_gate_elements"}, {"score": 0.0033943947596098583, "phrase": "receiver_structure"}, {"score": 0.0033150974333333214, "phrase": "cross-correlation_value"}, {"score": 0.0031396507967698115, "phrase": "architectural_consideration"}, {"score": 0.0031248392333206297, "phrase": "multiple_amplifiers"}, {"score": 0.0030881143614111552, "phrase": "advanced_signaling_methods"}, {"score": 0.0030590445140753187, "phrase": "pulse_position_modulation"}, {"score": 0.003015950477134494, "phrase": "coherent_ocdma"}, {"score": 0.002917736974519881, "phrase": "indepth_discussion"}, {"score": 0.0028360962841331634, "phrase": "successful_implementation"}, {"score": 0.002776364229179074, "phrase": "encoder-decoder_side"}, {"score": 0.002724323141343469, "phrase": "virtually_imaged_pulsed_array"}, {"score": 0.002711465591187757, "phrase": "fiber_bragg_gratings"}, {"score": 0.0026922926476971453, "phrase": "arrayed_waveguide_gratings"}, {"score": 0.00266693888510356, "phrase": "receiver_side"}, {"score": 0.0025861722388116383, "phrase": "analytical_framework"}, {"score": 0.002437645786158106, "phrase": "wireless_ocdma_lan"}, {"score": 0.002201814127222572, "phrase": "inseparable_part"}, {"score": 0.0021914171600969615, "phrase": "advanced_optical_communication_systems"}, {"score": 0.0021049998913725996, "phrase": "america"}], "paper_keywords": [""], "paper_abstract": "I present an in-depth review of the trends and the directions taken by researchers worldwide in optical code-division multiple-access (OCDMA) systems. I highlight those trends and features that I believe are essential to the successful introduction of various OCDMA techniques in communication systems and data networks in the near future. In particular I begin by giving a comprehensive review of the construction of optical orthogonal codes (OOCs). Specifically I discuss the recently developed algorithms that are based on matrix algebra, which simplify and enhance the efficiencies of algorithms in OOC generation. In communication systems studies I first focus on and discuss various OCDMA techniques, such as incoherent and coherent OCDMA. A comprehensive discussion takes place on all important aspects of each OCDMA technique. In particular, I elaborate on enabling technologies that are needed prior to full scale consideration of OCDMA in communication systems. For incoherent OCDMA the technique is categorized into two distinguished techniques, namely, 1D and 2D OCDMA. For each technique I discuss the various receiver structures proposed to date. In particular I discuss a recently introduced powerful receiver structure based on optical AND logic gate elements. Based on this receiver structure I conclude that in many practical applications, OOCs with a cross-correlation value lambda equal to 2 or 3, which have a much larger cardinality compared to OOCs with lambda=1, perform much better. Many fundamental issues, including architectural consideration of multiple amplifiers, various acquisition algorithms, and advanced signaling methods, such as pulse position modulation, are discussed. For coherent OCDMA or spectrally encoded ultrashort light pulse OCDMA, I begin by having an indepth discussion on the key and enabling technologies that are essential in the successful implementation of this very important and extremely powerful technique. In particular on the encoder-decoder side I present discussions on various key device technologies such as virtually imaged pulsed array, fiber Bragg gratings, and arrayed waveguide gratings. On the receiver side I elaborate on various nonlinear detection schemes used in such OCDMA networks. I will present an analytical framework on the above nonlinear detection schemes and discuss their pros and cons. I extend the discussion to various data networks. In particular I will discuss applications such as wireless OCDMA LAN, free-space OCDMA, fiber-to-the-home, and other code-division-multiple-access-based packet communication networks using label addressing and processing techniques to indicate the directions and the applications for which OCDMA systems are considered. It is believed that in the not so distant future OCDMA, once fully developed and matured, will be an inseparable part of advanced optical communication systems and networks, due to its various desirable features and functionalities. (C) 2007 Optical Society of America.", "paper_title": "Emerging OCDMA communication systems and data networks [Invited]", "paper_id": "WOS:000250006300007"}