{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "ordinal_information"}, {"score": 0.04671870192794836, "phrase": "gdm_models"}, {"score": 0.01373700613796122, "phrase": "ordinal_preferences"}, {"score": 0.013093207344338758, "phrase": "conflicting_opinions"}, {"score": 0.004771435352180973, "phrase": "group_decision"}, {"score": 0.004657299036322549, "phrase": "corivenient_way"}, {"score": 0.004587348052298537, "phrase": "decision_makers"}, {"score": 0.003942877273973905, "phrase": "large_number"}, {"score": 0.0036222340564869625, "phrase": "equal_importance"}, {"score": 0.0035677736570659813, "phrase": "aggregated_collective_preference"}, {"score": 0.003492897128445075, "phrase": "group's_decision"}, {"score": 0.003388639163205525, "phrase": "two-stage_dynamic_group_decision"}, {"score": 0.0030291453183733897, "phrase": "collective_decision"}, {"score": 0.0029926343123778056, "phrase": "aggregation_process"}, {"score": 0.002938688858078236, "phrase": "large-scale_gdm_problems"}, {"score": 0.0025560719383290356, "phrase": "new_support_function"}, {"score": 0.002532919466975052, "phrase": "pa_operator"}, {"score": 0.0024572448003065423, "phrase": "dominance-based_rough_set_approach"}, {"score": 0.0023622296334998324, "phrase": "herrera-viedma_et_al"}, {"score": 0.0022847009758393405, "phrase": "hydrographic_basin"}, {"score": 0.0022503309768594597, "phrase": "brazil"}, {"score": 0.0021764417172328307, "phrase": "proposed_method"}, {"score": 0.0021567204376536503, "phrase": "gdm_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Power Average operator", " Support function", " Dominance-based rough set approach", " Ordinal preference", " Group decision making"], "paper_abstract": "In group decision making (GDM) problems, ordinal data provide a corivenient way of articulating preferences from decision makers (DMs). A number of GDM models have been proposed to aggregate such kind of preferences in the literature. However, most of the GDM models that handle ordinal preferences suffer from two drawbacks: (1) it is difficult for the GDM models to manage conflicting opinions, especially with a large number of DMs; and (2) the relationships between the preferences provided by the DMs are neglected, and all DMs are assumed to be of equal importance, therefore causing the aggregated collective preference not an ideal representative of the group's decision. In order to overcome these problems, a two-stage dynamic group decision making method for aggregating ordinal preferences is proposed in this paper. The method consists of two main processes: (i) a data cleansing process, which aims to reduce the influence of conflicting opinions pertaining to the collective decision prior to the aggregation process; as such an effective solution for undertaking large-scale GDM problems is formulated; and (ii) a support degree oriented consensus-reaching process, where the collective preference is aggregated by using the Power Average (PA) operator; as such, the relationships of the arguments being aggregated are taken into consideration (i.e., allowing the values being aggregated to support each other). A new support function for the PA operator to deal with ordinal information is defined based on the dominance-based rough set approach. The proposed GDM model is compared with the models presented by Herrera-Viedma et al. An application related to controlling the degradation of the hydrographic basin of a river in Brazil is evaluated. The results demonstrate the usefulness of the proposed method in handling GDM problems with ordinal information. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A two-stage dynamic group decision making method for processing ordinal information", "paper_id": "WOS:000344209100019"}