{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiclass_classification_problems"}, {"score": 0.04568107674629595, "phrase": "multiclass_problems"}, {"score": 0.004229158339021651, "phrase": "binary_problems"}, {"score": 0.004188702178897384, "phrase": "recent_work"}, {"score": 0.004148631410346188, "phrase": "important_advantages"}, {"score": 0.0033575566897536906, "phrase": "binary_words"}, {"score": 0.0030058503645435455, "phrase": "specific_constraints"}, {"score": 0.002977061391551631, "phrase": "different_dimensions"}, {"score": 0.0024914135653274112, "phrase": "ecoc"}, {"score": 0.002432152706473349, "phrase": "good_trade-off"}, {"score": 0.0023743009016047424, "phrase": "correction_capacity"}, {"score": 0.002273605493468005, "phrase": "proposed_methods"}, {"score": 0.002198242191529979, "phrase": "benchmark_classification_problems"}, {"score": 0.0021771713131746636, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "Several classification problems involve more than two classes. These problems are known as multiclass classification problems. One of the approaches to deal with multiclass problems is their decomposition into a set of binary problems. Recent work shows important advantages related with this approach. Several strategies have been proposed for this decomposition. The strategies most frequently used are All-vs-All, One-vs-All and Error Correction Output Codes (ECOC). ECOCs are based on binary words (codewords) and have been adapted to deal with multiclass problems. For such, they must comply with a number of specific constraints. Different dimensions may be adopted for the codewords for each number of classes in the problem. These dimensions grow exponentially with the number of classes present in a dataset. Two methods to choose the dimension of a ECOC, which assure a good trade-off between redundancy and error correction capacity, are proposed in this paper. The proposed methods are evaluated in a set of benchmark classification problems. Experimental results show that they are competitive with other multiclass decomposition methods.", "paper_title": "The dimension of ECOCs for multiclass classification problems", "paper_id": "WOS:000257762200003"}