{"auto_keywords": [{"score": 0.044476153128415616, "phrase": "partition_oracle"}, {"score": 0.015297261702605463, "phrase": "excluded_minor"}, {"score": 0.00481495049065317, "phrase": "quasi-polynomial_time_partition"}, {"score": 0.004473982381245469, "phrase": "related_properties"}, {"score": 0.004312622975366676, "phrase": "efficient_partition_oracles"}, {"score": 0.004062682236016889, "phrase": "incidence_lists"}, {"score": 0.003988719758707836, "phrase": "bounded-degree_graph"}, {"score": 0.0037060428445111664, "phrase": "vertex_v"}, {"score": 0.0033190180867511605, "phrase": "graph_vertices"}, {"score": 0.002945081009084692, "phrase": "total_number"}, {"score": 0.0026986685585382347, "phrase": "excluded_minors"}, {"score": 0.002530359917257626, "phrase": "hassidim_et_al"}, {"score": 0.0023725232579531273, "phrase": "query_complexity"}, {"score": 0.002286781334850213, "phrase": "corresponding_improvements"}, {"score": 0.0021049977753042253, "phrase": "sublinear-time_approximation_algorithms"}], "paper_keywords": ["Planarity", " minor-free", " property testing", " partition oracle"], "paper_abstract": "Motivated by the problem of testing planarity and related properties, we study the problem of designing efficient partition oracles. A partition oracle is a procedure that, given access to the incidence lists representation of a bounded-degree graph G = (V, E) and a parameter epsilon, when queried on a vertex v is an element of V, returns the part (subset of vertices) that v belongs to in a partition of all graph vertices. The partition should be such that all parts are small, each part is connected, and if the graph has certain properties, the total number of edges between parts is at most epsilon vertical bar V vertical bar. In this work, we give a partition oracle for graphs with excluded minors whose query complexity is quasi-polynomial in 1/epsilon, improving on the result of Hassidim et al. (Proceedings of FOCS 2009), who gave a partition oracle with query complexity exponential in 1/epsilon. This improvement implies corresponding improvements in the complexity of testing planarity and other properties that are characterized by excluded minors as well as sublinear-time approximation algorithms that work under the promise that the graph has an excluded minor.", "paper_title": "A Quasi-Polynomial Time Partition Oracle for Graphs with an Excluded Minor", "paper_id": "WOS:000348204800009"}