{"auto_keywords": [{"score": 0.03473184552256374, "phrase": "toe"}, {"score": 0.031319265692468734, "phrase": "general_gigabit_ethernet_adapters"}, {"score": 0.01571969052852879, "phrase": "tcp_offload_engine"}, {"score": 0.0043506951029334984, "phrase": "hybrid_architecture"}, {"score": 0.004032002950217453, "phrase": "transmission_and_reception_paths"}, {"score": 0.0037746771370555546, "phrase": "data_transmission"}, {"score": 0.00355174968421371, "phrase": "fpga"}, {"score": 0.0033588449972778004, "phrase": "gigabit_ethernet"}, {"score": 0.0032415934630668484, "phrase": "minimum_latency"}, {"score": 0.0031603487697867538, "phrase": "cpu_utilization"}, {"score": 0.0029137604783116065, "phrase": "maximum_unidirectional_bandwidth"}, {"score": 0.002672750634553146, "phrase": "embedded_processors"}, {"score": 0.002618995204424126, "phrase": "clock_speed"}, {"score": 0.0024766728336622443, "phrase": "cpu."}, {"score": 0.0021373366163721518, "phrase": "experimental_toe_implementation"}], "paper_keywords": ["TCP offload engine", " hardware/software co-design", " embedded system", " embedded processor", " FPGA", " gigabit Ethernet"], "paper_abstract": "To achieve both the flexibility of software and the performance of hardware, we design a hybrid architecture for a TCP offload engine that is based on hardware/software co-design. In this architecture, the transmission and reception paths of TCP/IP are completely separated with the aid of two general embedded processors to process data transmission and reception simultaneously. We implement this architecture based on an FPGA that has two general embedded processor cores. In the experiments based on the gigabit Ethernet, the hybrid TOE has a minimum latency of 13.5 mu s. The CPU utilization is less than 3%, which is at least eighteen times lower than that of the general gigabit Ethernet adapters. The maximum unidirectional bandwidth of the hybrid TOE is 110 MB/s - comparable to that of the general gigabit Ethernet adapters although the embedded processors operate with a clock speed that is seven times lower than that of the host CPU. By using two embedded processors, the bidirectional bandwidth of the hybrid TOE improves to about 201 MB/s, comparable to that of the general gigabit Ethernet adapters, and a 34% improvement over an experimental TOE implementation in which only one embedded processor is used.", "paper_title": "An Efficient Architecture for a TCP Offload Engine Based on Hardware/Software Co-design", "paper_id": "WOS:000289122300007"}