{"auto_keywords": [{"score": 0.047101242106795636, "phrase": "new_fuzzy_model"}, {"score": 0.045084994333620905, "phrase": "nonlinear_terms"}, {"score": 0.04373175210707356, "phrase": "lyapunov"}, {"score": 0.003832031470970347, "phrase": "new_model"}, {"score": 0.0037454814403672697, "phrase": "fuzzy_rules"}, {"score": 0.003711409222544974, "phrase": "chaotic_systems"}, {"score": 0.0033410898465226417, "phrase": "fuzzy_systems"}, {"score": 0.0031483163191080425, "phrase": "new_fuzzy_systems"}, {"score": 0.0030076088903023034, "phrase": "nonlinear_systems"}, {"score": 0.0028210902750714075, "phrase": "fuzzy_logic_control"}, {"score": 0.0027954035431845344, "phrase": "fuzzy_modeling"}, {"score": 0.002769950045729965, "phrase": "mathieu-van_der_pol_system"}, {"score": 0.0025981315738078793, "phrase": "quantum_cellular_neural_networks"}, {"score": 0.0023818288346547692, "phrase": "numerical_simulation_results"}, {"score": 0.0021049977753042253, "phrase": "appendices_b"}], "paper_keywords": ["New fuzzy model", " New control Lyapunov function", " New pragmatical adaptive method", " Mathieu-Van der Pol system"], "paper_abstract": "In this paper, (1) a new fuzzy model is presented to simulate two different chaotic systems with different numbers of nonlinear terms and (2) a new adaptive approach and a new control Lyapunov function are proposed to synchronize these two different fuzzy chaotic systems and speed up the convergence of errors. By using this new model, the numbers of fuzzy rules of chaotic systems can be reduced from 2(N) to 2 x N and only 2 subsystems are needed, where N is the number of nonlinear terms. The fuzzy systems become much simpler. In addition, through the new fuzzy model, the new fuzzy systems are much simpler than T-S fuzzy systems (when nonlinear systems are complicated) and can be used to any other kind of application in fuzzy logic control or fuzzy modeling. Mathieu-Van der Pol system (which is called M-V system in this paper) and Quantum cellular neural networks nanosystem (which is called Q-CNN system in this paper) are used for illustrations in numerical simulation results to show the effectiveness and feasibility of our new adaptive approach and new control Lyapunov function. The T-S fuzzy modeling and traditional adaptive control are also given in Appendices B and C for comparison. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Pragmatical adaptive synchronization - New fuzzy model of two different and complex chaotic systems by new adaptive control", "paper_id": "WOS:000338390200030"}