{"auto_keywords": [{"score": 0.04916281891691644, "phrase": "labor_economics"}, {"score": 0.015719716506582538, "phrase": "early_research_performance"}, {"score": 0.015570195150470619, "phrase": "phd_graduates"}, {"score": 0.01527624408155392, "phrase": "europe"}, {"score": 0.004610092000959726, "phrase": "usa."}, {"score": 0.004246428036409373, "phrase": "major_productivity_differences"}, {"score": 0.004165105357908494, "phrase": "american_and_european_institutions"}, {"score": 0.003637669525737665, "phrase": "subsequent_job_placement_institution"}, {"score": 0.003482726806175435, "phrase": "phd"}, {"score": 0.003131023880006021, "phrase": "quality-adjusted_number"}, {"score": 0.0028421434495262796, "phrase": "higher_productivity"}, {"score": 0.0027876387169652717, "phrase": "european_universities"}, {"score": 0.0027474453262607834, "phrase": "usa_universities"}, {"score": 0.0024578987081792405, "phrase": "american_institutions"}, {"score": 0.0024224481033945943, "phrase": "particular_top_ones"}, {"score": 0.0023191613509609492, "phrase": "european"}, {"score": 0.0021049977753042253, "phrase": "clearer_career_incentives"}], "paper_keywords": ["Research productivity", " Graduate programs", " Publication analysis"], "paper_abstract": "This paper analyzes the early research performance of PhD graduates in labor economics, addressing the following questions: Are there major productivity differences between graduates from American and European institutions? If so, how relevant is the quality of the training received (i.e. ranking of institution and supervisor) and the research environment in the subsequent job placement institution? The population under study consists of labor economics PhD graduates who received their degree in the years 2000-2005 in Europe or the USA. Research productivity is evaluated alternatively as the number of publications or the quality-adjusted number of publications of an individual. When restricting the analysis to the number of publications, results suggest a higher productivity by graduates from European universities than from USA universities, but this difference vanishes when accounting for the quality of the publication. The results also indicate that graduates placed at American institutions, in particular top ones, are likely to publish more quality-adjusted articles than their European counterparts. This may be because, when hired, they already have several good acceptances or because of more focused research efforts and clearer career incentives.", "paper_title": "Comparing the early research performance of PhD graduates in labor economics in Europe and the USA", "paper_id": "WOS:000280274400005"}