{"auto_keywords": [{"score": 0.023723253915005814, "phrase": "bioinformatics"}, {"score": 0.00481495049065317, "phrase": "rna_virus_bioinformatics"}, {"score": 0.004459605573798577, "phrase": "neglected_area"}, {"score": 0.004273601449537163, "phrase": "interesting_and_challenging_field"}, {"score": 0.0036191240628152205, "phrase": "bioinformatics_communities"}, {"score": 0.0029871209444889716, "phrase": "bioinformatics_researchers"}, {"score": 0.0029491324941225356, "phrase": "pressing_needs"}, {"score": 0.002924074850256874, "phrase": "unsolved_problems"}, {"score": 0.0028992294924613327, "phrase": "computational_virology"}, {"score": 0.002825949329865926, "phrase": "rna_viruses"}, {"score": 0.0027078974645805736, "phrase": "fast_mutation_rate"}, {"score": 0.00268488398249084, "phrase": "low_evolutionary_conservation"}, {"score": 0.002550842302473891, "phrase": "viral_sequencing_data"}, {"score": 0.0025183881730011597, "phrase": "functionally_important_rna_structures"}, {"score": 0.0024863459251358217, "phrase": "viral_proteins"}, {"score": 0.0022828795331819025, "phrase": "supplementary_information"}, {"score": 0.0022634699331607615, "phrase": "supplementary_data"}, {"score": 0.0021049977753042253, "phrase": "supplementary_material"}], "paper_keywords": [""], "paper_abstract": "Motivation: Computer-assisted studies of structure, function and evolution of viruses remains a neglected area of research. The attention of bioinformaticians to this interesting and challenging field is far from commensurate with its medical and biotechnological importance. It is telling that out of4200 talks held at ISMB 2013, the largest international bioinformatics conference, only one presentation explicitly dealt with viruses. In contrast to many broad, established and wellorganized bioinformatics communities (e. g. structural genomics, ontologies, next-generation sequencing, expression analysis), research groups focusing on viruses can probably be counted on the fingers of two hands. Results: The purpose of this review is to increase awareness among bioinformatics researchers about the pressing needs and unsolved problems of computational virology. We focus primarily on RNA viruses that pose problems to many standard bioinformatics analyses owing to their compact genome organization, fast mutation rate and low evolutionary conservation. We provide an overview of tools and algorithms for handling viral sequencing data, detecting functionally important RNA structures, classifying viral proteins into families and investigating the origin and evolution of viruses. Contact: manja@ uni-jena. de Supplementary information: Supplementary data are available at Bioinformatics online. The references for this article can be found in the Supplementary Material.", "paper_title": "Challenges in RNA virus bioinformatics", "paper_id": "WOS:000339121900001"}