{"auto_keywords": [{"score": 0.036882615380165996, "phrase": "query_model"}, {"score": 0.01557276120808942, "phrase": "class_information"}, {"score": 0.011307070300791682, "phrase": "target_model"}, {"score": 0.00481495049065317, "phrase": "hybrid_features"}, {"score": 0.004657542074154025, "phrase": "retrieval_performance"}, {"score": 0.004136044939878838, "phrase": "existing_class_information"}, {"score": 0.0038332390893263844, "phrase": "different_aspects"}, {"score": 0.0032766780632972363, "phrase": "integrated_distance"}, {"score": 0.0028274947390686768, "phrase": "cbr"}, {"score": 0.002696101728474703, "phrase": "shape_descriptors"}, {"score": 0.0021049977753042253, "phrase": "commonly_used_performance_metrics"}], "paper_keywords": ["3D model retrieval", " Hybrid shape descriptor", " Class information", " Integrated distance"], "paper_abstract": "To improve the retrieval performance on a classified 3D model database, we propose a 3D model retrieval algorithm based on a hybrid 3D shape descriptor ZFDR and a class-based retrieval approach CBR utilizing the existing class information of the database. The hybrid 3D shape descriptor ZFDR comprises four features, depicting a 3D model from different aspects and it itself is already comparable to or better than several related shape descriptors. To compute the distance between a query model and a target model within a class of a database, we define an integrated distance metric which takes into account the class information. It scales the distance between the query model and the target model according to the distance between the query model and the class. Our class-based retrieval approach CBR is general, it can be used with any shape descriptors to improve their retrieval performance. Extensive generic and partial 3D model retrieval experiments on seven standard databases demonstrate that after we employ CBR, the retrieval performance of our algorithm CBR-ZFDR is evidently improved and the result is better than that achieved by the state-of-the-art method on each database in terms of most of the commonly used performance metrics.", "paper_title": "3D model retrieval using hybrid features and class information", "paper_id": "WOS:000314715500013"}