{"auto_keywords": [{"score": 0.041346674528199574, "phrase": "it-enabled_practices"}, {"score": 0.00481495049065317, "phrase": "new_market_opportunities"}, {"score": 0.004611369021812453, "phrase": "firm's_existing_niches"}, {"score": 0.00441635700580562, "phrase": "today's_competitive_marketplace"}, {"score": 0.00427550604912774, "phrase": "relatively_limited_research"}, {"score": 0.0036950408193035284, "phrase": "practice_perspective"}, {"score": 0.00342568771304873, "phrase": "particular_site"}, {"score": 0.0028968858148006823, "phrase": "on-going_praxis"}, {"score": 0.0027592065435732955, "phrase": "case_study"}, {"score": 0.0026281338360944436, "phrase": "china"}, {"score": 0.002436289099444074, "phrase": "useful_conceptual_lens"}, {"score": 0.0021745003291048356, "phrase": "ambidexterity_capability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ambidexterity", " Strategy-as-practice", " Site", " Information systems strategy", " Case study"], "paper_abstract": "Ambidexterity, defined as the capability to simultaneously explore knowledge to identify new market opportunities and exploit knowledge to capitalise on a firm's existing niches, is considered to be crucial in today's competitive marketplace. However, there is relatively limited research on how such a capability can be developed, and even less on the role of IT-enabled practices in promoting this. Drawing on the strategy-as-practice perspective, we investigate how interrelationships amongst practitioners, IT-enabled practices and praxis create a particular site of practice. More importantly, we consider how a site gets shifted over time through the emergence of changes in the interrelationships between IT-enabled practices and practitioners, stimulated by on-going praxis. Building on the findings derived from a case study of DaM,(1) the leading ticketing company in China, we explain how the phenomenon of site-shifting can provide a useful conceptual lens for explaining ambidexterity. In doing this, we bring to the fore the importance of IT in achieving an ambidexterity capability. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Site-shifting as the source of ambidexterity: Empirical insights from the field of ticketing", "paper_id": "WOS:000335546600003"}