{"auto_keywords": [{"score": 0.04904947763914552, "phrase": "tensor_products"}, {"score": 0.029420333683948783, "phrase": "previous_works"}, {"score": 0.00481495049065317, "phrase": "rectangle_method"}, {"score": 0.004210656614914171, "phrase": "product_r_circle_times"}, {"score": 0.004060718465754644, "phrase": "matrix_m"}, {"score": 0.0036685954616674406, "phrase": "ben-sasson"}, {"score": 0.0036420915228317207, "phrase": "sudan"}, {"score": 0.0029830992938695033, "phrase": "precise_characterization"}, {"score": 0.0028045585284215044, "phrase": "common_theme"}, {"score": 0.002239103860494545, "phrase": "tensor_product"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Theory of computation", " Locally testable codes", " LTC", " Robustness", " Robust", " Tensor product", " Product code"], "paper_abstract": "Given two codes R and C, their tensor product R circle times C consists of all matrices whose rows are codewords of R and whose columns are codewords of C. The product R circle times C is said to be robust if for every matrix M that is far from R circle times C it holds that the rows and columns of M are far on average from R and C respectively. Ben-Sasson and Sudan (RSA 28 (4) (2006)) have asked under which conditions the product R circle times C is robust. So far, a few important families of tensor products were shown to be robust, and a counter-example of a product that is not robust was also given. However, a precise characterization of codes whose tensor product is robust is yet unknown. In this work, we highlight a common theme in the previous works on the subject, which we call \"the rectangle method\". In short, we observe that all proofs of robustness in the previous works are done by constructing a certain \"rectangle\", while in the counter-example no such rectangle can be constructed. We then show that a rectangle can be constructed if and only if the tensor product is robust, and therefore the proof strategy of constructing a rectangle is complete. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "On the rectangle method in proofs of robustness of tensor products", "paper_id": "WOS:000300811700010"}