{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "history_students"}, {"score": 0.00478218760286811, "phrase": "purpose_-_the_purpose"}, {"score": 0.004669254965563445, "phrase": "spanish_history_students'_subjective_perception"}, {"score": 0.0044209926093642235, "phrase": "academic_and_individual_improvement_actions"}, {"score": 0.004301834610818624, "phrase": "il-humass_survey"}, {"score": 0.003528458369404996, "phrase": "information_processing"}, {"score": 0.0034450303951025704, "phrase": "high_scores"}, {"score": 0.00325051332556486, "phrase": "technological_advances"}, {"score": 0.003195414285736136, "phrase": "bibliographic_reference_managers"}, {"score": 0.003152006152091526, "phrase": "worst_results"}, {"score": 0.0030460403366412126, "phrase": "subjective_digital_literacy"}, {"score": 0.002777341265639153, "phrase": "excessive_priority"}, {"score": 0.002602555367635598, "phrase": "learning_tools"}, {"score": 0.002549672862868133, "phrase": "policy_makers"}, {"score": 0.002472352057126189, "phrase": "learning_process"}, {"score": 0.002397370428991875, "phrase": "specific_courses"}, {"score": 0.002308800317961002, "phrase": "information_search"}, {"score": 0.002238767763626708, "phrase": "independent_learning_needs"}, {"score": 0.002148677187261496, "phrase": "pioneering_study"}, {"score": 0.0021049977753042253, "phrase": "triple_perspective"}], "paper_keywords": ["Information literacy", " History students", " Skills self-assessment", " Learning habits", " Spain", " Information management", " Information retrieval", " Students", " Learning methods"], "paper_abstract": "Purpose - The purpose of this paper is to discover Spanish history students' subjective perception of their information literacy (IL) status in order to find and suggest some academic and individual improvement actions. Design/methodology/approach - The implementation of the IL-HUMASS survey provides diagnostic data on two IL quantitative dimensions (belief in importance and skills self-assessment) and a third qualitative dimension (learning habits) deployed along 26 variables, which are grouped into four categories (search, evaluation, processing, and communication-dissemination of information). Findings - The analysis confirms that variables related to information processing (above all schematising and abstracting information) show high scores of belief in importance and skills self-assessment among students. By contrast, variables related to technological advances (above all the use of bibliographic reference managers) show the worst results. In sum, there is a lack of subjective digital literacy in a set of skills related to the technologies of search, processing and communication of information. Among the less valued skills, independent learning reaches an excessive priority. However, this is really just an isolated learning. Research limitations/implications - The help of classrooms and libraries as learning tools would improve these results. Policy makers and instructors need to improve their role in the learning process by means of more extensive planning processes and the promotion of specific courses, above all on skills related to the technologies of information search, processing and communication. The concept of independent learning needs to be clarified and enhanced. Originality/value - This is a pioneering study that approaches IL from a triple perspective.", "paper_title": "Information literacy perceptions and behaviour among history students", "paper_id": "WOS:000306536300007"}