{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "automatic_inference_of_determinacy_and_mutual_exclusion_for_logic_programs_using_mode"}, {"score": 0.0034554281349858836, "phrase": "pruning_operator"}, {"score": 0.003308195943172624, "phrase": "mutual_exclusion"}, {"score": 0.0031845067058084583, "phrase": "arithmetic_equations"}, {"score": 0.002887210021573995, "phrase": "complete_satisfiability_testing_algorithm"}, {"score": 0.0026607205525625995, "phrase": "program_debugging"}, {"score": 0.0026033756286033285, "phrase": "resource_consumption"}, {"score": 0.002575167114383286, "phrase": "granularity_control"}, {"score": 0.0023346234464901978, "phrase": "ciaopp_system"}, {"score": 0.0022718774783143203, "phrase": "automatically_the_mode"}, {"score": 0.0021049977753042253, "phrase": "implementation_show"}], "paper_keywords": ["Determinacy Inference and Checking", " Types", " Program Analysis", " Debugging", " Optimization"], "paper_abstract": "We propose an analysis for detecting procedures and goals that are deterministic (i.e., that produce at most one solution at most once), or predicates whose clause tests are mutually exclusive (which implies that at most one of their clauses will succeed) even if they are not deterministic. The analysis takes advantage of the pruning operator in order to improve the detection of mutual exclusion and determinacy. It also supports arithmetic equations and disequations, as well as equations and disequations on terms, for which we give a complete satisfiability testing algorithm, w.r.t. available type information. Information about determinacy can be used for program debugging and optimization, resource consumption and granularity control, abstraction carrying code, etc. We have implemented the analysis and integrated it in the CiaoPP system, which also infers automatically the mode and type information that our analysis takes as input. Experiments performed on this implementation show that the analysis is fairly accurate and efficient.", "paper_title": "Automatic Inference of Determinacy and Mutual Exclusion for Logic Programs Using Mode and Type Analyses", "paper_id": "WOS:000277927800009"}