{"auto_keywords": [{"score": 0.02953506307707683, "phrase": "single_equation"}, {"score": 0.028296561359329165, "phrase": "sensory_science"}, {"score": 0.00481495049065317, "phrase": "large_body"}, {"score": 0.0038043055953253047, "phrase": "perceived_world"}, {"score": 0.0036993855514735746, "phrase": "perceiving_system"}, {"score": 0.0035544816252832375, "phrase": "physical_and_biological_worlds"}, {"score": 0.002741091312632307, "phrase": "good_deal"}, {"score": 0.0025001755089445092, "phrase": "hitherto_empirical_equations"}, {"score": 0.0022803854904010347, "phrase": "sensory_systems"}], "paper_keywords": ["Perceptual theory", " Unifying principle", " Entropy", " Physics"], "paper_abstract": "This is a review of a large body of work undertaken during the past 3-4 decades, by the author, who has worked in both the physical and the biological sciences. We begin with two assumed principles that are taken to be fundamental to the process of perception. The first is termed the reflexive property, and the second the uncertainty property. The former implies that the perceived world always mirrors a property of the perceiving system. The latter means that perception, both in the physical and biological worlds, always implies making a choice from among alternatives. We integrate these principles to develop equations diagrammatically, essentially using a set of cartoons. The equations are not derived rigorously - that can be found in other publications - but rather take shape pictorially, to give the reader the gist of the idea. The result is a single equation that has a good deal of scope in predicting events within sensory science. This single equation, suitably constrained, can be used to derive many of the hitherto empirical equations found in sensory science. By rooting perception in the physical, rather than the biological realm, this equation tells us about sensory systems that may be present throughout our universe, since the universe operates everywhere using the same laws of physics. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Sensation as reduction in uncertainty: A review", "paper_id": "WOS:000313690800007"}