{"auto_keywords": [{"score": 0.04368553367261279, "phrase": "window_length"}, {"score": 0.03986436747617021, "phrase": "ambiguous_words"}, {"score": 0.010612387000973441, "phrase": "common_trinucleotide_circular_code"}, {"score": 0.00991939726336753, "phrase": "reading_frames"}, {"score": 0.008723862544870937, "phrase": "reading_frame"}, {"score": 0.005757900062274624, "phrase": "x_motifs"}, {"score": 0.004581037514126714, "phrase": "circular_code_x"}, {"score": 0.004338744173262641, "phrase": "start_codons"}, {"score": 0.004309368854601124, "phrase": "reading_frame_retrieval"}, {"score": 0.004280191565553763, "phrase": "window_length_l"}, {"score": 0.003980946756695767, "phrase": "shifted_frames"}, {"score": 0.003719362723728175, "phrase": "first_part"}, {"score": 0.0035065523764817143, "phrase": "occurrence_number"}, {"score": 0.0034124679487298015, "phrase": "shifted_frame"}, {"score": 0.0032026066791743866, "phrase": "common_trinucleotide_circular_code_x"}, {"score": 0.0029249294679606656, "phrase": "circular_code"}, {"score": 0.0028919522313933525, "phrase": "second_part"}, {"score": 0.002846406008503774, "phrase": "x_circular_code_motifs"}, {"score": 0.0028015750912786393, "phrase": "transfer_rna"}, {"score": 0.002726354182186842, "phrase": "anticodon_stem-loop"}, {"score": 0.002659172481861264, "phrase": "window_lengths"}, {"score": 0.0026411384812121503, "phrase": "frame_retrieval"}, {"score": 0.002558579472926165, "phrase": "crystal_structure"}, {"score": 0.002445083752403236, "phrase": "mrna_x_motifs"}, {"score": 0.002305014991156598, "phrase": "decoding_center"}, {"score": 0.0022841883008682985, "phrase": "codon-anticodon_helix"}, {"score": 0.002253299769886694, "phrase": "code_theory_point"}, {"score": 0.0022278779300543548, "phrase": "identified_x_circular_code_motifs"}, {"score": 0.002187796899292235, "phrase": "translation_code"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Circular code motif", " Trinucleotide", " Messenger RNA", " Transfer RNA", " Ribosomal RNA", " Translation code"], "paper_abstract": "In 1996, a common trinucleotide circular code, called X, is identified in genes of eukaryotes and prokaryotes (Argues and Michel, 1996). This circular code X is a set of 20 trinucleotides allowing the reading frames in genes to be retrieved locally, i.e. anywhere in genes and in particular without start codons. This reading frame retrieval needs a window length l of 12 nucleotides (l >= 12). With a window length strictly less than 12 nucleotides (l < 12), some words of X, called ambiguous words, are found in the shifted frames (the reading frame shifted by one or two nucleotides) preventing the reading frame in genes to be retrieved. Since 1996, these ambiguous words of X were never studied. In the first part of this paper, we identify all the ambiguous words of the common trinucleotide circular code X. With a length! varying from l to 11 nucleotides, the type and the occurrence number (multiplicity) of ambiguous words of X are given in each shifted frame. Maximal ambiguous words of X, words which are not factors of another ambiguous words, are also determined. Two probability definitions based on these results show that the common trinucleotide circular code X retrieves the reading frame in genes with a probability of about 90% with a window length of 6 nucleotides, and a probability of 99.9% with a window length of 9 nucleotides (100% with a window length of 12 nucleotides, by definition of a circular code). In the second part of this paper, we identify X circular code motifs (shortly X motifs) in transfer RNA and 16S ribosomal RNA: a tRNA X motif of 26 nucleotides including the anticodon stem-loop and seven 16S rRNA X motifs of length greater or equal to 15 nucleotides. Window lengths of reading frame retrieval with each trinucleotide of these X motifs are also determined. Thanks to the crystal structure 3I8G (Jenner et al., 2010), a 3D visualization of X motifs in the ribosome shows several spatial configurations involving mRNA X motifs, A-tRNA and E-tRNA X motifs, and four 16S rRNA X motifs. Another identified 16S rRNA X motif is involved in the decoding center which recognizes the codon-anticodon helix in A-tRNA. From a code theory point of view, these identified X circular code motifs and their mathematical properties may constitute a translation code involved in retrieval, maintenance and synchronization of reading frames in genes. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Circular code motifs in transfer and 16S ribosomal RNAs: A possible translation code in genes", "paper_id": "WOS:000303099800005"}