{"auto_keywords": [{"score": 0.04958226493298706, "phrase": "infection_control_guidelines"}, {"score": 0.00481495049065317, "phrase": "health_care_workers'_adoption"}, {"score": 0.004420226794493722, "phrase": "netherlands"}, {"score": 0.004401997939102056, "phrase": "germany"}, {"score": 0.004374267836149339, "phrase": "website_communicating_guidelines"}, {"score": 0.004310823045702522, "phrase": "methicillin_resistant_staphylococcus_aureus"}, {"score": 0.004186669192823879, "phrase": "prior_experience"}, {"score": 0.0038271712887391015, "phrase": "different_categories"}, {"score": 0.0037874176217833487, "phrase": "technology_adoption"}, {"score": 0.0037716315779510634, "phrase": "health_care"}, {"score": 0.0036553070575015344, "phrase": "precede_model"}, {"score": 0.0033905067962602515, "phrase": "contextually_relevant_information"}, {"score": 0.0033622909109253616, "phrase": "website's_credibility"}, {"score": 0.0032858981413454802, "phrase": "website's_guidelines"}, {"score": 0.0032381878248821383, "phrase": "best_available_evidence"}, {"score": 0.0030605426745653887, "phrase": "individual_resistance"}, {"score": 0.002941389980674657, "phrase": "online_sources"}, {"score": 0.0028446460307503343, "phrase": "high_work_pressure"}, {"score": 0.0028327783069076883, "phrase": "working_hours"}, {"score": 0.002728166176898541, "phrase": "work_pressure"}, {"score": 0.0027167830773160203, "phrase": "infection_control_professionals"}, {"score": 0.0025623050508233078, "phrase": "different_occupational_groups"}, {"score": 0.002493592357827492, "phrase": "website_use"}, {"score": 0.00246765655376112, "phrase": "infection_control_nurses"}, {"score": 0.002421648363838962, "phrase": "multiple_categories"}, {"score": 0.002411541097685622, "phrase": "hcws'_adoption"}, {"score": 0.0024014759148123736, "phrase": "web-based_guidelines"}, {"score": 0.0023566987138026285, "phrase": "paramount_reinforcer"}, {"score": 0.0021995257343837547, "phrase": "routine_care"}, {"score": 0.0021450029487459403, "phrase": "early_phases"}, {"score": 0.0021315842986705485, "phrase": "design_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Practice guideline", " Communicable diseases", " Qualitative evaluation", " Innovation diffusion"], "paper_abstract": "Goal: To identify factors that could affect health care workers' (HCWs) adoption of a website for communicating infection control guidelines. Methods: In total, 20 semi-structured interviews were conducted with HCWs in 5 different occupational groups and 4 different hospitals in the Netherlands and Germany. A website communicating guidelines for the prevention and control of Methicillin Resistant Staphylococcus aureus served as a casus. The HCWs, the majority of whom had prior experience with the website, were asked to give their opinions about factors that hinder or facilitate adoption of the website in practice. The interviews were based on the PRECEDE (Predisposing, Reinforcing, and Enabling Causes in Educational Diagnosis and Evaluation) model complemented by quality criteria for health-related websites. This model encompasses different categories of factors relevant to technology adoption in health care. Results: A total of 361 interview statements were relevant to the four main categories of the PRECEDE model, yielding the following observations: (1) Technological factors (72 statements): The usability, design, and relevance of the website were positively valued. The website enabled HCWs to access contextually relevant information quickly. The website's credibility was evaluated rather negatively, as respondents perceived that the website's guidelines were not in concurrence with the best available evidence and it was not clear to HCWs who created the website. (2) Individual factors (85 statements): Respondents, particular infection control professionals, showed individual resistance to the website because they preferred to use their personal knowledge and experience (and communication with colleagues) over online sources. (3) Work-related factors (53 statements): Respondents perceived high work pressure during working hours as an impediment to consulting the website. In contrast, respondents thought the website might lower work pressure for infection control professionals, as they will receive fewer questions from HCWs. (4) Organizational factors (131 statements): Interpersonal (face-to-face) communication between HCWs from different occupational groups in both a formal (training) and informal (feedback) manner was seen as the most stimulating factor behind website use. The respondents identified infection control nurses as the most important opinion leaders. Conclusion: Factors from multiple categories determine HCWs' adoption of web-based guidelines, but the organization appeared to be a paramount reinforcer of initiation and maintenance of technology adoption among HCWs. In order eliminate resistance and create ownership among HCWs toward the website, leading to a willingness to integrate the website into routine care, it is essential to more actively involve HCWs in the early phases of the design process. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Factors affecting health care workers' adoption of a website with infection control guidelines", "paper_id": "WOS:000270079200004"}