{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "secos"}, {"score": 0.010152547079246775, "phrase": "sensor_networks"}, {"score": 0.006699762783609347, "phrase": "control_nodes"}, {"score": 0.004567990533989851, "phrase": "wireless_sensor_networks"}, {"score": 0.004094639048362357, "phrase": "front_symmetric_key_cryptography"}, {"score": 0.003760527969356061, "phrase": "increased_end-to-end_data_latency"}, {"score": 0.0035386420095120706, "phrase": "problems_ill_static_sensor_networks"}, {"score": 0.0034676182423067307, "phrase": "sensor_field"}, {"score": 0.003439608110599787, "phrase": "control_groups"}, {"score": 0.003384262486955773, "phrase": "control_node"}, {"score": 0.003356923403930231, "phrase": "data_exchange"}, {"score": 0.003289534854212415, "phrase": "control_group"}, {"score": 0.0031974502006267163, "phrase": "control_head"}, {"score": 0.0031459887611258765, "phrase": "common_key"}, {"score": 0.002436289099444074, "phrase": "simulation_model"}, {"score": 0.002406799309495983, "phrase": "seven_time_reduction"}, {"score": 0.002387337550919433, "phrase": "energy_overhead"}, {"score": 0.0021745003291048356, "phrase": "key_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Sensor network security", " Key management", " Symmetric cryptography", " Energy efficient key distribution", " Key refreshment"], "paper_abstract": "Wireless sensor networks are increasingly being used in applications where the communication between nodes needs to be protected from eavesdropping and tampering. Such protection is typically provided using techniques front symmetric key cryptography. The protocols ill this domain suffer from one or more of the following problems-weak Security guarantees if some nodes are compromised, lack of scalability, high energy overhead for key management, and increased end-to-end data latency. In this paper, we propose a protocol called SECOS that mitigates these problems ill static sensor networks. SECOS divides the sensor field into control groups each with a control node. Data exchange between nodes within a control group happens through the mediation of the control head which provides the common key. The keys are refreshed periodically and the control nodes are changed periodically to enhance security, SECOS enhances the survivability of the network by handling compromise and failures of control nodes. It provides the guarntee that the communication between any two sensor nodes remains secure despite the compromise of any number of other nodes in the network. The experiments based on a simulation model show a seven time reduction in energy overhead and a 50% reduction in latency compared to SPINS, which is one of the state-of-the-art protocols for key management in sensor networks. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Analysis and evaluation of SECOS, a protocol for energy efficient and secure communication in sensor networks", "paper_id": "WOS:000206060700006"}