{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_systems"}, {"score": 0.030136802537648718, "phrase": "theory_type"}, {"score": 0.004703671193348433, "phrase": "research_essay"}, {"score": 0.004612896435506914, "phrase": "structural_nature"}, {"score": 0.00373701482510911, "phrase": "information_systems_theories"}, {"score": 0.003443031148055198, "phrase": "five_interrelated_types"}, {"score": 0.0026923527275481804, "phrase": "journal_articles"}, {"score": 0.0026095369186867707, "phrase": "multiple_views"}, {"score": 0.0023029188952824685, "phrase": "epistemological_approach"}, {"score": 0.002154930852763048, "phrase": "integrated_bodies"}, {"score": 0.0021049977753042253, "phrase": "theory_types"}], "paper_keywords": ["theory", " theory taxonomy", " theory structure", " information systems discipline", " philosophy of science", " philosophy of social sciences", " interpretivist theory", " design theory", " design science", " explanation", " prediction", " causality", " generalization"], "paper_abstract": "The aim of this research essay is to examine the structural nature of theory in Information Systems. Despite the importance of theory, questions relating to its form and structure are neglected in comparison with questions relating to epistemology. The essay addresses issues of causality, explanation, prediction, and generalization that underlie an understanding of theory. A taxonomy is proposed that classifies information systems theories with respect to the manner in which four central goals are addressed: analysis, explanation, prediction, and prescription. Five interrelated types of theory are distinguished: (1) theory for analyzing, (2) theory for explaining, (3) theory for predicting, (4) theory for explaining and predicting, and (5) theory for design and action. Examples illustrate the nature of each theory type. The applicability of the taxonomy is demonstrated by classifying a sample of journal articles. The paper contributes by showing that multiple views of theory exist and by exposing the assumptions underlying different viewpoints. In addition, it is suggested that the type of theory under development can influence the choice of an epistemological approach. Support is given for the legitimacy and value of each theory type. The building of integrated bodies of theory that encompass all theory types is advocated.", "paper_title": "The nature of theory in information systems", "paper_id": "WOS:000240289900004"}