{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coarse-grained_reconfigurable_array_architectures"}, {"score": 0.004634254474150777, "phrase": "increasing_demands"}, {"score": 0.004359078118356132, "phrase": "embedded_systems_design"}, {"score": 0.004007083686875716, "phrase": "adres_cgra"}, {"score": 0.0031845067058084613, "phrase": "systematic_way"}, {"score": 0.0029270797740550973, "phrase": "adres"}, {"score": 0.00283870598459543, "phrase": "improved_performance_levels"}, {"score": 0.0026091594819333654, "phrase": "state-of-the-art_commercial_dsp_platform"}, {"score": 0.0024918548761791435, "phrase": "texas_instruments"}, {"score": 0.002325689073229477, "phrase": "cycle_count"}, {"score": 0.002272794656458419, "phrase": "power_consumption"}, {"score": 0.0021539955106204337, "phrase": "published_numbers"}], "paper_keywords": ["ADRES", " DRESC", " Coarse-grained architectures", " CGRA"], "paper_abstract": "Due to the increasing demands on efficiency, performance and flexibility reconfigurable computational architectures are very promising candidates in embedded systems design. Recently coarse-grained reconfigurable array architectures (CGRAs), such as the ADRES CGRA and its corresponding DRESC compiler are gaining more popularity due to several technological breakthroughs in this area. We investigate the mapping of two image processing algorithms, Wavelet encoding and decoding, and TIFF compression on this novel type of array architectures in a systematic way. The results of our experiments show that CGRAs based on ADRES and its DRESC compiler technology deliver improved performance levels for these two benchmark applications when compared to results obtained on a state-of-the-art commercial DSP platform, the c64x DSP from Texas Instruments. ADRES/DRESC can beat its performance by at least 50% in cycle count and the power consumption even drops to 10% of the published numbers of the c64x DSP.", "paper_title": "Still Image Processing on Coarse-Grained Reconfigurable Array Architectures", "paper_id": "WOS:000278481900006"}