{"auto_keywords": [{"score": 0.03787198124097667, "phrase": "framing_effect"}, {"score": 0.019876248858286226, "phrase": "cognitive_effort"}, {"score": 0.00744521652027581, "phrase": "eye-tracking_technology"}, {"score": 0.004501218372168526, "phrase": "tversky"}, {"score": 0.00446940166388824, "phrase": "kahneman"}, {"score": 0.0043908341845978575, "phrase": "d._kahneman"}, {"score": 0.0035740424892197155, "phrase": "neurobiological_studies"}, {"score": 0.0030032443093632125, "phrase": "disease_and_gambling_problems"}, {"score": 0.0028984332556216946, "phrase": "kittens'_therapy"}, {"score": 0.00286770704394124, "phrase": "plant_problem"}, {"score": 0.002777463594061196, "phrase": "eye_movement"}, {"score": 0.002699627613420169, "phrase": "cognitive_effort_asymmetry"}, {"score": 0.0026710032893246154, "phrase": "critical_role"}, {"score": 0.0024526426124799085, "phrase": "negative_framing_condition"}, {"score": 0.0022124176057373365, "phrase": "potential_implications"}, {"score": 0.0021734395455430167, "phrase": "information_presentation"}, {"score": 0.0021503823972534096, "phrase": "decision_making"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Eye tracking", " Framing effect", " Prospect theory", " Decision making", " Cognitive effort"], "paper_abstract": "The framing effect, proposed by Tversky and Kahneman [A. Tversky. D. Kahneman, The framing of decisions and the psychology of choice, Science 211 (4481) (1981) 453-458.], refers to the phenomenon that varying the presentations of the same problem can systematically affect the choice one makes. In this research we have reviewed a literature related to the framing effect and neurobiological studies of emotion. This review leads us to conceptualize that framing may induce emotion, which in turn impinges on the level of cognitive effort that subsequently shapes the framing effect. We then employ the eye-tracking technology to explore the differences in cognitive effort under both positive and negative framing conditions. Among the four experimental problems, disease and gambling problems are found to exhibit the framing effect, while the kittens' therapy and the plant problem do not. In analyzing the level of eye movement for the four problems. we find that cognitive effort asymmetry plays a critical role in the production of the framing effect. That is, for the two problems that display the framing effect, subjects expend more effort in the negative framing condition than they do in the positive, yet the framing effect persists, indicating that they cannot change their cognitive inertia despite this increase in cognitive effort. The finding has potential implications for the design of information presentation to facilitate decision making. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "An exploratory study of cognitive effort involved in decision under Framing-an application of the eye-tracking technology", "paper_id": "WOS:000272366100009"}