{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "perceived_switching_value"}, {"score": 0.0036826452656927877, "phrase": "individuals'_sensitivity"}, {"score": 0.003561205990687285, "phrase": "switching_decision-making"}, {"score": 0.003405472159599442, "phrase": "value-based_decision_model"}, {"score": 0.003311604528903634, "phrase": "rational_decision-making_concept"}, {"score": 0.0030451958332949735, "phrase": "innovative_products"}, {"score": 0.002815864555488112, "phrase": "perceived_benefits"}, {"score": 0.0025892330566358503, "phrase": "switching_context"}, {"score": 0.0024897902536499005, "phrase": "proposed_hypotheses"}, {"score": 0.0022893422054387235, "phrase": "value_determination"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Value-based decision model", " Satisfaction", " Switching", " Smartphone platform"], "paper_abstract": "Satisfaction has long been considered as one critical determinant of the intention to repurchase, continue usage, or switch. Satisfaction is shown to affect intention either directly or via interaction with other factors such as benefits and costs of switching. This study investigates how satisfaction changes individuals' sensitivity toward benefits and costs during switching decision-making. This study incorporates satisfaction into a value-based decision model which originated from the rational decision-making concept in economics and has been widely used to understand the adoption and continuance of innovative products or systems. It is hypothesized that the magnitude of the effects of perceived benefits and costs on the value is contingent on the level of satisfaction in a switching context. Data collected from 237 smartphone users confirm proposed hypotheses that the level of satisfaction determines the importance of benefits and costs in switching value determination. Discussions and implications of this result are provided. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Understanding the role of satisfaction in the formation of perceived switching value", "paper_id": "WOS:000333778800014"}