{"auto_keywords": [{"score": 0.03659494279253418, "phrase": "online_questionnaire"}, {"score": 0.00481495049065317, "phrase": "academic_environment"}, {"score": 0.004598027492787762, "phrase": "digital_environment"}, {"score": 0.004469400468609653, "phrase": "different_types"}, {"score": 0.004207840198934805, "phrase": "new_and_different_search_tools"}, {"score": 0.003975609222669783, "phrase": "significant_factor"}, {"score": 0.003933508945770709, "phrase": "search_process"}, {"score": 0.00378290546281883, "phrase": "information_search"}, {"score": 0.0033527773742790695, "phrase": "higher_education_sector"}, {"score": 0.0031008008614593465, "phrase": "specific_information_channels"}, {"score": 0.0030570583408091488, "phrase": "quantitative_analysis"}, {"score": 0.0028474035592052052, "phrase": "chosen_user_categories"}, {"score": 0.002827243416398972, "phrase": "academic_staff"}, {"score": 0.0028072256092845417, "phrase": "research_staff"}, {"score": 0.0027873491386063913, "phrase": "research_students"}, {"score": 0.002559501330352064, "phrase": "significant_number"}, {"score": 0.0025233755103976317, "phrase": "different_disciplines"}, {"score": 0.0024701382170046462, "phrase": "ict_skills"}, {"score": 0.002220296517089146, "phrase": "possible_implications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Uncertainty", " Information seeking and retrieval", " Information seeking activities", " Information seeking problems", " Digital information sources", " Human information behaviour"], "paper_abstract": "This research focuses specifically on uncertainty and information seeking in a digital environment. In this research we argue that different types of uncertainty are associated with the information seeking process and that, with the proliferation of new and different search tools, sources and channels, uncertainty, positive/desirable or negative/undesirable, continues to be a significant factor in the search process. Users may feel uncertain at any stage of the information search and retrieval process and uncertainty may remain even after completion of the process resulting in what may be called persistent uncertainty. An online questionnaire was used to collect data from users in the higher education sector. There were three parts to the questionnaire focusing on: information seeking activities, information seeking problems, and access to specific information channels or sources. Quantitative analysis was carried out on the data collected through the online questionnaire. A total of 668 responses were returned from the chosen user categories of academic staff, research staff and research students. This research has shown that there are some information seeking activities and information seeking problems that are the most common causes of uncertainty among significant number of users from different disciplines, age, gender, ICT skills, etc. This is also the case with respect to access to and use of specific information sources/channels, although the degrees of uncertainty in relation are relatively small. Possible implications of this study and further research issues are indicated. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Uncertainty in information seeking and retrieval: A study in an academic environment", "paper_id": "WOS:000288407300002"}