{"auto_keywords": [{"score": 0.034543751157973465, "phrase": "php"}, {"score": 0.00481495049065317, "phrase": "exploratory_experiment"}, {"score": 0.0047735489327932114, "phrase": "emergent_platform_properties"}, {"score": 0.004691805714620268, "phrase": "web-based_applications"}, {"score": 0.004378532515411219, "phrase": "accompanying_development_culture"}, {"score": 0.004278807087784626, "phrase": "web_development_projects"}, {"score": 0.0042542311446793725, "phrase": "emergent_process"}, {"score": 0.0042297957574089304, "phrase": "product_properties"}, {"score": 0.0040860907835759954, "phrase": "relevant_substantial_differences"}, {"score": 0.004027658449157296, "phrase": "team-to-team_individual_differences"}, {"score": 0.0035480536257462567, "phrase": "public_contest"}, {"score": 0.00335896380465609, "phrase": "web-based_application"}, {"score": 0.0032447629385581986, "phrase": "perl"}, {"score": 0.0031434552452869156, "phrase": "resulting_nine_products"}, {"score": 0.0031253798902093457, "phrase": "process_records"}, {"score": 0.002817181909556205, "phrase": "wide_spectrum"}, {"score": 0.002628747284714371, "phrase": "perl_solutions"}, {"score": 0.0025761937402886954, "phrase": "java_solutions"}, {"score": 0.002510161871523503, "phrase": "conventional_wisdom"}, {"score": 0.0022365262201954643, "phrase": "within-platform_variation"}, {"score": 0.0021049977753042253, "phrase": "substantial_characteristic_platform_differences"}], "paper_keywords": ["Emergent properties", " usability", " functionality", " reliability", " security", " product size", " design structure", " modifiability", " Java", " PHP", " Perl"], "paper_abstract": "Background: For developing Web-based applications, there exist several competing and widely used technological platforms (consisting of a programming language, framework(s), components, and tools), each with an accompanying development culture and style. Research question: Do Web development projects exhibit emergent process or product properties that are characteristic and consistent within a platform, but show relevant substantial differences across platforms or do team-to-team individual differences outweigh such differences, if any? Such a property could be positive (i.e., a platform advantage), negative, or neutral, and it might be unobvious which is which. Method: In a nonrandomized, controlled experiment, framed as a public contest called \"Plat_Forms,\" top-class teams of three professional programmers competed to implement the same requirements for a Web-based application within 30 hours. Three different platforms (Java EE, PHP, or Perl) were used by three teams each. We compare the resulting nine products and process records along many dimensions, both external (usability, functionality, reliability, security, etc.) and internal (size, structure, modifiability, etc.). Results: The various results obtained cover a wide spectrum: First, there are results that many people would have called \"obvious\" or \"well known,\" say, that Perl solutions tend to be more compact than Java solutions. Second, there are results that contradict conventional wisdom, say, that our PHP solutions appear in some (but not all) respects to be actually at least as secure as the others. Finally, one result makes a statement we have not seen discussed previously: Along several dimensions, the amount of within-platform variation between the teams tends to be smaller for PHP than for the other platforms. Conclusion: The results suggest that substantial characteristic platform differences do indeed exist in some dimensions, but possibly not in others.", "paper_title": "Plat_Forms: A Web Development Platform Comparison by an Exploratory Experiment Searching for Emergent Platform Properties", "paper_id": "WOS:000286676700007"}