{"auto_keywords": [{"score": 0.044753672605157, "phrase": "young_people"}, {"score": 0.015719716506582538, "phrase": "information-coping_trajectory"}, {"score": 0.004718431349852634, "phrase": "long_term_illness_an_evidence"}, {"score": 0.004229556887896042, "phrase": "long_term_illness"}, {"score": 0.0041112665381266315, "phrase": "methodological_approach"}, {"score": 0.00398010723401417, "phrase": "cartographic"}, {"score": 0.003133252930886608, "phrase": "five_positions"}, {"score": 0.002865710140187219, "phrase": "information_health"}, {"score": 0.0028081546657056948, "phrase": "information_donor"}, {"score": 0.002599763359352916, "phrase": "information_theory"}, {"score": 0.0021922308351126746, "phrase": "multi-disciplinary_value"}, {"score": 0.0021049977753042253, "phrase": "information_studies"}], "paper_keywords": ["Information", " Coping", " Trajectory", " Situational analysis", " Young people", " Health information", " Information behaviour", " Youth"], "paper_abstract": "Purpose - The purpose of this paper is to explore the relationship between information and coping from the experiences of young people coping with long term illness. Design/methodology/approach - Situational analysis was used as a methodological approach. It has roots in the Chicago Symbolic Interactionism School. Cartographic approaches enabled the analysis, mapping the complexities emerging from the data. Findings - As the young people became more informed about their health conditions, and gained knowledge and understanding both about their illnesses, their own bodies and boundaries, their confidence and capacity to cope increased. Gaining confidence, the young people often wanted to share their knowledge - becoming information providers themselves. From the data, five positions on an information-coping trajectory were identified: information deficiency; feeling ill-informed; needing an injection of information; having information health; and becoming an information donor. Research limitations/implications - The research was limited to an analysis of 30 narratives. The paper contributes to information theory by mapping clearly the relationship between information and coping. Practical and social implications - The study establishes a relationship between levels of information and knowledge and the ability to cope with illness. Originality/value - The information theories in this study have originality and multi-disciplinary value in the management of health and illness, and information studies.", "paper_title": "Mapping the information-coping trajectory of young people with long term illness An evidence based approach", "paper_id": "WOS:000325444500004"}