{"auto_keywords": [{"score": 0.04931971121682219, "phrase": "consensus_model"}, {"score": 0.00481495049065317, "phrase": "consistency_control_module"}, {"score": 0.004147216579100177, "phrase": "high_degree"}, {"score": 0.00378767277402891, "phrase": "individuals'_preferences"}, {"score": 0.0037076911119175455, "phrase": "formal_properties"}, {"score": 0.003422462630994095, "phrase": "transitivity_property"}, {"score": 0.0032793933580835574, "phrase": "rational_decision"}, {"score": 0.002794001681064862, "phrase": "gdm_process"}, {"score": 0.0025514745448798385, "phrase": "gdm_problems"}, {"score": 0.002393034183276193, "phrase": "novel_consistency"}, {"score": 0.00232995025271599, "phrase": "consistency_measures"}], "paper_keywords": ["decision-making", " fuzzy preferences", " consistency", " transitivity", " consensus", " recommendations."], "paper_abstract": "In group decision making (GDM) processes, prior to the selection of the best alternative(s), it would be desirable that experts achieve a high degree of consensus or agreement between them. Due to the complexity of most decision making problems, individuals' preferences may not satisfy formal properties. 'Consistency' is one of such properties, and it is associated with the transitivity property. Obviously, when carrying out a rational decision making, consistent information, i.e. information which does not imply any kind of contradiction, is more appropriate than information containing some contradictions. Therefore, in a GDM process, consistency should also be sought after. In this paper we present a consensus model for GDM problems that proceeds from consistency to consensus. This model integrates a novel consistency reaching module based on consistency measures. In particular, the model generates advice on how experts should change their preferences in order to increase their consistency. Also, the consensus model is considered adaptive because the search for consensus is adapted to the level of agreement achieved at each consensus round.", "paper_title": "Integration of a consistency control module within a consensus model", "paper_id": "WOS:000256307600004"}