{"auto_keywords": [{"score": 0.00471193241675062, "phrase": "computer_network_vulnerabilities"}, {"score": 0.004671342094877447, "phrase": "network_vulnerability_taxonomy"}, {"score": 0.004138309011478741, "phrase": "computer_networks"}, {"score": 0.004084920064588169, "phrase": "important_role"}, {"score": 0.004014800383343256, "phrase": "communication_infrastructure"}, {"score": 0.0038115535592184438, "phrase": "vulnerability_risks"}, {"score": 0.0037138072936226, "phrase": "secure_information_exchange_systems"}, {"score": 0.0034204548167213545, "phrase": "secure_networks"}, {"score": 0.0031230216871739776, "phrase": "present_paper"}, {"score": 0.002990592465417758, "phrase": "taxonomy_framework"}, {"score": 0.0029264925857346497, "phrase": "network_vulnerabilities"}, {"score": 0.0026835045963349647, "phrase": "second_edition"}, {"score": 0.0026603411931700556, "phrase": "common_vulnerability_scoring_system"}, {"score": 0.0025696647013416863, "phrase": "proposed_taxonomy_framework"}, {"score": 0.0024078737745407614, "phrase": "comprehensive_taxonomic_structure"}, {"score": 0.002207851585508636, "phrase": "effective_management"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["vulnerability", " computer network vulnerability", " taxonomy of vulnerabilities", " ITU-TX-805 security architecture", " quantifying vulnerabilities", " Common Vulnerability Scoring System"], "paper_abstract": "Network vulnerability taxonomy has become increasingly important in the area of information and data exchange for its potential use not only in identification of vulnerabilities but also in their assessment and prioritization. Computer networks play an important role in information and communication infrastructure. However, they are constantly exposed to a variety of vulnerability risks. In their attempts to create secure information exchange systems, scientists have concentrated on understanding the nature and typology of these vulnerabilities. Their efforts aimed at establishing secure networks have led to the development of a variety of methods and techniques for quantifying vulnerability. The objectives of the present paper are twofold: (1) to develop a taxonomy framework for the classification of network vulnerabilities on the basis of the ITU-TX-805 security architecture and (2) to develop a method on the basis of the second edition of Common Vulnerability Scoring System for the quantification of vulnerabilities within the proposed taxonomy framework. It is expected that the framework proposed in this paper will provide a comprehensive taxonomic structure that can be extended to all the different aspects of network vulnerability. Furthermore, it will help in the identification and effective management of vulnerabilities by their quantification. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "A taxonomy framework based on ITU-TX-805 security architecture for quantitative determination of computer network vulnerabilities", "paper_id": "WOS:000320776500007"}