{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evolutionary_algorithms"}, {"score": 0.01089172105110293, "phrase": "nhst"}, {"score": 0.005838549317735871, "phrase": "computational_experiment"}, {"score": 0.00449859196755507, "phrase": "utmost_importance"}, {"score": 0.003969018740062018, "phrase": "nhst_usage"}, {"score": 0.0038986150699604504, "phrase": "new_method"}, {"score": 0.0034148795808317555, "phrase": "chess_players"}, {"score": 0.0032829570709414736, "phrase": "objective_function"}, {"score": 0.0032016639006812826, "phrase": "rating_system"}, {"score": 0.003055977395076106, "phrase": "bradley-terry_model"}, {"score": 0.003034158379493625, "phrase": "dynamic_pairwise_comparisons"}, {"score": 0.002927371124061966, "phrase": "rating_deviation"}, {"score": 0.0028651061556017304, "phrase": "rating_volatility"}, {"score": 0.002695768552609587, "phrase": "benchmark_suite"}, {"score": 0.002377916348320401, "phrase": "statistical_significance_tests"}, {"score": 0.0022941723937662927, "phrase": "reliable_ratings"}, {"score": 0.0022453451864218477, "phrase": "small_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Evolutionary algorithm", " Computational experiment", " Null hypothesis significance testing", " Chess rating", " Ranking"], "paper_abstract": "The Null Hypothesis Significance Testing (NHST) is of utmost importance for comparing evolutionary algorithms as the performance of one algorithm over another can be scientifically proven. However, NHST is often misused, improperly applied and misinterpreted. In order to avoid the pitfalls of NHST usage this paper proposes a new method, a Chess Rating System for Evolutionary Algorithms (CRS4EAs) for the comparison and ranking of evolutionary algorithms. A computational experiment in CRS4EAs is conducted in the form of a tournament where the evolutionary algorithms are treated as chess players and a comparison between the solutions of two algorithms on the objective function is treated as one game outcome. The rating system used in CRS4EAs was inspired by the Glicko-2 rating system, based on the Bradley-Terry model for dynamic pairwise comparisons, where each algorithm is represented by rating, rating deviation, a rating/confidence interval, and rating volatility. The CRS4EAs was empirically compared to NHST within a computational experiment conducted on 16 evolutionary algorithms and a benchmark suite of 20 numerical minimisation problems. The analysis of the results shows that the CRS4EAs is comparable with NHST but may also have many additional benefits. The computations in CRS4EAs are less complicated and sensitive than those in statistical significance tests, the method is less sensitive to outliers, reliable ratings can be obtained over a small number of runs, and the conservativity/liberality of CRS4EAs is easier to control. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A chess rating system for evolutionary algorithms: A new method for the comparison and ranking of evolutionary algorithms", "paper_id": "WOS:000338390200041"}