{"auto_keywords": [{"score": 0.03924349302513645, "phrase": "lscm"}, {"score": 0.03649502212066351, "phrase": "supply_chains"}, {"score": 0.033002348931367075, "phrase": "lscm."}, {"score": 0.00481495049065317, "phrase": "discrete_event_simulation"}, {"score": 0.004712726613162057, "phrase": "logistics_and_supply_chain_context"}, {"score": 0.004403054828362479, "phrase": "decision_support_tools"}, {"score": 0.004340488340181084, "phrase": "supply_chain_management"}, {"score": 0.004248294537944227, "phrase": "widely_held_belief"}, {"score": 0.0041283957965834875, "phrase": "model_problems"}, {"score": 0.004084307764140389, "phrase": "strategic_level"}, {"score": 0.003802135020791801, "phrase": "decision_support_systems"}, {"score": 0.003552084379143929, "phrase": "journal_papers"}, {"score": 0.0035015674744573377, "phrase": "modelling_approaches"}, {"score": 0.003144888245632655, "phrase": "dss"}, {"score": 0.0029169007179202164, "phrase": "bullwhip_effect"}, {"score": 0.002229300966775032, "phrase": "existing_literature"}, {"score": 0.002158505888557746, "phrase": "dss_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Logistics and supply chain management", " Simulation modelling", " Discrete-event simulation", " System dynamics", " Comparison of methods"], "paper_abstract": "Discrete event simulation (DES) and system dynamics (SD) are two modelling approaches widely used as decision support tools in logistics and supply chain management (LSCM). A widely held belief exists that SD is mostly used to model problems at a strategic level, whereas DES is used at an operational/tactical level. This paper explores the application of DES and SD as decision support systems (DSS) for LSCM by looking at the nature and level of issues modelled. Peer reviewed journal papers that use these modelling approaches to study supply chains, published between 1996 and 2006 are reviewed. A total of 127 journal articles are analysed to identify the frequency with which the two simulation approaches are used as modelling tools for DSS in LSCM. Our findings suggest that DES has been used more frequently to model supply chains, with the exception of the bullwhip effect, which is mostly modelled using SD. Based on the most commonly used modelling approach, issues in LSCM are categorised into four groups: the DES domain, the SD domain, the common domain and the less common domain. The study furthermore suggests that in terms of the level of decision making involved, strategic or operational/tactical, there is no difference in the use of either DES or SD. The results of this study inform the existing literature about the use of DES and SD as DSS tools in LSCM. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "The application of discrete event simulation and system dynamics in the logistics and supply chain context", "paper_id": "WOS:000301889000004"}