{"auto_keywords": [{"score": 0.04257133096705247, "phrase": "fiegarch_model"}, {"score": 0.020055911734460728, "phrase": "a-lmsv_model"}, {"score": 0.00481495049065317, "phrase": "long-memory_volatilities"}, {"score": 0.004634799977448855, "phrase": "fiegarch."}, {"score": 0.00459568664065473, "phrase": "new_stochastic_volatility_model"}, {"score": 0.004349337717774093, "phrase": "leverage_effect"}, {"score": 0.002870006736445581, "phrase": "future_volatilities"}, {"score": 0.002785978280998868, "phrase": "absolute_returns"}, {"score": 0.002505412457777352, "phrase": "original_observations"}, {"score": 0.002421726275597666, "phrase": "absolute_value"}, {"score": 0.002224510044064184, "phrase": "dynamic_evolution"}, {"score": 0.0021870332034407817, "phrase": "daily_returns"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["autocorrelations of squares and of absolute values", " conditional heteroscedasticity", " kurtosis", " EMM estimator"], "paper_abstract": "A new stochastic volatility model, called A-LMSV, is proposed to cope simultaneously with leverage effect and long-memory in volatility. Its statistical properties are derived and compared with the properties of the FIEGARCH model. It is shown that the dependence of the autocorrelations of squares on the parameters measuring the asymmetry and the persistence is different in both models. The kurtosis and autocorrelations of squares do not depend on the asymmetry in the A-LMSV model while they increase with the asymmetry in the FIEGARCH model. Furthermore, the autocorrelations of squares increase with the persistence in the A-LMSV model and decrease in the FIEGARCH model. On the other hand, if the correlation between returns and future volatilities is negative, the autocorrelations of absolute returns increase with the magnitude of the asymmetry in the FIEGARCH model while they decrease in the A-LMSV model. Finally, the cross-correlations between squares and original observations are, in general, larger in absolute value in the FIEGARCH model than in the A-LMSV model. The results are illustrated by fitting both models to represent the dynamic evolution of volatilities of daily returns of the S&P500 and DAX indexes. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Modelling long-memory volatilities with leverage effect: A-LMSV versus FIEGARCH", "paper_id": "WOS:000254422400002"}