{"auto_keywords": [{"score": 0.03924561015138583, "phrase": "contour_deformation"}, {"score": 0.00481495049065317, "phrase": "mode_tracker"}, {"score": 0.004753194996637899, "phrase": "nonaffine_contour_deformations"}, {"score": 0.004592340708764929, "phrase": "boundary_contour"}, {"score": 0.004533427352547707, "phrase": "deforming_object"}, {"score": 0.004475266375001531, "phrase": "image_sequence"}, {"score": 0.004268293864953256, "phrase": "overlapping_clutter"}, {"score": 0.003501175642882274, "phrase": "large_dimensional_problems"}, {"score": 0.0031982609080278643, "phrase": "small_number"}, {"score": 0.003037047249598515, "phrase": "residual_deformation"}, {"score": 0.00295950473406239, "phrase": "state_space"}, {"score": 0.0024906610581090223, "phrase": "low_spatial_frequency"}, {"score": 0.0023650305205893353, "phrase": "subsampled_set"}, {"score": 0.0023145690608400425, "phrase": "effective_basis_space"}, {"score": 0.0022848092812445533, "phrase": "resulting_algorithm"}, {"score": 0.0022457226013538343, "phrase": "pf-mt."}, {"score": 0.0022168460543913787, "phrase": "significant_modifications"}, {"score": 0.0021789194955896124, "phrase": "original_pf-mt"}, {"score": 0.0021049977753042253, "phrase": "non-euclidean_infinite_dimensional_space"}], "paper_keywords": [""], "paper_abstract": "We propose algorithms for tracking the boundary contour of a deforming object from an image sequence, when the nonaffine (local) deformation over consecutive frames is large and there is overlapping clutter, occlusions, low contrast, or outlier imagery. When the object is arbitrarily deforming, each, or at least most, contour points can move independently. Contour deformation then forms an infinite (in practice, very large), dimensional space. Direct application of particle filters (PF) for large dimensional problems is impractically expensive. However, in most real problems, at any given time, most of the contour deformation occurs in a small number of dimensions (\"effective basis space\") while the residual deformation in the rest of the state space (\"residual space\") is small. This property enables us to apply the particle filtering with mode tracking (PF-MT) idea that was proposed for such large dimensional problems in recent work. Since most contour deformation is low spatial frequency, we propose to use the space of deformation at a subsampled set of locations as the effective basis space. The resulting algorithm is called deform PF-MT. It requires significant modifications compared to the original PF-MT because the space of contours is a non-Euclidean infinite dimensional space.", "paper_title": "Deform PF-MT: Particle Filter With Mode Tracker for Tracking Nonaffine Contour Deformations", "paper_id": "WOS:000275662900001"}