{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "commonly_used_ensemble-based_classification_techniques"}, {"score": 0.004518442937844318, "phrase": "classifier_ensemble"}, {"score": 0.004323886831151445, "phrase": "classification_accuracy"}, {"score": 0.004097389262726735, "phrase": "significant_amount"}, {"score": 0.003715425273229361, "phrase": "art_review"}, {"score": 0.0034020946201397057, "phrase": "recent_attempts"}, {"score": 0.003099888654615187, "phrase": "updated_view"}, {"score": 0.003054681986032532, "phrase": "different_modifications"}, {"score": 0.0026762874092443197, "phrase": "over-fitting_problem"}, {"score": 0.002523481637809674, "phrase": "different_ensemble_selection_methods"}, {"score": 0.0024264776194357993, "phrase": "new_directions"}, {"score": 0.002321787726770895, "phrase": "classifier_ensembles"}, {"score": 0.002265586601922693, "phrase": "recently_published_studies"}, {"score": 0.0021891781017389783, "phrase": "deeper_insight"}, {"score": 0.0021049977753042253, "phrase": "existing_theoretical_studies"}], "paper_keywords": [""], "paper_abstract": "The combination of multiple classifiers, commonly referred to as a classifier ensemble, has previously demonstrated the ability to improve classification accuracy in many application domains. As a result this area has attracted significant amount of research in recent years. The aim of this paper has therefore been to provide a state of the art review of the most well-known ensemble techniques with the main focus on bagging, boosting and stacking and to trace the recent attempts, which have been made to improve their performance. Within this paper, we present and compare an updated view on the different modifications of these techniques, which have specifically aimed to address some of the drawbacks of these methods namely the low diversity problem in bagging or the over-fitting problem in boosting. In addition, we provide a review of different ensemble selection methods based on both static and dynamic approaches. We present some new directions which have been adopted in the area of classifier ensembles from a range of recently published studies. In order to provide a deeper insight into the ensembles themselves a range of existing theoretical studies have been reviewed in the paper.", "paper_title": "A survey of commonly used ensemble-based classification techniques", "paper_id": "WOS:000344948300002"}