{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "embedded_spudcan"}, {"score": 0.00466877910546307, "phrase": "spudcan_footings"}, {"score": 0.004611554879923759, "phrase": "mobile_jack-up_platforms"}, {"score": 0.004335739075947899, "phrase": "soft_clay_soils"}, {"score": 0.004256243266481051, "phrase": "penetration_soil"}, {"score": 0.0038561471948364723, "phrase": "elastic_stiffness_coefficients"}, {"score": 0.002518227743688769, "phrase": "interpolation_procedure"}, {"score": 0.002487296495786493, "phrase": "partial_backflow_conditions"}, {"score": 0.002323826502178581, "phrase": "existing_jack-up_site_assessment_guidelines"}, {"score": 0.002225426912273257, "phrase": "spudcan_shape"}, {"score": 0.0021845387990972543, "phrase": "increasing_strength_soil_profile"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Spudcan", " Elastic stiffness", " Combined loading", " Backflow", " Finite element analysis", " Clay"], "paper_abstract": "The spudcan footings of mobile jack-up platforms have been known to embed several diameters during their installation in soft clay soils. During penetration soil can flow around the spudcan back filling the cavity above. This paper provides the elastic stiffness coefficients for surface to deeply embedded spudcan, as required for predicting the in situ load-displacement behaviour of a jack-up from the wind, wave and currents loading of a large storm. Results from 264 finite element analyses provide 352 dimension-less coefficients for the combined vertical, horizontal and moment elastic stiffness matrix. Coefficients are provided for (i) a representative spudcan shape, (ii) seabed with constant or linearly increasing shear modulus with depth, (iii) spudcan embedment from the surface to up to five diameters, and (iv) the limiting conditions of either an open and completely filled cavity above the spudcan. Recommendations for an interpolation procedure for partial backflow conditions are also provided. These improve the coefficients provided in existing jack-up site assessment guidelines, which do not account for spudcan shape or an increasing strength soil profile. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Elastic stiffness coefficients for an embedded spudcan in clay", "paper_id": "WOS:000301912300009"}