{"auto_keywords": [{"score": 0.04814050608144561, "phrase": "health_information"}, {"score": 0.010612387000973441, "phrase": "university_students'_online_habits"}, {"score": 0.008378049080800105, "phrase": "young_people"}, {"score": 0.008292279797316428, "phrase": "active_users"}, {"score": 0.004188198923320451, "phrase": "young_adult_population"}, {"score": 0.003936389070602614, "phrase": "mainstream_health_services"}, {"score": 0.0035866734383189396, "phrase": "health_service_delivery_warrants"}, {"score": 0.003234299589505403, "phrase": "quantitative_descriptive_design"}, {"score": 0.0031032149454757545, "phrase": "ireland"}, {"score": 0.0029467742734417255, "phrase": "university_students"}, {"score": 0.0028273061946184645, "phrase": "social_networking_sites"}, {"score": 0.002769395841379498, "phrase": "communication_purposes"}, {"score": 0.0023958326775913165, "phrase": "specific_illnesses"}, {"score": 0.0023711591828229736, "phrase": "sexual_health"}], "paper_keywords": ["Health information", " Internet", " Online habits", " Social networking", " Students"], "paper_abstract": "Studies have explored the use of the Internet for health information, but few have focused on the young adult population, a population that is known to have difficulties in accessing mainstream health services. It has been acknowledged that young people are active users of the Internet, and this mode of health service delivery warrants further exploration. This study aimed to determine university students' online habits and their use of the Internet for health information using a quantitative descriptive design. Data were collected from 922 university students in Ireland, aged between 18 and 24 years. The findings indicated that university students are active users of the Internet and of social networking sites, particularly for communication purposes. It was also found that 66.1% of participants had used the Internet to search for health information, for a variety of reasons, including information on specific illnesses, sexual health, and fitness and nutrition. It is concluded that the use of the Internet to communicate with young people in relation to their health needs to be explored.", "paper_title": "University Students' Online Habits and Their Use of the Internet for Health Information", "paper_id": "WOS:000308135600003"}