{"auto_keywords": [{"score": 0.04403369388104738, "phrase": "distant_communication"}, {"score": 0.030004026261512426, "phrase": "physical_embodiment"}, {"score": 0.014180508118532376, "phrase": "real-time_avatars"}, {"score": 0.00481495049065317, "phrase": "fine-grained_communication_analysis"}, {"score": 0.004703075081891693, "phrase": "motion_tracking_technologies"}, {"score": 0.004502126088469323, "phrase": "user's_facial_and_body_motions"}, {"score": 0.004111672925576111, "phrase": "positive_effects"}, {"score": 0.004002596930301241, "phrase": "first_experiment"}, {"score": 0.003922685601503529, "phrase": "conversation_partner's_video"}, {"score": 0.0036553070575015344, "phrase": "partner's_motion"}, {"score": 0.003558294449586273, "phrase": "partner's_appearance"}, {"score": 0.002957327365538023, "phrase": "second_experiment"}, {"score": 0.0027370835853738626, "phrase": "teleoperated_robots"}, {"score": 0.0026823700218343506, "phrase": "user's_body_motions"}, {"score": 0.002646501671714952, "phrase": "user's_appearance"}, {"score": 0.002465895175961543, "phrase": "smoother_speech"}, {"score": 0.0024084679931209514, "phrase": "body_motions"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["avatar", " robot", " face tracking", " video chat", " teleconferencing", " distant communication"], "paper_abstract": "Thanks to the maturity of motion tracking technologies, it became easy and inexpensive to use avatars that reflect the user's facial and body motions in real time. There is a possibility that those real-time avatars can serve as a substitute for videos in distant communication. We conducted two experiments to confirm positive effects of avatars on distant communication. In the first experiment, the subjects watched a conversation partner's video, avatar, photo, or nothing when speaking to the partner. Because the video and avatar delivered the partner's motion while the video and photo delivered the partner's appearance, we were able to observe the effects of the motion and appearance separately. As a result, we found that presenting the motion via a video or an avatar increased the degree of the smoothness of speaking to the partner, but the appearance did not significantly affect such an influence. In the second experiment, we compared the avatar and teleoperated robot to find how a physical embodiment influences the degree of the smoothness of speech. Teleoperated robots resemble avatars in transmitting the user's body motions without disclosing the user's appearance but differ in reflecting these motions onto a robot that has a physical embodiment. We predicted that the robot produces smoother speech because the physical embodiment might make the body motions recognizable. However, the robot decreased the degree of the smoothness of speech against our expectation. The results of these experiments showed that real-time avatars that present only body motions are enough to smooth distant communication. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Appearance, motion, and embodiment: unpacking avatars by fine-grained communication analysis", "paper_id": "WOS:000358163500003"}