{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "language_theoretic_and_algorithmic_results"}, {"score": 0.004681653551412616, "phrase": "newly_introduced_operation"}, {"score": 0.004644247838681628, "phrase": "formal_languages"}, {"score": 0.004570326517392777, "phrase": "biological_phenomena"}, {"score": 0.004355516897622305, "phrase": "new_variant"}, {"score": 0.004303404058571052, "phrase": "hairpin_completion"}, {"score": 0.004101088357088207, "phrase": "possible_bio-lab_implementation"}, {"score": 0.0038614646772981848, "phrase": "hairpin_structure"}, {"score": 0.003549245218355768, "phrase": "language_theoretic_results"}, {"score": 0.0033958751452139984, "phrase": "different_classes"}, {"score": 0.0033552055241931346, "phrase": "chomsky_hierarchy"}, {"score": 0.003121183062764093, "phrase": "efficient_algorithm"}, {"score": 0.002722634472231842, "phrase": "starting_language"}, {"score": 0.0024036710362692042, "phrase": "closure_properties"}, {"score": 0.002374855916752648, "phrase": "discussed_classes"}, {"score": 0.002253920389285441, "phrase": "hairpin_lengthening_distance"}], "paper_keywords": ["DNA computing", " hairpin structure", " hairpin completion", " hairpin lengthening", " formal languages"], "paper_abstract": "The hairpin completion is a newly introduced operation on formal languages, inspired by biological phenomena and by DNA-computing. In this article, we analyse a new variant of the hairpin completion, called hairpin lengthening, which seems more appropriate for a possible bio-lab implementation. The variant considered here concerns the lengthening of the word that forms a hairpin structure, such that this structure is preserved, without necessarily completing the hairpin. First we present a series of language theoretic results regarding the one-step and iterated hairpin lengthening of languages from different classes of the Chomsky hierarchy. Following our biological motivation we also approach several algorithmic properties of this operation. More precisely, we propose an efficient algorithm for the recognition of the iterated hairpin lengthening of a language, and show how it can be particularized to recognize the one-step hairpin lengthening of a language; the cases when the starting language is finite, regular, linear context-free or context-free are discussed. It is worth noting that these results cannot be deduced canonically from the closure properties of the discussed classes of languages. We also propose an algorithm for computing efficiently the hairpin lengthening distance between a word and all its factors; this algorithm can be used to compute the distance between two words, or the common hairpin-lengthening ancestors of two words.", "paper_title": "Hairpin lengthening: language theoretic and algorithmic results", "paper_id": "WOS:000359658400002"}