{"auto_keywords": [{"score": 0.04917590014781086, "phrase": "geographic_knowledge"}, {"score": 0.011815418685372902, "phrase": "geographic_objects"}, {"score": 0.00481495049065317, "phrase": "geographic_knowledge_engineering"}, {"score": 0.004634969772496517, "phrase": "urban_and_environmental_planning"}, {"score": 0.0045475066042750135, "phrase": "territorial_intelligence"}, {"score": 0.004233905451521571, "phrase": "tentative_conceptual_framework"}, {"score": 0.004203755099553109, "phrase": "practical_geographic_knowledge"}, {"score": 0.003979595592631525, "phrase": "sliver_polygons"}, {"score": 0.003932463153573191, "phrase": "real_features"}, {"score": 0.003876637620664603, "phrase": "many-to-many_relationship"}, {"score": 0.003643708557737021, "phrase": "small_measurement_errors"}, {"score": 0.00353252736114556, "phrase": "different_properties"}, {"score": 0.003400319264221666, "phrase": "spatial_relations"}, {"score": 0.003336076207855162, "phrase": "projective_relations"}, {"score": 0.0032886890742735778, "phrase": "ribbon_topology_relations"}, {"score": 0.0031807119319674977, "phrase": "conceptual_framework"}, {"score": 0.003128055981789474, "phrase": "overall_guidelines"}, {"score": 0.002996611146746012, "phrase": "basic_building_blocks"}, {"score": 0.002982350418963658, "phrase": "theoretical_models"}, {"score": 0.002905117389508774, "phrase": "preliminary_considerations"}, {"score": 0.0028366375814063848, "phrase": "essentially_rules"}, {"score": 0.0027565833296749674, "phrase": "geographic_science"}, {"score": 0.0025969673094636755, "phrase": "spatial_relationships"}, {"score": 0.002578443684503779, "phrase": "visual_acuity"}, {"score": 0.0025176448284720838, "phrase": "neighboring_information"}, {"score": 0.0025056577497695027, "phrase": "cross-boundary_interoperability"}, {"score": 0.0024759385358850373, "phrase": "geographic_knowledge_types"}, {"score": 0.002315892979412874, "phrase": "knowledge_chunks"}, {"score": 0.002266674802326747, "phrase": "descriptive_logics"}, {"score": 0.0021610055929651216, "phrase": "visual_language"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Geoprocessing fundamentals", " Geographic knowledge engineering", " Spatial knowledge engineering", " Visual language", " Geographic reasoning"], "paper_abstract": "In many applications, the management of geographic knowledge is very important especially not only for urban and environmental planning, but also for any application in territorial intelligence. However there are several practical problems hindering the efficiency, some of them being technical and other being more conceptual. The goal of this paper is to present a tentative conceptual framework for managing practical geographic knowledge taking account of accuracy, rotundity of earth, the mobility of objects, multiple-representation, multi-scale, existence of sliver polygons, differences in classifying real features (ontologies), the many-to-many relationship of place names (gazetteers) and the necessity of interoperability. In other words, this framework must be robust against scaling, generalization and small measurement errors. Therefore, geographic objects must be distinguished into several classes of objects with different properties, namely geodetic objects, administrative objects, manmade objects and natural objects. Regarding spatial relations, in addition to conventional topological and projective relations, other relations including tessellations and ribbon topology relations are presented in order to help model geographic objects by integrating more practical semantics. Any conceptual framework is based on principles which are overall guidelines and rules; moreover, principles allow at making predictions and drawing implications and are finally the basic building blocks of theoretical models. But before identifying the principles, one needs some preliminary considerations named prolegomena. In our case, principles will be essentially rules for transforming geographic knowledge whereas prolegomena will be assertions regarding more the foundations of geographic science. Based on those considerations, 12 principles are given, preceded by 12 prolegomena. For instance, some principles deal with the transformation of spatial relationships based on visual acuity and granularity of interest, with the influence of neighboring information and cross-boundary interoperability. New categories of geographic knowledge types are presented, spatial facts, cluster of areas, flows of persons, goods, etc., topological constraints and co-location rules. To represent knowledge chunks, three styles are presented, based respectively on descriptive logics, XML and visual languages. To conclude this paper, after having defined contexts of interpretation, an example of visual language to manage geographic knowledge is proposed. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A conceptual framework for geographic knowledge engineering", "paper_id": "WOS:000331026600002"}