{"auto_keywords": [{"score": 0.030904024955940936, "phrase": "cdp"}, {"score": 0.004770954764363855, "phrase": "korf"}, {"score": 0.00472738932434119, "phrase": "reid"}, {"score": 0.004684158248408618, "phrase": "edelkamp"}, {"score": 0.004473982381245469, "phrase": "kre"}, {"score": 0.004007244770653557, "phrase": "chen"}, {"score": 0.0035072146967082083, "phrase": "prediction_methods"}, {"score": 0.0032886455096627324, "phrase": "preprocessing_step"}, {"score": 0.0032287289440915187, "phrase": "'s_prediction_accuracy"}, {"score": 0.002878140062594849, "phrase": "exactly_the_same_predictions"}, {"score": 0.0027361626349903744, "phrase": "kre_line"}, {"score": 0.0025071862539276283, "phrase": "empirical_comparison"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Heuristic search", " Predicting search performance"], "paper_abstract": "Korf, Reid and Edelkamp initiated a line of research for developing methods (KRE and later CDP) that predict the number of nodes expanded by IDA* for a given start state and cost bound. Independently, Chen developed a method (ss) that can also be used to predict the number of nodes expanded by IDA*. In this paper we improve both of these prediction methods. First, we present epsilon-truncation, a method that acts as a preprocessing step and improves cDP's prediction accuracy. Second and orthogonally to E-truncation, we present a variant of CDP that can be orders of magnitude faster than CDP while producing exactly the same predictions. Third, we show how ideas developed in the KRE line of research can be used to improve the predictions produced by ss. Finally, we make an empirical comparison between our new enhanced versions of CDP and ss. Our experimental results suggest that CDP is suitable for applications that require less accurate but fast predictions, while ss is suitable for applications that require more accurate predictions but can afford more computation time. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Predicting the size of IDA*'s search tree", "paper_id": "WOS:000319087200003"}