{"auto_keywords": [{"score": 0.030771958238452326, "phrase": "personal_hotspots"}, {"score": 0.015719716506582524, "phrase": "opportunistic_social_networks"}, {"score": 0.00455585162011571, "phrase": "human_mobility"}, {"score": 0.004493275458211613, "phrase": "social_contexts"}, {"score": 0.004149716134716874, "phrase": "traditional_social_networks_analysis"}, {"score": 0.004036455094603843, "phrase": "transient_node_contact"}, {"score": 0.003994780550602818, "phrase": "intermittently_connected_link"}, {"score": 0.0035391223341472502, "phrase": "real_world"}, {"score": 0.0033834012029672423, "phrase": "public_hotspot"}, {"score": 0.003325343504284345, "phrase": "personal_hotspot"}, {"score": 0.0030390745780621503, "phrase": "opportunistic_routing"}, {"score": 0.0029662917511334604, "phrase": "relative_entropy"}, {"score": 0.0029356335847783195, "phrase": "public_hotspots"}, {"score": 0.002875261849352716, "phrase": "node_centrality"}, {"score": 0.0025914765323897604, "phrase": "universal_gravitation"}, {"score": 0.002319503690965857, "phrase": "extensive_trace-driven_simulations"}, {"score": 0.0022717738872652013, "phrase": "hotent"}, {"score": 0.0022020103573658035, "phrase": "packet_delivery_ratio"}, {"score": 0.002179234170770192, "phrase": "average_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Hotspot", " Information entropy", " Data forwarding", " Opportunistic social networks"], "paper_abstract": "Performance of data forwarding in opportunistic social networks benefits considerably if one can make use of human mobility in terms of social contexts. However, it is difficult and time-consuming to calculate the centrality and similarity of nodes by using solutions of traditional social networks analysis, this is mainly because of the transient node contact and the intermittently connected link. In this paper, we are interested in the following question: Can we exploit some other stable social attributes to quantify the centrality and similarity of nodes? Aggregating GPS traces of human walks from the real world, we find that there exist two types of phenomena. One is public hotspot, the other is personal hotspot. Motivated by this observation, we propose Hotent (HOTspot-ENTropy), a novel data forwarding metric to improve the performance of opportunistic routing. First, we use the relative entropy between the public hotspots and the personal hotspots to compute node centrality. Second, we utilize the inverse symmetrized entropy of the personal hotspots between two nodes to evaluate their similarity. Third, we integrate the two social metrics by using the law of universal gravitation. Besides, we use the entropy of personal hotspots of a node to characterize its personality. Finally, we compare our routing strategy with the state-of-the-art works through extensive trace-driven simulations, the results show that Hotent largely outperforms other solutions, especially in terms of packet delivery ratio and the average number of hops per message. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Hotspot-entropy based data forwarding in opportunistic social networks", "paper_id": "WOS:000348027800010"}