{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "regular_temporal_distribution"}, {"score": 0.0047464608267006395, "phrase": "optimal_staff_scheduling"}, {"score": 0.004678940805063634, "phrase": "elaborate_computational_methods"}, {"score": 0.004376273644295806, "phrase": "simpler_approaches"}, {"score": 0.004232331639807526, "phrase": "simple_procedure"}, {"score": 0.004172094622123562, "phrase": "random_and_greedy_strategies"}, {"score": 0.003977403701783668, "phrase": "spanish_hospital"}, {"score": 0.003920780681351006, "phrase": "guard_shifts"}, {"score": 0.00349577373145384, "phrase": "workload_distribution"}, {"score": 0.003087017178815267, "phrase": "shift_types"}, {"score": 0.0030285084113651035, "phrase": "unfrequent_and_aperiodic_types"}, {"score": 0.002928765962664163, "phrase": "long_weekends"}, {"score": 0.002661474607275484, "phrase": "particular_pairing"}, {"score": 0.002500927169609655, "phrase": "suitable_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Personnel scheduling", " Greedy search"], "paper_abstract": "Although optimal staff scheduling often requires elaborate computational methods, those cases which are not highly constrained can be efficiently solved using simpler approaches. This paper describes how a simple procedure, combining random and greedy strategies with heuristics, has been successfully applied in a Spanish hospital to assign guard shifts to the physicians in a department. In this case, the employees prefer that their guard duties are regularly distributed in time. The workload distribution must also satisfy some constraints: in particular, the distribution of duties among the staff must be uniform when a number of tasks and shift types (including some unfrequent and aperiodic types, such as those scheduled during long weekends) are considered. Furthermore, the composition of teams should be varied, in the sense that no particular pairing should dominate the assignments. The procedure proposed is able to find suitable solutions when the number of employees available for every task is not small compared to the number required at every shift. The software is distributed under the terms of the GNU General Public License. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Long-term staff scheduling with regular temporal distribution", "paper_id": "WOS:000283040000010"}