{"auto_keywords": [{"score": 0.013123304830358954, "phrase": "mock_model"}, {"score": 0.008587100601280229, "phrase": "time_delay"}, {"score": 0.008437506399555445, "phrase": "strong_gravitational_lensing"}, {"score": 0.007637349299858056, "phrase": "mass_codes"}, {"score": 0.00703529375817355, "phrase": "calculated_time_delay"}, {"score": 0.0068922944118151586, "phrase": "percent_change"}, {"score": 0.00481495049065317, "phrase": "strong_gravitational_lens_model_software_i._redshift"}, {"score": 0.004716867446922295, "phrase": "mass_calculations"}, {"score": 0.004620773128779254, "phrase": "software_analysis"}, {"score": 0.004593677275091001, "phrase": "observational_data"}, {"score": 0.004421368738303273, "phrase": "strong_gravitational_lens_modeling_software"}, {"score": 0.0037830010278885437, "phrase": "time_delays"}, {"score": 0.003598371921676043, "phrase": "singular_isothermal_ellipsoid"}, {"score": 0.0035042905855674875, "phrase": "five_models"}, {"score": 0.00303346212256215, "phrase": "similar_magnitude"}, {"score": 0.002980325931052783, "phrase": "calculated_time_delays"}, {"score": 0.002851510437722781, "phrase": "image_position"}, {"score": 0.002809817987970514, "phrase": "grale"}, {"score": 0.0027282473656358784, "phrase": "enclosed_mass"}, {"score": 0.0023684091424541038, "phrase": "comparative_studies"}, {"score": 0.002279379132030189, "phrase": "small_changes"}, {"score": 0.0021488865854453073, "phrase": "particular_software"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Strong gravitational lensing", " Computer simulation", " Redshift", " Cosmological constraints", " Time delay"], "paper_abstract": "Analysis of strong gravitational lensing depends on software analysis of observational data. The purpose of this study is to evaluate the behavior of strong gravitational lens modeling software with changes in redshift. Four different strong gravitational lens software modeling codes are directly compared (Lenstool/glafic, two light traces mass codes, and GRALE/PixeLens, two non-light traces mass codes) in the analysis of a mock model as well as analysis of SDSSJ1004 + 4112. The calculated time delay is proportional to DdDs/D-ds. The percent change in time delays calculated at each redshift tested is compared with percent change in DdDs/D-ds. A mock model with a singular isothermal ellipsoid and four images is tested with each code. Five models are used with a constant z(lens) and a varying z(source), and five models with a constant z(source) and a varying z(lens). The effects of changing geometry are similarly investigated for SDSSJ1004 + 4112. In general, the changes in time delay are of a similar magnitude and direction, although some calculated time delays did not follow changes in DdDs/D-ds. This variation is explained by changes in image position calculated by glafic and GRALE, which varied according to D-ds/D-s. Changes in enclosed mass for the mock model with a constant z(source) are similar to changes in DdDs/D-ds for three of the four codes tested. These data demonstrate the effect of changes in redshift on parameters calculated by each of the codes as compared to changes in DdDs/D-ds. The paucity of comparative studies in strong gravitational lensing suggests the need for further studies. These results show that small changes in redshift affect the calculated time delay and mass, and that the effect on the calculations is dependent on the particular software used. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Comparison of strong gravitational lens model software I. Redshift and model dependence of time delay and mass calculations", "paper_id": "WOS:000354902400003"}