{"auto_keywords": [{"score": 0.04588564535385819, "phrase": "symbolic_approach"}, {"score": 0.028198276166246455, "phrase": "group_key_exchange_protocols"}, {"score": 0.0076543271981727844, "phrase": "computational_approach"}, {"score": 0.0069873320295128355, "phrase": "computational_soundness"}, {"score": 0.004551563730037998, "phrase": "cryptographic_community"}, {"score": 0.004487989502479992, "phrase": "current_work"}, {"score": 0.004363480951473701, "phrase": "security_analysis"}, {"score": 0.003434922209075514, "phrase": "computationally_sound_symbolic_security_reduction_approach"}, {"score": 0.0032467792804296036, "phrase": "bilinear_pairings"}, {"score": 0.003212663446866794, "phrase": "universally_composable_symbolic_analysis"}, {"score": 0.0031124451011241496, "phrase": "two-party_protocols"}, {"score": 0.0028201570908224166, "phrase": "simple_protocols"}, {"score": 0.002415170557932468, "phrase": "arbitrary_number"}, {"score": 0.002290814637620121, "phrase": "proposed_approach"}, {"score": 0.002227125088932002, "phrase": "cryptographic_primitives"}, {"score": 0.0021882194836465936, "phrase": "computationally_sound_and_efficient_symbolic_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Universally composable symbolic analysis", " Computational soundness", " Bilinear pairing", " Group key exchange protocol"], "paper_abstract": "The security of the group key exchange protocols has been widely studied in the cryptographic community in recent years. Current work usually applies either the computational approach or the symbolic approach for security analysis. The symbolic approach is more efficient than the computational approach, because it can be easily automated. However, compared with the computational approach, it has to overcome three challenges: (1) The computational soundness is unclear; (2) the number of participants must be fixed; and (3) the advantage of efficiency disappears, if the number of participants is large. This paper proposes a computationally sound symbolic security reduction approach to resolve these three issues. On one hand, combined with the properties of the bilinear pairings, the universally composable symbolic analysis (UCSA) approach is extended from the two-party protocols to the group key exchange protocols. Meanwhile, the computational soundness of the symbolic approach is guaranteed. On the other hand, for the group key exchange protocols which satisfy the syntax of the simple protocols proposed in this paper, the security is proved to be unrelated with the number of participants. As a result, the symbolic approach just needs to deal with the protocols among three participants. This makes the symbolic approach has the ability to handle arbitrary number of participants. Therefore, the advantage of efficiency is still guaranteed. The proposed approach can also be applied to other types of cryptographic primitives besides bilinear pairing for computationally sound and efficient symbolic analysis of group key exchange protocols. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Computationally sound symbolic security reduction analysis of the group key exchange protocols using bilinear pairings", "paper_id": "WOS:000307198400007"}