{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "argumentative_knowledge_construction"}, {"score": 0.015505893263073004, "phrase": "transactive_discussion_script"}, {"score": 0.0047051051659828275, "phrase": "cscl._learning"}, {"score": 0.004555499634179394, "phrase": "complex_problems"}, {"score": 0.0042506731642425275, "phrase": "computer-supported_collaborative_learning"}, {"score": 0.003929689573550262, "phrase": "multidisciplinary_cscl_groups"}, {"score": 0.003616108223034427, "phrase": "meaningful_questions"}, {"score": 0.0035010071030752883, "phrase": "argument_syntheses"}, {"score": 0.0034052594710793664, "phrase": "laboratory_experiment"}, {"score": 0.0032968474833776906, "phrase": "multidisciplinary_dyads"}, {"score": 0.0027913353347879507, "phrase": "authentic_problem_case"}, {"score": 0.002640636493247601, "phrase": "community-based_social_marketing"}, {"score": 0.0026042472337367015, "phrase": "sustainable_agricultural_water_management"}, {"score": 0.0023851187337905412, "phrase": "scripted_condition"}, {"score": 0.002363150587804677, "phrase": "significantly_more_domain-specific_and_domain-general_knowledge"}, {"score": 0.0021843879253500894, "phrase": "cscl_scripts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Argumentative knowledge construction", " Collaborative learning", " Computer-supported collaborative learning", " Multidisciplinary groups", " Transactive discussion script"], "paper_abstract": "Learning to argue is prerequisite to solving complex problems in groups, especially when they are multidisciplinary and collaborate online. Environments for Computer-Supported Collaborative Learning (CSCL) can be designed to facilitate argumentative knowledge construction. This study investigates how argumentative knowledge construction in multidisciplinary CSCL groups can be facilitated with a transactive discussion script. The script prompts learners to paraphrase, criticize, ask meaningful questions, construct counterarguments, and propose argument syntheses. As part of a laboratory experiment, 60 university students were randomly assigned to multidisciplinary dyads based on their disciplinary backgrounds (i.e. water management or international development studies). These dyads were randomly assigned to a scripted (experimental) or non-scripted (control) condition. They were asked to analyse, discuss, and solve an authentic problem case related to both of their domains, i.e. applying the concept of community-based social marketing in fostering sustainable agricultural water management. The results showed that the transactive discussion script facilitates argumentative knowledge construction during discourse. Furthermore, learners assigned to the scripted condition acquired significantly more domain-specific and domain-general knowledge on argumentation than learners assigned to the unscripted condition. We discuss how these results advance research on CSCL scripts and argumentative knowledge construction. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Facilitating argumentative knowledge construction through a transactive discussion script in CSCL", "paper_id": "WOS:000312517900006"}