{"auto_keywords": [{"score": 0.029171317115594717, "phrase": "initial_scenario"}, {"score": 0.00481495049065317, "phrase": "robust_hybrid_flow_shop_scheduling"}, {"score": 0.0047152877145889656, "phrase": "scheduling_methods"}, {"score": 0.004641890423057823, "phrase": "deterministic_environment"}, {"score": 0.0040942189695983185, "phrase": "robust_scheduling"}, {"score": 0.0037653554368382814, "phrase": "scheduling_problem"}, {"score": 0.003629882559085245, "phrase": "hybrid_flow_shop_scheduling_problem"}, {"score": 0.003118486096035156, "phrase": "genetic_algorithm"}, {"score": 0.003069867656852932, "phrase": "robust_bi-objective_evaluation_function"}, {"score": 0.002867771524071872, "phrase": "data_uncertainty"}, {"score": 0.002823050755743821, "phrase": "bi-objective_function"}, {"score": 0.0027936239349923464, "phrase": "simultaneously_the_makespan"}, {"score": 0.0022653055209664284, "phrase": "computational_results"}], "paper_keywords": ["uncertainty", " robustness", " effectiveness", " genetic algorithm", " hybrid flow shop scheduling", " simulation"], "paper_abstract": "Most of scheduling methods consider a deterministic environment for which the data of the problem are known. Nevertheless, in reality, several kinds of uncertainties should be considered, and robust scheduling allows uncertainty to be taken into account. In this article, we consider a scheduling problem under uncertainty. Our case study is a hybrid flow shop scheduling problem, and the processing time of each job for each machine at each stage is the source of uncertainty. To solve this problem, we developed a genetic algorithm. A robust bi-objective evaluation function was defined to obtain a robust, effective solution that is only slightly sensitive to data uncertainty. This bi-objective function minimises simultaneously the makespan of the initial scenario, and the deviation between the makespan of all the disrupted scenarios and the makespan of the initial scenario. We validated our approach with a simulation in order to evaluate the quality of the robustness faced with uncertainty. The computational results show that our algorithm can generate a trade off for effectiveness and robustness for various degrees of uncertainty.", "paper_title": "A genetic algorithm for robust hybrid flow shop scheduling", "paper_id": "WOS:000296272100004"}