{"auto_keywords": [{"score": 0.04232478027153052, "phrase": "nash_equilibrium"}, {"score": 0.02250656393813834, "phrase": "selfish_routing"}, {"score": 0.01242548267779816, "phrase": "linear_latency_functions"}, {"score": 0.009201412002405483, "phrase": "total_latency"}, {"score": 0.007323850402034144, "phrase": "network_edges"}, {"score": 0.006429203015267042, "phrase": "selfish_users"}, {"score": 0.005372339699380275, "phrase": "edge_removals"}, {"score": 0.0047841335646924815, "phrase": "economic_incentives"}, {"score": 0.004753512932910936, "phrase": "selfish_behavior"}, {"score": 0.004593467306126913, "phrase": "network_traffic"}, {"score": 0.004476963405985556, "phrase": "edge_congestion"}, {"score": 0.004448300015467547, "phrase": "network_users"}, {"score": 0.004372754377223336, "phrase": "minimum-latency_paths"}, {"score": 0.004216434794603139, "phrase": "travel_times"}, {"score": 0.0039035351575463103, "phrase": "network_user"}, {"score": 0.0038785287909095796, "phrase": "congestion_effects"}, {"score": 0.0037398106866046972, "phrase": "marginal_cost_pricing"}, {"score": 0.0036137713873827374, "phrase": "collected_taxes"}, {"score": 0.0034179225740833055, "phrase": "total_user_disutility"}, {"score": 0.00319134078848996, "phrase": "famous_braess's_paradox"}, {"score": 0.003024794819268207, "phrase": "sufficiently_large_tax"}, {"score": 0.0029416448256236057, "phrase": "previous_work"}, {"score": 0.002879237498994052, "phrase": "designing_networks"}, {"score": 0.002788093250433863, "phrase": "computer_science"}, {"score": 0.002597577409911978, "phrase": "large_class"}, {"score": 0.0024725273985046936, "phrase": "largest-possible_benefit"}, {"score": 0.0023484391331502113, "phrase": "removing_edges"}, {"score": 0.00231840032236117, "phrase": "nonlinear_latency_functions"}, {"score": 0.002192599828534981, "phrase": "optimal_taxes"}, {"score": 0.0021371489401392986, "phrase": "np"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["game theory in networks", " inefficiency of equilibria", " marginal cost taxes", " pricing", " selfish routing"], "paper_abstract": "We study economic incentives for influencing selfish behavior in networks. We consider a model of selfish routing in which the latency experienced by network traffic on an edge of the network is a function of the edge congestion, and network users are assumed to selfishly route traffic on minimum-latency paths. The quality of a routing of traffic is historically measured by the sum of all travel times, also called the total latency.. It is well known that the outcome of selfish routing (a flow at Nash equilibrium) does not minimize the total latency, and that marginal cost pricing-charging each network user for the congestion effects caused by its presence-eliminates the inefficiency of selfish routing. However, the principle of marginal cost pricing assumes that taxes cause no disutility to network users; this is appropriate only when collected taxes can be feasibly returned (directly or indirectly) to the users, If this assumption does not hold and we wish to minimize the total user disutility (latency plus taxes paid)-the total cost-how should we price the network edges? Intuition may suggest that taxes can never improve the cost of a Nash equilibrium, but the famous Braess's Paradox shows this intuition to be incorrect. We consider strategies for pricing network edges to reduce the cost of a Nash equilibrium. Since levying a sufficiently large tax on an edge effectively removes it from the network, our study generalizes previous work on designing networks for selfish users [T Roughgarden, Designing networks for selfish users is hard, in: Proceedings of the 42nd Annual Symposium on Foundations of Computer Science (FOCS), 2001, pp. 472-481 (full version to appear in Journal of Computer and System Sciences)]. In this paper, we prove the following results. In a large class of networks-including all networks with linear latency functions-marginal cost taxes do not improve the cost of a Nash equilibrium. The largest-possible benefit from taxes does not exceed that from edge removals. In ever), network with linear latency functions, the benefit of taxes cannot exceed that of removing edges. There are networks with nonlinear latency functions, however, in which taxes are radically more powerful than edge removals. For every epsilon > 0, there is no (4/3 - epsilon)-approximation algorithm for computing optimal taxes, even in networks with linear latency functions (assuming P not equal NP). (C) 2005 Elsevier Inc. All rights reserved.", "paper_title": "How much can taxes help selfish routing?", "paper_id": "WOS:000237143700004"}