{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "occluded_objects"}, {"score": 0.009365354132018796, "phrase": "handheld_devices"}, {"score": 0.00578532226988373, "phrase": "ar_visualizations"}, {"score": 0.004785022360244881, "phrase": "handheld_augmented_reality"}, {"score": 0.004566384853664753, "phrase": "augmented_reality"}, {"score": 0.004481740377469438, "phrase": "increased_usage"}, {"score": 0.004480635320277541, "phrase": "handheld_ar_systems"}, {"score": 0.004440005714775306, "phrase": "portable_handheld_devices"}, {"score": 0.004398657974555281, "phrase": "handheld_ar_applications"}, {"score": 0.004171492822734768, "phrase": "user_experience"}, {"score": 0.003906944616017869, "phrase": "head-worn_displays"}, {"score": 0.0037390087984220752, "phrase": "depth_judgment"}, {"score": 0.0036137129449624727, "phrase": "ar_systems"}, {"score": 0.0035912243639260846, "phrase": "outdoor_environments"}, {"score": 0.0035356111195810483, "phrase": "higher_degree"}, {"score": 0.003491739070201915, "phrase": "indoor_environments"}, {"score": 0.00331125524068286, "phrase": "five_experiments"}, {"score": 0.0032498004320510076, "phrase": "outdoor_locations"}, {"score": 0.0032094634756436595, "phrase": "design_recommendations"}, {"score": 0.0029777101656842803, "phrase": "depth_perception"}, {"score": 0.002931569771634119, "phrase": "non-occluded_objects"}, {"score": 0.002868168412858044, "phrase": "different_scenarios"}, {"score": 0.0028237205895435733, "phrase": "multiple_visualizations"}, {"score": 0.0027369286729615086, "phrase": "ar"}, {"score": 0.002595307614796063, "phrase": "clear_visibility"}, {"score": 0.0023556945924067475, "phrase": "display_field"}, {"score": 0.002171836484200008, "phrase": "multiple_graphical_objects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Augmented reality", " Handheld devices", " Experiments", " Visualizations for occluded objects", " Outdoor environments"], "paper_abstract": "Handheld devices like smartphones and tablets have emerged as one of the most promising platforms for Augmented Reality (AR). The increased usage of these portable handheld devices has enabled handheld AR applications to reach the end-users; hence, it is timely and important to seriously consider the user experience of such applications. AR visualizations for occluded objects enable an observer to look through objects. AR visualizations have been predominantly evaluated using Head-Worn Displays (HWDs), handheld devices have rarely been used. However, unless we gain a better understanding of the perceptual and cognitive effects of handheld AR systems, effective interfaces for handheld devices cannot be designed. Similarly, human perception of AR systems in outdoor environments, which provide a higher degree of variation than indoor environments, has only been insufficiently explored. In this paper, we present insights acquired from five experiments we performed using handheld devices in outdoor locations. We provide design recommendations for handheld AR systems equipped with visualizations for occluded objects. Our key conclusions are the following: (1) Use of visualizations for occluded objects improves the depth perception of occluded objects akin to non-occluded objects. (2) To support different scenarios, handheld AR systems should provide multiple visualizations for occluded objects to complement each other. (3) Visual clutter in AR visualizations reduces the visibility of occluded objects and deteriorates depth judgment; depth judgment can be improved by providing clear visibility of the occluded objects. (4) Similar to virtual reality interfaces, both egocentric and exocentric distances are underestimated in handheld AR. (5) Depth perception will improve if handheld AR systems can dynamically adapt their geometric field of view (GFOV) to match the display field of view (DFOV). (6) Large handheld displays are hard to carry and use; however, they enable users to better grasp the depth of multiple graphical objects that are presented simultaneously. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Lessons learned: Evaluating visualizations for occluded objects in handheld augmented reality", "paper_id": "WOS:000340697000002"}