{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "divergence_distance"}, {"score": 0.04974064540897104, "phrase": "fuzzy_clustering"}, {"score": 0.004747141873785, "phrase": "clustering_algorithms"}, {"score": 0.004549366134876482, "phrase": "similar_data_objects"}, {"score": 0.0038780652371817447, "phrase": "membership_grade"}, {"score": 0.0037295765964056255, "phrase": "fuzzy_c-means"}, {"score": 0.003650984439966844, "phrase": "fuzzy_objective_function_algorithms"}, {"score": 0.003511159930253876, "phrase": "isodata_algorithm"}, {"score": 0.003212906206685004, "phrase": "proper_cluster_shape"}, {"score": 0.003190219668943985, "phrase": "jain"}, {"score": 0.0031340167205149813, "phrase": "acm_computing_survey"}, {"score": 0.0028881548838751705, "phrase": "fuzzy_sets"}, {"score": 0.00285753732066807, "phrase": "feature_space"}, {"score": 0.0028072256092845417, "phrase": "fuzzy_clustering_optimization_problem"}, {"score": 0.0025961429982767257, "phrase": "probabilistic_distance"}, {"score": 0.0025413743933379185, "phrase": "modified_fuzzy_clustering"}, {"score": 0.0024877583128884457, "phrase": "variance_covariance"}, {"score": 0.0024701382170046462, "phrase": "input_terms"}, {"score": 0.0024180213826477093, "phrase": "underlying_optimization_problem"}, {"score": 0.0023838876943453515, "phrase": "optimal_solution"}, {"score": 0.0021503823972534096, "phrase": "gaussian_membership_functions"}, {"score": 0.0021049977753042253, "phrase": "well-known_iris_dataset"}], "paper_keywords": ["feature space", " fuzzy clustering"], "paper_abstract": "Clustering algorithms divide up a dataset into a set of classes/clusters, where similar data objects are assigned to the same cluster. When the boundary between clusters is ill defined, which yields situations where the same data object belongs to more than one class, the notion of fuzzy clustering becomes relevant. In this course, each datum belongs to a given class with some membership grade, between 0 and 1. The most prominent fuzzy clustering algorithm is the fuzzy c-means introduced by Bezdek (Pattern recognition with fuzzy objective function algorithms, 1981), a fuzzification of the k-means or ISODATA algorithm. On the other hand, several research issues have been raised regarding both the objective function to be minimized and the optimization constraints, which help to identify proper cluster shape (Jain et al., ACM Computing Survey 31(3): 264-323, 1999). This paper addresses the issue of clustering by evaluating the distance of fuzzy sets in a feature space. Especially, the fuzzy clustering optimization problem is reformulated when the distance is rather given in terms of divergence distance, which builds a bridge to the notion of probabilistic distance. This leads to a modified fuzzy clustering, which implicitly involves the variance covariance of input terms. The solution of the underlying optimization problem in terms of optimal solution is determined while the existence and uniqueness of the solution are demonstrated. The performances of the algorithm are assessed through two numerical applications. The former involves clustering of Gaussian membership functions and the latter tackles the well-known Iris dataset. Comparisons with standard fuzzy c-means (FCM) are evaluated and discussed.", "paper_title": "On the use of divergence distance in fuzzy clustering", "paper_id": "WOS:000259101700003"}