{"auto_keywords": [{"score": 0.044786117849615066, "phrase": "connected_graph"}, {"score": 0.00481495049065317, "phrase": "connected_graphs"}, {"score": 0.004725886853744007, "phrase": "dimensional_problem"}, {"score": 0.003812299519486331, "phrase": "demand_volumes"}, {"score": 0.0032370412139943808, "phrase": "single-row_routing_network"}, {"score": 0.0031036643805367487, "phrase": "optimum_routing_network"}, {"score": 0.002839812512030847, "phrase": "hopfield_neural_network"}, {"score": 0.002787181295054319, "phrase": "adcliq"}, {"score": 0.002562123444678208, "phrase": "matching_nodes"}, {"score": 0.0025264171945423254, "phrase": "single-row_axis"}, {"score": 0.0023996890513009743, "phrase": "non-crossing_nets"}, {"score": 0.0023551955270737215, "phrase": "essr."}, {"score": 0.0022686625017583387, "phrase": "minimum_street_congestion"}, {"score": 0.0021649437083408425, "phrase": "reasonably_good_step"}, {"score": 0.0021347607855562102, "phrase": "overall_solution"}, {"score": 0.0021049977753042253, "phrase": "demand-supply_problem"}], "paper_keywords": ["connected graph", " single-row routing", " demand-supply problem and linear transformation"], "paper_abstract": "In a dimensional problem, the transformation of a graph into its linear network can be viewed as a transition involving demand and supply. A connected graph represents the demand flows between the components in the graph while the network supporting it is the resource or capacity links for supporting the demand volumes. The transformation involves a mapping from the graph to its network to satisfy certain performance metrics. In this work, we propose a model for transforming a connected graph to its linear network model in the form of a single-row routing network. The main objective is to provide an optimum routing network that minimizes the congestion. In this technique, the given graph is first partitioned into several disjoint cliques using the Hopfield neural network using our model called AdCliq. From the cliques, a set of intervals derived from the zones are obtained through the matching nodes in the single-row axis. The intervals are then mapped into a network of non-crossing nets using our previously developed tool called ESSR. The network is optimal in terms of minimum street congestion and number of doglegs, and this provides a reasonably good step towards the overall solution to the demand-supply problem.", "paper_title": "Single-row mapping and transformation of connected graphs", "paper_id": "WOS:000242731900005"}