{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "heuristics_miner"}, {"score": 0.04286666008487537, "phrase": "process_discovery"}, {"score": 0.037357632902107904, "phrase": "resulting_process_model"}, {"score": 0.004606479650820579, "phrase": "large_amounts"}, {"score": 0.004299910946753963, "phrase": "useful_information"}, {"score": 0.003954837422946628, "phrase": "process_models"}, {"score": 0.003877737556673229, "phrase": "event_logs"}, {"score": 0.0033288399506044763, "phrase": "frequently_used_heuristics_miner"}, {"score": 0.0030017207229983385, "phrase": "new_artifact"}, {"score": 0.0026148807877309417, "phrase": "updated_heuristics_miner"}, {"score": 0.002576503437739865, "phrase": "higher_validity"}, {"score": 0.0022113879114507577, "phrase": "systematic_developing"}, {"score": 0.0021896891011033105, "phrase": "evaluation_method"}, {"score": 0.0021682027434117095, "phrase": "process_discovery_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge discovery", " Process mining", " Heuristics Miner", " Quality", " Validity", " Completeness"], "paper_abstract": "Considering the presence of large amounts of data in organizations today, the need to transform this data into useful information and subsequently into knowledge, increasingly gains attention. Process discovery is a technique to automatically discover process models from data in event logs. Since process discovery is gaining attention among researchers as well as practitioners, the quality of the resulting process model must be assured. In this paper, the quality of the frequently used Heuristics Miner is improved as anomalies were found concerning the validity and completeness of the resulting process model. For this purpose, a new artifact called the Updated Heuristics Miner was constructed containing alterations to the tool and to the algorithm itself. Evaluations of this artifact resulted in the conclusion that the Updated Heuristics Miner indeed demonstrates higher validity and completeness. This study contributes to the body of knowledge first by improving the quality of the an often used research instrument and second by stating that there is a need for a systematic developing and evaluation method for process discovery techniques. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Improving the quality of the Heuristics Miner in ProM 6.2", "paper_id": "WOS:000341462600002"}