{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital"}, {"score": 0.004439941010250576, "phrase": "innovation_processes"}, {"score": 0.00393886140366453, "phrase": "school_staff"}, {"score": 0.0034140224493254935, "phrase": "optional_development"}, {"score": 0.003374655868348244, "phrase": "strong_bottom-up"}, {"score": 0.0033486631403337555, "phrase": "top-down_initiatives"}, {"score": 0.0031477782772867655, "phrase": "survey_response_data"}, {"score": 0.0028687545730861665, "phrase": "complementary_top-down_and_bottom-up_strategy"}, {"score": 0.002792119634261638, "phrase": "top-down_strategy"}, {"score": 0.0027599042621376624, "phrase": "better_ict-resources"}, {"score": 0.002707033618304716, "phrase": "educational_technology"}, {"score": 0.002665465323614577, "phrase": "bottom-up-_or_optional-innovation-type_schools"}, {"score": 0.002486147565139633, "phrase": "higher_degree"}, {"score": 0.002283243905993669, "phrase": "bottom-up_innovation_strategies"}, {"score": 0.0022222152430170254, "phrase": "top-down_support"}, {"score": 0.002171202123281881, "phrase": "technology_installations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information and communication technology (ICT)", " School development", " Media adoption", " Secondary education"], "paper_abstract": "Past research has suggested that innovation processes in schools are more successful when they are participatory and voluntary. To examine this notion, we categorized schools into one of four different innovation-process types, based on group interviews with school staff: complementary bottom-up and top-down development (type 1), top-down development that is not supported bottom-up (type 2), bottom-up development that is not supported top-down (type 3) and optional development with neither strong bottom-up nor top-down initiatives (type 4). Based on this typology, analysis of variance was then conducted on survey response data from 357 teachers and 1051 9th grade students from these schools. In contrast with some of our expectations, we found that teachers in schools with a complementary top-down and bottom-up strategy as well as schools with a top-down strategy only showed better ICT-resources and a more intensive use of educational technology than those in bottom-up- or optional-innovation-type schools. Additionally, teachers' ICT-use in type 1 and 2 schools is predicted to a higher degree by the number of computers in the classroom than in schools where ICT-integration is bottom-up or optional. Our findings suggest that bottom-up innovation strategies are likely to fall short without top-down support, especially when funds for technology installations are missing. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Digital media adoption in schools: Bottom-up, top-down, complementary or optional?", "paper_id": "WOS:000350839900005"}