{"auto_keywords": [{"score": 0.029280064673385762, "phrase": "boiling_temperature"}, {"score": 0.01330616454896919, "phrase": "volatile_oil"}, {"score": 0.009303630880577202, "phrase": "phase_transitions"}, {"score": 0.00419336149335416, "phrase": "different_phase_states"}, {"score": 0.004156515375354328, "phrase": "maximum_number"}, {"score": 0.004071790119305426, "phrase": "solution_approach"}, {"score": 0.004036007891943648, "phrase": "different_equations"}, {"score": 0.004012327233842635, "phrase": "primary_variables"}, {"score": 0.0038277970600041748, "phrase": "variable_substitutions"}, {"score": 0.0037387272682935686, "phrase": "newton-raphson_procedure"}, {"score": 0.0036732826889280487, "phrase": "m-phase_and_n-phase_states"}, {"score": 0.003556251226438769, "phrase": "numerical_simulators"}, {"score": 0.0035146218353274672, "phrase": "modeling_issues"}, {"score": 0.0034939895980892646, "phrase": "thermal_recovery_processes"}, {"score": 0.0034328142696903345, "phrase": "multicontact_miscible_gas_injection"}, {"score": 0.003226986367585129, "phrase": "steam_injection"}, {"score": 0.003060383344045888, "phrase": "thousand_currency_sign"}, {"score": 0.0029715605634810793, "phrase": "standard_numerical_solution"}, {"score": 0.0028683597138449467, "phrase": "excellent_agreement"}, {"score": 0.002809817778886807, "phrase": "oil_recovery"}, {"score": 0.0026102986739587187, "phrase": "boiling-temperature_ranges"}, {"score": 0.002564555834629261, "phrase": "wave_structures"}, {"score": 0.002446446287270775, "phrase": "striking_result"}, {"score": 0.0023964947203388874, "phrase": "evaporation_front"}, {"score": 0.002320047233050843, "phrase": "steam-condensation_front"}, {"score": 0.002206659334299112, "phrase": "virtually_complete_oil_recovery"}, {"score": 0.0021049977753042253, "phrase": "incomplete_recovery"}], "paper_keywords": ["Three-phase negative-saturation approach", " Phase transitions", " (Non)-isothermal compositional three-phase flow", " Steam injection", " Heavy-oil reservoirs"], "paper_abstract": "This article describes the extension of the two-phase (non)-isothermal negative-saturation solution approach to the three-phase (non)-isothermal negative-saturation (NegSat3) solution approach. The NegSat3 solution approach solves efficiently any (non)-isothermal compositional flow problem in porous media that involves phase transitions between different phase states when the maximum number of phases is less than four. The solution approach circumvents using different equations and primary variables for single-phase, two-phase, and three-phase regions in porous media. Consequently, the NegSat3 solution approach avoids switches or variable substitutions at phase transitions where the convergence of the Newton-Raphson procedure is hampered by oscillations between m-phase and n-phase states. The NegSat3 solution approach can be implemented efficiently in numerical simulators to deal with modeling issues for thermal recovery processes, CO2 sequestration, and for multicontact miscible gas injection in oil reservoirs if the number of phases is less than four. We illustrate the NegSat3 solution approach by way of example to steam injection in a 1D heavy-oil reservoir. However, the NegSat3 solution approach can be used for any n a parts per thousand currency sign 3-dimensional, multicomponent three-phase problems. The example solution is compared with a standard numerical solution that is analytically verified by the method of characteristics and shows excellent agreement. The results show that the oil recovery depends critically on whether the boiling temperature of the volatile oil is around the water boiling temperature, or much below or above it. These boiling-temperature ranges give rise to three different types of wave structures. When the boiling temperature of the volatile oil is near the boiling temperature of water, the striking result is that the speed of the evaporation front is equal or somewhat larger than the speed of the steam-condensation front. Thus, the volatile oil condenses at the location where the steam condenses too, yielding virtually complete oil recovery. Conversely, if the boiling temperature is too high or too low, there is incomplete recovery.", "paper_title": "Negative-saturation approach for (non)-isothermal compositional three-phase flow simulations in porous media", "paper_id": "WOS:000353787600010"}