{"auto_keywords": [{"score": 0.014329921980742188, "phrase": "gatk"}, {"score": 0.00481495049065317, "phrase": "midsize_and_long_indels"}, {"score": 0.004453874101119545, "phrase": "standard_read_aligners"}, {"score": 0.004250302819248558, "phrase": "proper_treatment"}, {"score": 0.004135859558144883, "phrase": "longer_indels"}, {"score": 0.004008820473628357, "phrase": "increasing_attention"}, {"score": 0.003977672712305348, "phrase": "globally_concerted_projects"}, {"score": 0.0035660913513115267, "phrase": "contemporary_ngs"}, {"score": 0.0035108659422301985, "phrase": "special_focus"}, {"score": 0.003483573659272443, "phrase": "family_data"}, {"score": 0.003443031148055198, "phrase": "enhanced_quality"}, {"score": 0.0034162643819889054, "phrase": "indel_calls"}, {"score": 0.0032220148724914867, "phrase": "mendelian_inheritance"}, {"score": 0.003196960816092101, "phrase": "mate-clever's_performance_rates"}, {"score": 0.0027347383772384102, "phrase": "family_contexts"}, {"score": 0.0026402908398883832, "phrase": "gatk._mate-clever"}, {"score": 0.002357535807803925, "phrase": "special_version"}, {"score": 0.0023029188952824685, "phrase": "indel_discovery"}, {"score": 0.0022060496442538476, "phrase": "ngs"}, {"score": 0.0021049977753042253, "phrase": "netherlands_project"}], "paper_keywords": [""], "paper_abstract": "Motivation: Accurately predicting and genotyping indels longer than 30 bp has remained a central challenge in next-generation sequencing (NGS) studies. While indels of up to 30bp are reliably processed by standard read aligners and the Genome Analysis Toolkit (GATK), longer indels have still resisted proper treatment. Also, discovering and genotyping longer indels has become particularly relevant owing to the increasing attention in globally concerted projects. Results: We present MATE-CLEVER (Mendelian-inheritance-AtTEntive CLique-Enumerating Variant findER) as an approach that accurately discovers and genotypes indels longer than 30 bp from contemporary NGS reads with a special focus on family data. For enhanced quality of indel calls in family trios or quartets, MATE-CLEVER integrates statistics that reflect the laws of Mendelian inheritance. MATE-CLEVER's performance rates for indels longer than 30 bp are on a par with those of the GATK for indels shorter than 30 bp, achieving up to 90% precision overall, with > 80% of calls correctly typed. In predicting de novo indels longer than 30 bp in family contexts, MATE-CLEVER even raises the standards of the GATK. MATE-CLEVER achieves precision and recall of similar to 63% on indels of 30 bp and longer versus 55% in both categories for the GATK on indels of 10-29 bp. A special version of MATE-CLEVER has contributed to indel discovery, in particular for indels of 30-100 bp, the 'NGS twilight zone of indels', in the Genome of the Netherlands Project.", "paper_title": "MATE-CLEVER: Mendelian-inheritance-aware discovery and genotyping of midsize and long indels", "paper_id": "WOS:000327714700007"}