{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "non-indexed_spanish_medical_journals"}, {"score": 0.004611554879923759, "phrase": "indexed_journals"}, {"score": 0.00430907756010007, "phrase": "hypothetical_changes"}, {"score": 0.004076352180903171, "phrase": "biomedical_journals"}, {"score": 0.003952821207607234, "phrase": "sci"}, {"score": 0.0033457659530207306, "phrase": "subject_categories"}, {"score": 0.0032240802202623316, "phrase": "largest_increase"}, {"score": 0.0026953359825383624, "phrase": "non_sci-jcr-indexed_spanish_medical_journals"}, {"score": 0.0026458370516131255, "phrase": "sci-jcr-indexed_journals"}, {"score": 0.0024266884464267348, "phrase": "usa"}, {"score": 0.0023673292305733244, "phrase": "uk."}, {"score": 0.00230950802983053, "phrase": "non-indexed_spanish_journals"}, {"score": 0.002198084195030656, "phrase": "sci-jcr-indexed_journal"}], "paper_keywords": [""], "paper_abstract": "The purpose of this study is to analyze the hypothetical changes in the 2002 impact factor (IF) of the biomedical journals included in the Science Citation Index-Journal Citation Reports (SCI-JCR) by also taking into account cites coming from 83 non-indexed Spanish journals on different medical specialties. A further goal of the study is to identify the subject categories of the SCI-JCR with the largest increase in their IF, and to estimate the 2002 hypothetical impact factor (2002 HIF) of these 83 non-indexed Spanish journals. It is demonstrated that the inclusion of cites from a selection of non SCI-JCR-indexed Spanish medical journals in the SCI-JCR-indexed journals produces a slight increase in their 2002 IF, specially in journals edited in the USA and in the UK. More than half of the non-indexed Spanish journals has a higher 2002 HIF than that of the SCI-JCR-indexed journal with the lowest IF in the same subject category.", "paper_title": "Hypothetical influence of non-indexed Spanish medical journals on the impact factor of the Journal Citation Reports-indexed journals", "paper_id": "WOS:000243471400004"}