{"auto_keywords": [{"score": 0.015216323287395481, "phrase": "new_technology"}, {"score": 0.011019990999542708, "phrase": "dependability_requirements"}, {"score": 0.00481495049065317, "phrase": "software_testbeds"}, {"score": 0.004762435022350756, "phrase": "new_technologies"}, {"score": 0.004591466267316524, "phrase": "good_theoretical_basis"}, {"score": 0.004159763048814389, "phrase": "software_testbed"}, {"score": 0.003981106369547929, "phrase": "broad_set"}, {"score": 0.003633079011725194, "phrase": "standard_software_platform"}, {"score": 0.0035934073774126856, "phrase": "important_component"}, {"score": 0.0035153544006182834, "phrase": "unified_model"}, {"score": 0.003327534497764259, "phrase": "testbed_software"}, {"score": 0.0032552377213294604, "phrase": "seeded_faults"}, {"score": 0.0032314884215434857, "phrase": "known_issues"}, {"score": 0.0031961879138783012, "phrase": "target_system"}, {"score": 0.002863652837038965, "phrase": "tsafe"}, {"score": 0.00284275228258112, "phrase": "testbed_environment"}, {"score": 0.002565626044684815, "phrase": "first_experiment"}, {"score": 0.0025098414374397308, "phrase": "architectural_violations"}, {"score": 0.0022817585639886883, "phrase": "ongoing_experimental_work"}, {"score": 0.0021049977753042253, "phrase": "studied_technology"}], "paper_keywords": ["empirical study", " technology evaluation", " software testbed"], "paper_abstract": "The evolution of a new technology depends upon a good theoretical basis for developing the technology, as well as upon its experimental validation. In order to provide for this experimentation, we have investigated the creation of a software testbed and the feasibility of using the same testbed for experimenting with a broad set of technologies. The testbed is a set of programs, data, and supporting documentation that allows researchers to test their new technology on a standard software platform. An important component of this testbed is the Unified Model of Dependability (UMD), which was used to elicit dependability requirements for the testbed software. With a collection of seeded faults and known issues of the target system, we are able to determine if a new technology is adept at uncovering defects or providing other aids proposed by its developers. In this paper, we present the Tactical Separation Assisted Flight Environment (TSAFE) testbed environment for which we modeled and evaluated dependability requirements and defined faults to be seeded for experimentation. We describe two completed experiments that we conducted on the testbed. The first experiment studies a technology that identifies architectural violations and evaluates its ability to detect the violations. The second experiment studies model checking as part of design for verification. We conclude by describing ongoing experimental work studying testing, using the same testbed. Our conclusion is that even though these three experiments are very different in terms of the studied technology, using and re-using the same testbed is beneficial and cost effective.", "paper_title": "Experimenting with software testbeds for evaluating new technologies", "paper_id": "WOS:000248056000005"}