{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coverage_control"}, {"score": 0.011697335335353833, "phrase": "mixed_wsns"}, {"score": 0.004768104290288521, "phrase": "mixed_wireless_sensor_networks"}, {"score": 0.004721711709176679, "phrase": "wireless_sensor_networks"}, {"score": 0.004585212379675535, "phrase": "relatively_new_technology"}, {"score": 0.004409304640026443, "phrase": "wide_area_monitoring"}, {"score": 0.004302791070310513, "phrase": "stationary_or_mobile_sensor_platforms"}, {"score": 0.0034187896011435245, "phrase": "experimental_testbed"}, {"score": 0.0033361232750221863, "phrase": "stationary_and_mobile_sensor_nodes"}, {"score": 0.003239549357111286, "phrase": "sensing_coverage"}, {"score": 0.0032079813320482304, "phrase": "event_detection"}, {"score": 0.002880333728285514, "phrase": "case_study"}, {"score": 0.0026762874092443197, "phrase": "developed_testbed"}, {"score": 0.002548331088496964, "phrase": "different_algorithms"}, {"score": 0.0024624103660827695, "phrase": "stationary_and_mobile_sensors"}, {"score": 0.002414616656410503, "phrase": "wsn's_monitoring_capabilities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mixed WSN testbed", " Distributed path-planning", " Coverage"], "paper_abstract": "Wireless sensor networks (WSNs) is a relatively new technology that has been proposed for several applications including wide area monitoring. Such applications may include stationary or mobile sensor platforms or they may include several stationary and some mobile-robotic sensor nodes that can move in the area in order to achieve certain objectives, e.g., monitor areas that are not adequately covered or assist in the transfer of data to prevent the energy depletion of certain critical nodes. Such networks that consist of both stationary and mobile nodes are referred to as mixed WSNs. This paper presents the development of an experimental testbed for mixed WSNs consisting of stationary and mobile sensor nodes that collaborate to improve the sensing coverage and event detection of the network in a given deployment area. The paper describes the hardware and infrastructure of the testbed as well as a case study for coverage control that was investigated using the testbed. We point out that the developed testbed can be used for the evaluation and validation of different algorithms for coverage control that involve collaboration between stationary and mobile sensors to improve the WSN's monitoring capabilities. In addition, it can also be used to investigate other objectives as well as other concepts (e.g., network control). (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A testbed for coverage control using mixed wireless sensor networks", "paper_id": "WOS:000300862900003"}