{"auto_keywords": [{"score": 0.04603267085888504, "phrase": "large_number"}, {"score": 0.02322730111336098, "phrase": "multi-state_k-out-of-n_systems"}, {"score": 0.009403118721359715, "phrase": "possible_states"}, {"score": 0.007106631030943273, "phrase": "recursive_algorithm"}, {"score": 0.004210114198411514, "phrase": "\"reliability_bounds"}, {"score": 0.003936698872193083, "phrase": "system_reliability"}, {"score": 0.0031117775337824853, "phrase": "performance_evaluation"}, {"score": 0.0030857431184193765, "phrase": "multi-state_k-out"}, {"score": 0.0026637384761565605, "phrase": "k_vector"}, {"score": 0.002575665611013556, "phrase": "bounding_approach"}, {"score": 0.002511522462767081, "phrase": "good_estimate"}, {"score": 0.0024081387633065206, "phrase": "computation_time"}, {"score": 0.0023187286045879643, "phrase": "complex_systems"}, {"score": 0.0021861845339709533, "phrase": "numerical_example"}, {"score": 0.0021049977753042253, "phrase": "proposed_bounding_approach"}], "paper_keywords": ["bound", " k-out-of-n systems", " multi-state", " recursive algorithm"], "paper_abstract": "Algorithms have been available for exact performance evaluation of multi-state k-out-of-n systems. However, especially for complex systems with a large number of components, and a large number of possible states, obtaining \"reliability bounds\" would be an interesting, significant issue. Reliability bounds will give us a range of the system reliability in a much shorter computation time, which allow us to make decisions more efficiently. The systems under consideration are multi-state k-out-of-n systems with i.i.d. components. We will focus on the probability of the system in states below a certain state d, denoted by Q(sd). Based on the recursive algorithm proposed by Zuo & Tian [14] for performance evaluation of multi-state k-out-of-n Systems with i.i.d. components, a reliability bounding approach is developed in this paper. The upper, and lower bounds of Q(sd) are,calculated by reducing the length of the k vector when using the recursive algorithm. Using the bounding approach, we can obtain a good estimate of the exact Q(sd) value while significantly reducing the computation time. This approach is attractive, especially to complex systems with a large number of components, and a large number of possible states. A numerical example is used to illustrate the significance of the proposed bounding approach.", "paper_title": "Reliability bounds for multi-state k-out-of-n systems", "paper_id": "WOS:000253840700006"}