{"auto_keywords": [{"score": 0.036653305954379496, "phrase": "srm"}, {"score": 0.03310748705394466, "phrase": "lem"}, {"score": 0.00481495049065317, "phrase": "strength_reduction"}, {"score": 0.004321118442104989, "phrase": "limit_equilibrium_method"}, {"score": 0.003935420482629049, "phrase": "failure_modes"}, {"score": 0.003802135020791801, "phrase": "good_agreement"}, {"score": 0.003378385493203297, "phrase": "physical_insight"}, {"score": 0.0032160319265621285, "phrase": "simple_slopes"}, {"score": 0.002986969236641105, "phrase": "convergence_criterion"}, {"score": 0.002706659627293686, "phrase": "ultimate_limit_state"}, {"score": 0.0024891269874339553, "phrase": "great_care"}, {"score": 0.002255431275670053, "phrase": "actual_failure_mode"}, {"score": 0.0022223176391038785, "phrase": "solution_domain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Three-dimensional slope stability", " Limit equilibrium method", " Strength reduction method"], "paper_abstract": "In this paper, three-dimensional (3D) slope stability analysis is analyzed by the strength reduction method (SRM) and the limit equilibrium method (LEM) for several cases. In general, the factors of safety (FOS) and the failure modes obtained by these two methods are in good agreement. The authors have discovered many interesting results which appear to be surprising, but a more detailed analysis by the SRM and LEM along with some physical insight have suggested that these results may be true for simple slopes. It is also found that the 3D SIRM can be very sensitive to the convergence criterion. boundary conditions and the design of the mesh, and that it is more difficult to define the ultimate limit state with the 3D SRM as compared with the corresponding two-dimensional (2D) analysis. It is concluded that a proper 3D analysis requires great care and judgment, and a trial and error analysis may be required for both the SRM and LEM, as the actual failure mode and the solution domain are not known in advance, (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Three-dimensional slope failure analysis by the strength reduction and limit equilibrium methods", "paper_id": "WOS:000262249700009"}