{"auto_keywords": [{"score": 0.029304299444589392, "phrase": "tam"}, {"score": 0.02884455194556565, "phrase": "think_aloud_method"}, {"score": 0.00481495049065317, "phrase": "model-driven_method_engineering_approach"}, {"score": 0.004386637056030611, "phrase": "potential_benefits"}, {"score": 0.004263972370406983, "phrase": "computer-aided_method_engineering_technology"}, {"score": 0.0041112665381266315, "phrase": "practical_application"}, {"score": 0.003398015125667192, "phrase": "intensive_use"}, {"score": 0.003370565320453525, "phrase": "reusable_assets"}, {"score": 0.0032629585038738856, "phrase": "previous_work"}, {"score": 0.0025578967205807843, "phrase": "subjective_manner"}, {"score": 0.002320449502337321, "phrase": "perceived_usefulness"}, {"score": 0.0022371907579775796, "phrase": "positive_results"}, {"score": 0.0021922308351126746, "phrase": "users'_actual_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Method Engineering", " Model-Driven Engineering", " Complexity", " Think Aloud", " Technology Acceptance Model"], "paper_abstract": "The Method Engineering (ME) discipline emerged as a response to the need for methods that are better adapted to context. Despite the potential benefits of ME and the emergence of Computer-Aided Method Engineering technology, there are hardly any reports on the practical application of ME available in the literature. Some authors argue that this is because practitioners often fail to see the usefulness of ME due to its high complexity. With the aim of facilitating the application of ME, we developed MOSKitt4ME, a lightweight approach that makes intensive use of reusable assets and Model-Driven Engineering. In previous work, we illustrated how MOSKitt4ME supports three phases of the ME lifecycle: design, implementation, and execution. In this paper, we evaluate the complexity of MOSKitt4ME. Specifically, we present a study that is based on the Technology Acceptance Model (TAM) and the Think Aloud method. The TAM allowed us to measure usefulness and ease of use in a subjective manner; the Think Aloud method allowed us to analyze these measures objectively. Overall, the results were favorable. MOSKitt4ME was highly rated in perceived usefulness and ease of use; we also obtained positive results with respect to the users' actual performance and the difficulty experienced. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "On the usefulness and ease of use of a model-driven Method Engineering approach", "paper_id": "WOS:000351971000003"}