{"auto_keywords": [{"score": 0.04480168731572528, "phrase": "location_information"}, {"score": 0.035063062788852184, "phrase": "vertex_locations"}, {"score": 0.03325339742593115, "phrase": "routing_decision"}, {"score": 0.015609395716532946, "phrase": "schnyder"}, {"score": 0.015499791416900133, "phrase": "geometric_routing"}, {"score": 0.008416286199561748, "phrase": "routing_path"}, {"score": 0.00481495049065317, "phrase": "simple_routing_algorithm"}, {"score": 0.004713162564945179, "phrase": "elegant_way"}, {"score": 0.0046797114400479135, "phrase": "network_routing_problems"}, {"score": 0.004613516457919661, "phrase": "routing_scheme"}, {"score": 0.0045374660781550445, "phrase": "origin_vertex_u"}, {"score": 0.004347589925594838, "phrase": "neighbor_t"}, {"score": 0.0039723268236794935, "phrase": "greedy_drawing"}, {"score": 0.0038515000499988673, "phrase": "greedy_routing_algorithm"}, {"score": 0.003806015462003836, "phrase": "leighton"}, {"score": 0.0037879651116631465, "phrase": "moitra"}, {"score": 0.003603549914861701, "phrase": "greedy_routing"}, {"score": 0.0035779458261087486, "phrase": "similar_result"}, {"score": 0.0035356745476539885, "phrase": "angelini_et_al"}, {"score": 0.0032688966024454636, "phrase": "traditional_routing_table_approaches"}, {"score": 0.0031693980719538317, "phrase": "greedy_routing_scheme"}, {"score": 0.0029581852510487824, "phrase": "decreasing_distances"}, {"score": 0.002767584756033483, "phrase": "geometric_routing_scheme"}, {"score": 0.0026896953007096084, "phrase": "new_model"}, {"score": 0.0024984517279573906, "phrase": "schnyder_coordinates"}, {"score": 0.002468902422760431, "phrase": "schnyder_realizers"}, {"score": 0.0024571805463127873, "phrase": "plane_triangulations"}, {"score": 0.002445514186654732, "phrase": "schnyder_woods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Geometric routing is an elegant way for solving network routing problems. The essence of this routing scheme is the following: When an origin vertex u wants to send a message to a destination vertex w, it forwards the message to a neighbor t, solely based on the location information of u, w and the neighbors of u. In its simplest form, greedy routing, a message is simply forwarded to a neighbor that is closer to the destination. A greedy drawing of a graph G is an embedding of G for which the greedy routing algorithm works. Recently, Leighton and Moitra (2010) [18] found an algorithm that produces an embedding of any 3-connected planar graph in R-2 that supports greedy routing. A similar result was independently found by Angelini et al. (2010) [2]. One main drawback of these algorithms is that they need Omega(n log n) bits to represent the coordinates of the vertex locations. This is the same space usage as traditional routing table approaches, and hence makes greedy routing infeasible in applications. In the greedy routing scheme, the routing decision is based on decreasing distances between vertex locations. For this idea to work, however, the routing decision does not have to be based on decreasing distances. As long as the routing decision is solely based on the location information of the source, the destination, and the neighbors of the source, the geometric routing scheme will work fine. In this paper, we introduce a new model of geometric routing. Instead of relying on decreasing distance for routing decisions, our algorithm uses other criterion to determine the routing path, solely based on location information. Our routing algorithms are based on Schnyder coordinates which are derived from Schnyder realizers for plane triangulations and Schnyder woods for 3-connected plane graphs. The coordinates of vertex locations consist of three integers between 0 and 2n, hence the representation only needs O(log n) bits. In order to send a message from the origin u to the destination w, our routing algorithm determines the routing path from the Schnyder coordinates of u, w and all neighbors of u. The algorithms are natural and simple to implement. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "A simple routing algorithm based on Schnyder coordinates", "paper_id": "WOS:000321422500011"}