{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "use_case_implementations"}, {"score": 0.0047310525657970615, "phrase": "component-based_decomposition"}, {"score": 0.004282391936827106, "phrase": "modularity_mechanisms"}, {"score": 0.00408617426304956, "phrase": "virtual_classes"}, {"score": 0.003591542373891629, "phrase": "single_use_case"}, {"score": 0.0033473779327638322, "phrase": "use_case"}, {"score": 0.0029592333031063156, "phrase": "layered_architecture_pattern"}, {"score": 0.002890557197908352, "phrase": "traditional_and_contemporary_metrics"}, {"score": 0.002600661525224505, "phrase": "quality_attributes"}, {"score": 0.00249592321829865, "phrase": "independent_development"}, {"score": 0.0022455164874830777, "phrase": "chosen_system"}], "paper_keywords": ["Modularity", " Use cases", " Aspect-oriented programming", " Empirical software engineering"], "paper_abstract": "A component-based decomposition can result in implementations having use cases code tangled with other concerns and scattered across components. Modularity mechanisms such as aspects, mixins, and virtual classes have been proposed to address this kind of problem. One can use such mechanisms to group together code related to a single use case. This paper quantitatively analyzes the impact of this kind of use case modularization. We apply one specific technique, aspect oriented programming, to modularize the use case implementations of two information systems that conform to the layered architecture pattern. We extract traditional and contemporary metrics - including cohesion, coupling, and separation of concerns - to analyze modularity in terms of quality attributes such as changeability, support for independent development, and pluggability. Our findings indicate that the results of a given modularity analysis depend on other factors beyond the chosen system, metrics, and the applied modularity technique. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Modularity analysis of use case implementations", "paper_id": "WOS:000301630700019"}