{"auto_keywords": [{"score": 0.04823897849666524, "phrase": "aes"}, {"score": 0.010612322234225232, "phrase": "hardware_implementation"}, {"score": 0.010537445784838317, "phrase": "advanced_encryption_standard"}, {"score": 0.006254283667484005, "phrase": "proposed_schemes"}, {"score": 0.004548253531664032, "phrase": "differential_fault_attacks"}, {"score": 0.004467965784278827, "phrase": "error_detection"}, {"score": 0.0040726680518382965, "phrase": "aes_process"}, {"score": 0.0037387746981660717, "phrase": "general_error_control_codes"}, {"score": 0.0036727235025069828, "phrase": "aes_operations"}, {"score": 0.003218764138744059, "phrase": "good_algebraic_properties"}, {"score": 0.0031731685183735508, "phrase": "specifically_the_mixcolumns_operation"}, {"score": 0.0031393948330209255, "phrase": "error_detection_schemes"}, {"score": 0.0028107098861552124, "phrase": "high_fault_coverage"}, {"score": 0.0026077803487003, "phrase": "aes_circuit"}, {"score": 0.0024108455980729284, "phrase": "encryption_process"}, {"score": 0.002385166298265828, "phrase": "decryption_process"}, {"score": 0.0022851491693940272, "phrase": "encryption-only_or_decryption-only_cases"}, {"score": 0.0021429152327481892, "phrase": "derived_results"}, {"score": 0.002120083747913758, "phrase": "data_procedure"}, {"score": 0.0021049985067852356, "phrase": "aes."}], "paper_keywords": ["advanced encryption standard", " error control code", " CRC", " differential fault attacks"], "paper_abstract": "In order to prevent the Advanced Encryption Standard (AES) from suffering from differential fault attacks, the technique of error detection can be adopted to detect the errors during encryption or decryption and then to provide the information for taking further action, such as interrupting the AES process or redoing the process. Because errors occur within a function, it is not easy to predict the output. Therefore, general error control codes are not suited for AES operations. In this work, several error-detection schemes have been proposed. These schemes are based on the (n + 1, n) cyclic redundancy check (CRC) over GF(2(8)), where n n is an element of {4, 8, 16,}. Because of the good algebraic properties of AES, specifically the Mixcolumns operation, these error detection schemes are suitable for AES and efficient for the hardware implementation; they may be designed using round-level, operation-level, or algorithm-level detection. The proposed schemes have high fault coverage. In addition, the schemes proposed are scalable and symmetrical. The scalability makes these schemes suitable for an AES circuit implemented in 8-bit, 32-bit, or 128-bit architecture. Symmetry also benefits the implementation of the proposed schemes to achieve that the encryption process and the decryption process can share the same error detection hardware. These schemes are also suitable for encryption-only or decryption-only cases. Error detection for the key schedule in AES is also proposed and is based on the derived results in the data procedure of AES.", "paper_title": "Simple error detection methods for hardware implementation of advanced encryption standard", "paper_id": "WOS:000236929800006"}