{"auto_keywords": [{"score": 0.04305155173647725, "phrase": "requirements-level_translation"}, {"score": 0.015433673286860506, "phrase": "activity_diagrams"}, {"score": 0.014143452956060803, "phrase": "activity_diagram"}, {"score": 0.012319587546963308, "phrase": "perfect_synchrony_hypothesis"}, {"score": 0.012150504475326628, "phrase": "implementation-level_translation"}, {"score": 0.00481495049065317, "phrase": "uml_activity_diagrams"}, {"score": 0.00466102244911872, "phrase": "input_language"}, {"score": 0.004617952338980931, "phrase": "nusmv"}, {"score": 0.004267468074128779, "phrase": "finite_state_machine"}, {"score": 0.004169519409162853, "phrase": "existing_statechart_semantics"}, {"score": 0.0031113369425402287, "phrase": "large_class"}, {"score": 0.0028350413546400703, "phrase": "model_checking"}, {"score": 0.002731500545019039, "phrase": "linear_stuttering-closed_properties"}, {"score": 0.0026317312518257803, "phrase": "slightly_modified_version"}, {"score": 0.002500456462028735, "phrase": "check_data_integrity_constraints"}, {"score": 0.0024091057723923857, "phrase": "class_diagrams"}, {"score": 0.0021049977753042253, "phrase": "large_example_activity_diagrams"}], "paper_keywords": ["verification", " model checking", " activity diagrams", " Unified Modeling Language"], "paper_abstract": "Two translations from activity diagrams to the input language of NuSMV, a symbolic model verifier, are presented. Both translations map an activity diagram into a finite state machine and are inspired by existing statechart semantics. The requirements-level translation defines state machines that can be efficiently verified, but are a bit unrealistic since they assume the perfect synchrony hypothesis. The implementation-level translation defines state machines that cannot be verified so efficiently, but that are more realistic since they do not use the perfect synchrony hypothesis. To justify the use of the requirements-level translation, we show that for a large class of activity diagrams and certain properties, both translations are equivalent: regardless of which translation is used, the outcome of model checking is the same. Moreover, for linear stuttering-closed properties, the implementation-level translation is equivalent to a slightly modified version of the requirements-level translation. We use the two translations to model check data integrity constraints for an activity diagram and a set of class diagrams that specify the data manipulated in the activities. Both translations have been implemented in two tools. We discuss our experiences in applying both translations to model check some large example activity diagrams.", "paper_title": "Symbolic model checking of UML activity diagrams", "paper_id": "WOS:000237320900001"}