{"auto_keywords": [{"score": 0.0493950121722342, "phrase": "integrated_superbrownian_excursion"}, {"score": 0.04460540104209965, "phrase": "enumerative_results"}, {"score": 0.032665560958905125, "phrase": "limit_laws"}, {"score": 0.00481495049065317, "phrase": "embedded_trees"}, {"score": 0.0046648687677450455, "phrase": "labeled_plane_trees"}, {"score": 0.004050930846552577, "phrase": "closed_form_expressions"}, {"score": 0.003216804708106142, "phrase": "combinatorial_intuition"}, {"score": 0.002907992115184249, "phrase": "uniform_distribution"}, {"score": 0.002825319183890361, "phrase": "largest_label"}, {"score": 0.0025392983369523143, "phrase": "scaled_versions"}, {"score": 0.002517414574213069, "phrase": "random_variables"}, {"score": 0.0023020099901627576, "phrase": "earlier_results"}, {"score": 0.0022821699061487673, "phrase": "delmas"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["embedded trees", " integrated superBrownian excursion", " generating functions", " limit laws"], "paper_abstract": "We study three families of labeled plane trees. In all these trees, the root is labeled 0 and the labels of two adjacent nodes differ by 0, 1, or -1. One part of the paper is devoted to enumerative results. For each family, and for all j is an element of N, we obtain closed form expressions for the following three generating functions: the generating function of trees having no label larger than j; the (bivariate) generating function of trees, counted by the number of edges and the number of nodes labeled j; and finally the (bivariate) generating function of trees, counted by the number of edges and the number of nodes labeled at least j. Strangely enough, all these series turn out to be algebraic, but we have no combinatorial intuition for this algebraicity. The other part of the paper is devoted to deriving limit laws from these enumerative results. In each of our families of trees, we endow the trees of size n with the uniform distribution and study the following random variables: M-n the largest label occurring in a (random) tree; X-n(j), the number of nodes labeled j; and X-n(+)(j), the number of nodes labeled j or more. We obtain limit laws for scaled versions of these random variables. Finally, we translate the above limit results into statements dealing with the integrated superBrownian excursion. In particular, we describe the law of the supremum of its support (thus recovering some earlier results obtained by Delmas) and the law of its distribution function at a given point. We also conjecture the law of its density (at a given point). (c) 2006 Wiley Periodicals, Inc.", "paper_title": "Limit laws for embedded trees: Applications to the integrated superBrownian excursion", "paper_id": "WOS:000242116100005"}