{"auto_keywords": [{"score": 0.047383019958100334, "phrase": "mde"}, {"score": 0.00481495049065317, "phrase": "match_algorithms"}, {"score": 0.004640808212832262, "phrase": "increasing_importance"}, {"score": 0.004592214823540993, "phrase": "model-driven_engineering"}, {"score": 0.0043797373807446015, "phrase": "software_systems"}, {"score": 0.0034013521529056715, "phrase": "different_implementations"}, {"score": 0.0031761255583359726, "phrase": "new_algorithms"}, {"score": 0.0029038817737006405, "phrase": "different_models"}, {"score": 0.002809715746857272, "phrase": "mde."}, {"score": 0.002783945062714816, "phrase": "domain-specific_language"}, {"score": 0.0025858215477025117, "phrase": "eclipse_modelling_framework"}, {"score": 0.0024529757621396717, "phrase": "eclipse_modeling_project"}, {"score": 0.0022783523466965187, "phrase": "case_study"}, {"score": 0.002242577809454225, "phrase": "authors_tool"}, {"score": 0.0021049977753042253, "phrase": "emf_compare"}], "paper_keywords": [""], "paper_abstract": "Owing to the increasing importance of model-driven engineering (MDE) and the changes experienced by software systems over their life cycle, the calculation, representation and visualisation of matches and differences between two different versions of the same model are becoming more necessary and useful. This study shows the need for improvement in the algorithms for calculating the relationships between models and presents a tool to test different implementations, thus reducing the effort required to measure, compare or create new algorithms. To demonstrate the need for improvement and the framework developed, the authors have created different models that conform to the metamodel of a domain-specific language. Subsequently, the authors compared these models using the algorithms of the eclipse modelling framework (EMF) Compare tool, part of the eclipse modeling project, which is the framework of reference for MDE. Thus, in the case study, the authors tool is used to measure the quality of the comparisons performed by EMF Compare.", "paper_title": "MCTest: towards an improvement of match algorithms for models", "paper_id": "WOS:000303930400005"}