{"auto_keywords": [{"score": 0.0429434896102935, "phrase": "maximal_domain"}, {"score": 0.04212297097730833, "phrase": "expression_l."}, {"score": 0.00481495049065317, "phrase": "self-adjoint_ordinary_differential_operators"}, {"score": 0.00458869631642791, "phrase": "real_valued_coefficients"}, {"score": 0.004515655183335171, "phrase": "self_adjoint_operators"}, {"score": 0.004425979295788883, "phrase": "weighted_square_integrable_functions"}, {"score": 0.003987474771008829, "phrase": "glazman-krein-naimark_theorem"}, {"score": 0.0037999551521987426, "phrase": "nonreal_parameter_lambda"}, {"score": 0.0036504182609411852, "phrase": "real_parameter_lambda"}, {"score": 0.003010347277067459, "phrase": "l._a_special_class"}, {"score": 0.002722634472231842, "phrase": "weak_formulation"}, {"score": 0.0026471070725516467, "phrase": "deficiency_index"}, {"score": 0.0025633455664747606, "phrase": "bilinear_form"}, {"score": 0.0023369711258107244, "phrase": "celebrated_friedrich_extension"}, {"score": 0.0022268964676199292, "phrase": "general_case"}, {"score": 0.002156402793481102, "phrase": "explicit_characterization"}], "paper_keywords": ["Differential operators", " Self-adjoint operators", " Deficiency index", " Friedrich extension", " Bilinear form"], "paper_abstract": "Symmetric differential expressions l of order n = 2k with real valued coefficients give rise to self adjoint operators in the space of weighted square integrable functions. Characterization theorems exist in the literature that describe such self-adjoint operators. All such characterizations begin by constructing the maximal domain of definition of the expression l. The Glazman-Krein-Naimark theorem constructs the maximal domain in terms of eigenfunctions corresponding to a nonreal parameter lambda. Representations in terms of certain functions related to a real parameter lambda can also be found in the literature. In this paper we construct the maximal domain from two complementary self-adjoint realizations of l. One operator is assumed to be known and the other one is computed explicitly. From these two operators we explicitly give all other self-adjoint operators associated with l. A special class of operators associated with l is what we call Type I operators. They arise in connection with a certain bilinear form that results from the weak formulation of the expression l. Depending on the deficiency index of l and the properties of the bilinear form we can have two complementary self-adjoint operators (two Type I operators) and, as it turns out, one of them is the celebrated Friedrich Extension. The other operator appears to be new. As in the general case, using these two operators we give an explicit characterization of all other operators of the same Type I. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Characterization of self-adjoint ordinary differential operators", "paper_id": "WOS:000290014600061"}