{"auto_keywords": [{"score": 0.04936538823130262, "phrase": "uncertain_information"}, {"score": 0.04889532068804287, "phrase": "possibility_theory"}, {"score": 0.00481495049065317, "phrase": "context-dependent_algorithm"}, {"score": 0.004556901872357751, "phrase": "multiple_sources"}, {"score": 0.004444203710097833, "phrase": "important_issue"}, {"score": 0.004081385289516914, "phrase": "flexible_framework"}, {"score": 0.003785836059995376, "phrase": "merging_operators"}, {"score": 0.002858952758523772, "phrase": "adaptive_merging_algorithm"}, {"score": 0.002816246391862638, "phrase": "largely_partially_maximal_consistent_subsets"}, {"score": 0.0026384167183586015, "phrase": "conjunctive_operator"}, {"score": 0.0024105326885334962, "phrase": "fusion_process"}, {"score": 0.0021802872319258977, "phrase": "related_merging_methods"}], "paper_keywords": ["Context-dependent merging", " information fusion", " measures of inconsistency and coherence", " possibility theory"], "paper_abstract": "The need to merge multiple sources of uncertain information is an important issue in many application areas, particularly when there is potential for contradictions between sources. Possibility theory offers a flexible framework to represent, and reason with, uncertain information, and there is a range of merging operators, such as the conjunctive and disjunctive operators, for combining information. However, with the proposals to date, the context of the information to be merged is largely ignored during the process of selecting which merging operators to use. To address this shortcoming, in this paper, we propose an adaptive merging algorithm which selects largely partially maximal consistent subsets of sources, which can be merged through the relaxation of the conjunctive operator, by assessing the coherence of the information in each subset. In this way, a fusion process can integrate both conjunctive and disjunctive operators in a more flexible manner and thereby be more context dependent. comparison with related merging methods shows how our algorithm can produce a more consensual result.", "paper_title": "A Context-Dependent Algorithm for Merging Uncertain Information in Possibility Theory", "paper_id": "WOS:000260899700016"}