{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vortex-induced_vibration"}, {"score": 0.049090663946911924, "phrase": "shear_flow"}, {"score": 0.01048113336357843, "phrase": "circular_cylinder"}, {"score": 0.008803788683373864, "phrase": "hydrodynamic_force"}, {"score": 0.00869470715249045, "phrase": "cylinder_motion_equation"}, {"score": 0.00777136505226742, "phrase": "virtual_mass"}, {"score": 0.004266067096140677, "phrase": "exponential-polar_coordinate"}, {"score": 0.004195418010131832, "phrase": "moving_cylinder"}, {"score": 0.004143196873246147, "phrase": "stream_function-vorticity_equations"}, {"score": 0.0037795163893761027, "phrase": "inertial_force"}, {"score": 0.0033905067962602515, "phrase": "cylinder_mass"}, {"score": 0.003092690568543981, "phrase": "fluid-structure_interactions"}, {"score": 0.0030541531847589833, "phrase": "fixed_cylinder"}, {"score": 0.002953711377604328, "phrase": "vortex_shedding"}, {"score": 0.0028209599545587745, "phrase": "dominated_vortex"}, {"score": 0.0026494723416072316, "phrase": "pressure_side"}, {"score": 0.0025838249689625775, "phrase": "suction_side"}, {"score": 0.0023764959294052964, "phrase": "front_stagnation_point"}, {"score": 0.002327310963701377, "phrase": "background_vortex"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Vortex-induced vibration", " Shear flow", " Wake vortex", " Hydrodynamic force"], "paper_abstract": "To investigate the in-depth mechanism of vortex-induced vibration of a circular cylinder with shear flow, in this paper, with the use of exponential-polar coordinate attached on the moving cylinder, the stream function-vorticity equations of vortex-induced vibration, the initial/boundary conditions and distribution of hydrodynamic force together with cylinder motion equation in shear flow are deduced, the hydrodynamic force consists of inertial force, the vortex-induced force and viscous damping force. Similarly, the cylinder motion equation with virtual mass is induced where the virtual mass consists of the cylinder mass, the potential added mass and the apparent added mass induced by viscosity. Our numerical results revealed that there are three factors affecting fluid-structure interactions from the fixed cylinder to its steady vibration: The first is the vortex shedding where one side shear layer of cylinder strengthens with the effect of the dominated vortex. The second is the vibration of cylinder which pushes the fluid on the pressure side and pumps that on the suction side. The third is the vortexes strengthen in one side and weaken in the other side together with the shift of front stagnation point with the effect of background vortex which is generated by shear flow. The character of vortex-induced vibration in shear flow are affected by the above three factors. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An in-depth study on vortex-induced vibration of a circular cylinder with shear flow", "paper_id": "WOS:000339775500003"}