{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "moving_objects"}, {"score": 0.03762120582175634, "phrase": "predictive_skyline_queries"}, {"score": 0.004765788394931875, "phrase": "skyline_query"}, {"score": 0.004504193207111593, "phrase": "decision_making"}, {"score": 0.004435363840720883, "phrase": "existing_work"}, {"score": 0.004390060342250211, "phrase": "skyline_queries"}, {"score": 0.0036490529923833884, "phrase": "namely_prismo"}, {"score": 0.0034485432592912917, "phrase": "spatio-temporal_information"}, {"score": 0.003361069456060196, "phrase": "non-spatial_dimensions"}, {"score": 0.0026945086500597304, "phrase": "predictive_skyline_computation"}, {"score": 0.0026532596852754525, "phrase": "basic_tpbbs"}, {"score": 0.002456272788591051, "phrase": "memory_space_consumption"}, {"score": 0.0024311346712789553, "phrase": "cpu_time"}, {"score": 0.0022275639370573264, "phrase": "extensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "tpbbs"}], "paper_keywords": ["Spatio-temporal database", " Moving object", " Skyline"], "paper_abstract": "Skyline query is important in the circumstances that require the support of decision making. The existing work on skyline queries is based mainly on the assumption that the datasets are static. Querying skylines over moving objects, however, is also important and requires more attention. In this paper, we propose a framework, namely PRISMO, for processing predictive skyline queries over moving objects that not only contain spatio-temporal information, but also include non-spatial dimensions, such as other dynamic and static attributes. We present two schemes, RBBS (branch-and-bound skyline with rescanning and repacking) and TPBBS (time-parameterized branch-and-bound skyline), each with two alternative methods, to handle predictive skyline computation. The basic TPBBS is further extended to TPBBSE (TPBBS with expansion) to enhance the performance of memory space consumption and CPU time. Our schemes are flexible and thus can process point, range, and subspace predictive skyline queries. Extensive experiments show that our proposed schemes can handle predictive skyline queries effectively, and that TPBBS significantly outperforms RBBS.", "paper_title": "PRISMO: predictive skyline query processing over moving objects", "paper_id": "WOS:000301343500003"}