{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hydro-mechanical_behaviour"}, {"score": 0.04886502274223979, "phrase": "bexm_model"}, {"score": 0.00445783412174435, "phrase": "barcelona_expansive_model"}, {"score": 0.00418046991987597, "phrase": "experimental_data"}, {"score": 0.003598317040926701, "phrase": "different_stress_paths"}, {"score": 0.003432604816716035, "phrase": "main_feature"}, {"score": 0.003388745581055085, "phrase": "pressure_development"}, {"score": 0.003359816816853762, "phrase": "micro-structural_volume_change"}, {"score": 0.0029925402963843282, "phrase": "soil_structure"}, {"score": 0.00296698375549856, "phrase": "double_structure"}, {"score": 0.0028181504086563967, "phrase": "mercury_intrusion"}, {"score": 0.0027114323601885666, "phrase": "low_suctions"}, {"score": 0.0024461474613359994, "phrase": "macro-structural_and_micro-structural_void_ratio_changes"}, {"score": 0.002353483216544667, "phrase": "clay_intra-particle_spaces"}, {"score": 0.0021973099304606076, "phrase": "micro-structural_water_content"}, {"score": 0.0021599099979586946, "phrase": "experimental_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bentonite/sand mixture", " Hydro-mechanical behaviour", " Constitutive modelling", " Volume change", " Microstructure"], "paper_abstract": "This study focuses on the hydro-mechanical behaviour of a MX80 bentonite/sand mixture. Barcelona Expansive Model (BExM) was used to describe this behaviour. For this purpose, experimental data obtained in the laboratory were analysed, allowing determination of the parameters used in the model.. These parameters were then used to simulate the hydro-mechanical (H-M) responses of the material from other tests with different stress paths. It was observed that the model reproduced well the main feature of swelling pressure development and micro-structural volume change during suction decrease. On the other hand, the simulations also showed some limitations of the model which is based on the consideration of two levels of soil structure or double structure: the pore size distribution curve determined by the technique of mercury intrusion porosimetry (MIP) in the range of low suctions (4.2 and 1 MPa) being revealed to be tri-modal, the BExM model cannot capture this aspect to correctly describe the macro-structural and micro-structural void ratio changes. Moreover, because the BExM model lumps clay intra-particle spaces and inter-particles voids together as micro-pores, it leads to overestimation of the micro-structural water content compared to the experimental value. (c) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Investigation of the hydro-mechanical behaviour of compacted bentonite/sand mixture based on the BExM model", "paper_id": "WOS:000325057000004"}