{"auto_keywords": [{"score": 0.04849105041601803, "phrase": "ligands_atp"}, {"score": 0.010125709049937799, "phrase": "transcriptional_activation"}, {"score": 0.01005801119614564, "phrase": "gal_genes"}, {"score": 0.009186872000133333, "phrase": "atp"}, {"score": 0.004235717186207754, "phrase": "numerous_studies"}, {"score": 0.004013098289856805, "phrase": "interacting_surface"}, {"score": 0.0034708912871162464, "phrase": "molecular_dynamics"}, {"score": 0.003459191419478298, "phrase": "simulation_and_protein-protein_docking_studies"}, {"score": 0.003063180586734181, "phrase": "global_conformation"}, {"score": 0.0030118779844670353, "phrase": "local_conformational_changes"}, {"score": 0.0029915976131073825, "phrase": "upper-lip_helix"}, {"score": 0.00266693888510356, "phrase": "binding_interface"}, {"score": 0.002442594378453517, "phrase": "probable_docking_sites"}, {"score": 0.0021336600569395693, "phrase": "existing_body"}, {"score": 0.0021049977753042253, "phrase": "functional_and_dynamical_aspects"}], "paper_keywords": ["Gal1p", " Gal3p", " Gal80p", " Docking", " Molecular dynamics", " ATP", " Galactose", " GAL genes"], "paper_abstract": "The Gal4p mediated transcriptional activation of GAL genes requires the interaction between Gal3p bound with ATP and galactose and Gal80p. Though numerous studies suggest that galactose and ATP activate Gal3p/Gal1p interaction with Gal80p, neither the mechanism of activation nor the interacting surface that binds to Gal80p is well understood. In this study we investigated the dynamics of Gal3p and Gal1p in the presence and absence of ligands ATP and galactose to understand the role played by dynamics in the function of these proteins through molecular dynamics simulation and protein-protein docking studies. We performed simulations totaling to 510 ns on both Gal1p and Gal3p proteins in the presence and absence of ligands ATP and galactose. We find that, while binding of ligands ATP and galactose to Gal3p/Gal1p do not affect the global conformation of proteins, some local conformational changes around upper-lip helix including insertion domain are observed. We observed that only in the presence of ATP and galactose, Gal3p displays opening and closing motion between the two domains. And because of this motion, a binding interface, which is largely hydrophobic, opens up on the surface of Gal3p and this surface can bind to Gal80p. From our simulation studies we infer probable docking sites for Gal80p on Gal3p/Gal1p, which were further ascertained by the docking of Gal80p on to ligand bound Gal1p and Gal3p proteins, and the residues at the interface between Gal3p and Gal80p are identified. Our results correlate quite well with the existing body of literature on functional and dynamical aspects of Gal1p and Gal3p proteins.", "paper_title": "Molecular simulation and docking studies of Gal1p and Gal3p proteins in the presence and absence of ligands ATP and galactose: implication for transcriptional activation of GAL genes", "paper_id": "WOS:000307398600005"}