{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weather_forecasts"}, {"score": 0.03755139933968755, "phrase": "prediction_strategies"}, {"score": 0.032781743294999326, "phrase": "weather_forecast"}, {"score": 0.004768649568826951, "phrase": "renewable_energy_systems"}, {"score": 0.004677372885331908, "phrase": "harvest_environmental_energy"}, {"score": 0.004456717971917794, "phrase": "energy_usage"}, {"score": 0.004350308086118336, "phrase": "system's_demands"}, {"score": 0.0030267296900520217, "phrase": "energy_harvesting"}, {"score": 0.002855934865505357, "phrase": "solar_or_wind_energy_harvesting_prediction"}, {"score": 0.002655894070657161, "phrase": "energy_harvesting_systems"}, {"score": 0.0021987994275190314, "phrase": "forecast-based_predictions"}, {"score": 0.0021670777282518424, "phrase": "system_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Energy harvesting", " Weather forecast", " Energy prediction", " Green computing"], "paper_abstract": "Systems that harvest environmental energy must carefully regulate their usage to satisfy their demand. Regulating energy usage is challenging if a system's demands are not elastic, since it cannot precisely scale its usage to match its supply. Instead, the system must choose how to satisfy its demands based on its current energy reserves and predictions of its future energy supply. In this paper, we show that prediction strategies that use weather forecasts are more accurate than prediction strategies based on the past, and are capable of improving the performance of a variety of systems. We analyze weather forecast, observational, and energy harvesting data to formulate a model that translates a weather forecast to a solar or wind energy harvesting prediction, and quantify its accuracy. We then compare the performance of three types of energy harvesting systems-a lexicographically fair sensor network, an off-the-grid sensor testbed, and a solar-powered smart home-using prediction models based on both forecasts and the past. In each case, forecast-based predictions significantly improve system performance. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Leveraging weather forecasts in renewable energy systems", "paper_id": "WOS:000209576600002"}