{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "agent_technology"}, {"score": 0.004583686207645165, "phrase": "future_electronic_marketplaces"}, {"score": 0.004378854464130883, "phrase": "autonomous_intelligent_entities-software"}, {"score": 0.003434922209075514, "phrase": "security_risks"}, {"score": 0.003178904945309528, "phrase": "legal_issues_relating_to_agents_trading"}, {"score": 0.003079736435077217, "phrase": "traditional_trading_practices"}, {"score": 0.0024581013157048926, "phrase": "users'_privacy"}, {"score": 0.0022667208478315323, "phrase": "legal_issues"}, {"score": 0.002234988641498543, "phrase": "agent-mediated_e-commerce"}, {"score": 0.00217284779477444, "phrase": "software_agents"}, {"score": 0.002142426911242168, "phrase": "legal_persons"}], "paper_keywords": [""], "paper_abstract": "The vision of future electronic marketplaces (e-markets) is that of markets being populated by autonomous intelligent entities-software, trading, e-agents-representing their users or owners and conducting business on their behalf. For this vision to materialize, one fundamental issue that needs to be addressed is that of trust. First, users need to be able to trust that the agents will do what they say they do. Second, they need to be confident that their privacy is protected and that the security risks involved in entrusting agents to perform transactions on their behalf are minimized. Finally, users need to be assured that any legal issues relating to agents trading electronically are fully covered as they are in traditional trading practices. In this paper we consider the barriers for the adoption of agent technology in electronic commerce (e-commerce) which pertain to trust, security and legal issues. We discuss the perceived risks of the use of agents in e-commerce and the fundamental issue of trust in this context. Issues regarding security, and how some of these can be addressed through the use of cryptography, are described. The impact of the use of agent technology on the users' privacy and how it can be both protected as well as hindered by it is also examined. Finally, we discuss the legal issues that arise in agent-mediated e-commerce and discuss the idea of attributing to software agents the status of legal persons or e-persons and the various implications.", "paper_title": "On agent technology for e-commerce: trust, security and legal issues", "paper_id": "WOS:000247840800001"}