{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "high-pressure_air_blast"}, {"score": 0.044713044306537005, "phrase": "dust_dispersion"}, {"score": 0.009827967163353206, "phrase": "dust_explosion"}, {"score": 0.009579470083802236, "phrase": "dust_distribution"}, {"score": 0.009385161036569476, "phrase": "numerical_simulation"}, {"score": 0.008557993111698895, "phrase": "dust_particle_size"}, {"score": 0.00713270683865138, "phrase": "uniform_dispersion"}, {"score": 0.005199427933591405, "phrase": "dust_particles_distribution"}, {"score": 0.004741167616693272, "phrase": "purpose_-_a_dust_cloud"}, {"score": 0.004526503177267299, "phrase": "dust_cloud"}, {"score": 0.004491678520807451, "phrase": "significant_impact"}, {"score": 0.004125773078637226, "phrase": "rebound_nozzle"}, {"score": 0.00393886140366453, "phrase": "numerical_simulations"}, {"score": 0.003702702337768558, "phrase": "findings_-_dust"}, {"score": 0.0034806529881619454, "phrase": "uniform_state"}, {"score": 0.0033486631403337555, "phrase": "aluminum_dusts"}, {"score": 0.0032972747743006572, "phrase": "higher_blast_pressure"}, {"score": 0.0031886139206755374, "phrase": "best_blast_pressure_value"}, {"score": 0.003075583447856341, "phrase": "dust_cloud_generation"}, {"score": 0.003036190943494256, "phrase": "dust_explosions"}, {"score": 0.0030205751488866293, "phrase": "dust_cloud_deflagration_parameters"}, {"score": 0.00286136653797089, "phrase": "multiphase_flow"}, {"score": 0.0028393160727077735, "phrase": "dust_air_mixture"}, {"score": 0.0027885217101617224, "phrase": "series_numerical_simulations"}, {"score": 0.0025610035410346386, "phrase": "dust_cloud_formation"}, {"score": 0.0024893563212341633, "phrase": "dust_explosion_experimental_parameters"}, {"score": 0.0024574537875026634, "phrase": "strong_impact"}, {"score": 0.0024448072654601957, "phrase": "measured_parameters"}, {"score": 0.0022279566797721645, "phrase": "new_finding"}, {"score": 0.002171202123281881, "phrase": "dust_particles"}, {"score": 0.002148906319501576, "phrase": "high-pressure_blast"}, {"score": 0.0021049977753042253, "phrase": "dispersible_uniformity"}], "paper_keywords": ["Flow", " Dust", " High-pressure air blast"], "paper_abstract": "Purpose - A dust cloud is formed by a high-pressure air blast in dust explosion experiments in the spherical 20 L chamber. The state of the dust cloud has a significant impact on the dust explosion. However, it is difficult to observe the dust distribution in the chamber during the dust dispersion. Numerical simulation was used to examine the dust distribution in the chamber with the rebound nozzle in this work. The paper aims to discuss these issues. Design/methodology/approach - Through a series numerical simulations, the influences of the dust particle size and the pressure for dust dispersion on the have been analyzed, and the results are discussed. Findings - Dust in the spherical 20 L chamber is in the state of very intensifying motion within 30 ms from dispersion starting. Dust in the chamber reaches a uniform state beyond 200 ms. The pressure for dust dispersion should be higher than 0.5 MPa for the aluminum dusts of larger than 50. The higher blast pressure is not always applicable to achieve a uniform dispersion. There is a best blast pressure value for a given dust to achieve a uniform dispersion in the spherical 20 L chamber. Research limitations/implications - Dust cloud generation is essential for understanding dust explosions. Dust cloud deflagration parameters depend on the uniformity and concentration of dusts dispersed by a high-pressure air blast. Numerical simulation was used to examine the multiphase flow of the dust air mixture in this work. Through a series numerical simulations, the influences of the dust particle size and the pressure for dust dispersion on the have been analyzed, and the results are discussed. The data are useful for understanding the basics of dust cloud formation. Practical implications - The data are useful for evaluating dust explosion experimental parameters. Originality/value - Dispersible uniformity has a strong impact on measured parameters of dust explosion in a chamber. However, it is difficult to observe the dust particles distribution during the dispersion. Numerical simulation was used to examine the dust particles distribution and its influencing factors during the dispersion in this work. New finding is: the approach to examine the distribution of dust particles dispersed by a high-pressure blast in a chamber; the variation of dispersible uniformity and its influencing factors when dust is injected into the spherical 20 L chamber by high-pressure air blast.", "paper_title": "Flow characteristics of dusts dispersed by high-pressure air blast in 20 L chamber", "paper_id": "WOS:000355829900009"}