{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rating_scales"}, {"score": 0.04971075098097412, "phrase": "decision_quality"}, {"score": 0.03863019075739011, "phrase": "multicriteria_scale"}, {"score": 0.03518546144454444, "phrase": "single-criterion_rating_scale"}, {"score": 0.00468656988857138, "phrase": "online_innovation_communities"}, {"score": 0.00415777266387528, "phrase": "user-generated_content"}, {"score": 0.00406250784433007, "phrase": "ratings_scales"}, {"score": 0.0039085400187964196, "phrase": "functional_and_perceptional_aspects"}, {"score": 0.003760385494931853, "phrase": "multimethod_approach"}, {"score": 0.0036318365746264127, "phrase": "higher_decision_quality"}, {"score": 0.003562322256892338, "phrase": "single-criterion_scale"}, {"score": 0.0035212516951180946, "phrase": "idea_elaboration"}, {"score": 0.0032592499906265882, "phrase": "long_ideas"}, {"score": 0.003111472132927442, "phrase": "web_site"}, {"score": 0.002981885091155911, "phrase": "bootstrap-based_monte_carlo_simulation"}, {"score": 0.0028138046006772567, "phrase": "stable_idea_rankings"}, {"score": 0.0026143990748127253, "phrase": "multicriteria_rating_scale"}, {"score": 0.0025643086619242814, "phrase": "co-creation_research"}, {"score": 0.0023368833197343953, "phrase": "rating_object"}, {"score": 0.0021049977753042253, "phrase": "future_use"}], "paper_keywords": ["Bootstrap", " co-creation", " decision quality", " Monte Carlo simulation", " online innovation community", " rating scale", " user-generated content"], "paper_abstract": "Given the rise of the Internet, consumers increasingly engage in co-creating products and services. Whereas most co-creation research deals with various aspects of generating user-generated content, this study addresses designing ratings scales for evaluating such content. In detail, we analyze functional and perceptional aspects of two frequently used rating scales in online innovation communities. Using a multimethod approach, our experiments show that a multicriteria scale leads to higher decision quality of users than a single-criterion scale, that idea elaboration (i.e., idea length) negatively moderates this effect such that the single-criterion rating scale outperforms the multicriteria scale for long ideas, and finally that the multicriteria scale leads to more favorable user attitudes toward the Web site. To ensure robustness of our results, we applied a bootstrap-based Monte Carlo simulation based on our experimental data. We found that around 20 user ratings per idea are sufficient for creating stable idea rankings and that a combination of both rating scales leads to a 63 percent performance improvement over the single-criterion rating scale and 16 percent over the multicriteria rating scale. Our work contributes to co-creation research by offering insights as to how the interaction of the technology being used (i. e., rating scale) and the attributes of the rating object affects two central outcome measures: the effectiveness of the rating in terms of decision quality of its users and the perception of the scale by its users as a predictor of future use.", "paper_title": "The Effect of Rating Scales on Decision Quality and User Attitudes in Online Innovation Communities", "paper_id": "WOS:000318678500002"}