{"auto_keywords": [{"score": 0.007496492617641941, "phrase": "web_search_engines"}, {"score": 0.00481495049065317, "phrase": "major_web_search_engines"}, {"score": 0.004669362683840143, "phrase": "major_study"}, {"score": 0.004354572391793908, "phrase": "first_results_page_overlap"}, {"score": 0.004211069233133584, "phrase": "wide_range"}, {"score": 0.004187614134377688, "phrase": "user_defined_search_terms"}, {"score": 0.004106541104485704, "phrase": "first_page"}, {"score": 0.004083665825986903, "phrase": "search_results"}, {"score": 0.003916098498242888, "phrase": "single-source_web_search_engines"}, {"score": 0.003641713874009232, "phrase": "dogpile.com"}, {"score": 0.003453395626161181, "phrase": "overlap_algorithm"}, {"score": 0.0033301694494391612, "phrase": "first_result_page_search"}, {"score": 0.003211326135352262, "phrase": "overall_overlap_metrics"}, {"score": 0.0029945352738604742, "phrase": "total_results"}, {"score": 0.002784540221128404, "phrase": "small_level"}, {"score": 0.0027535633837592597, "phrase": "major_differences"}, {"score": 0.0027382040767844093, "phrase": "web_search_engines_retrieval"}, {"score": 0.0026478260192958924, "phrase": "important_contribution"}, {"score": 0.002625700271311702, "phrase": "web_research_literature"}, {"score": 0.0025604233506352375, "phrase": "meta-search_engines"}, {"score": 0.0024967652017219115, "phrase": "single_search_engines"}, {"score": 0.0022324086872003985, "phrase": "large_investigation"}, {"score": 0.0022199498967679734, "phrase": "web_search_engine_overlap"}, {"score": 0.0021829882516961846, "phrase": "major_web_meta-search_engine"}, {"score": 0.0021049977753042253, "phrase": "top_results"}], "paper_keywords": ["world wide web", " search engines"], "paper_abstract": "Purpose - This paper reports the findings of a major study examining the overlap among results retrieved by three major web search engines. The goal of the research was to: measure the overlap across three major web search engines on the first results page overlap (i.e. share the same results) and the differences across a wide range of user defined search terms; determine the differences in the first page of search results and their rankings (each web search engine's view of the most relevant content) across single-source web search engines, including both sponsored and non-sponsored results; and measure the degree to which a meta-search web engine, such as Dogpile.com, provides searchers with the most highly ranked search results from three major single source web search engines. Design/methodology/approach - The authors collected 10,316 random Dogpile.com queries and ran an overlap algorithm using the URL for each result by query. The overlap of first result page search for each query was then summarized across all 10,316 to determine the overall overlap metrics. For a given query, the URL of each result for each engine was retrieved from the database. Findings - The percent of total results unique retrieved by only one of the three major web search engines was 85 percent, retrieved by two web search engines was 12 percent, and retrieved by all three web search engines was 3 percent. This small level of overlap reflects major differences in web search engines retrieval and ranking results. Research limitations/implications - This study provides an important contribution to the web research literature. The findings point to the value of meta-search engines in web retrieval to overcome the biases of single search engines. Practical implications - The results of this research can inform people and organizations that seek to use the web as part of their information seeking efforts, and the design of web search engines. Originality/value - This research is a large investigation into web search engine overlap using real data from a major web meta-search engine and single web search engines that sheds light on the uniqueness of top results retrieved by web search engines.", "paper_title": "Overlap among major web search engines", "paper_id": "WOS:000240930800004"}