{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "specific_learning_disabilities"}, {"score": 0.004677108044285109, "phrase": "ipad_computerized_writing_instruction"}, {"score": 0.004513957235071457, "phrase": "diagnosed_specific_learning_disabilities"}, {"score": 0.004190904630161064, "phrase": "language_learning_disability"}, {"score": 0.003979854888950705, "phrase": "multiple_learning_activities"}, {"score": 0.0034974064973871833, "phrase": "functional_writing_system"}, {"score": 0.003452490908017195, "phrase": "treatment_effectiveness"}, {"score": 0.0029467742734417255, "phrase": "oral_syntax"}, {"score": 0.0029089095588612007, "phrase": "pen_and_paper_tasks"}, {"score": 0.002862260172272785, "phrase": "computer_writing_instruction"}, {"score": 0.0027004145919012736, "phrase": "writing_outcomes"}, {"score": 0.0026743419827100225, "phrase": "individual_students"}, {"score": 0.002622947550220266, "phrase": "impaired_skill"}, {"score": 0.002514947446797848, "phrase": "upper_elementary_school"}, {"score": 0.0023497779149212737, "phrase": "persisting_slds"}, {"score": 0.00222403027114726, "phrase": "writing_skills"}, {"score": 0.0021462652605453163, "phrase": "persisting_writing_disabilities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer teacher", " Specific learning disabilities in writing", " Handwriting instruction", " Spelling instruction", " Composing instruction"], "paper_abstract": "Effectiveness of iPad computerized writing instruction was evaluated for 4th-9th graders (n = 35) with diagnosed specific learning disabilities (SLDs) affecting writing: dysgraphia (impaired handwriting), dyslexia (impaired spelling), and oral and written language learning disability (OWL LD) (impaired syntax composing). Each of the 18 two-hour lessons had multiple learning activities aimed at improving subword- (handwriting), word- (spelling), and syntax- (sentence composing) level language skills by engaging all four language systems (listening, speaking, reading, and writing) to create a functional writing system. To evaluate treatment effectiveness, normed measures of handwriting, spelling, and composing were used with the exception of one non-normed alphabet writing task. Results showed that the sample as a whole improved significantly from pretest to posttest in three handwriting measures, four spelling measures, and both written and oral syntax construction measures. All but oral syntax was evaluated with pen and paper tasks, showing that the computer writing instruction transferred to better writing with pen and paper. Performance on learning activities during instruction correlated with writing outcomes; and individual students tended to improve in the impaired skill associated with their diagnosis. Thus, although computers are often used in upper elementary school and middle school in the United States (US) for accommodations (alternatives to pen and paper) for students with persisting SLDs affecting writing, this study shows computers can also be used for Tier 3 instruction to improve the writing skills of students in grades 4-9 with history of persisting writing disabilities. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Computer instruction in handwriting, spelling, and composing for students with specific learning disabilities in grades 4-9", "paper_id": "WOS:000347606300015"}