{"auto_keywords": [{"score": 0.019872714754037225, "phrase": "spot_databases"}, {"score": 0.008875658439620035, "phrase": "spot_atoms"}, {"score": 0.006410614139625275, "phrase": "linear_programs"}, {"score": 0.00481495049065317, "phrase": "probabilistic_spatial_databases"}, {"score": 0.004401342842183475, "phrase": "object_o"}, {"score": 0.0043619799095455415, "phrase": "spatial_region_r"}, {"score": 0.00407161650109722, "phrase": "selection_operators"}, {"score": 0.003951561974767821, "phrase": "spot"}, {"score": 0.003611751858608048, "phrase": "cautious_selection_algorithms"}, {"score": 0.0034946232062615813, "phrase": "underlying_cartesian_space"}, {"score": 0.003371159698962328, "phrase": "\"optimistic\"_selection"}, {"score": 0.003118367740261359, "phrase": "entailment_relationship"}, {"score": 0.002765867822046626, "phrase": "resulting_advances"}, {"score": 0.002741091312632307, "phrase": "consistency_checking"}, {"score": 0.00255068452076921, "phrase": "search_space"}, {"score": 0.0025051811853674215, "phrase": "optimistic_selection"}, {"score": 0.0024238511813987323, "phrase": "efficient_index"}, {"score": 0.00240213106042981, "phrase": "optimistic_selection_queries"}, {"score": 0.002143247921132179, "phrase": "real-_world_data"}, {"score": 0.0021304214257321, "phrase": "ship_movements"}], "paper_keywords": ["Probabilistic database", " uncertainty management", " spatial database"], "paper_abstract": "(S) under bar patial (P) under barr (O) under bar babilistic (T) under bar emporal (SPOT) databases are a paradigm for reasoning with probabilistic statements about where a vehicle may be now or in the future. They express statements of the form \"Object O is in spatial region R at some time t with some probability in the interval [L,U].\" Past work on SPOT databases has developed selection operators based on selecting SPOT atoms that are entailed by the SPOT database-we call this \"cautious\" selection. In this paper, we study several problems. First, we note that the runtime of consistency checking and cautious selection algorithms in past work is influenced greatly by the granularity of the underlying Cartesian space. In this paper, we first introduce the notion of \"optimistic\" selection, where we are interested in returning all SPOT atoms in a database that are consistent with respect to a query, rather than having an entailment relationship. We then develop an approach to scaling SPOT databases that has three main contributions: 1) We develop methods to eliminate variables from the linear programs used in past work, thus greatly reducing the size of the linear programs used-the resulting advances apply to consistency checking, optimistic selection, and cautious selection. 2) We develop a host of theorems to show how we can prune the search space when we are interested in optimistic selection. 3) We use the above contributions to build an efficient index to execute optimistic selection queries over SPOT databases. Our approach is superior to past work in two major respects: First, it makes fewer assumptions than all past works on this topic except that in [30]. Second, our experiments, which are based on real- world data about ship movements, show that our algorithms are much more efficient than those in [30].", "paper_title": "SPOT Databases: Efficient Consistency Checking and Optimistic Selection in Probabilistic Spatial Databases", "paper_id": "WOS:000260999100007"}