{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "time_windows"}, {"score": 0.04279516348007121, "phrase": "pickup_location"}, {"score": 0.042051296116313676, "phrase": "delivery_location"}, {"score": 0.004642604455537883, "phrase": "delivery_problems"}, {"score": 0.004449280529563265, "phrase": "courier_companies"}, {"score": 0.00386876598761639, "phrase": "empirical_study"}, {"score": 0.003775803846431323, "phrase": "transshipment_points"}, {"score": 0.0032039415997394817, "phrase": "transshipment_point"}, {"score": 0.0027685531038981847, "phrase": "large_san_francisco_based_courier_company"}, {"score": 0.0025735173163957993, "phrase": "large_geographic_area"}, {"score": 0.0024963543716522087, "phrase": "main_reasoning"}, {"score": 0.0021966859554037174, "phrase": "transshipment_practice"}, {"score": 0.0021049977753042253, "phrase": "entire_service_area"}], "paper_keywords": ["pickup and delivery", " transshipment", " time windows"], "paper_abstract": "Pickup and delivery problems with time windows are frequently encountered by courier companies. These companies serve customers that require transportation of a package from a pickup location to a delivery location. This paper presents an empirical study on usefulness of transshipment points in such a context. Transshipment allows for a request to be served by two vehicles: one vehicle collects the load at the pickup location, drops it at a transshipment point, and another vehicle carries the load to the delivery location. The motivation for this work came from the practice observed in a large San Francisco based courier company that allows transshipment of loads between vehicles. The company serves large geographic area covering several neighboring cities. The main reasoning behind allowing transshipment lies in the idea of keeping drivers in their home area. We have investigated a generalization of this transshipment practice, allowing vehicles to move through entire service area in order to evaluate the usefulness of transshipment. We identify circumstances under which transshipment may be beneficial.", "paper_title": "The pickup and delivery problem with time windows and transshipment", "paper_id": "WOS:000252750800003"}