{"auto_keywords": [{"score": 0.04032838400644838, "phrase": "performing_arts"}, {"score": 0.03491093349899491, "phrase": "eclap"}, {"score": 0.015719716506582538, "phrase": "arts_metadata"}, {"score": 0.00830422329001964, "phrase": "eclap_model"}, {"score": 0.00817901954138011, "phrase": "edm"}, {"score": 0.004741845603430361, "phrase": "content_service"}, {"score": 0.004309323675697185, "phrase": "classical_cultural_heritage_descriptors"}, {"score": 0.004260134699483774, "phrase": "physical_objects"}, {"score": 0.004163427731140163, "phrase": "present_models"}, {"score": 0.0031240877370757167, "phrase": "europeana"}, {"score": 0.0029951555610569225, "phrase": "identified_problems"}, {"score": 0.002960922610176301, "phrase": "proposed_model"}, {"score": 0.00290473242917264, "phrase": "present_standards"}, {"score": 0.0028170314398963704, "phrase": "graphic_tool"}, {"score": 0.0027955219242123013, "phrase": "user_navigation"}, {"score": 0.0027741761880779535, "phrase": "semantic_relationships"}, {"score": 0.002609164919236973, "phrase": "lod"}, {"score": 0.002579326836642461, "phrase": "eclap_semantic_model"}, {"score": 0.0025110337774260773, "phrase": "europeana_data_model"}, {"score": 0.002416589459425828, "phrase": "relevant_elements"}, {"score": 0.0021049977753042253, "phrase": "available_standards"}], "paper_keywords": ["Performing arts", " Metadata enrichment", " Performing arts metadata", " LOD", " EDM", " Metadata standards"], "paper_abstract": "The modeling of performing arts metadata is considered one of the most challenging problems, since performances add complexities related to events to the classical cultural heritage descriptors associated to physical objects. The most relevant lacks of the present models are related to the modeling of information connected to performers and performances, which are obviously distinguishing aspects of the performing arts and are essential for the preservation of our cultural heritage and literature, such aspects being strongly connected with performing arts. This paper presents the European Collected Library of Artistic Performance (ECLAP) semantic model that has been specifically defined for aggregating and enriching performing arts content coming from several content providers. ECLAP has been set up by the European Commission to play the role of content aggregator for Europeana. The proposed ECLAP semantic model addresses most of the identified problems. The proposed model has been compared with present standards and it is now supported by a graphic tool for user navigation among semantic relationships and Linked Open Data (LOD). The paper also describes the generation of LOD from the ECLAP semantic model and the mapping of ECLAP model to Europeana Data Model (EDM). The experience highlighted that some relevant elements produced, enriched and aggregated by ECLAP cannot be mapped into EDM, while the ECLAP model can address some of the details related to the performing arts which are not at present addressed by the available standards.", "paper_title": "Modeling performing arts metadata and relationships in content service for institutions", "paper_id": "WOS:000360884100001"}