{"auto_keywords": [{"score": 0.04906704882074208, "phrase": "emotinet"}, {"score": 0.009713111476950599, "phrase": "automatic_systems"}, {"score": 0.00481495049065317, "phrase": "implicit_expressions"}, {"score": 0.004580769304731227, "phrase": "important_volume"}, {"score": 0.004515967518891287, "phrase": "natural_language_processing"}, {"score": 0.004265760046406154, "phrase": "different_approaches"}, {"score": 0.004190438004831167, "phrase": "explicit_expressions"}, {"score": 0.004116440453049531, "phrase": "word_level"}, {"score": 0.0038744481564444173, "phrase": "affective_meaning"}, {"score": 0.0032533888943254144, "phrase": "emotinet_knowledge_base"}, {"score": 0.003105979498529766, "phrase": "commonsense_knowledge"}, {"score": 0.0026737455737636867, "phrase": "implicit_affect_detection"}, {"score": 0.002525347599743456, "phrase": "alternative_methods"}, {"score": 0.0025073851194697397, "phrase": "affect_detection"}, {"score": 0.0023346234464901978, "phrase": "automatic_treatment"}, {"score": 0.0021659920594094407, "phrase": "better_results"}, {"score": 0.002150580119047236, "phrase": "traditional_emotion_detection_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["EmotiNet", " Emotion detection", " Emotion ontology", " Knowledge base", " Appraisal Theories", " Self-reported affect"], "paper_abstract": "In the past years, an important volume of research in Natural Language Processing has concentrated on the development of automatic systems to deal with affect in text. The different approaches considered dealt mostly with explicit expressions of emotion, at word level. Nevertheless, expressions of emotion are often implicit, inferrable from situations that have an affective meaning. Dealing with this phenomenon requires automatic systems to have \"knowledge\" on the situation, and the concepts it describes and their interaction, to be able to \"judge\" it, in the same manner as a person would. This necessity motivated us to develop the EmotiNet knowledge base - a resource for the detection of emotion from text based on commonsense knowledge on concepts, their interaction and their affective consequence. In this article, we briefly present the process undergone to build EmotiNet and subsequently propose methods to extend the knowledge it contains. We further on analyse the performance of implicit affect detection using this resource. We compare the results obtained with EmotiNet to the use of alternative methods for affect detection. Following the evaluations, we conclude that the structure and content of EmotiNet are appropriate to address the automatic treatment of implicitly expressed affect, that the knowledge it contains can be easily extended and that overall, methods employing EmotiNet obtain better results than traditional emotion detection approaches. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Detecting implicit expressions of affect in text using EmotiNet and its extensions", "paper_id": "WOS:000329382100008"}