{"auto_keywords": [{"score": 0.02844104612775308, "phrase": "cg_representation"}, {"score": 0.00481495049065317, "phrase": "data_selection"}, {"score": 0.0042550030421781605, "phrase": "statistical_distributions"}, {"score": 0.00419997182602686, "phrase": "internal_variables"}, {"score": 0.003935267970727093, "phrase": "simplified_interactions"}, {"score": 0.003859146369720225, "phrase": "larger_scales"}, {"score": 0.003569050665799723, "phrase": "accurate_and_predictive_statistics-based_force_fields"}, {"score": 0.002859856368059419, "phrase": "structural_datasets"}, {"score": 0.0025266963982350523, "phrase": "different_resolutions"}, {"score": 0.0022615684627308283, "phrase": "primary_structure_relations"}, {"score": 0.002232261129770455, "phrase": "sample_datasets"}, {"score": 0.0021049977753042253, "phrase": "structural_features"}], "paper_keywords": [""], "paper_abstract": "Motivation: Atomistic or coarse grained (CG) potentials derived from statistical distributions of internal variables have recently become popular due to the need of simplified interactions for reaching larger scales in simulations or more efficient conformational space sampling. However, the process of parameterization of accurate and predictive statistics-based force fields requires a huge amount of work and is prone to the introduction of bias and errors. Results: This article introduces SecStAnT, a software for the creation and analysis of protein structural datasets with user-defined primary/secondary structure composition, with a particular focus on the CG representation. In addition, the possibility of managing different resolutions and the primary/secondary structure selectivity allow addressing the mapping-backmapping of atomistic to CG representation and study the secondary to primary structure relations. Sample datasets and distributions are reported, including interpretation of structural features.", "paper_title": "SecStAnT: secondary structure analysis tool for data selection, statistics and models building", "paper_id": "WOS:000332259300011"}