{"auto_keywords": [{"score": 0.008081647282623259, "phrase": "text_documents"}, {"score": 0.00481495049065317, "phrase": "jxta-overlay"}, {"score": 0.004644014990871423, "phrase": "essential_feature"}, {"score": 0.004479120557712926, "phrase": "brute_force_techniques"}, {"score": 0.004364919932563366, "phrase": "meta_information"}, {"score": 0.003916098498242888, "phrase": "content-based_search"}, {"score": 0.0037769520261285872, "phrase": "clustering_techniques"}, {"score": 0.0035497797026638033, "phrase": "document_discovery"}, {"score": 0.0028715299874549245, "phrase": "multimedia_content"}, {"score": 0.0025625729433234623, "phrase": "existing_class-based_semantic_search_algorithm"}, {"score": 0.0024842242921857705, "phrase": "proposed_algorithms"}, {"score": 0.002251542790734307, "phrase": "considered_clustering_techniques"}, {"score": 0.0021490449563443025, "phrase": "efficient_searching"}, {"score": 0.002126907587540404, "phrase": "multimedia_contents"}, {"score": 0.0021049977753042253, "phrase": "peer_nodes"}], "paper_keywords": ["P2P networks", " P2P multimedia clustering", " Class-based Semantic Search", " JXTA", " Content-based retrieval"], "paper_abstract": "Efficient file searching is an essential feature in P2P systems. While many current approaches use brute force techniques to search files by meta information (file names, extensions or user-provided tags), the interest is in implementing techniques that allow content-based search in P2P systems. Recently, clustering techniques have been used for searching text documents to increase the efficiency of document discovery and retrieval. Integrating such techniques into P2P systems is important to enhance searching in P2P file sharing systems. While some effort has been taken for content-based searching for text documents in P2P systems, there has been few research work for applying these techniques to multimedia content in P2P systems. In this paper, we introduce two P2P content-based clustering techniques for multimedia documents. These techniques are an adaptation of the existing Class-based Semantic Search algorithm for text documents. The proposed algorithms have been integrated into a JXTA-based Overlay P2P platform, and evaluation results are provided. The JXTA-Overlay together with the considered clustering techniques is thus very useful for developing P2P multimedia applications requiring efficient searching of multimedia contents in peer nodes.", "paper_title": "Evaluation of P2P multimedia clustering techniques in JXTA-Overlay", "paper_id": "WOS:000270342700003"}