{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "flexural_strength"}, {"score": 0.04885877600670675, "phrase": "rc_columns"}, {"score": 0.008820267483170411, "phrase": "strain_gradient"}, {"score": 0.008640669843316549, "phrase": "maximum_concrete_stress"}, {"score": 0.008040161972554239, "phrase": "strain_gradient_effect"}, {"score": 0.006087555530015177, "phrase": "concrete_strength"}, {"score": 0.004620093797504386, "phrase": "stress-strain_relationship"}, {"score": 0.004410248125081398, "phrase": "essential_parameters"}, {"score": 0.004123781267600542, "phrase": "previous_research_studies"}, {"score": 0.003757480190200645, "phrase": "quantitative_model"}, {"score": 0.0034236045013591437, "phrase": "experimental_studies"}, {"score": 0.0032848684681050745, "phrase": "respective_strain"}, {"score": 0.0031193028729331667, "phrase": "flexural_concrete_stress-strain_curve"}, {"score": 0.0028715299874549245, "phrase": "gradient_effects"}, {"score": 0.002684740763324991, "phrase": "strain-gradient-dependent_concrete_stress-strain_curve"}, {"score": 0.002298649369775623, "phrase": "practical_engineering_design_purpose"}, {"score": 0.00226322835801988, "phrase": "new_equivalent_rectangular_concrete_stress_block"}, {"score": 0.0021049977753042253, "phrase": "design_formulas"}], "paper_keywords": ["columns", " ductility", " flexural strength", " strain gradient", " stress block parameters"], "paper_abstract": "The stress-strain relationship of concrete in flexure is one of the essential parameters in assessing the flexural strength and ductility of reinforced concrete (RC) columns. An overview of previous research studies revealed that the presence of strain gradient would affect the maximum concrete stress developed in flexure. However, no quantitative model was available to evaluate the strain gradient effect on concrete under flexure. Previously, the authors have conducted experimental studies to investigate the strain gradient effect on maximum concrete stress and respective strain and developed two strain-gradient-dependent factors k3 and ko for modifying the flexural concrete stress-strain curve. As a continued study, the authors herein will extend the investigation of strain gradient effects on flexural strength and ductility of RC columns to concrete strength up to 100 MPa by employing the strain-gradient-dependent concrete stress-strain curve using nonlinear moment-curvature analysis. It was evident from the results that both the flexural strength and ductility of RC columns are improved under strain gradient effect. Lastly, for practical engineering design purpose, a new equivalent rectangular concrete stress block incorporating the combined effects of strain gradient and concrete strength was proposed and validated. Design formulas and charts have also been presented for flexural strength and ductility of RC columns.", "paper_title": "Combined strain gradient and concrete strength effects on flexural strength and ductility design of RC columns", "paper_id": "WOS:000359968800007"}