{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "cognitive_radio_networks"}, {"score": 0.014981767887395641, "phrase": "cognitive_users"}, {"score": 0.004464326432401002, "phrase": "communication_link"}, {"score": 0.004392565073466714, "phrase": "commonly_available_channel"}, {"score": 0.004298666679374568, "phrase": "consequent_information_exchange"}, {"score": 0.0035771121569391916, "phrase": "central_controller"}, {"score": 0.0035386420095120706, "phrase": "dedicated_common_control_channel"}, {"score": 0.0030414140732789186, "phrase": "different_velocities"}, {"score": 0.0028968858148006823, "phrase": "lower_velocity"}, {"score": 0.0027295084882654917, "phrase": "higher_velocity"}, {"score": 0.002656650588033728, "phrase": "existing_solutions"}, {"score": 0.002599763359352916, "phrase": "guaranteed_rendezvous"}, {"score": 0.0024231382864800173, "phrase": "multi-user_and_multi-hop_scenario"}, {"score": 0.0021049977753042253, "phrase": "multi-user_scenarios"}], "paper_keywords": ["Cognitive radio", " Rendezvous", " Channel hopping"], "paper_abstract": "Rendezvous in cognitive radio networks is the process that cognitive users meet and establish a communication link on a commonly available channel, so that consequent information exchange and data communications can be accomplished on the channel. In this study, we propose two ring-walk (RW) rendezvous algorithms to solve the problem of blind rendezvous, i.e., rendezvous without the help of any central controller and dedicated common control channel. Our basic idea is to represent each channel as a vertex in a ring. Cognitive users \"walk\" on the ring by visiting vertices of channels with different velocities. Rendezvous is achievable since the user with lower velocity will be eventually \"caught\" by the user with higher velocity. Compared with the existing solutions, our algorithms provide guaranteed rendezvous without the need of time-synchronization and are applicable to rendezvous of the multi-user and multi-hop scenario. We derive upper bounds on the time-to-rendezvous (TTR) and the expected TTR of our algorithms in both 2-user and multi-user scenarios. Extensive simulations are conducted to evaluate the performance of our algorithms.", "paper_title": "Ring-Walk Rendezvous Algorithms for Cognitive Radio Networks", "paper_id": "WOS:000310653400001"}