{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "production_system"}, {"score": 0.049666636555871356, "phrase": "virtual_commissioning"}, {"score": 0.04572074988236009, "phrase": "real_controller"}, {"score": 0.024667291473581918, "phrase": "proposed_design_procedure"}, {"score": 0.004631099806015235, "phrase": "concurrent_design_procedure"}, {"score": 0.0043213410601860985, "phrase": "virtual_plant"}, {"score": 0.0042656009036320585, "phrase": "virtual_devices"}, {"score": 0.004084920064588169, "phrase": "virtual_device_model"}, {"score": 0.0038115535592184438, "phrase": "motion_programming"}, {"score": 0.003480230347985338, "phrase": "whole_design_procedure"}, {"score": 0.0029776614744264724, "phrase": "process_design_step"}, {"score": 0.0029519664912853938, "phrase": "effective_manufacturing_processes"}, {"score": 0.0023460397258997525, "phrase": "concurrent_attribute"}], "paper_keywords": ["Virtual commissioning", " simulation", " programmable logic controller", " virtual plant", " concurrent design"], "paper_abstract": "In this article, a concurrent design procedure of a production system is presented, which supports the virtual commissioning between a real controller and a virtual plant consisting of virtual devices. To achieve the concurrency, we split a virtual device model into two parts, a physical device model (a geometric model with kinematics for the motion programming of tasks) and a logical device model (a behavioral model to interact with a real controller). The whole design procedure consists of four major steps: (1) process design, (2) physical device modeling, (3) logical device modeling, and (4) system control modeling. First, the process design step identifies effective manufacturing processes and produces the sequence of operations. Once the sequence of operations is obtained at Step 1, then the other three steps can be performed concurrently without interfering each other. All the three concurrent steps start from the sequence of operations, and a detailed procedure for each of the step has been developed. The concurrent attribute of the proposed design procedure significantly contributes to the saving of the delays in time to market. The proposed design procedure has been implemented and tested for various examples.", "paper_title": "A concurrent design methodology of a production system for virtual commissioning", "paper_id": "WOS:000330527100004"}