{"auto_keywords": [{"score": 0.04016157518902184, "phrase": "trust_judgments"}, {"score": 0.00481495049065317, "phrase": "trained_professionals"}, {"score": 0.004112812699639956, "phrase": "end_users"}, {"score": 0.003958049372486465, "phrase": "new_model"}, {"score": 0.003468053168607071, "phrase": "different_features"}, {"score": 0.003104038398386081, "phrase": "online_experiment"}, {"score": 0.0029491324941225356, "phrase": "wikipedia_articles"}, {"score": 0.002924074850256874, "phrase": "varying_accuracy"}, {"score": 0.002825949329865926, "phrase": "internet_users"}, {"score": 0.0027781249331615813, "phrase": "domain_experts"}, {"score": 0.002465210678474529, "phrase": "trusting_participants"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": [""], "paper_abstract": "In the past few decades, the task of judging the credibility of information has shifted from trained professionals (e. g., editors) to end users of information (e. g., casual Internet users). Lacking training in this task, it is highly relevant to research the behavior of these end users. In this article, we propose a new model of trust in information, in which trust judgments are dependent on three user characteristics: source experience, domain expertise, and information skills. Applying any of these three characteristics leads to different features of the information being used in trust judgments; namely source, semantic, and surface features (hence, the name 3S-model). An online experiment was performed to validate the 3S-model. In this experiment, Wikipedia articles of varying accuracy (semantic feature) were presented to Internet users. Trust judgments of domain experts on these articles were largely influenced by accuracy whereas trust judgments of novices remained mostly unchanged. Moreover, despite the influence of accuracy, the percentage of trusting participants, both experts and novices, was high in all conditions. Along with the rationales provided for such trust judgments, the outcome of the experiment largely supports the 3S-model, which can serve as a framework for future research on trust in information.", "paper_title": "Factual Accuracy and Trust in Information: The Role of Expertise", "paper_id": "WOS:000291953800003"}