{"auto_keywords": [{"score": 0.048786972321694204, "phrase": "marketing_policy"}, {"score": 0.00481495049065317, "phrase": "research_and_development"}, {"score": 0.004363277689798392, "phrase": "existing_performance_measurement_methods"}, {"score": 0.004245476558619167, "phrase": "significant_assistance"}, {"score": 0.004130842663662047, "phrase": "marketing_strategies"}, {"score": 0.004085856939524333, "phrase": "innovation_levels"}, {"score": 0.003228434077467506, "phrase": "bass_diffusion_model"}, {"score": 0.0028932554846476718, "phrase": "computer_simulation"}, {"score": 0.002738914205394527, "phrase": "innovation_level"}, {"score": 0.0024679299547216956, "phrase": "supply_chain_system"}, {"score": 0.0024276590297034064, "phrase": "performance_measurement"}, {"score": 0.002361992359512022, "phrase": "firm's_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Supply chain management", " R&D", " Marketing policy", " Bass diffusion model", " Performance measurement system"], "paper_abstract": "Various performance measurement techniques have been developed and applied in their respective fields, but the existing performance measurement methods have failed to provide significant assistance in the context of marketing strategies and innovation levels of a firm. In this paper, we have considered an important aspect of marketing policy involving examining the decision of a firm to distribute products and services to its consumer. The model developed in this paper is an extension to the Bass diffusion model which is generalized to incorporate the effects of marketing policy of the firm. In order to examine our model, computer simulation is conducted in order to measure the effect of innovation level and distribution of products and services on the change in the sales of a firm from its previous products and supply chain system. The performance measurement was developed by examining firm's level of innovation achieved by their Research and Development (R&D) performances, and sales of the products and services. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An innovative supply chain performance measurement system incorporating Research and Development (R&D) and marketing policy", "paper_id": "WOS:000332440400007"}