{"auto_keywords": [{"score": 0.04961597900198376, "phrase": "high-speed_networks"}, {"score": 0.010612387000973441, "phrase": "congestion_control"}, {"score": 0.010062973683050515, "phrase": "real-time_traffic"}, {"score": 0.008054779671434753, "phrase": "throughput_degradation"}, {"score": 0.005792082218416752, "phrase": "eefast_dccp"}, {"score": 0.005255990546180374, "phrase": "fast_dccp"}, {"score": 0.00512986660300522, "phrase": "reverse_traffic"}, {"score": 0.003614044704141927, "phrase": "tcp_traffic"}, {"score": 0.003493021648360933, "phrase": "new_unreliable_transport_protocol"}, {"score": 0.0031845067058084583, "phrase": "dccp_protocol"}, {"score": 0.00312310128226407, "phrase": "fast_scheme"}, {"score": 0.002903161844810564, "phrase": "dccp"}, {"score": 0.0028195727965553367, "phrase": "proposed_protocol"}, {"score": 0.0027383842769094354, "phrase": "large_size_window"}, {"score": 0.002545468362709126, "phrase": "one-way_delay"}, {"score": 0.0024842242921857705, "phrase": "window_size"}, {"score": 0.002297949552105756, "phrase": "simulation_results"}, {"score": 0.0021780349459687622, "phrase": "real-time_data_delivery"}, {"score": 0.0021049977753042253, "phrase": "bandwidth_utilization"}], "paper_keywords": ["Unreliable transport protocol", " Congestion control", " High-speed networks", " Real-time traffic"], "paper_abstract": "Currently there is no control for the real-time traffic of multimedia applications using UDP (User Datagram Protocol) in high-speed networks. Therefore, although a number of high-speed TCP (Transmission Control Protocol) protocols have been developed for gigabit-speed (or faster) links, the real-time traffic could also congest the network and result in unfairness and throughput degradation of TCP traffic. In this paper, a new unreliable transport protocol, FAST DCCP, is presented for the real-time traffic in high-speed networks. FAST DCCP is based on the DCCP protocol and adopts the FAST scheme to realize congestion control. Some modifications have been made to the mechanisms inherited from DCCP so as to let the proposed protocol can efficiently operate under a large size window. In addition, an enhanced protocol. EEFAST DCCP, using the measurements of one-way delay to dynamically adjust the window size is also proposed to improve the throughput of FAST DCCP with the effect of reverse traffic. Simulation results show that FAST DCCP not only can satisfy the requirements of real-time data delivery, but also perform well in bandwidth utilization and fairness in high-speed networks. Meanwhile, EEFAST DCCP is able to effectively conquer the throughput degradation caused by the reverse traffic. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Unreliable transport protocol using congestion control for high-speed networks", "paper_id": "WOS:000284674200023"}