{"auto_keywords": [{"score": 0.039172026442386244, "phrase": "low-sensitivity_explosives"}, {"score": 0.00481495049065317, "phrase": "theoretical_studies"}, {"score": 0.0045213598841171935, "phrase": "five-membered_heterocycle"}, {"score": 0.004390517953424082, "phrase": "triazole_ring"}, {"score": 0.0038549394272661356, "phrase": "five-membered_heterocycles"}, {"score": 0.003665552439863732, "phrase": "present_work"}, {"score": 0.0034418037573506837, "phrase": "gas_phase"}, {"score": 0.003286420941205958, "phrase": "density_functional_theory"}, {"score": 0.0031248767378106663, "phrase": "homodesmotic_reaction_method"}, {"score": 0.0030470980812086247, "phrase": "solid-phase_enthalpies"}, {"score": 0.002897283610433351, "phrase": "kamlet-jacobs_equations"}, {"score": 0.002766415324343602, "phrase": "solid_state"}, {"score": 0.00267495669519805, "phrase": "available_free_space"}, {"score": 0.0024284701569889113, "phrase": "higher_energies"}], "paper_keywords": ["1,2,3,4-Tetrazine", " 1,2,3-Triazole", " DFT", " Detonation performance", " Stability"], "paper_abstract": "1,2,3,4-Tetrazine (vicinal-tetrazine) high-energy-density compounds (HEDCs) are receiving increasing attention due to their promise as explosives. We have performed a series of studies of vicinaltetrazine 1,3-dioxides annulated with a range of five-membered heterocycles, considering their potential as high-energy, low-sensitivity explosives. In the present work, twelve 1,2,3-triazol-1,2,3,4-tetrazine 1,3-dioxides (TTDOs; T1-T12) were studied theoretically. Their geometric structures in the gas phase were studied at the B3LYP/6-311++G(d,p) level of density functional theory (DFT). Their gas-phase enthalpies of formation were calculated by the homodesmotic reaction method. Their enthalpies of sublimation and solid-phase enthalpies of formation were also predicted. Their detonation properties were estimated with the Kamlet-Jacobs equations, based on their predicted densities and enthalpies of formation in the solid state. Their bond dissociation activation energies (BDAEs) and the available free space in the lattice of each compound were calculated to evaluate their stabilities. T2, T5, and T11 were found to have higher energies than RDX and acceptable stabilities, and are therefore considered to be the three most promising TTDOs for use as high-energy, low-sensitivity explosives. We believe that further studies, both experimental and theoretical, of these three targets would be worthwhile.", "paper_title": "Theoretical studies of the structure, stability, and detonation properties of vicinal-tetrazine 1,3-dioxide annulated with a five-membered heterocycle. 1. Annulation with a triazole ring", "paper_id": "WOS:000359539700015"}