{"auto_keywords": [{"score": 0.049715817986079144, "phrase": "mobile_environments"}, {"score": 0.015719716506582538, "phrase": "handwritten_signature_recognition"}, {"score": 0.011277124240370378, "phrase": "mobile_devices"}, {"score": 0.004652754203582873, "phrase": "mobile_scenarios"}, {"score": 0.004377719094086111, "phrase": "highest_potential"}, {"score": 0.004150377643719188, "phrase": "traditional_processes"}, {"score": 0.00394981748347167, "phrase": "acceptable_levels"}, {"score": 0.0037020429480068653, "phrase": "multiple_results"}, {"score": 0.0035230711775515854, "phrase": "eight_different_capture_devices"}, {"score": 0.0028347983387988847, "phrase": "dtw-based_one"}, {"score": 0.0026976391682197133, "phrase": "visual_feedback"}, {"score": 0.002616544154458438, "phrase": "big_challenges"}, {"score": 0.0025282151875392817, "phrase": "handwritten_signature"}, {"score": 0.0021537671245615286, "phrase": "multiple_improvements"}, {"score": 0.0021049977753042253, "phrase": "future_deployments"}], "paper_keywords": [""], "paper_abstract": "The utilisation of biometrics in mobile scenarios is increasing remarkably. At the same time, handwritten signature recognition is one of the modalities with highest potential of use for those applications where customers are used to sign in those traditional processes. However, several improvements have to be made in order to reach acceptable levels of performance, reliability and interoperability. The evaluation carried out in this study contributes with multiple results obtained from 43 users signing 60 times, divided in three sessions, in eight different capture devices, being six of them mobile devices and the other two digitisers specially made for signing and used as a baseline. At each session, a total of 20 signatures per user are captured by each device, so that the evaluation here reported a total of 20 640 signatures, stored in ISO/IEC 19794-7 format. The algorithm applied is a DTW-based one, particularly modified for mobile environments. The results analysed include interoperability, visual feedback and modality tests. One of the big challenges of this research was to discover if the handwritten signature modality in mobile devices should be split into two different modalities, one for those cases when the signature is performed with a stylus, and another when the fingertip is used for signing. Many relevant conclusions have been collected and, over all, multiple improvements have been reached contributing to future deployments of biometrics in mobile environments.", "paper_title": "Performance evaluation of handwritten signature recognition in mobile environments", "paper_id": "WOS:000346562600003"}