{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "active_site"}, {"score": 0.004733347359490221, "phrase": "hepatitis_c_viral_rna_polymerase"}, {"score": 0.004653120760786245, "phrase": "novel_drug_design"}, {"score": 0.004574247691703376, "phrase": "hepatitis_c_virus"}, {"score": 0.004296264970612285, "phrase": "leading_target"}, {"score": 0.004199406257273994, "phrase": "selective_hcv_drug_design"}, {"score": 0.003989351600022163, "phrase": "intensive_drug_discovery"}, {"score": 0.0033048445033866795, "phrase": "forty-one_distinct_nucleotide_structures"}, {"score": 0.0031037644581516973, "phrase": "six_major_hcv_genotypes"}, {"score": 0.002706383680762465, "phrase": "binding_interactions"}, {"score": 0.0026604207233593973, "phrase": "individual_compounds"}, {"score": 0.0025416235470290286, "phrase": "atomic_level"}, {"score": 0.0024984517279573906, "phrase": "present_study"}, {"score": 0.0023064582783867645, "phrase": "key_structural_elements"}, {"score": 0.0021291870676682406, "phrase": "additional_much_needed_novel_inhibitors"}], "paper_keywords": [""], "paper_abstract": "The hepatitis C virus (HCV) RNA polymerase, NS5B, is a leading target for novel and selective HCV drug design. The enzyme has been the subject of intensive drug discovery aimed at developing direct acting antiviral (DAA) agents that inhibit its activity and hence prevent the virus from replicating its genome. In this study, we focus on one class of NS5B inhibitors, namely nucleos(t)ide mimetics. Forty-one distinct nucleotide structures have been modeled within the active site of NS5B for the six major HCV genotypes. Our comprehensive modeling protocol employed 287 different molecular dynamics simulations combined with the molecular mechanics/Poisson-Boltzmann surface area (MM-PBSA) methodology to rank and analyze these structures for all genotypes. The binding interactions of the individual compounds have been investigated and reduced to the atomic level. The present study significantly refines our understanding of the mode of action of NS5B-nucleotide-inhibitors, identifies the key structural elements necessary for their activity, and implements the tools for ranking the potential of additional much needed novel inhibitors of NS5B.", "paper_title": "Detailed Computational Study of the Active Site of the Hepatitis C Viral RNA Polymerase to Aid Novel Drug Design", "paper_id": "WOS:000327747200023"}