{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "objective_functions"}, {"score": 0.0047057084749407485, "phrase": "density_deconvolution"}, {"score": 0.004426308135681733, "phrase": "objective_function"}, {"score": 0.004375789703278455, "phrase": "practical_implementation"}, {"score": 0.004211504818267892, "phrase": "specific_problems"}, {"score": 0.004163427731140163, "phrase": "seemingly_numerical_instability"}, {"score": 0.00411589720697736, "phrase": "integral_calculation"}, {"score": 0.004053362743156545, "phrase": "grid_points"}, {"score": 0.003221316290858497, "phrase": "serious_considerations"}, {"score": 0.0031240868074933078, "phrase": "clear_discussion"}, {"score": 0.003018196463874475, "phrase": "particular_statistical_problem"}, {"score": 0.00288255520607591, "phrase": "measurement_errors"}, {"score": 0.002680114113899346, "phrase": "kernel_density_estimator"}, {"score": 0.002530359917257626, "phrase": "fully_data-driven_procedures"}, {"score": 0.002325689073229477, "phrase": "adequate_numerical_procedures"}], "paper_keywords": ["bandwidth selection", " dramatic cancellation", " fast Fourier transform", " numerical approximations", " optimization"], "paper_abstract": "Many statistical procedures involve calculation of integrals or optimization (minimization or maximization) of some objective function. In practical implementation of these, the user often has to face specific problems such as seemingly numerical instability of the integral calculation, choices of grid points, appearance of several local minima or maxima, etc. In this paper we provide insights into these problems (why and when are they happening?), and give some guidelines of how to deal with them. Such problems are not new, neither are the ways to deal with them, but it is worthwhile to devote serious considerations to them. For a transparant and clear discussion of these issues, we focus on a particular statistical problem: nonparametric estimation of a density from a sample that contains measurement errors. The discussions and guidelines remain valid though in other contexts. In the density deconvolution setting, a kernel density estimator has been studied in detail in the literature. The estimator is consistent and fully data-driven procedures have been proposed. When implemented in practice however, the estimator can turn out to be very inaccurate if no adequate numerical procedures are used. We review the steps leading to the calculation of the estimator and in selecting parameters of the method, and discuss the various problems encountered in doing so.", "paper_title": "Frequent problems in calculating integrals and optimizing objective functions: a case study in density deconvolution", "paper_id": "WOS:000249409100005"}