{"auto_keywords": [{"score": 0.026965901705955694, "phrase": "existing_approaches"}, {"score": 0.004438250823243621, "phrase": "network_security"}, {"score": 0.004162978902905446, "phrase": "network_communities"}, {"score": 0.003557283483525861, "phrase": "multi-dimensional_properties"}, {"score": 0.003415137969569376, "phrase": "innovative_trust_model"}, {"score": 0.003259604990188875, "phrase": "multiple_factors"}, {"score": 0.002817639725689939, "phrase": "weighted_moving_average"}, {"score": 0.0026580683046325253, "phrase": "combination_algorithms"}, {"score": 0.0024072121760839427, "phrase": "simulation_results"}, {"score": 0.0022708315711029423, "phrase": "proposed_model"}, {"score": 0.002244494905883452, "phrase": "greater_accuracy"}, {"score": 0.0021799789348982534, "phrase": "trust_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Large-scale P2P computing", " Trust model", " Trust factor", " WMA-OWA combination algorithms"], "paper_abstract": "In large-scale peer-to-peer (P2P) computing, trust management technology has become a key requirement for network security. However, trust is one of the most complex concepts in network communities. It involves many factors, such as, assumptions, expectations, behaviors, risks, and so on. As a result, trustworthiness has multi-dimensional properties. In this paper, an innovative trust model is proposed for large-scale P2P computing, in which multiple factors are incorporated to reflect the complexity of trust. More importantly, the properties (weights) of these factors are dynamically assigned by weighted moving average and ordered weighted averaging (WMA-OWA) combination algorithms. This model surpasses the limitations of existing approaches, wherein weights are assigned subjectively. The simulation results show that, compared with the existing approaches, the proposed model provides greater accuracy and a more detailed analysis in trust evaluation. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A multi-dimensional trust evaluation model for large-scale P2P computing", "paper_id": "WOS:000290460100010"}