{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "peptide_fragmentation"}, {"score": 0.015459727487894455, "phrase": "peptide_identification"}, {"score": 0.004774530554776604, "phrase": "dynamic_bayesian_networks"}, {"score": 0.004500891637057374, "phrase": "indispensable_technology"}, {"score": 0.004388450908826472, "phrase": "complex_mixtures"}, {"score": 0.0041194351307673556, "phrase": "mass_spectrometer"}, {"score": 0.003932654396285872, "phrase": "relative_predictability"}, {"score": 0.003568932067237836, "phrase": "peptide_identification_algorithms"}, {"score": 0.003465036432323081, "phrase": "hybrid_dynamic_bayesian_network"}, {"score": 0.0031710903727066313, "phrase": "high-confidence_peptide-spectrum_matches"}, {"score": 0.003014422649429416, "phrase": "probabilistic_model"}, {"score": 0.0029890721584351684, "phrase": "peptide_fragmentation_chemistry"}, {"score": 0.00284137141260141, "phrase": "new_trends"}, {"score": 0.0027937732927852646, "phrase": "prevalent_a-ion_fragmentation"}, {"score": 0.002770273247998903, "phrase": "peptide_cleavage_sites_c-term"}, {"score": 0.0026112013707473938, "phrase": "likelihood_scores"}, {"score": 0.0024303177930280065, "phrase": "svm"}, {"score": 0.0023794391656001466, "phrase": "final_score"}, {"score": 0.0022522565004588113, "phrase": "improved_discrimination"}], "paper_keywords": [""], "paper_abstract": "Motivation: Tandem mass spectrometry (MS/MS) is an indispensable technology for identification of proteins from complex mixtures. Proteins are digested to peptides that are then identified by their fragmentation patterns in the mass spectrometer. Thus, at its core, MS/MS protein identification relies on the relative predictability of peptide fragmentation. Unfortunately, peptide fragmentation is complex and not fully understood, and what is understood is not always exploited by peptide identification algorithms. Results: We use a hybrid dynamic Bayesian network (DBN)/support vector machine (SVM) approach to address these two problems. We train a set of DBNs on high-confidence peptide-spectrum matches. These DBNs, known collectively as Riptide, comprise a probabilistic model of peptide fragmentation chemistry. Examination of the distributions learned by Riptide allows identification of new trends, such as prevalent a-ion fragmentation at peptide cleavage sites C-term to hydrophobic residues. In addition, Riptide can be used to produce likelihood scores that indicate whether a given peptide-spectrum match is correct. A vector of such scores is evaluated by an SVM, which produces a final score to be used in peptide identification. Using Riptide in this way yields improved discrimination when compared to other state-of-the-art MS/MS identification algorithms, increasing the number of positive identifications by as much as 12% at a 1% false discovery rate.", "paper_title": "Modeling peptide fragmentation with dynamic Bayesian networks for peptide identification", "paper_id": "WOS:000257169700062"}