{"auto_keywords": [{"score": 0.02817836731245031, "phrase": "firm_globalization"}, {"score": 0.00481495049065317, "phrase": "individual_firms"}, {"score": 0.004622450915803531, "phrase": "traditional_patterns"}, {"score": 0.004591120854640081, "phrase": "firm-to-customer_communication"}, {"score": 0.004289215825521407, "phrase": "firms'_visibility"}, {"score": 0.004245667843980468, "phrase": "electronic_marketplace"}, {"score": 0.0040619911719900976, "phrase": "new_model"}, {"score": 0.00356924199356768, "phrase": "global_e-business_market"}, {"score": 0.0034497831301482144, "phrase": "literature_review"}, {"score": 0.003380029058401904, "phrase": "online_customers"}, {"score": 0.003255777265493076, "phrase": "five_countries"}, {"score": 0.0030936482163040823, "phrase": "different_levels"}, {"score": 0.0027459678326877744, "phrase": "substantial_differences"}, {"score": 0.002565084553019013, "phrase": "specific_firms"}, {"score": 0.002428974327006118, "phrase": "simple_and_reliable_way"}, {"score": 0.0023960878466674795, "phrase": "company's_adaptation"}, {"score": 0.0023475891378276735, "phrase": "social_web"}, {"score": 0.0022766712610014484, "phrase": "policy_makers"}, {"score": 0.0022535101994966907, "phrase": "industry_or_government_level"}, {"score": 0.0021484955960643167, "phrase": "online_marketplace"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["E-business", " Maturity model design", " Social software", " E-visibility", " Interactivity", " Global market", " Sociability", " Internet security", " Internet presence"], "paper_abstract": "The Internet has transformed traditional patterns of firm-to-customer communication and opened new channels through which enterprises can engage with consumers around the world. Yet ways to measure firms' visibility in this electronic marketplace have failed to keep pace with these developments. We present a new model - the e-visibility maturity (e-VM) model - that can be used to assess the degree to which a firm or set of firms has the potential to engage customers in the global e-business market. The suggested model is developed based on a literature review, an international survey of online customers, and a comprehensive review of 1868 firm websites representing 27 industries in five countries. After presenting the model, we show how it can be scaled to different levels (e.g., the industry or country level) using three illustrative cases: a set of four countries across industries; a set of four industries across countries; and a set of four individual firms. We found substantial differences in levels of e-visibility and its specific dimensions of interactivity, firm globalization, sociability, and security between the countries and specific firms sampled. The industries sampled all emphasize firm globalization and interactivity. The model offers a simple and reliable way to evaluate a company's adaptation to the challenges of the social web, and can be used by strategists and policy makers at the industry or government level as well as to help firms establish strategies for improving their position in the online marketplace. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "E-visibility maturity model: A tool for assessment and comparison of individual firms and sets of firms in e-business", "paper_id": "WOS:000366161800008"}