{"auto_keywords": [{"score": 0.04621662015442936, "phrase": "internal_structure"}, {"score": 0.003577414339646767, "phrase": "business_-_labeled_it_governance_performance"}, {"score": 0.0031435968684569112, "phrase": "positive_correlation"}, {"score": 0.0027982016314450717, "phrase": "clearly_defined_organizational_structures"}, {"score": 0.002726740692380339, "phrase": "mature_quality_management"}, {"score": 0.0026060359255636444, "phrase": "strongest_positive_correlation"}, {"score": 0.0024906610581090223, "phrase": "project_management"}, {"score": 0.0024586427394152196, "phrase": "service_level_management"}, {"score": 0.0023497779149212737, "phrase": "capacity_management"}, {"score": 0.002304606411453748, "phrase": "almost_no_correlation"}, {"score": 0.002260301305523054, "phrase": "governance_performance"}, {"score": 0.002132420504803564, "phrase": "current_frameworks"}], "paper_keywords": ["alignment of IS organization", " business value of IT", " governance of the IS organization", " IS organization transformation", " strategic IS planning"], "paper_abstract": "There are several best practice based frameworks that detail effective arrangements for the internal structure of an IT organization. Although it is reasonable that there is a correlation between the quality of the internal structure of an IT organization - labeled IT governance maturity, and the external impact of the same IT organization on the business - labeled IT governance performance, this has not been validated. The results, based on 35 case studies, confirm the hypotheses of a positive correlation between IT governance maturity and IT governance performance. Among IT processes described in 34 references, the internal structure of the IT organization, clearly defined organizational structures and relationships, mature quality management, and cost allocation show the strongest positive correlation to IT governance performance. The maturity of project management and service level management, as well as performance and capacity management, show almost no correlation to IT governance performance. The findings can be used to improve current frameworks for IT governance.", "paper_title": "The Effect of IT Governance Maturity on IT Governance Performance", "paper_id": "WOS:000273610800003"}