{"auto_keywords": [{"score": 0.032447020673427356, "phrase": "ranked_list"}, {"score": 0.00481495049065317, "phrase": "evaluation_sensitivity"}, {"score": 0.004682708592184678, "phrase": "multiple_interpretations"}, {"score": 0.004347473906950474, "phrase": "web_search"}, {"score": 0.004054931951058077, "phrase": "diverse_ranked_lists"}, {"score": 0.003712362078915926, "phrase": "diversity_evaluation_measures"}, {"score": 0.0035110198699787013, "phrase": "ranked_lists"}, {"score": 0.0031113369425402287, "phrase": "ad-hoc_retrieval"}, {"score": 0.002942495422585405, "phrase": "multiple_subtopics"}, {"score": 0.0027698788736535865, "phrase": "relevant_documents"}, {"score": 0.002523828967909659, "phrase": "evaluation_measures"}, {"score": 0.0021746987512551693, "phrase": "substantial_improvements"}, {"score": 0.0021049977753042253, "phrase": "discriminative_power"}], "paper_keywords": ["Diversity", " Evaluation", " Diversity difficulty"], "paper_abstract": "Many queries have multiple interpretations; they are ambiguous or underspecified. This is especially true in the context of Web search. To account for this, much recent research has focused on creating systems that produce diverse ranked lists. In order to validate these systems, several new evaluation measures have been created to quantify diversity. Ideally, diversity evaluation measures would distinguish between systems by the amount of diversity in the ranked lists they produce. Unfortunately, diversity is also a function of the collection over which the system is run and a system's performance at ad-hoc retrieval. A ranked list built from a collection that does not cover multiple subtopics cannot be diversified; neither can a ranked list that contains no relevant documents. To ensure that we are assessing systems by their diversity, we develop (1) a family of evaluation measures that take into account the diversity of the collection and (2) a meta-evaluation measure that explicitly controls for performance. We demonstrate experimentally that our new measures can achieve substantial improvements in sensitivity to diversity without reducing discriminative power.", "paper_title": "Increasing evaluation sensitivity to diversity", "paper_id": "WOS:000322187800006"}