{"auto_keywords": [{"score": 0.04875986484857526, "phrase": "activity_profile"}, {"score": 0.032046968361965765, "phrase": "conventional_gtm"}, {"score": 0.00481495049065317, "phrase": "bridging_descriptor"}, {"score": 0.004517055580214742, "phrase": "specific_activity_profile"}, {"score": 0.004322967486451877, "phrase": "bridging_activity"}, {"score": 0.004288581530198804, "phrase": "molecular_descriptor_spaces"}, {"score": 0.004137184278868391, "phrase": "\"stargate\"_version"}, {"score": 0.004087910779160781, "phrase": "generative_topographic_mapping_approach"}, {"score": 0.003669941438286456, "phrase": "s-gtm_algorithm"}, {"score": 0.0034152340901585374, "phrase": "weighted_geometric_mean"}, {"score": 0.0033880439015902476, "phrase": "probability_distributions"}, {"score": 0.0031528393611136704, "phrase": "training_procedure"}, {"score": 0.002957471572421436, "phrase": "molecular_descriptors"}, {"score": 0.0028302049070944944, "phrase": "whole_activity_profile"}, {"score": 0.0026654155072292707, "phrase": "relevant_chemical_structures"}, {"score": 0.002560907803820395, "phrase": "s-gtm_prediction_models"}, {"score": 0.002244178699939059, "phrase": "individual_activities"}, {"score": 0.0021909411820497707, "phrase": "lasso_multitask_learning_algorithm"}], "paper_keywords": [""], "paper_abstract": "Predicting the activity profile of a molecule or discovering structures possessing a specific activity profile are two important goals in chemoinformatics, which could be achieved by bridging activity and molecular descriptor spaces. In this paper, we introduce the \"Stargate\" version of the Generative Topographic Mapping approach (S-GTM) in which two different multidimensional spaces (e.g., structural descriptor space and activity space) are linked through a common 2D latent space. In the S-GTM algorithm, the manifolds are trained simultaneously in two initial spaces using the probabilities in the 2D latent space calculated as a weighted geometric mean of probability distributions in both spaces. S-GTM has the following interesting features: (1) activities are involved during the training procedure; therefore, the method is supervised, unlike conventional GTM; (2) using molecular descriptors of a given compound as input, the model predicts a whole activity profile, and (3) using an activity profile as input, areas populated by relevant chemical structures can be detected. To assess the performance of S-GTM prediction models, a descriptor space (ISIDA descriptors) of a set of 1325 GPCR ligands was related to a B-dimensional (B = 1 or 8) activity space corresponding to pK(i) values for eight different targets. S-GTM outperforms conventional GTM for individual activities and performs similarly to the Lasso multitask learning algorithm, although it is still slightly less accurate than the Random Forest method.", "paper_title": "Stargate GTM: Bridging Descriptor and Activity Spaces", "paper_id": "WOS:000365465400010"}