{"auto_keywords": [{"score": 0.03337540840020653, "phrase": "hapmap"}, {"score": 0.029420316637553234, "phrase": "hapmap_snps"}, {"score": 0.00481495049065317, "phrase": "cataloged_variation"}, {"score": 0.0047761092701293474, "phrase": "international_hapmap_consortium"}, {"score": 0.0046993598473345395, "phrase": "background_since"}, {"score": 0.0046238380150870435, "phrase": "human_genome"}, {"score": 0.00445830200258645, "phrase": "risk_variant_associations"}, {"score": 0.0043161190928529755, "phrase": "complex_diseases"}, {"score": 0.004161553532799662, "phrase": "common_variation"}, {"score": 0.004028796143006953, "phrase": "minor_allele_frequency"}, {"score": 0.003996275955058198, "phrase": "maf"}, {"score": 0.003791141540467091, "phrase": "genotyping_technology"}, {"score": 0.00374531366198605, "phrase": "genome-wide_association_studies"}, {"score": 0.003685067218455088, "phrase": "common_variants"}, {"score": 0.003524322230452833, "phrase": "genomes_project"}, {"score": 0.00342568771304873, "phrase": "rare_variants"}, {"score": 0.003070340620983981, "phrase": "single_nucleotide_polymorphisms"}, {"score": 0.0029126002350975634, "phrase": "pilot_data"}, {"score": 0.002865710140187219, "phrase": "results_comparison"}, {"score": 0.0026638482306228575, "phrase": "hapmap_variants"}, {"score": 0.0022190974300886467, "phrase": "snp_queries"}, {"score": 0.0022011501095573747, "phrase": "rare_variant_validation"}, {"score": 0.0021221627745801478, "phrase": "useful_resources"}, {"score": 0.0021049977753042253, "phrase": "human_genetics"}], "paper_keywords": [""], "paper_abstract": "Background Since publication of the human genome in 2003, geneticists have been interested in risk variant associations to resolve the etiology of traits and complex diseases. The International HapMap Consortium undertook an effort to catalog all common variation across the genome (variants with a minor allele frequency (MAF) of at least 5% in one or more ethnic groups). HapMap along with advances in genotyping technology led to genome-wide association studies which have identified common variants associated with many traits and diseases. In 2008 the 1000 Genomes Project aimed to sequence 2500 individuals and identify rare variants and 99% of variants with a MAF of <1%. Methods To determine whether the 1000 Genomes Project includes all the variants in HapMap, we examined the overlap between single nucleotide polymorphisms (SNPs) genotyped in the two resources using merged phase II/III HapMap data and low coverage pilot data from 1000 Genomes. Results Comparison of the two data sets showed that approximately 72% of HapMap SNPs were also found in 1000 Genomes Project pilot data. After filtering out HapMap variants with a MAF of <5% (separately for each population), 99% of HapMap SNPs were found in 1000 Genomes data. Conclusions Not all variants cataloged in HapMap are also cataloged in 1000 Genomes. This could affect decisions about which resource to use for SNP queries, rare variant validation, or imputation. Both the HapMap and 1000 Genomes Project databases are useful resources for human genetics, but it is important to understand the assumptions made and filtering strategies employed by these projects.", "paper_title": "A comparison of cataloged variation between International HapMap Consortium and 1000 Genomes Project data", "paper_id": "WOS:000300768100024"}