{"auto_keywords": [{"score": 0.04972074726974986, "phrase": "evaluation_techniques"}, {"score": 0.015720180617951798, "phrase": "xml"}, {"score": 0.004383406949799696, "phrase": "different_types"}, {"score": 0.004143196873246147, "phrase": "data_streaming_applications"}, {"score": 0.004096751549280256, "phrase": "increased_attention"}, {"score": 0.0038721890530859578, "phrase": "xml_streams"}, {"score": 0.0038144050983900286, "phrase": "central_issue"}, {"score": 0.0034984413289675838, "phrase": "xpath"}, {"score": 0.003446208270665051, "phrase": "xquery_queries"}, {"score": 0.003382017342396959, "phrase": "xpath_streaming_evaluation_approaches"}, {"score": 0.0033315236647127734, "phrase": "main_data_structure"}, {"score": 0.002953711377604328, "phrase": "major_techniques"}, {"score": 0.0028553693643045795, "phrase": "multiple_query"}, {"score": 0.0027916287357898544, "phrase": "xquery_streaming_evaluation_problem"}, {"score": 0.002688532127821979, "phrase": "existing_xquery_stream_query_engines"}, {"score": 0.0023834640793589435, "phrase": "optimization_techniques"}, {"score": 0.0023566987138026285, "phrase": "streaming_evaluation"}, {"score": 0.002286781334850213, "phrase": "xquery_streaming_evaluation"}, {"score": 0.0022610992177831643, "phrase": "buffer_optimization_problem"}, {"score": 0.0021775526153883355, "phrase": "research_issues"}, {"score": 0.0021530945641993152, "phrase": "proposed_algorithms"}], "paper_keywords": ["XML streaming evaluation", " XPath", " XQuery", " XML query optimization"], "paper_abstract": "XML is currently the most popular format for exchanging and representing data on the web. It is used in various applications and for different types of data including structured, semistructured, and unstructured heterogeneous data types. During the period, XML was establishing itself, data streaming applications have gained increased attention and importance. Because of these developments, the querying and efficient processing of XML streams has became a central issue. In this study, we survey the state of the art in XML streaming evaluation techniques. We focus on both the streaming evaluation of XPath expressions and of XQuery queries. We classify the XPath streaming evaluation approaches according to the main data structure used for the evaluation into three categories: automaton-based approach, array-based approach, and stack-based approach. We review, analyze, and compare the major techniques proposed for each approach. We also review multiple query streaming evaluation techniques. For the XQuery streaming evaluation problem, we identify and discuss four processing paradigms adopted by the existing XQuery stream query engines: the transducer-based paradigm, the algebra-based paradigm, the automata-algebra paradigm, and the pull-based paradigm. In addition, we review optimization techniques for XQuery streaming evaluation. We address the problem of optimizing XQuery streaming evaluation as a buffer optimization problem. For all techniques discussed, we describe the research issues and the proposed algorithms and we compare them with other relevant suggested techniques.", "paper_title": "A survey on XML streaming evaluation techniques", "paper_id": "WOS:000316500800003"}