{"auto_keywords": [{"score": 0.04904273003005848, "phrase": "graduate_studies"}, {"score": 0.00481495049065317, "phrase": "electronic_thesis"}, {"score": 0.004762550320451225, "phrase": "dissertation_repositories"}, {"score": 0.003997343989408636, "phrase": "scientific_information"}, {"score": 0.0035049738376240567, "phrase": "electronic_theses"}, {"score": 0.0034290036727926783, "phrase": "etd"}, {"score": 0.0033546701239540555, "phrase": "substantial_investment"}, {"score": 0.0031240075437664314, "phrase": "information_sources"}, {"score": 0.002877438939246423, "phrase": "'golden_years"}, {"score": 0.0026213749921120623, "phrase": "positive_impact"}, {"score": 0.00221153232497724, "phrase": "monograph_style_theses"}, {"score": 0.0021049977753042253, "phrase": "peer-reviewed_papers"}], "paper_keywords": [""], "paper_abstract": "Although the writing of a thesis is a very important step for scientists undertaking a career in research, little information exists on the impact of theses as a source of scientific information. Knowing the impact of theses is relevant not only for students undertaking graduate studies, but also for the building of repositories of electronic theses and dissertations (ETD) and the substantial investment this involves. This paper shows that the impact of theses as information sources has been generally declining over the last century, apart from during the period of the 'golden years' of research, 1945 to 1975. There is no evidence of ETDs having a positive impact; on the contrary, since their introduction the impact of theses has actually declined more rapidly. This raises questions about the justification for ETDs and the appropriateness of writing monograph style theses as opposed to publication of a series of peer-reviewed papers as the requirement for fulfilment of graduate studies.", "paper_title": "The declining scientific impact of theses: Implications for electronic thesis and dissertation repositories and graduate studies", "paper_id": "WOS:000251830300008"}