{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "indirect_encoding"}, {"score": 0.012364310824372168, "phrase": "hyperneat"}, {"score": 0.00842664442383238, "phrase": "indirect_encodings"}, {"score": 0.007680308188767049, "phrase": "problem_regularity"}, {"score": 0.004658426838467567, "phrase": "evolutionary_algorithm"}, {"score": 0.004556901872357751, "phrase": "phenotypic_regularity"}, {"score": 0.0045194004619162325, "phrase": "important_design_principle"}, {"score": 0.004482206282876944, "phrase": "natural_organisms"}, {"score": 0.004457579615095599, "phrase": "engineered_designs"}, {"score": 0.004396600680348434, "phrase": "first_comprehensive_study"}, {"score": 0.004172360444377281, "phrase": "regular_solutions"}, {"score": 0.004058951880810154, "phrase": "important_prerequisite"}, {"score": 0.0040366412779632085, "phrase": "evolutionary_algorithms"}, {"score": 0.0039813976794342, "phrase": "high-dimensional_real-world_problems"}, {"score": 0.00379914165379475, "phrase": "case_study"}, {"score": 0.00373682045166829, "phrase": "artificial_neural_networks"}, {"score": 0.0036251983768532925, "phrase": "biological_development"}, {"score": 0.0034879261743468574, "phrase": "regular_behaviors"}, {"score": 0.003468743363226176, "phrase": "regular_anns"}, {"score": 0.0033837135367113004, "phrase": "direct_encodings"}, {"score": 0.0033651019362620866, "phrase": "regularity_increases"}, {"score": 0.00319330258693017, "phrase": "domain_knowledge"}, {"score": 0.00282048824450047, "phrase": "new_algorithm"}, {"score": 0.00278184186397901, "phrase": "indirect_and_direct_encodings"}, {"score": 0.0027513053204190497, "phrase": "hyperneat's_performance"}, {"score": 0.0027361626349903744, "phrase": "regular_problems"}, {"score": 0.0026616868981501006, "phrase": "hybrid's_ability"}, {"score": 0.0023900527169254744, "phrase": "refining_process"}, {"score": 0.002286781334850213, "phrase": "prior_studies"}, {"score": 0.0021049977753042253, "phrase": "separate_process"}], "paper_keywords": ["Artificial neural networks", " developmental encodings", " generative encodings", " HyperNEAT", " indirect encodings", " regularity"], "paper_abstract": "This paper investigates how an evolutionary algorithm with an indirect encoding exploits the property of phenotypic regularity, an important design principle found in natural organisms and engineered designs. We present the first comprehensive study showing that such phenotypic regularity enables an indirect encoding to outperform direct encoding controls as problem regularity increases. Such an ability to produce regular solutions that can exploit the regularity of problems is an important prerequisite if evolutionary algorithms are to scale to high-dimensional real-world problems, which typically contain many regularities, both known and unrecognized. The indirect encoding in this case study is HyperNEAT, which evolves artificial neural networks (ANNs) in a manner inspired by concepts from biological development. We demonstrate that, in contrast to two direct encoding controls, HyperNEAT produces both regular behaviors and regular ANNs, which enables HyperNEAT to significantly outperform the direct encodings as regularity increases in three problem domains. We also show that the types of regularities HyperNEAT produces can be biased, allowing domain knowledge and preferences to be injected into the search. Finally, we examine the downside of a bias toward regularity. Even when a solution is mainly regular, some irregularity may be needed to perfect its functionality. This insight is illustrated by a new algorithm called HybrID that hybridizes indirect and direct encodings, which matched HyperNEAT's performance on regular problems yet outperformed it on problems with some irregularity. HybrID's ability to improve upon the performance of HyperNEAT raises the question of whether indirect encodings may ultimately excel not as stand-alone algorithms, but by being hybridized with a further process of refinement, wherein the indirect encoding produces patterns that exploit problem regularity and the refining process modifies that pattern to capture irregularities. This paper thus paints a more complete picture of indirect encodings than prior studies because it analyzes the impact of the continuum between irregularity and regularity on the performance of such encodings, and ultimately suggests a path forward that combines indirect encodings with a separate process of refinement.", "paper_title": "On the Performance of Indirect Encoding Across the Continuum of Regularity", "paper_id": "WOS:000292110600004"}