{"auto_keywords": [{"score": 0.04391077929360234, "phrase": "strategic_remedies"}, {"score": 0.015553237878350447, "phrase": "crm_performance"}, {"score": 0.014785987610322253, "phrase": "crm"}, {"score": 0.00481495049065317, "phrase": "fuzzy_balanced_scorecard"}, {"score": 0.004550364809125859, "phrase": "customer_relationship_management"}, {"score": 0.004465426224845726, "phrase": "balanced_scorecard"}, {"score": 0.004323473551145489, "phrase": "present_conditions"}, {"score": 0.004300255514135844, "phrase": "crm_implementation"}, {"score": 0.004265661035060299, "phrase": "specific_organization"}, {"score": 0.004063837272072844, "phrase": "best_solution"}, {"score": 0.003728240083633891, "phrase": "beverage_industry"}, {"score": 0.003708219637928064, "phrase": "iran"}, {"score": 0.0036096370549115885, "phrase": "non-probability_sampling_method"}, {"score": 0.003504223380320875, "phrase": "fuzzy_approach"}, {"score": 0.0032146906964771213, "phrase": "selective_tools"}, {"score": 0.0030459724743267186, "phrase": "ideal_solution"}, {"score": 0.002997100092045566, "phrase": "evaluation_process"}, {"score": 0.0029809836568688037, "phrase": "six_significant_gaps"}, {"score": 0.0027198559127718943, "phrase": "customer_feedbacks"}, {"score": 0.002697940903304148, "phrase": "managerial_knowledge"}, {"score": 0.0026834288199353066, "phrase": "employee_belongingness"}, {"score": 0.002654637790308288, "phrase": "main_objectives"}, {"score": 0.0025562739675224822, "phrase": "better_understanding"}, {"score": 0.0024615458805542713, "phrase": "customer-related_performance_gaps"}, {"score": 0.002396034649574465, "phrase": "strategic_solutions"}, {"score": 0.002376722584437227, "phrase": "detected_areas"}, {"score": 0.0022157248843582417, "phrase": "crm-bsc_framework"}, {"score": 0.0021860348299797107, "phrase": "iranian_industrial_environment"}, {"score": 0.0021049977753042253, "phrase": "first_time"}], "paper_keywords": ["Customer relationship management", " Fuzzy balanced scorecard", " Performance measurement", " Iran"], "paper_abstract": "Purpose - This paper aims to provide a framework for evaluating the impact of implementing customer relationship management (CRM) based on the balanced scorecard (BSC). The outcomes illustrate the gaps between the present conditions of CRM implementation in a specific organization, which leads to some strategic remedies. These remedies are going to be ranked to achieve the best solution for enhancing the quality of CRM in the organization. Design/methodology/approach - This study investigates the weights of measures presented in the CRM-BSC by distributing the questionnaires among 44 experts in the beverage industry of Iran. It also benefits from judgment-purposive in non-probability sampling method for collecting data. The results are analyzed through a fuzzy approach. The strategic remedies for the drawbacks of the organization that were obtained from the CRM-BSC are also proposed by the experts. These remedies are again evaluated by questionnaires and some selective tools of multi-criteria decision-making approach namely: simple additive weighting and technique for ordering preference by similarity to ideal solution. Findings - Through the evaluation process, six significant gaps related to the CRM performance of the organization are agreed upon. For each of these gaps, the strategic remedies are proposed by the experts. The outcomes of ranking these remedies imply that customer feedbacks, updating managerial knowledge and employee belongingness should be the main objectives of the manufacturer for improvement. Practical implications - This study provides a better understanding of a more effective CRM system for different kinds of organizations by first, clarifying the customer-related performance gaps of the target organization and second, by presenting strategic solutions for the detected areas. The framework could be also beneficial in other fields of industry, but the relevancy of the measures should be considered. Originality/value - The CRM-BSC framework is customized to the Iranian industrial environment. The structure of the measures in the scorecard is proposed for the first time.", "paper_title": "Applying fuzzy balanced scorecard for evaluating the CRM performance", "paper_id": "WOS:000295553200007"}