{"auto_keywords": [{"score": 0.029955288649822137, "phrase": "item_pricing_problem"}, {"score": 0.00481495049065317, "phrase": "item_pricing_problems"}, {"score": 0.0038998328617557013, "phrase": "set_v"}, {"score": 0.003814212645832246, "phrase": "set_e"}, {"score": 0.0028496788280048045, "phrase": "maximization_problem"}, {"score": 0.002779318608820933, "phrase": "previous_works"}, {"score": 0.0026000528324590074, "phrase": "balcan"}, {"score": 0.0025288055004452415, "phrase": "wine"}, {"score": 0.0021049977753042253, "phrase": "good_approximation_ratio"}], "paper_keywords": ["item pricing problem", " approximation preserving reductions", " price models", " selfloops"], "paper_abstract": "When a store sells items to customers, the store wishes to determine the prices of the items to maximize its profit. Intuitively, if the store sells the items with low (resp. high) prices, the customers buy more (resp. less) items, which provides less profit to the store. So it would be hard for the store to decide the prices of items. Assume that the store has a set V of n items and there is a set E of in customers who wish to buy those items, and also assume that each item i is an element of V has the production cost d(i) and each customer e(j) is an element of E has the valuation v(j) on the bundle e(j) subset of V of items. When the store sells an item i is an element of V at the price r(i), the profit for the item i is p(i) = r(i) - d(i). The goal of the store is to decide the price of each item to maximize its total profit. We refer to this maximization problem as the item pricing problem. In most of the previous works, the item pricing problem was considered under the assumption that pi : 0 for each i is an element of V, however, Balcan, et al. [In Proc. of WINE, LNCS 4858, 2007] introduced the notion of \"loss-leader,\" and showed that the seller can get more total profit in the case that p(i) < 0 is allowed than in the case that p(i) < 0 is not allowed. In this paper, we derive approximation preserving reductions among several item pricing problems and show that all of them have algorithms with good approximation ratio.", "paper_title": "Approximation Preserving Reductions among Item Pricing Problems", "paper_id": "WOS:000265700800007"}