{"auto_keywords": [{"score": 0.0045709675813472884, "phrase": "transposable_elements"}, {"score": 0.004339293854115301, "phrase": "numerous_factors"}, {"score": 0.0036694287631595995, "phrase": "population_structuring"}, {"score": 0.003523822585025555, "phrase": "transposable_element_simulator_dynamics"}, {"score": 0.0034233569308012982, "phrase": "simulation_environment"}, {"score": 0.0032496585171039797, "phrase": "simple_tool"}, {"score": 0.002861160152640875, "phrase": "excision_rates"}, {"score": 0.0028119023819663472, "phrase": "recombination_rate"}, {"score": 0.00270023138867066, "phrase": "te_insertions"}, {"score": 0.0025336179740814905, "phrase": "population_size"}, {"score": 0.002349884235026956, "phrase": "dynamic_fate"}, {"score": 0.0022960713730673494, "phrase": "structured_populations"}, {"score": 0.0021049977753042253, "phrase": "population_genetics"}], "paper_keywords": [""], "paper_abstract": "Various mathematical models have been used to explore the dynamics of transposable elements (TEs) within their host genomes. However, numerous factors can influence their dynamics, and we know only little about the dynamics of TEs when they first began to invade populations. In addition, the influence of population structuring has only recently been investigated. Transposable Element Simulator Dynamics, a population genomics simulation environment, has therefore been developed to provide a simple tool for analyzing the dynamics of TEs in a community based on (i) various TE parameters, such as the transposition and excision rates, the recombination rate and the coefficient of selection against TE insertions; and (ii) population parameters, such as population size and migration rates. The simulations can be used to illustrate the dynamic fate of TEs in structured populations, can be extended by using more specific molecular or demographic models, and can be useful for teaching population genetics and genomics.", "paper_title": "TESD: a transposable element dynamics simulation environment", "paper_id": "WOS:000241629600022"}