{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "end-to-end_network_traffic"}, {"score": 0.011569079264481573, "phrase": "power_laws"}, {"score": 0.010932385196728272, "phrase": "partial_origin-destination_flows"}, {"score": 0.008679068819378062, "phrase": "reconstruction_model"}, {"score": 0.004737201825299411, "phrase": "accurately_end-to-end_network_traffic"}, {"score": 0.004566805735863274, "phrase": "network_operators"}, {"score": 0.004384623928442369, "phrase": "network_traffic_engineering"}, {"score": 0.004278807087784626, "phrase": "current_network"}, {"score": 0.003944112858235306, "phrase": "origin-destination_flows"}, {"score": 0.003378385493203297, "phrase": "novel_approach"}, {"score": 0.0031780228058373235, "phrase": "known_traffic_information"}, {"score": 0.003076052206618737, "phrase": "compressive_sensing_method"}, {"score": 0.0028935680100446583, "phrase": "compressive_sensing"}, {"score": 0.002777949746964955, "phrase": "measurement_matrix"}, {"score": 0.002613103872300205, "phrase": "known_information"}, {"score": 0.002560352786969071, "phrase": "reconstruction_algorithms"}, {"score": 0.0024480094603893175, "phrase": "observed_results"}, {"score": 0.002359759876402679, "phrase": "numerical_simulation_results"}, {"score": 0.002283984048569816, "phrase": "real_backbone_network_traffic_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Power laws", " Compressive sensing", " Origin-destination flows", " Traffic reconstruction"], "paper_abstract": "To obtain accurately end-to-end network traffic is a significantly difficult and challenging problem for network operators, although it is one of the most important input parameters for network traffic engineering. With the development of current network, the characteristics of networks have changed a lot. In this paper, we exploit the characteristics of origin-destination flows and thus grasp the properties of end-to-end network traffic. An important and amazing find of our work is that the sizes of origin-destination flows obey the power laws. Taking advantage of this characteristic, we propose a novel approach to select partial origin-destination flows which are to be measured directly. In terms of the known traffic information, we reconstruct all origin-destination flows via compressive sensing method. In detail, here, we combine the power laws and the constraints of compressive sensing (namely restricted isometry property) together to build measurement matrix and pick up the partial origin-destination flows. Furthermore, we build a reconstruction model from the known information corresponding to compressive sensing reconstruction algorithms. Finally, we reconstruct all origin-destination flows from the observed results by solving the reconstruction model. And we provide numerical simulation results to validate the performance of our method using real backbone network traffic data. It illustrates that our method can recover the end-to-end network traffic more accurately than previous methods. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A power laws-based reconstruction approach to end-to-end network traffic", "paper_id": "WOS:000316091900029"}