{"auto_keywords": [{"score": 0.04955111375780366, "phrase": "fat_trees"}, {"score": 0.00481495049065317, "phrase": "dynamic_fault_tolerance"}, {"score": 0.004580550308652044, "phrase": "current_large-scale_parallel_computers"}, {"score": 0.004381749459671914, "phrase": "systems_increases"}, {"score": 0.004145287175409325, "phrase": "routing_method"}, {"score": 0.0038354405231002323, "phrase": "source_routing"}, {"score": 0.0035486713647627246, "phrase": "original_routing_strategy"}, {"score": 0.003490056936165004, "phrase": "faulty_components"}, {"score": 0.0030208364972341096, "phrase": "small_extra_functionality"}, {"score": 0.002418829014435841, "phrase": "graceful_degradation"}, {"score": 0.002140400526572388, "phrase": "significantly_more_faults"}], "paper_keywords": ["Fat trees", " k-ary n-trees", " dynamic fault tolerance", " deterministic routing", " adaptive routing"], "paper_abstract": "Fat trees are a very common communication architecture in current large-scale parallel computers. The probability of failure in these systems increases with the number of components. We present a routing method for deterministically and adaptively routed fat trees, applicable to both distributed and source routing, that is able to handle several concurrent faults and that transparently returns to the original routing strategy once the faulty components have recovered. The method is local and dynamic, completely masking the fault from the rest of the system. It only requires a small extra functionality in the switches to handle rerouting packets around a fault. The method guarantees connectedness and deadlock and livelock freedom for up to k - 1 benign simultaneous switch and/or link faults where k is half the number of ports in the switches. Our simulation experiments show a graceful degradation of performance as more faults occur. Furthermore, we demonstrate that for most fault combinations, our method will even be able to handle significantly more faults beyond the k - 1 limit with high probability.", "paper_title": "Dynamic Fault Tolerance in Fat Trees", "paper_id": "WOS:000287668100007"}