{"auto_keywords": [{"score": 0.011466089933261833, "phrase": "subexponential_conversion"}, {"score": 0.00481495049065317, "phrase": "state-size_cost"}, {"score": 0.004746558955503364, "phrase": "two-way_nondeterministic_automata"}, {"score": 0.004662427600500598, "phrase": "two-way_deterministic_automata"}, {"score": 0.0041136473765874815, "phrase": "restricted_input_head_movement"}, {"score": 0.003912595576016982, "phrase": "exponential_gaps"}, {"score": 0.0038708031633013086, "phrase": "weaker_model"}, {"score": 0.003464150192089816, "phrase": "stronger_model"}, {"score": 0.0032712190037495975, "phrase": "two-way_automata"}, {"score": 0.00323625520042892, "phrase": "nondeterministic_choices"}, {"score": 0.003190215563286321, "phrase": "input_head"}, {"score": 0.0031335830806256777, "phrase": "input_tape_endmarkers"}, {"score": 0.003023307182674672, "phrase": "input_head_movement"}, {"score": 0.0029590077170443666, "phrase": "exponential_gap"}, {"score": 0.0028041618337853, "phrase": "proposed_new_model"}, {"score": 0.002695768552609587, "phrase": "original_language"}, {"score": 0.0023356716952515413, "phrase": "nl."}, {"score": 0.002285961573963468, "phrase": "alternating_version"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Two-way automata", " Descriptional complexity", " Regular languages"], "paper_abstract": "The question of the state-size cost for simulation of two-way nondeterministic automata (2NFAS) by two-way deterministic automata (2DFAS) was raised in 1978 and, despite many attempts, it is still open. Subsequently, the problem was attacked by restricting the power of 2DFAS (e.g., using a restricted input head movement) to the degree for which it was already possible to derive some exponential gaps between the weaker model and the standard 2NFAS. Here we use an opposite approach, increasing the power of 2DFAS to the degree for which it is still possible to obtain a subexponential conversion from the stronger model to the standard 2DFAS. In particular, it turns out that subexponential conversion is possible for two-way automata that make nondeterministic choices only when the input head scans one of the input tape endmarkers. However, there is no restriction on the input head movement. This implies that an exponential gap between 2NFAS and 2DFAS can be obtained only for unrestricted 2NFAS using capabilities beyond the proposed new model. As an additional bonus, conversion into a machine for the complement of the original language is polynomial in this model. The same holds for making such machines self-verifying, halting, or unambiguous. Finally, any superpolynomial lower bound for the simulation of such machines by standard 2DFAS would imply L not equal NL. In the same way, the alternating version of these machines is related to L (sic) NL (sic) P, the classical computational complexity problems. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Two-way automata making choices only at the endmarkers", "paper_id": "WOS:000345658400007"}