{"auto_keywords": [{"score": 0.04920822493417558, "phrase": "fuzzy_number_intuitionistic_fuzzy_information"}, {"score": 0.00481495049065317, "phrase": "hamacher_operation"}, {"score": 0.004352411290383643, "phrase": "multiple_attribute_decision"}, {"score": 0.004007083686875716, "phrase": "fuzzy_number_intuitionistic_fuzzy_sets"}, {"score": 0.0038271712887391015, "phrase": "new_hamacher_aggregation_operators"}, {"score": 0.0035887342563437935, "phrase": "fuzzy_number_intuitionistic"}, {"score": 0.0031553611552558986, "phrase": "hamacher"}, {"score": 0.00241658945942583, "phrase": "fuzzy_number_intuitionistic_fuzzy_environments"}, {"score": 0.0023079225317714815, "phrase": "illustrative_example"}, {"score": 0.002224510044064184, "phrase": "complex_information_systems_security_risk"}, {"score": 0.0021049977753042253, "phrase": "developed_approach"}], "paper_keywords": ["Multiple attribute decision making (MADM)", " fuzzy number intuitionistic fuzzy sets", " Hamacher aggregation operators", " fuzzy number intuitionistic fuzzy Hamacher hybrid average (FNIFHHA) operator"], "paper_abstract": "The study investigates the multiple attribute decision making (MADM) problems with fuzzy number intuitionistic fuzzy information. Based on the fuzzy number intuitionistic fuzzy sets, we develop some new Hamacher aggregation operators with fuzzy number intuitionistic fuzzy information, such as the fuzzy number intuitionistic fuzzy Hamacher weighted average (FNIFHWA) operator, fuzzy number intuitionistic fuzzy Hamacher ordered weighted average (FNIFHOWA) operator and fuzzy number intuitionistic fuzzy Hamacher hybrid average (FNIFHHA) operator. Then, we suggest the fuzzy number intuitionistic fuzzy Hamacher hybrid average (FNIFHHA) operator to deal with multiple attribute decision making under the fuzzy number intuitionistic fuzzy environments. Finally, an illustrative example for evaluating the complex information systems security risk is given to verify the developed approach.", "paper_title": "Approach to multiple attribute decision making based on the Hamacher operation with fuzzy number intuitionistic fuzzy information and their application", "paper_id": "WOS:000341926700002"}