{"auto_keywords": [{"score": 0.0490692031182167, "phrase": "census_microdata"}, {"score": 0.00481495049065317, "phrase": "open_data_technologies"}, {"score": 0.004492573860101133, "phrase": "statistical_data"}, {"score": 0.004038076978795421, "phrase": "fine-grained_analysis"}, {"score": 0.00378767277402891, "phrase": "individual_records"}, {"score": 0.003687960013746783, "phrase": "detailed_anonymous_individual_information"}, {"score": 0.003571751184289622, "phrase": "different_censuses"}, {"score": 0.0035150223642728437, "phrase": "comparative_studies"}, {"score": 0.003459191419478298, "phrase": "difficult_tasks"}, {"score": 0.003159106878239524, "phrase": "novel_data_processing_techniques"}, {"score": 0.0024447258861321685, "phrase": "step-by-step_process"}, {"score": 0.0021852508421515092, "phrase": "spanish"}, {"score": 0.0021049977753042253, "phrase": "integrated_public_use_microdata_series"}], "paper_keywords": ["government information", " semantic web", " data formats"], "paper_abstract": "Censuses are one of the most relevant types of statistical data, allowing analyses of the population in terms of demography, economy, sociology, and culture. For fine-grained analysis, census agencies publish census microdata that consist of a sample of individual records of the census containing detailed anonymous individual information. Working with microdata from different censuses and doing comparative studies are currently difficult tasks due to the diversity of formats and granularities. In this article, we show that novel data processing techniques can be applied to make census microdata interoperable and easy to access and combine. In fact, we demonstrate how Linked Open Data principles, a set of techniques to publish and make connections of (semi-)structured data on the web, can be fruitfully applied to census microdata. We present a step-by-step process to achieve this goal and we study, in theory and practice, two real case studies: the 2001 Spanish census and a general framework for Integrated Public Use Microdata Series (IPUMS-I).", "paper_title": "Linked Open Data Technologies for Publication of Census Microdata", "paper_id": "WOS:000322870300005"}