{"auto_keywords": [{"score": 0.030070332590530862, "phrase": "manufacturing_bias"}, {"score": 0.028874053033981883, "phrase": "geometric_bias"}, {"score": 0.00481495049065317, "phrase": "frequency_distributions"}, {"score": 0.004708220751321872, "phrase": "pin-hole_assemblies"}, {"score": 0.0046632033374901715, "phrase": "new_mathematical_model"}, {"score": 0.0046038458731764926, "phrase": "geometric_variations"}, {"score": 0.004501774379030109, "phrase": "probabilistic_representations"}, {"score": 0.0043738432231020885, "phrase": "positional_variations"}, {"score": 0.003985738225654119, "phrase": "geometric_tolerances"}, {"score": 0.003922378980031565, "phrase": "new_model"}, {"score": 0.0032256239062596944, "phrase": "maximum_material_condition"}, {"score": 0.0030642636185693054, "phrase": "worst-case_basis"}, {"score": 0.003034916887102753, "phrase": "statistical_method"}, {"score": 0.0028923335491735564, "phrase": "frequency_distribution"}, {"score": 0.0028738341066290815, "phrase": "id_clearance"}, {"score": 0.0026438102161263567, "phrase": "multidimensional_t-maps"}, {"score": 0.002610090005760493, "phrase": "probabilistic_representation"}, {"score": 0.002340250894008014, "phrase": "greater_likelihood"}, {"score": 0.0023252743521788876, "phrase": "small_clearances"}, {"score": 0.002310393431454436, "phrase": "large_clearances"}, {"score": 0.0022882500116799777, "phrase": "assembled_pin"}, {"score": 0.0021876814398268775, "phrase": "optional_material_condition"}, {"score": 0.0021049977753042253, "phrase": "allowable_variations"}], "paper_keywords": [""], "paper_abstract": "A new mathematical model for representing the geometric variations of lines is extended to include probabilistic representations of one-dimensional (ID) clearance, which arise from positional variations of the axis of a hole, the size of the hole, and a pin-hole assembly. The model is compatible with the ASME/ANSI/ISO Standards for geometric tolerances. Central to the new model is a Tolerance-Map (T-Map) (Patent No. 69638242), a hypothetical volume of points that models the 3D variations in location and orientation for a segment of a line (the axis), which can arise from tolerances on size, position, orientation, and form. Here, it is extended to model the increases in yield that occur when maximum material condition (MMC) is specified and when tolerances are assigned statistically rather than on a worst-case basis; the statistical method includes the specification of both size and position tolerances on a feature. The frequency distribution of ID clearance is decomposed into manufacturing bias, i.e., toward certain regions of a Tolerance-Map, and into a geometric bias that can be computed from the geometry of multidimensional T-Maps. Although the probabilistic representation in this paper is built from geometric bias, and it is presumed that manufacturing bias is uniform, the method is robust enough to include manufacturing bias in the future. Geometric bias alone shows a greater likelihood of small clearances than large clearances between an assembled pin and hole. A comparison is made between the effects of choosing the optional material condition MMC and not choosing it with the tolerances that determine the allowable variations in position.", "paper_title": "Using tolerance-maps to generate frequency distributions of clearance and allocate tolerances for pin-hole assemblies", "paper_id": "WOS:000251787300007"}