{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "taiwanese_management_journals"}, {"score": 0.0044688905734813255, "phrase": "taiwan"}, {"score": 0.004367452559737983, "phrase": "nsc"}, {"score": 0.0040767015025213625, "phrase": "social_sciences"}, {"score": 0.00365531194930464, "phrase": "nsc."}, {"score": 0.0034118234596993836, "phrase": "objective_approach"}, {"score": 0.0028880836335117297, "phrase": "comprehensive_evaluation"}, {"score": 0.002574387911697005, "phrase": "compromise_sense"}, {"score": 0.0025014259919355453, "phrase": "composite_indices"}, {"score": 0.0024586427394152196, "phrase": "subjective_evaluation"}, {"score": 0.002416589459425828, "phrase": "general_image"}, {"score": 0.002294686545883412, "phrase": "objective_evaluation"}, {"score": 0.002268441347979241, "phrase": "blind_spots"}], "paper_keywords": [""], "paper_abstract": "To improve the quality of journals in Taiwan, the National Science Council (NSC) of the Republic of China evaluates journals in the fields of humanities and social sciences periodically. This paper describes the evaluation of 46 management journals conducted by the authors, as authorized by the NSC. Both a subjective approach, with judgments solicited from 345 experts, and an objective approach, with data collected on four indicators: journal cross citation, dissertation citation, authors' scholastic reputation, and author diversity, were used to make a comprehensive evaluation. Performance in the four indicators were aggregated using weights which were most favourable to all journals, in a compromise sense, to produce the composite indices. The subjective evaluation reflects the general image, or reputation, of journals while the objective evaluation discloses blind spots which have been overlooked by experts. The results show that using either approach alone would have produced results which are misleading, which suggests that both approaches should be used. All of the editors of the journals being evaluated agreed that the evaluation was appropriate and the results are reasonable.", "paper_title": "Ranking taiwanese management journals: A case study", "paper_id": "WOS:000256779500005"}