{"auto_keywords": [{"score": 0.03546730795101328, "phrase": "tpack-deep_scale"}, {"score": 0.011766385192183865, "phrase": "efa"}, {"score": 0.010195564932941582, "phrase": "cronbach's_alpha_coefficient"}, {"score": 0.004506265705673849, "phrase": "centered_component"}, {"score": 0.004471270242168067, "phrase": "tpack_framework"}, {"score": 0.004384960761826366, "phrase": "preservice_teachers'_tpack."}, {"score": 0.0043509032299218955, "phrase": "systematic_and_step-by-step_approach"}, {"score": 0.0038554737609608255, "phrase": "random_basis"}, {"score": 0.0036791522245326514, "phrase": "first_sample"}, {"score": 0.0036221822903900725, "phrase": "exploratory_factor_analysis"}, {"score": 0.0034971932704828197, "phrase": "confirmatory_factor_analysis"}, {"score": 0.0030745737579268876, "phrase": "whole_scale"}, {"score": 0.0028215303839066986, "phrase": "cfa"}, {"score": 0.0027347383772384102, "phrase": "validity_study"}, {"score": 0.002519402443228795, "phrase": "test-retest_reliability_coefficient"}, {"score": 0.002357535807803925, "phrase": "valid_and_reliable_instrument"}, {"score": 0.0023300677028248776, "phrase": "tpack."}, {"score": 0.0021803388613879896, "phrase": "future_studies"}, {"score": 0.002163367190715979, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Pedagogical issues"], "paper_abstract": "The purpose of this study is to develop a TPACK (technological pedagogical content knowledge) scale based on the centered component of TPACK framework in order to measure preservice teachers' TPACK. A systematic and step-by-step approach was followed for the development of the scale. The validity and reliability studies of the scale were carried out with 995 Turkish preservice teachers. The sample was split into two subsamples on random basis (n1 = 498, n2 = 497). The first sample was used for Exploratory Factor Analysis (EFA) and the second sample for Confirmatory Factor Analysis (CFA). After the EFA, the TPACK-deep scale included 33 items and had four factors. These factors were design, exertion, ethics and proficiency. The Cronbach's alpha coefficient for the whole scale was found to be .95, whereas the values of Cronbach's alpha coefficient for individual factors of the scale ranged between .85 and .92. The CFA was conducted within the scope of the validity study of the scale. In this way, this structure of the 4-factor scale was confirmed. In addition, the test-retest reliability coefficient of the scale was calculated as .80. The findings revealed that the TPACK-deep scale was a valid and reliable instrument for measuring TPACK. Consequently, various suggestions were put forward regarding the use the TPACK-deep scale for applied research and for future studies. Crown Copyright (C) 2011 Published by Elsevier Ltd. All rights reserved.", "paper_title": "The development, validity and reliability of TPACK-deep: A technological pedagogical content knowledge scale", "paper_id": "WOS:000299714400010"}