{"auto_keywords": [{"score": 0.04765668038582168, "phrase": "complex_clinical_environments"}, {"score": 0.04438922345410228, "phrase": "standard_protocol"}, {"score": 0.00481495049065317, "phrase": "complex_trauma_environment"}, {"score": 0.004639822587124109, "phrase": "consistent_and_safe_practices"}, {"score": 0.004356535752468849, "phrase": "non-standard_situations"}, {"score": 0.004060256280654948, "phrase": "harmful_outcomes"}, {"score": 0.0038263829059336564, "phrase": "dynamic_adjustments"}, {"score": 0.0036870776660851007, "phrase": "current_operational_conditions"}, {"score": 0.0036462799422150834, "phrase": "high_accuracy"}, {"score": 0.003474624627033273, "phrase": "underlying_cognitive_processes"}, {"score": 0.003074197032561992, "phrase": "trauma_setting"}, {"score": 0.0030514638431036714, "phrase": "field_observations"}, {"score": 0.0028121943702224326, "phrase": "customized_activity-error-innovation_ontology"}, {"score": 0.002719790133195399, "phrase": "team_members"}, {"score": 0.0025916375737852506, "phrase": "patient's_condition"}, {"score": 0.0025724636254035337, "phrase": "critical_care_environment_influence"}, {"score": 0.0024786956187352327, "phrase": "experts'_deviations"}, {"score": 0.002379484250348599, "phrase": "novices'_deviations"}, {"score": 0.002361876178411006, "phrase": "mostly_errors"}, {"score": 0.002301265368019983, "phrase": "novel_approach"}, {"score": 0.0021684903968454267, "phrase": "compliance_measurements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Errors", " Innovations", " Complexity"], "paper_abstract": "Protocol standardizations are important for consistent and safe practices. However, complex clinical environments are highly dynamic in nature and often require clinicians, confronted with non-standard situations, to adjust and deviate from standard protocol. Some of these deviations are errors which can result in harmful outcomes. On the other hand, some of the deviations can be innovations, which are dynamic adjustments to the protocols made by people to adapt the current operational conditions and achieve high accuracy and efficiency. However, there is very little known about the underlying cognitive processes that are related to errors and innovations. In this study we investigate the extent to which deviations are classified as errors or innovations, as a function of expertise in a Trauma setting. Field observations were conducted in a Level 1 Trauma unit. A total of 10 Trauma cases were observed and collected data was analyzed using measures that included customized activity-error-innovation ontology, time-stamps and expertise of the team members. The results show that expertise of the caregivers and criticality of a patient's condition in critical care environment influence the number and type of deviations from standard protocol. Experts' deviations were a combination of errors and innovations; whereas the novices' deviations were mostly errors. This research suggests that a novel approach must be taken into consideration for the design of protocols (including standards) and compliance measurements in complex clinical environments. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Deviations from protocol in a complex Trauma environment: Errors or innovations?", "paper_id": "WOS:000291768200007"}