{"auto_keywords": [{"score": 0.0495290999002817, "phrase": "software_testing"}, {"score": 0.016793671459514922, "phrase": "software_testing_processes"}, {"score": 0.016043818063394322, "phrase": "observed_software_failures"}, {"score": 0.010612387000973441, "phrase": "linear_dynamic_system"}, {"score": 0.007385775309525491, "phrase": "expected_number"}, {"score": 0.004650896226390719, "phrase": "software_reliability_improvement"}, {"score": 0.004143196873246147, "phrase": "mathematically_rigorous_manner"}, {"score": 0.004001938457469328, "phrase": "theoretical_study"}, {"score": 0.0038654774211631564, "phrase": "dynamic_behavior"}, {"score": 0.0034036089823450385, "phrase": "mathematical_formulae"}, {"score": 0.00265373679629359, "phrase": "simplifying_assumptions"}, {"score": 0.0022434880661725493, "phrase": "intrinsic_link"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["software testing", " software reliability", " linear dynamic system"], "paper_abstract": "Software testing is essential for software reliability improvement and assurance, and the processes of software testing are intrinsically dynamic. However they are seldom investigated in a mathematically rigorous manner. In this paper a theoretical study is presented to examine the dynamic behavior of software testing. More specifically, a set of simplifying assumptions is adopted to formulate and quantify the software testing processes. The mathematical formulae for the expected number of observed software failures are rigorously derived, the bounds and trends of the expected number of observed software failures are analyzed, and the variance of the number of observed software failures is examined. On the other hand, it is demonstrated that under the simplifying assumptions, the software testing processes can be treated as a linear dynamic system. This suggests that the software testing processes could be classified as linear or non-linear, and there be intrinsic link between software testing and system dynamics. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Software testing processes as a linear dynamic system", "paper_id": "WOS:000253660400009"}