{"auto_keywords": [{"score": 0.03498304983072447, "phrase": "bipartite_graphs"}, {"score": 0.02797091156983104, "phrase": "fully_polynomial_randomized_approximation_scheme"}, {"score": 0.00481495049065317, "phrase": "random_graphs"}, {"score": 0.004400153852462583, "phrase": "fundamental_problem"}, {"score": 0.004318881178805575, "phrase": "previous_results"}, {"score": 0.003971262520692664, "phrase": "first_general_subcase"}, {"score": 0.003934401172799425, "phrase": "subgraph_isomorphism_counting_problem"}, {"score": 0.0037668375812212654, "phrase": "new_graph_decomposition_technique"}, {"score": 0.00353972102514233, "phrase": "different_labels"}, {"score": 0.003431332820984854, "phrase": "higher_label"}, {"score": 0.0034100553723847037, "phrase": "identical_labels"}, {"score": 0.0031845067058084583, "phrase": "large_subgraphs"}, {"score": 0.003115908199991072, "phrase": "small_subgraphs"}, {"score": 0.0030298703815998173, "phrase": "simple_randomized_algorithm"}, {"score": 0.0030017207229983385, "phrase": "counting_problem"}, {"score": 0.0029645930408561086, "phrase": "decomposable_graphs_h"}, {"score": 0.0028737647829311587, "phrase": "unbiased_estimator"}, {"score": 0.0028206052780047424, "phrase": "graphs_h"}, {"score": 0.002585206414738808, "phrase": "graph_classes"}, {"score": 0.002325554982412043, "phrase": "bounded-degree_graphs"}, {"score": 0.0022825131641434964, "phrase": "outerplanar_graphs"}, {"score": 0.0022125358787611457, "phrase": "large_girth"}, {"score": 0.00219196314559129, "phrase": "unbounded-width_grid_graphs"}], "paper_keywords": [""], "paper_abstract": "Let H be a graph, and let CH(G) be the number of (subgraph isomorphic) copies of H contained in a graph G. We investigate the fundamental problem of estimating CH(G). Previous results cover only a few specific instances of this general problem, for example the case when H has degree at most one (the monomer-dimer problem). In this paper we present the first general subcase of the subgraph isomorphism counting problem, which is almost always efficiently approximable. The results rely on a new graph decomposition technique. Informally, the decomposition is a labelling of the vertices such that every edge is between vertices with different labels, and for every vertex all neighbours with a higher label have identical labels. The labelling implicitly generates a sequence of bipartite graphs, which permits us to break the problem of counting embeddings of large subgraphs into that of counting embeddings of small subgraphs. Using this method, we present a simple randomized algorithm for the counting problem. For all decomposable graphs H and all graphs G, the algorithm is an unbiased estimator. Furthermore, for all graphs H having a decomposition where each of the bipartite graphs generated is small and almost all graphs G, the algorithm is a fully polynomial randomized approximation scheme. We show that the graph classes of H for which we obtain a fully polynomial randomized approximation scheme for almost all G includes graphs of degree at most two, bounded-degree forests, bounded-width grid graphs, subdivision of bounded-degree graphs, and major subclasses of outerplanar graphs, series-parallel graphs and planar graphs of large girth, whereas unbounded-width grid graphs are excluded. Moreover, our general technique can easily be applied to proving many more similar results.", "paper_title": "Approximately Counting Embeddings into Random Graphs", "paper_id": "WOS:000343755200005"}