{"auto_keywords": [{"score": 0.049440303515783074, "phrase": "collaboration_engineering"}, {"score": 0.010612387000973441, "phrase": "thinklet_concept"}, {"score": 0.006381243708117719, "phrase": "predictable_pattern"}, {"score": 0.004593787100061613, "phrase": "collaborative_teams"}, {"score": 0.004125513927068713, "phrase": "new_research_field"}, {"score": 0.003704797078215222, "phrase": "high-value_recurring_collaborative_tasks"}, {"score": 0.003282383509542342, "phrase": "professional_facilitators"}, {"score": 0.0031738126998349775, "phrase": "key_concepts"}, {"score": 0.0024742098091226203, "phrase": "snap-together_building_blocks"}, {"score": 0.002206606452557159, "phrase": "conceptual_object_model"}], "paper_keywords": ["collaboration engineering", " ThinkLets", " collaboration", " object oriented modeling", " collaboration process design", " facilitation", " Group Support Systems"], "paper_abstract": "Organizations increasingly use collaborative teams in order to create value for their stakeholders. This trend has given rise to a new research field: Collaboration Engineering. The goal of Collaboration Engineering is to design and deploy processes for high-value recurring collaborative tasks, and to design these processes such that practitioners can execute them successfully without the intervention of professional facilitators. One of the key concepts in Collaboration Engineering is the thinkLet-a codified facilitation technique that creates a predictable pattern of collaboration. Because thinkLets produce a predictable pattern of interactions among people working together toward a goal they can be used as snap-together building blocks for team process designs. This paper presents an analysis of the thinkLet concept and proposes a conceptual object model of a thinkLet that may inform further developments in Collaboration Engineering. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A conceptual foundation of the thinkLet concept for Collaboration Engineering", "paper_id": "WOS:000237788100005"}