{"auto_keywords": [{"score": 0.034874695661108526, "phrase": "abc"}, {"score": 0.01001505252640983, "phrase": "peer_reliability"}, {"score": 0.007633518015171442, "phrase": "proposed_systems"}, {"score": 0.004775335634705251, "phrase": "jxta-overlay_platform"}, {"score": 0.004525629293824217, "phrase": "future_distributed_systems"}, {"score": 0.0038518661517315533, "phrase": "file_sharing"}, {"score": 0.003516904794821069, "phrase": "flc"}, {"score": 0.0033327768024847397, "phrase": "actual_behaviour_criterion"}, {"score": 0.0032243996790508175, "phrase": "pd"}, {"score": 0.003132356254669768, "phrase": "nu"}, {"score": 0.002687690320065082, "phrase": "cl"}, {"score": 0.002621590601574503, "phrase": "actual_behavioural_criterion"}, {"score": 0.002473959963690124, "phrase": "input_linguistic_parameters"}, {"score": 0.002305799666781492, "phrase": "computer_simulations"}, {"score": 0.0022773309395419427, "phrase": "simulation_results"}, {"score": 0.0022122603123901114, "phrase": "good_behaviour"}, {"score": 0.0021049977753042253, "phrase": "new_peer"}], "paper_keywords": ["P2P systems", " Fuzzy system", " Peer reliability"], "paper_abstract": "Peer-to-peer (P2P) networks, will be very important for future distributed systems and applications. In such networks, peers are heterogeneous in providing the services and they do not have the same competence of reliability. Therefore, it is necessary to estimate whether a peer is trustworthy or not for file sharing and other services. In this paper, we propose two fuzzy-based trustworthiness system for P2P communication in JXTA-overlay. System 1 has only one fuzzy logic controller (FLC) and uses four input parameters: mutually agreed behaviour (MAB), actual behaviour criterion (ABC), peer disconnections (PD) and number of uploads (NU) and the output is peer reliability (PR). System 2 has two FLCs. In FLC1 use three input parameters: number of jobs (NJ), number of connections (NC) and connection lifetime (CL) and the output is actual behavioural criterion (ABC). We use ABC and reputation (R) as input linguistic parameters for FLC2 and the output is peer reliability (PR). We evaluate the proposed systems by computer simulations. The simulation results show that the proposed systems have a good behaviour and can be used successfully to evaluate the reliability of the new peer connected in JXTA-overlay.", "paper_title": "Trustworthiness in P2P: performance behaviour of two fuzzy-based systems for JXTA-overlay platform", "paper_id": "WOS:000340498800012"}