{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobility_models"}, {"score": 0.007615659392475979, "phrase": "relational_graph"}, {"score": 0.00702085474531079, "phrase": "wireless_networks"}, {"score": 0.0045850648862091085, "phrase": "mobile_devices"}, {"score": 0.004462105963334103, "phrase": "important_issue"}, {"score": 0.0036288825833675127, "phrase": "recent_progress"}, {"score": 0.003512308265830794, "phrase": "social_graph"}, {"score": 0.0033895917080039337, "phrase": "real_mobility_data"}, {"score": 0.0027943943921568456, "phrase": "new_way"}, {"score": 0.0024788167298469455, "phrase": "e.g._relation"}, {"score": 0.002386062690026682, "phrase": "also_people"}, {"score": 0.0022967713922705, "phrase": "novel_mobility_features"}, {"score": 0.002235040467016128, "phrase": "proposed_model"}], "paper_keywords": ["mobility model", " relational graph", " social graph", " contact duration", " inter-contact time"], "paper_abstract": "Simulating the mobility of mobile devices has always been an important issue as far as wireless networks are concerned because mobility needs to be taken into account in various situations in wireless networks. Researchers have been trying, for many years, to improve the accuracy and flexibility of mobility models. Although recent progress of designing mobility models based on social graph have enhanced the performance of mobility models and made them more convenient to use, we believe the accuracy and flexibility of mobility models could be further improved by taking a more integrated structure as the input. In this paper, we propose a new way of designing mobility models on the basis of relational graph [ 1] which is a graph depicting the relation among objects, e.g. relation between people and people, and also people and places. Moreover, some novel mobility features were introduced in the proposed model to provide social, spatial and temporal properties in order to produce results similar to real mobility data. It was demonstrated by simulation that these measures could generate results similar to real mobility data.", "paper_title": "Designing Mobility Models Based on Relational Graph", "paper_id": "WOS:000348141600004"}