{"auto_keywords": [{"score": 0.048786972321694204, "phrase": "large_database"}, {"score": 0.04102458095058994, "phrase": "logic_correlation"}, {"score": 0.031981949229212416, "phrase": "apriori_bfs"}, {"score": 0.030485121765670396, "phrase": "proposed_method"}, {"score": 0.004762550320451225, "phrase": "mining_association_rule"}, {"score": 0.0037636590459094762, "phrase": "association_rules"}, {"score": 0.0030899524399043863, "phrase": "apriori-based_method"}, {"score": 0.0030562674358159945, "phrase": "boolean_function_simplification_technique"}, {"score": 0.0026942333853202556, "phrase": "integration_logic_correlation_rule"}, {"score": 0.002536534348967784, "phrase": "real-world_case"}, {"score": 0.0021874023741762496, "phrase": "apriori_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Logic correlation rule", " Apriori-base", " Boolean function simplification", " Apriori_BFS", " HIV-1 protease"], "paper_abstract": "Mining association rule in a large database is a technique for finding relations among attributes. In the last decade, most studies have been devoted to boost the efficiency, but few of them have been concentrated on the analysis of logic correlation among variables. Furthermore, mining association rules in a large database, when applied on a bio-sequence data set, is generally medically irrelevant and difficult to analyze. In this paper, a pre and post-processing approach through discovering a logic correlation rule by combining Apriori-based method and Boolean function simplification technique called Apriori_BFS method is presented. The objective of the proposed method is to effectively reduce the number of rules and present an integration logic correlation rule to readers. The experiment was conducted by using a real-world case, the HIV Drug Resistance Database, and its results unveil that the proposed method, Apriori_BFS, can not only present the logic correlation among variables but also provide more condensed rules than the Apriori method alone. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A new logic correlation rule for HIV-1 protease mutation", "paper_id": "WOS:000287419900088"}