{"auto_keywords": [{"score": 0.03606242426841463, "phrase": "computer-supported_systems"}, {"score": 0.00481495049065317, "phrase": "risk_identification_techniques"}, {"score": 0.004720606036240263, "phrase": "security_requirements"}, {"score": 0.004492717291734985, "phrase": "important_aspects"}, {"score": 0.0043183186953102805, "phrase": "special_attention"}, {"score": 0.004130165601475531, "phrase": "requirements_phase"}, {"score": 0.003577691211998842, "phrase": "different_techniques"}, {"score": 0.0032563083791198534, "phrase": "techniques'_ability"}, {"score": 0.00320826350799124, "phrase": "different_risks"}, {"score": 0.0023710856920150574, "phrase": "creative_and_systematic_process"}, {"score": 0.002234092591045251, "phrase": "security_techniques"}, {"score": 0.0021902063413831545, "phrase": "system_models"}, {"score": 0.002168586864007222, "phrase": "security_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Risk identification", " Safety", " Security", " Technique", " Requirement elicitation", " Comparison"], "paper_abstract": "When developing systems where safety and security are important aspects, these aspects have to be given special attention throughout the development, in particular in the requirements phase. There are many similar techniques within the safety and security fields, but few comparisons about what lessons that could be learnt and benefits to be gained. In this paper different techniques for identifying risk, hazard and threat of computer-supported systems are compared. This is done by assessing the techniques' ability to identify different risks in computer-supported systems in the environment where they operate. The purpose of this paper is therefore to investigate whether and how the techniques can mutually strengthen each other. The result aids practitioners in the selection and combination of techniques and researchers in focusing on gaps between the two fields. Among other things, the findings suggest that many safety techniques enforce a creative and systematic process by applying guide-words and structuring the results in worksheets, while security techniques tend to integrate system models with security models. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Comparing risk identification techniques for safety and security requirements", "paper_id": "WOS:000316831700017"}