{"auto_keywords": [{"score": 0.0380015063753839, "phrase": "selected_disease"}, {"score": 0.021052694588114047, "phrase": "medical_database"}, {"score": 0.020655427147804724, "phrase": "billing_database"}, {"score": 0.019507155326103386, "phrase": "heart_failure"}, {"score": 0.01733988701351277, "phrase": "corresponding_treatment"}, {"score": 0.009303524517527292, "phrase": "hospital_stays"}, {"score": 0.00481495049065317, "phrase": "administrative_medical_data"}, {"score": 0.0047839735747931605, "phrase": "billing_data"}, {"score": 0.004707396263523012, "phrase": "increasing_use"}, {"score": 0.004677108044285109, "phrase": "medical_administrative_databases"}, {"score": 0.004647013794908825, "phrase": "hospital_financing"}, {"score": 0.0038533599012512466, "phrase": "mbds"}, {"score": 0.0030435998319355883, "phrase": "in-hospital_stays"}, {"score": 0.002709161672473817, "phrase": "corresponding_disease"}, {"score": 0.0026743419827100225, "phrase": "high_proportion"}, {"score": 0.002514947446797848, "phrase": "database_comparison"}, {"score": 0.0023880948210628933, "phrase": "better_focus"}, {"score": 0.0023650305205893353, "phrase": "medical_mbds"}, {"score": 0.0022897425998475362, "phrase": "thorough_analysis"}, {"score": 0.0022676260293002706, "phrase": "medical_chart"}, {"score": 0.0021462652605453163, "phrase": "administrative_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["quality", " administrative database", " diagnosis coding", " drugs", " heart failure", " hypertension", " pneumonia"], "paper_abstract": "Objective: The increasing use of medical administrative databases in hospital financing means more attention is being paid to their quality The object of this study is to compare diagnoses found in the medical database to treatments mentioned in the billing database and to identify hospital stays with discrepancies. Method: The analysis is performed for the diagnoses of heart failure, hypertension, and pneumonia. Data were extracted from the 2000 National Medical Minimum Basic Data Set (MBDS) database and from the 2000 National bill summary database. The in-hospital stays were split into four analysis groups: patients with the selected disease and a corresponding treatment, patients with the selected disease but without a corresponding treatment, patients with a treatment, without the selected disease, but with another pathology requiring the same treatment, and patients with a treatment, without the selected disease and without any other pathology requiring the same treatment. Results: The proportion of in-hospital stays with the disease in the medical database but without a corresponding treatment mentioned in the billing database was 1.1% for heart failure, 12.0% for hypertension, and 5.1% for pneumonia. Under-reporting (patient with a treatment but without any corresponding disease) concerned a high proportion of stays for heart failure and for hypertension (29.6% and 26.8%, respectively). Conclusions: This database comparison identified hospital stays with discrepancies between the medical database and the billing database. This method allows a better focus on the medical MBDS to be reviewed but must be completed by a thorough analysis of the medical chart. An extension of this methodology to other pathology would be useful to assess the quality of administrative data. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Health data quality improvement by comparing administrative medical data and billing data", "paper_id": "WOS:000257978900004"}