{"auto_keywords": [{"score": 0.05007347267169469, "phrase": "serious_games"}, {"score": 0.04755419007395372, "phrase": "learning_effectiveness"}, {"score": 0.04149638088047677, "phrase": "english"}, {"score": 0.01360287022552881, "phrase": "serious_game"}, {"score": 0.013125859049873935, "phrase": "spaniards"}, {"score": 0.013073887440731763, "phrase": "britons"}, {"score": 0.013022118896924595, "phrase": "business_settings"}, {"score": 0.01281705997724449, "phrase": "lingua_franca"}, {"score": 0.012342732542439207, "phrase": "video_game"}, {"score": 0.011491059680970105, "phrase": "intercultural_knowledge"}, {"score": 0.011445485959766815, "phrase": "intercultural_communicative_competence"}, {"score": 0.004747997855358171, "phrase": "potential_benefits"}, {"score": 0.004719588268604286, "phrase": "video_games"}, {"score": 0.004700742598677484, "phrase": "ideal_companions"}, {"score": 0.004681971826924847, "phrase": "classroom_instruction"}, {"score": 0.0044357497507964815, "phrase": "learning_outcomes"}, {"score": 0.004382808897134411, "phrase": "game_play"}, {"score": 0.004029428762076566, "phrase": "intercultural_business_communication"}, {"score": 0.003481434956145924, "phrase": "business_english"}, {"score": 0.003239203732593485, "phrase": "game_participants"}, {"score": 0.003155923184630307, "phrase": "english_studies"}, {"score": 0.0031244635775092493, "phrase": "academic_year"}, {"score": 0.0030624791652879924, "phrase": "post-test_questionnaires"}, {"score": 0.002989714021608139, "phrase": "fifty_students"}, {"score": 0.0029539804547738403, "phrase": "empirical_study"}, {"score": 0.002803991518796075, "phrase": "statistically_significant_difference"}, {"score": 0.002731869692860045, "phrase": "students'_intercultural_communicative_competence"}, {"score": 0.002572417371513178, "phrase": "effective_learning_tool"}, {"score": 0.002546759542203733, "phrase": "intercultural_communication"}, {"score": 0.0024271110662485306, "phrase": "small_learning_effect"}, {"score": 0.002417397195857689, "phrase": "intercultural_awareness"}, {"score": 0.002402899060902048, "phrase": "medium_learning_effect"}, {"score": 0.0023694065215394593, "phrase": "large_learning_effect"}, {"score": 0.0023316992489822042, "phrase": "correlating_factors"}, {"score": 0.0022355418435481655, "phrase": "correct_balance"}, {"score": 0.002222131941198864, "phrase": "different_dimensions"}, {"score": 0.002186763292278803, "phrase": "specifically_instructional_content"}, {"score": 0.002178009250126491, "phrase": "game_dimensions"}, {"score": 0.002169290175933533, "phrase": "game_cycle"}, {"score": 0.0021304833545718973, "phrase": "intrinsic_motivation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Adult learning", " Cross-cultural projects", " Interactive learning environments", " Interdisciplinary projects", " Simulations"], "paper_abstract": "Although the value of serious games in education is undeniable and the potential benefits of using video games as ideal companions to classroom instruction is unquestionable, there is still little consensus on the game features supporting learning effectiveness, the process by which games engage learners, and the types of learning outcomes that can be achieved through game play. Our aim in this discussion is precisely to advance in this direction by providing evidence of some of the factors influencing the learning effectiveness of a serious game called It's a Deal! This serious game was created for the purpose of teaching intercultural business communication between Spaniards and Britons in business settings in which English is used as the lingua franca. This paper hypothesizes that the immersive, all-embracing and interactive learning environment provided by the video game to its users may contribute to develop and enhance their intercultural communicative competence. The study attempts to answer three main research questions: (a) after playing It's a Deal!, did the students sampled improve their intercultural awareness, intercultural knowledge and intercultural communicative competence in business English? (b) If they improved their intercultural learning, what are the factors influencing such improvement? And (c) if they did not improve their intercultural learning, what are the factors influencing such failure? The game participants who volunteered to take part in the study were all students of English Studies at the University of Alicante in the academic year 2010-2011. One hundred and six students completed both the pre-test and the post-test questionnaires, and played It's a Deal! A sample of fifty students was selected randomly for the empirical study. The results obtained in the tests performed were compared and contrasted intra-group, both qualitatively and quantitatively, for the purpose of finding any statistically significant difference that may confirm whether or not there was an improvement in the students' intercultural communicative competence in business English as a result of the implementation of the It's a Deal! serious game. Findings of this study demonstrate that the video game is an effective learning tool for the teaching of intercultural communication between Spaniards and Britons in business settings in which English is used as the lingua franca. In particular, whereas the game had a small learning effect on intercultural awareness and a medium learning effect on intercultural knowledge, it had a large learning effect on intercultural communicative competence. The study also documents correlating factors that make serious games effective, since it shows that the learning effectiveness of It's a Deal! stems from the correct balance of the different dimensions involved in the creation of serious games, specifically instructional content, game dimensions, game cycle, debriefing, perceived educational value, transfer of learnt skills and intrinsic motivation. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Serious games and learning effectiveness: The case of It's a Deal!", "paper_id": "WOS:000298524300039"}