{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "response_time"}, {"score": 0.00481495049065317, "phrase": "question_response_time"}, {"score": 0.004730158389701481, "phrase": "newly_posted_question"}, {"score": 0.004195418010131832, "phrase": "question_asker"}, {"score": 0.003907403442285109, "phrase": "social_media"}, {"score": 0.003754140294151593, "phrase": "major_source"}, {"score": 0.003687960013746783, "phrase": "internet_users"}, {"score": 0.0035590664550919854, "phrase": "important_aspect"}, {"score": 0.003404244237372396, "phrase": "users'_satisfaction"}, {"score": 0.0032561349010603734, "phrase": "online_communities"}, {"score": 0.003059511666279378, "phrase": "stackoverflow"}, {"score": 0.002952516738708181, "phrase": "software_developers"}, {"score": 0.0027989800906333784, "phrase": "long_list"}, {"score": 0.0026652435674846095, "phrase": "clear_relation"}, {"score": 0.00258347644721642, "phrase": "tag-related_factors"}, {"score": 0.0021049977753042253, "phrase": "identified_evidential_features"}], "paper_keywords": ["Online communities", " Question-answering sites", " Collective intelligence", " Question response time", " User engagement", " Human behavior", " Evidential feature analysis"], "paper_abstract": "Given a newly posted question on a Question and Answer (Q&A) site, how long will it take until an answer is received? Does response time relate to factors about how the question asker composes the question? If so, what are those factors? With advances in social media and the Web, Q&A sites have become a major source of information for Internet users. Response time of a question is an important aspect in these sites as it is associated with the users' satisfaction and engagement, and thus the lifespan of these online communities. In this paper, we study and estimate response time for questions in StackOverflow, a popular online Q&A forum where software developers post and answer questions related to programming. We analyze a long list of factors in the data and identify those that have clear relation with response time. Our key finding is that tag-related factors, such as their \"popularity\" (how often the tag is used) and the number of their \"subscribers\" (how many users can answer questions containing the tag), provide much stronger evidence than factors not related to tags. Finally, we learn models using the identified evidential features for predicting the response time of questions, which also demonstrate the significance of tags chosen by the question asker.", "paper_title": "Effects of tag usage on question response time", "paper_id": "WOS:000355743100024"}