{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "asp-g"}, {"score": 0.022009564416591083, "phrase": "boolean_network_models"}, {"score": 0.004625164125506718, "phrase": "genetic_regulatory_networks"}, {"score": 0.004394350285140955, "phrase": "detailed_kinetic_information"}, {"score": 0.004298974960001275, "phrase": "biological_reality"}, {"score": 0.003937649447496154, "phrase": "exact_choice"}, {"score": 0.0036866541358511005, "phrase": "biologically_correct_assumptions"}, {"score": 0.0036198068824262464, "phrase": "ideal_simulation"}, {"score": 0.0035671997165370403, "phrase": "different_rules"}, {"score": 0.003438990973529508, "phrase": "observed_biological_phenomenon"}, {"score": 0.0032196786163178107, "phrase": "specific_assumptions"}, {"score": 0.002927278301452369, "phrase": "asp-g."}, {"score": 0.0027809588979112393, "phrase": "different_assumptions"}, {"score": 0.002690771424958613, "phrase": "previously_published_studies"}, {"score": 0.0025939803934423486, "phrase": "network_models"}, {"score": 0.002575042977852052, "phrase": "different_settings"}, {"score": 0.0024642796422450755, "phrase": "main_added_value"}, {"score": 0.002298544073884724, "phrase": "traditional_approaches"}, {"score": 0.0022734117274137468, "phrase": "declarative_nature"}, {"score": 0.002136087390959268, "phrase": "good_efficiency"}, {"score": 0.0021049977753042253, "phrase": "computational_time"}], "paper_keywords": [""], "paper_abstract": "Motivation: Boolean network models are suitable to simulate GRNs in the absence of detailed kinetic information. However, reducing the biological reality implies making assumptions on how genes interact (interaction rules) and how their state is updated during the simulation (update scheme). The exact choice of the assumptions largely determines the outcome of the simulations. In most cases, however, the biologically correct assumptions are unknown. An ideal simulation thus implies testing different rules and schemes to determine those that best capture an observed biological phenomenon. This is not trivial because most current methods to simulate Boolean network models of GRNs and to compute their attractors impose specific assumptions that cannot be easily altered, as they are built into the system. Results: To allow for a more flexible simulation framework, we developed ASP-G. We show the correctness of ASP-G in simulating Boolean network models and obtaining attractors under different assumptions by successfully recapitulating the detection of attractors of previously published studies. We also provide an example of how performing simulation of network models under different settings help determine the assumptions under which a certain conclusion holds. The main added value of ASP-G is in its modularity and declarativity, making it more flexible and less error-prone than traditional approaches. The declarative nature of ASP-G comes at the expense of being slower than the more dedicated systems but still achieves a good efficiency with respect to computational time.", "paper_title": "ASP-G: an ASP-based method for finding attractors in genetic regulatory networks", "paper_id": "WOS:000344644600013"}