{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "research_fronts"}, {"score": 0.010016715202670293, "phrase": "bibliographic_coupling"}, {"score": 0.004722613498487908, "phrase": "organic_light-emitting_diode"}, {"score": 0.004204459295724526, "phrase": "specific_fields"}, {"score": 0.003992729692096799, "phrase": "current_focuses"}, {"score": 0.003941478054422721, "phrase": "future_trends"}, {"score": 0.003791621842185417, "phrase": "important_indicators"}, {"score": 0.003742941972172613, "phrase": "government_policymaking"}, {"score": 0.0031845067058084583, "phrase": "oled_field"}, {"score": 0.0026060359255636444, "phrase": "analytic_methods"}, {"score": 0.002319566486828135, "phrase": "higher_number"}, {"score": 0.0021049977753042253, "phrase": "better_performance"}], "paper_keywords": ["Research fronts", " Bibliographic coupling", " Co-citation", " Fixed citation window", " OLED"], "paper_abstract": "Research fronts represent areas of cutting-edge study in specific fields. They not only provide insights into current focuses and future trends, but also serve as important indicators for government policymaking with regard to technology. This study employed both bibliographic coupling and co-citation as methods to analyze the evolution of research fronts in the OLED field, and compared the outcomes in order to identify the differences between, and assess the effectiveness of, the two methods in detecting such research fronts. This study indicated that both analytic methods can be employed to track the evolution of research fronts. Compared with co-citation, bibliographic coupling identifies a higher number of research fronts, and detects the emergence of the research fronts earlier, thus showing better performance than co-citation in detecting research fronts.", "paper_title": "A comparative study on detecting research fronts in the organic light-emitting diode (OLED) field using bibliographic coupling and co-citation", "paper_id": "WOS:000350337000011"}