{"auto_keywords": [{"score": 0.04865090847142818, "phrase": "customer_loyalty"}, {"score": 0.00481495049065317, "phrase": "cognitive_trust"}, {"score": 0.004773476989344654, "phrase": "affective_distrust"}, {"score": 0.004611108249179507, "phrase": "present_research"}, {"score": 0.004435006247087171, "phrase": "customer_perceptions"}, {"score": 0.003980191398041843, "phrase": "cognitively_active_construct"}, {"score": 0.0038781372962808894, "phrase": "affectively_active_construct"}, {"score": 0.0037299231609021783, "phrase": "six_antecedents"}, {"score": 0.003525744120930142, "phrase": "capability-based_elements"}, {"score": 0.003465189575252443, "phrase": "site_convenience"}, {"score": 0.003261295948815592, "phrase": "relationship-affecting_elements"}, {"score": 0.003205268682789165, "phrase": "customer_involvement"}, {"score": 0.003177615880037735, "phrase": "web_fraud"}, {"score": 0.002990592465417758, "phrase": "content_truthfulness"}, {"score": 0.0029647862293448895, "phrase": "customer_responsiveness"}, {"score": 0.0027542280470369013, "phrase": "korea"}, {"score": 0.002637377202509382, "phrase": "foregoing_hypotheses"}, {"score": 0.0024713335323674223, "phrase": "positive_result"}, {"score": 0.0022464835515931592, "phrase": "vicious_motivation"}, {"score": 0.0021049977753042253, "phrase": "present_study"}], "paper_keywords": ["Trust", " Distrust", " Cognition", " Affect", " Customer loyalty"], "paper_abstract": "The present research investigates how trust and distrust differently mediate in customer perceptions of various web features in the process of building customer loyalty. Assuming trust and distrust are different in their psychological aspects, we propose that trust is a cognitively active construct, whereas distrust is an affectively active construct. To support this proposal, we select six antecedents of trust and distrust and hypothesize their different relationships as follows: 1) Antecedents with capability-based elements, such as site convenience and content relevance, are associated with trust; 2) Antecedents with relationship-affecting elements, such as customer involvement and web fraud, are associated with distrust; 3) Antecedents with both elements, such as content truthfulness and customer responsiveness, are associated with both trust and distrust. A survey is conducted on 279 online shopping mall users in Korea, and the result shows that most of the foregoing hypotheses are supported. The finding suggests: 1) Trust emerges when customers expect positive result with confidence, thereby implying that it is cognitively activated; 2) Distrust emerges when customers suspect that the seller has a vicious motivation, thereby implying that it is affectively activated. From these premises, the present study contributes to the literature by showing how trust and distrust are different, and why they should be managed differently to establish customer loyalty.", "paper_title": "Antecedents of cognitive trust and affective distrust and their mediating roles in building customer loyalty", "paper_id": "WOS:000349963200013"}