{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coordinated_development"}, {"score": 0.022982376754879304, "phrase": "urban_transport_system"}, {"score": 0.009480393983274906, "phrase": "transport_system"}, {"score": 0.004956529678874464, "phrase": "quantitative_theoretical_model"}, {"score": 0.0041840994704406866, "phrase": "quantitative_method"}, {"score": 0.004050625770007516, "phrase": "urban_transportation_development_planning"}, {"score": 0.003900257249255497, "phrase": "organic_composition"}, {"score": 0.0034442607586033657, "phrase": "external_systems"}, {"score": 0.0031417377608722, "phrase": "-_establishing_models"}, {"score": 0.0029126002350975634, "phrase": "overall_coordination"}, {"score": 0.002436289099444074, "phrase": "main_limitation"}, {"score": 0.00235843888868088, "phrase": "theoretical_foundation"}], "paper_keywords": ["Urban regions", " Transport management", " Transportation", " People's Republic of China"], "paper_abstract": "Purpose - The purpose of this paper is to expound the concept of the coordinated development of the transport system, and provide a quantitative method to support decision making in urban transportation development planning. Design/methodology/approach - To analyze the organic composition of urban transport system, research the meaning and mechanism of coordinated development of transport system. On the basis of researching relations of transport and external systems and its subsystems, to research quantitative theoretical model of the coordinated development and assessment of the transport system. Findings - Establishing models needs to analyze the coordination among the various indices of subsystem, calculate the overall coordination between indices of the subsystem and all the indices of other subsystems, then inspect the coordinated development among subsystems. Research limitations/implications - How to design the indexes of the subsystem of urban transport system is the main limitation. Practical implications - Offering theoretical foundation for coordinated development of urban transport system. Originality/value - Putting forward quantitative theoretical model on coordinated development of urban transport system, which lays a foundation for further study.", "paper_title": "Theoretical analysis on coordinated development of urban transport system", "paper_id": "WOS:000261315700014"}