{"auto_keywords": [{"score": 0.004755353864362941, "phrase": "forward-backward_motion"}, {"score": 0.004486800020569973, "phrase": "rigid_surface"}, {"score": 0.004233347974930148, "phrase": "sensory_events"}, {"score": 0.00402748353567517, "phrase": "temporal_estimate"}, {"score": 0.0039120325834029355, "phrase": "brain_use"}, {"score": 0.003368367923339975, "phrase": "particular_state"}, {"score": 0.0031647054743284947, "phrase": "tactile_event"}, {"score": 0.0030995835539697893, "phrase": "proprioceptive_information"}, {"score": 0.002960979624379786, "phrase": "central_nervous_system"}, {"score": 0.002646412155387084, "phrase": "robotic_device"}, {"score": 0.0023651843133643785, "phrase": "useful_cue"}, {"score": 0.002259346051668556, "phrase": "perceptual_and_motor_systems"}, {"score": 0.00224061675049049, "phrase": "essential_engineering_knowledge"}, {"score": 0.0021944684609599245, "phrase": "effective_and_realistic_augmented_reality_systems"}, {"score": 0.0021049977753042253, "phrase": "telepresence_applications"}], "paper_keywords": ["Active guidance", " haptic", " motor learning", " motor system", " perception"], "paper_abstract": "Knock, knock-who's there? Here, we do not address this question but rather the underlying mechanism behind the perception of knocking impacts. When one knocks on a surface, her hand makes a forward-backward motion and, at the point of reversal, the knuckles collide with the rigid surface. How does one perceive the unity, or simultaneity, of the sensory events associated with this impact? Does this binding derive from a temporal estimate of simultaneity, or does the brain use some other mechanism? In this paper, we ask whether the tap and the reversal of the hand are perceived as happening together, since both took place at the same time or at a particular state of motion. The aim of this research is to find out whether a tactile event and the flow of proprioceptive information regarding the state of the arm are matched within the central nervous system according to time or state. We tested this experimentally with subjects who actively moved one arm, as well as subjects who were servoed by a robotic device. Our results suggest that time is the mechanism used for judging the unity of the modalities for both active and passive movements. Taken together, these results provide a useful cue for neuroscientists as to the structure and function of the perceptual and motor systems and essential engineering knowledge for the development of effective and realistic augmented reality systems with haptics for the telerobotics, telesurgery, and telepresence applications of the future.", "paper_title": "Simultaneity in Perception of Knocking", "paper_id": "WOS:000305584400011"}