{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nurse_rerostering_problem"}, {"score": 0.012447634933336137, "phrase": "genetic_algorithms"}, {"score": 0.008803582240862392, "phrase": "real_data"}, {"score": 0.008630737219809394, "phrase": "good_quality_solutions"}, {"score": 0.008025272251025308, "phrase": "nurse_schedules"}, {"score": 0.004431616517786392, "phrase": "reserve_nurses"}, {"score": 0.00430118556814906, "phrase": "current_roster"}, {"score": 0.004216362268148017, "phrase": "new_roster"}, {"score": 0.0041469500929423595, "phrase": "labour_rules"}, {"score": 0.0041195049121633956, "phrase": "institutional_constraints"}, {"score": 0.003893406207928709, "phrase": "present_paper"}, {"score": 0.0038676325043529524, "phrase": "constructive_heuristics"}, {"score": 0.0037662262006579023, "phrase": "specific_encoding"}, {"score": 0.003716520760680603, "phrase": "sequencing_problems"}, {"score": 0.00361906209437624, "phrase": "hard_constraints"}, {"score": 0.0028966970007550824, "phrase": "genetic_algorithm"}, {"score": 0.0027834145465170292, "phrase": "genetic_operators"}, {"score": 0.002656823796937945, "phrase": "lisbon_hospital"}, {"score": 0.0024125742420201, "phrase": "portuguese_public_hospitals"}, {"score": 0.0023886223145816376, "phrase": "specific_problem"}, {"score": 0.0023336530061840244, "phrase": "unexpected_staff_absences"}, {"score": 0.002234893735225432, "phrase": "heuristic_procedures"}, {"score": 0.0021049977753042253, "phrase": "computing_time"}], "paper_keywords": ["nurse scheduling", " rerostering", " heuristics", " genetic algorithms", " OR applications in health care"], "paper_abstract": "The nurse rerostering problem occurs when one or more nurses cannot work in shifts that were previously assigned to her or them. If no pool of reserve nurses exists to replace those absent, then the current roster must be rebuilt. This new roster must comply with the labour rules and institutional constraints. Moreover, it must be as similar as possible to the current one. The present paper describes constructive heuristics, besides several versions of genetic algorithms based on specific encoding and operators for sequencing problems applied to the nurse rerostering problem, defined with hard constraints. In the genetic algorithms described, each individual in the population is associated with a pair of chromosomes, representing permutations of tasks and nurses. Those permutations are used as input to a procedure that generates rosters. The fitness of individuals is given by the similarity between the roster generated from the permutations and the current one. The authors developed several versions of the genetic algorithm, whose difference lay in the encoding of permutations and in the genetic operators used for each encoding. These heuristics were tested with real data from a Lisbon hospital and yielded good quality solutions. Scope and purpose The research reported is part of a project designed to develop a system for the management of nurse schedules for implementation in Portuguese public hospitals. The specific problem of rebuilding nurse schedules is addressed when unexpected staff absences arise. The complexity of the problem led the authors to design heuristic procedures. The tests performed so far with real data have shown that the algorithms attain good quality solutions at a computing time within the bounds stipulated by the hospital. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "A genetic algorithm approach to a nurse rerostering problem", "paper_id": "WOS:000241737500004"}