{"auto_keywords": [{"score": 0.049747721549480615, "phrase": "ea"}, {"score": 0.012921922174767675, "phrase": "solution_space"}, {"score": 0.00481495049065317, "phrase": "election_algorithm"}, {"score": 0.004683073921949839, "phrase": "search_technique"}, {"score": 0.0046184900568047565, "phrase": "presidential_election"}, {"score": 0.004523272849033429, "phrase": "iterative_population_based_algorithm"}, {"score": 0.003991646181215783, "phrase": "electoral_parties"}, {"score": 0.003922907208353323, "phrase": "advertising_campaign"}, {"score": 0.0036595438031512217, "phrase": "positive_advertisement"}, {"score": 0.003485744667868367, "phrase": "negative_advertisement"}, {"score": 0.003217896008931311, "phrase": "similar_ideas"}, {"score": 0.0030650070965891653, "phrase": "united_party"}, {"score": 0.0028195727965553367, "phrase": "election_day"}, {"score": 0.002584733102974067, "phrase": "best_solution"}, {"score": 0.0023942700905678735, "phrase": "continuous_genetic_algorithm"}, {"score": 0.0023529740798601015, "phrase": "comprehensive_learning_particle_swarm_optimizer"}, {"score": 0.002312388685547026, "phrase": "adaptive_differential_evolution_algorithm"}, {"score": 0.002296351108890614, "phrase": "jde"}, {"score": 0.002272501735900584, "phrase": "covariance_matrix_adaptation_evolution_strategy"}, {"score": 0.002202427244004817, "phrase": "global_optimum"}, {"score": 0.0021049977753042253, "phrase": "benchmark_examples"}], "paper_keywords": ["Election algorithm", " global optimization", " meta-heuristic algorithms", " presidential election"], "paper_abstract": "This paper describes Election Algorithm (EA), an optimization and search technique, inspired by presidential election. The EA is an iterative population based algorithm, which works with a set of solutions known as population. Each individual of the population is called a person and can be either a candidate or a voter. These persons form a number of electoral parties in the solution space. Advertising campaign is the core of this algorithm and contains three main steps: positive advertisement, negative advertisement and coalition. During positive advertisement, the candidates introduce themselves through reinforcing their positive images and qualities. In the negative advertisement, candidates compete with each other to increase their popularity and defame their opponents. Also in some cases, the candidates that have similar ideas can confederate together in order to increase the chance of success of the united party. Advertisements hopefully cause the persons to converge to a state of solution space that is the global optimum. All these efforts lead up to election day (stopping condition). On election day, the candidate who attained the most votes, is announced as the winner and equals to the best solution that is found for the problem. In order to evaluate the performance of EA, we compared this algorithm with Continuous Genetic Algorithm (CGA), Comprehensive Learning Particle Swarm Optimizer (CLPSO), Adaptive Differential Evolution Algorithm (JDE) and Covariance Matrix Adaptation Evolution Strategy (CMA-ES) in finding the global optimum of four mathematical benchmark examples. Our experiments demonstrate the superiority of the EA for benchmark examples.", "paper_title": "Election algorithm: A new socio-politically inspired strategy", "paper_id": "WOS:000358733300013"}