{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uncertainty_assessment"}, {"score": 0.04978464912522237, "phrase": "uncertainty_management"}, {"score": 0.03394235694003813, "phrase": "'total_uncertainty"}, {"score": 0.004697655699119423, "phrase": "general_method"}, {"score": 0.004625795150473604, "phrase": "test_planning"}, {"score": 0.004178198896815672, "phrase": "different_kinds"}, {"score": 0.004114251688287943, "phrase": "different_sources"}, {"score": 0.003832423454781517, "phrase": "historical_perspective"}, {"score": 0.0037737482742198278, "phrase": "new_perspective"}, {"score": 0.0037045182324752404, "phrase": "fuzzy_logic"}, {"score": 0.003059206456855218, "phrase": "physical_science"}, {"score": 0.0029297595441334823, "phrase": "e.g._economics"}, {"score": 0.0029117184554526094, "phrase": "social_sciences"}, {"score": 0.002678734566245688, "phrase": "expressed_goal"}, {"score": 0.002281134611390528, "phrase": "policy_making"}, {"score": 0.0022185595808679, "phrase": "quantification_of_margins"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Uncertainty quantification", " Fuzzy sets", " Inference", " Total uncertainty", " Management"], "paper_abstract": "The paper presents a general method for doing predictions and test planning which can also be used as a tool for managing uncertainty. Uncertainty is generally defined as \"that which is not precisely known\". This definition permits the identification of different kinds of uncertainty arising from different sources and activities, most of which go unnoticed in analysis. In this paper, the description of uncertainty begins from a historical perspective and concludes with a new perspective based upon making inferences; fuzzy logic can be most helpful in quantifying some inferences. Our assessment of uncertainty begins the identification of the various forms of uncertainty (ambiguity, fuzziness, randomness, non-specificity, ignorance, etc.) and concludes with models and methods for assessing the 'total uncertainty' within an application. The material contained herein is described in the context of physical science and engineering applications: however, nothing presented precludes application to other fields, e.g. economics, social sciences, medicine and business. Uncertainty assessment involves how to identify, classify, characterize, quantify, and combine uncertainties within an application, with the expressed goal of understanding how to manage uncertainties. Uncertainty management presumes that we have a process to quantify uncertainties and to be able to aggregate them in such a way that they can be compared in terms of their individual contributions to the 'total uncertainty'. Managing uncertainties is important, because uncertainties directly affect decision and policy making. An example, using a concept called Quantification of Margins and Uncertainty (QMU), is provided to illustrate our ideas. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "New developments in uncertainty assessment and uncertainty management", "paper_id": "WOS:000311133600018"}