{"auto_keywords": [{"score": 0.004681012408089219, "phrase": "comprehensive_modeling_study"}, {"score": 0.0045324756541157574, "phrase": "potent_inhibitory_receptor"}, {"score": 0.0039677715255034595, "phrase": "immune_tolerance"}, {"score": 0.0038263136898042285, "phrase": "'game_changer'_approach"}, {"score": 0.003734810936407523, "phrase": "significant_therapeutic_potential"}, {"score": 0.003487222504700868, "phrase": "current_crystal_structures"}, {"score": 0.0030646951765987414, "phrase": "detailed_model"}, {"score": 0.002896274285996145, "phrase": "accurate_structures"}, {"score": 0.002861402531078998, "phrase": "high_barrier"}, {"score": 0.0027816546451972725, "phrase": "safer_agents"}, {"score": 0.0025658094607383646, "phrase": "molecular_dynamics"}, {"score": 0.002504374718975704, "phrase": "protein-protein_docking"}, {"score": 0.0024842242921857705, "phrase": "binding_energy_analysis"}, {"score": 0.002357131515622894, "phrase": "available_experimental_nmr_and_mutational_data"}, {"score": 0.00224558083320154, "phrase": "human_pd-ls"}, {"score": 0.002182958452794581, "phrase": "different_affinities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["PD1", " PD-L1", " PD-L2", " Protein-Protein docking", " ZDOCK", " Molecular dynamics simulations"], "paper_abstract": "Programmed death-1 (PD-1) is a potent inhibitory receptor of T cells which binds to two different ligands, namely PD-L1 and PD-L2, and upon binding, it inhibits T cell activation, differentiation, and proliferation, leading to a state of immune tolerance. Blocking these interactions recently emerged as a 'game changer' approach in immunotherapy. Despite the significant therapeutic potential of targeting the PD-1 pathway, the interaction between human PD-1 and its two human ligands is not fully understood. Current crystal structures describe the interactions of mouse PD-1 with human PD-L1 or mouse PD-L2. However, recent mutational and nuclear magnetic resonance (NMR) analyses suggest that human PD-1 binds its human ligands differently compared to their mouse counterparts. No detailed model is currently available to consistently fit these data. The lack of these accurate structures constitutes a high barrier against rationally developing more effective and safer agents targeting these interactions. Here we describe for the first time two accurate models for human PD-1 bound to its two human ligands. Our methodology involved combining molecular dynamics (MD) simulations with protein-protein docking and binding energy analysis to predict the most probable binding conformations for PD1 to its ligands. Our results confirm the available experimental NMR and mutational data and reveal the most accurate atomistic details so far of how human PD-1 binds to human PD-Ls and why the two ligands bind with different affinities to the same receptor. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Human PD-1 binds differently to its human ligands: A comprehensive modeling study", "paper_id": "WOS:000353004800015"}