{"auto_keywords": [{"score": 0.0387515965540892, "phrase": "ordinary_coherence"}, {"score": 0.004766683200410046, "phrase": "neurobiological_time_series"}, {"score": 0.004718897469501381, "phrase": "multisensor_recordings"}, {"score": 0.004555371402128666, "phrase": "functional_connectivity"}, {"score": 0.004509694461067052, "phrase": "different_brain_areas"}, {"score": 0.003975781274672803, "phrase": "time_series"}, {"score": 0.003594369823549604, "phrase": "individual_time_series"}, {"score": 0.0028498718992429825, "phrase": "non-overlapping_time_series"}, {"score": 0.002486734224234698, "phrase": "local_field_potential_recordings"}, {"score": 0.0024125253170522816, "phrase": "visuomotor_task"}, {"score": 0.0023053339328456234, "phrase": "block_coherence"}, {"score": 0.0021917966722180132, "phrase": "prefrontal_region"}, {"score": 0.0021697677572213086, "phrase": "beta_band"}, {"score": 0.0021049977753042253, "phrase": "response_time"}], "paper_keywords": ["Coherence", " Spectral density matrix", " Multivariate process", " Granger causality"], "paper_abstract": "Multisensor recordings are becoming commonplace. When studying functional connectivity between different brain areas using such recordings, one defines regions of interest, and each region of interest is often characterized by a set (block) of time series. Presently, for two such regions, the interdependence is typically computed by estimating the ordinary coherence for each pair of individual time series and then summing or averaging the results over all such pairs of channels (one from block 1 and other from block 2). The aim of this paper is to generalize the concept of coherence so that it can be computed for two blocks of non-overlapping time series. This quantity, called block coherence, is first shown mathematically to have properties similar to that of ordinary coherence, and then applied to analyze local field potential recordings from a monkey performing a visuomotor task. It is found that an increase in block coherence between the channels from V4 region and the channels from prefrontal region in beta band leads to a decrease in response time.", "paper_title": "Block coherence: a method for measuring the interdependence between two blocks of neurobiological time series", "paper_id": "WOS:000290554500004"}