{"auto_keywords": [{"score": 0.0383084906782155, "phrase": "reference_region"}, {"score": 0.009093644694112614, "phrase": "brain_region"}, {"score": 0.007014244134709403, "phrase": "corresponding_points"}, {"score": 0.00481495049065317, "phrase": "brain_surfaces"}, {"score": 0.00478968045369969, "phrase": "gaussian_random_fields"}, {"score": 0.004702270260893693, "phrase": "morphometric_analysis"}, {"score": 0.004379737380744606, "phrase": "cortical_and_subcortical_brain_regions"}, {"score": 0.004345288603071002, "phrase": "new_image_processing_techniques"}, {"score": 0.004299776199854382, "phrase": "small_and_highly_localized_perturbations"}, {"score": 0.004254738454916371, "phrase": "localized_volume"}, {"score": 0.0042212686864468805, "phrase": "remarkable_precision"}, {"score": 0.004188061099494327, "phrase": "appropriate_statistical_representation"}, {"score": 0.0038699648075244297, "phrase": "underlying_tissue"}, {"score": 0.00357594216066491, "phrase": "gaussian_random_field"}, {"score": 0.003492155652400838, "phrase": "entire_surface"}, {"score": 0.0033656930865509547, "phrase": "segmented_brain_images"}, {"score": 0.0033480035183418642, "phrase": "healthy_individuals"}, {"score": 0.003321642923045707, "phrase": "grit"}, {"score": 0.0032695402272090424, "phrase": "signed_euclidean_distances"}, {"score": 0.003151113813808222, "phrase": "corresponding_region"}, {"score": 0.0029038817737006405, "phrase": "coordinate_space"}, {"score": 0.0028432828877281388, "phrase": "fluid_dynamics"}, {"score": 0.002613239644974825, "phrase": "reference_regions"}, {"score": 0.0025722202862084186, "phrase": "proposed_statistical_description"}, {"score": 0.0025385285106790403, "phrase": "surface_contours"}, {"score": 0.002427235181120177, "phrase": "grf."}, {"score": 0.002357829127448854, "phrase": "statistically_significant_differences"}, {"score": 0.0022366701161264744, "phrase": "statistical_methods"}, {"score": 0.002144231454317139, "phrase": "large_sample"}, {"score": 0.002132947962296264, "phrase": "normal_subjects"}], "paper_keywords": ["conformal mapping", " Gaussian random field", " manifold", " Riemannian curvature tensor", " statistical shape analyses", " students' t-statistics"], "paper_abstract": "Interest in the morphometric analysis of the brain and its subregions has recently intensified because growth or degeneration of the brain in health or illness affects not only the volume but also the shape of cortical and subcortical brain regions, and new image processing techniques permit detection of small and highly localized perturbations in shape or localized volume, with remarkable precision. An appropriate statistical representation of the shape of a brain region is essential, however, for detecting, localizing, and interpreting variability in its surface contour and for identifying differences in volume of the underlying tissue that produce that variability across individuals and groups of individuals. Our statistical representation of the shape of a brain region is defined by a reference region for that region and by a Gaussian random field (GRF) that is defined across the entire surface of the region. We first select a reference region from a set of segmented brain images of healthy individuals. The GRIT is then estimated as the signed Euclidean distances between points on the surface of the reference region and the corresponding points on the corresponding region in images of brains that have been coregistered to the reference. Correspondences between points on these surfaces are defined through deformations of each region of a brain into the coordinate space of the reference region using the principles of fluid dynamics. The warped, coregistered region of each subject is then unwarped into its native space, simultaneously bringing into that space the map of corresponding points that was established when the surfaces of the subject and reference regions were tightly coregistered. The proposed statistical description of the shape of surface contours makes no assumptions, other than smoothness, about the shape of the region or its GRF. The description also allows for the detection and localization of statistically significant differences in the shapes of the surfaces across groups of subjects at both a fine and coarse scale. We demonstrate the effectiveness of these statistical methods by applying them to study differences in shape of the amygdala and hippocampus in a large sample of normal subjects and in subjects with attention deficit/hyperactivity disorder (ADHD).", "paper_title": "Statistical analyses of brain surfaces using Gaussian random fields on 2-D manifolds", "paper_id": "WOS:000243286800004"}