{"auto_keywords": [{"score": 0.04772471867055894, "phrase": "dynamical_matrix"}, {"score": 0.027922180379588615, "phrase": "phonon_dispersion"}, {"score": 0.015719716506582538, "phrase": "molecular_dynamics_simulations"}, {"score": 0.015019477488861174, "phrase": "proposed_method"}, {"score": 0.008552860789477056, "phrase": "molecular_dynamics_simulation"}, {"score": 0.007702531216711993, "phrase": "anharmonic_effect"}, {"score": 0.007538488827519212, "phrase": "lammps"}, {"score": 0.0068274275875484375, "phrase": "distributed_program"}, {"score": 0.006798070787478026, "phrase": "test_data"}, {"score": 0.0052708638569617374, "phrase": "force_field"}, {"score": 0.004658158616983538, "phrase": "open_source"}, {"score": 0.004618099842144362, "phrase": "lammps."}, {"score": 0.004474125526144931, "phrase": "fluctuation-dissipation_theory"}, {"score": 0.004403823349864079, "phrase": "phonon_spectra"}, {"score": 0.004050930846552577, "phrase": "measured_dynamical_matrices"}, {"score": 0.004016072233242585, "phrase": "auxiliary_postprocessing_code"}, {"score": 0.003970614904982074, "phrase": "program"}, {"score": 0.003952938894305794, "phrase": "fixphonon"}, {"score": 0.0038628691754918503, "phrase": "cpc_program_library"}, {"score": 0.003851755169496289, "phrase": "queen's_university"}, {"score": 0.003840673159485314, "phrase": "belfast"}, {"score": 0.003829622626630238, "phrase": "n._ireland"}, {"score": 0.0038076167733021612, "phrase": "gnu_general_public"}, {"score": 0.0035634460366776055, "phrase": "linux"}, {"score": 0.0034872708593416406, "phrase": "ram"}, {"score": 0.003422505144364946, "phrase": "external"}, {"score": 0.0034077574595465137, "phrase": "mpi"}, {"score": 0.0033108950376365717, "phrase": "ceaseless_vibrations"}, {"score": 0.0032541167047457926, "phrase": "allowed_wavelength"}, {"score": 0.0031845067058084583, "phrase": "so-called_\"lattice_dynamics"}, {"score": 0.003138926660480172, "phrase": "normal_modes"}, {"score": 0.0031029313316451057, "phrase": "lattice_dynamics"}, {"score": 0.0030541087053888964, "phrase": "wave_vectors"}, {"score": 0.0029630185516509927, "phrase": "atomic_scale_modeling"}, {"score": 0.0029502287070757704, "phrase": "dynamical_matrices"}, {"score": 0.002825319183890361, "phrase": "tedious_\"quasi-harmonic\"_procedure"}, {"score": 0.0026211746739675927, "phrase": "resultant_phonons"}, {"score": 0.0026060946618700416, "phrase": "finite_temperature_effect"}, {"score": 0.002583636737108568, "phrase": "well_defined_lattice"}, {"score": 0.0025429640342410475, "phrase": "implemented_code"}, {"score": 0.00248494115765596, "phrase": "solid_state"}, {"score": 0.002403839385995682, "phrase": "periodic_systems"}, {"score": 0.002393457439332598, "phrase": "non-periodic_system"}, {"score": 0.002383120224166142, "phrase": "supercell_approach"}, {"score": 0.0023422148545398673, "phrase": "unit_cell"}, {"score": 0.0023287359930308864, "phrase": "additional_comments"}, {"score": 0.002295376442690866, "phrase": "subsequent_update"}, {"score": 0.0022690324237501927, "phrase": "associated_postprocessing_code"}, {"score": 0.0022397558211251544, "phrase": "latest_version"}, {"score": 0.002204484672229227, "phrase": "system_size"}, {"score": 0.0021510617542976674, "phrase": "typical_molecular_dynamics_simulation"}, {"score": 0.0021386805729852664, "phrase": "third_example"}], "paper_keywords": ["Phonon dispersion", " Lattice dynamics", " Molecular dynamics simulation", " Elastic Green's functions"], "paper_abstract": "A method to measure the phonon dispersion of a crystal based on molecular dynamics simulation is proposed and implemented as an extension to an open source classical molecular dynamics simulation code LAMMPS. In the proposed method, the dynamical matrix is constructed by observing the displacements of atoms during molecular dynamics simulation, making use of the fluctuation-dissipation theory. The dynamical matrix can then be employed to compute the phonon spectra by evaluating its eigenvalues. It is found that the proposed method is capable of yielding the phonon dispersion accurately, while taking into account the anharmonic effect on phonons simultaneously. The implementation is done in the style of fix of LAMMPS, which is designed to run in parallel and to exploit the functions provided by LAMMPS; the measured dynamical matrices could be passed to an auxiliary postprocessing code to evaluate the phonons. Program summary Program title: FixPhonon, version 1.0 Catalogue identifier: AEJB_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AEJB_v1_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: GNU General Public license No. of lines in distributed program, including test data, etc.: 105 393 No. of bytes in distributed program, including test data, etc.: 3 231 800 Distribution format: tar.gz Programming language: C++ Computer: All Operating system: Linux Has the code been vectorized or parallelized?: Yes. 1 to N processors may be used RAM: Depends on problem, approximate to 1 kB to several MB Classification: 7.8 External routines: MPI, FIT, LAMMPS version 15, January 2010 (http://lammps.sandia.gov/) Nature of problem: Atoms in solids make ceaseless vibrations about their equilibrium positions, and a collective vibration forms a wave of allowed wavelength and amplitude. The quantum of such lattice vibration is called the phonon, and the so-called \"lattice dynamics\" is the field of study to find the normal modes of these vibrations. In other words, lattice dynamics examines the relationship between the frequencies of phonons and the wave vectors, i.e., the phonon dispersion. The evaluation of the phonon dispersion requires the construction of the dynamical matrix. In atomic scale modeling, the dynamical matrices are usually constructed by deriving the derivatives of the force field employed, which cannot account for the effect of temperature on phonons, with an exception of the tedious \"quasi-harmonic\" procedure. Solution method: We propose here a method to construct the dynamical matrix directly from molecular dynamics simulations, simply by observing the displacements of atoms in the system thus making the constructing of the dynamical matrix a straightforward task. Moreover, the anharmonic effect was taken into account in molecular dynamics simulations naturally, the resultant phonons therefore reflect the finite temperature effect simultaneously. Restrictions: A well defined lattice is necessary to employ the proposed method as well as the implemented code to evaluate the phonon dispersion. In other words, the system under study should be in solid state where atoms vibrate about their equilibrium positions. Besides, no drifting of the lattice is expected. The method is best suited for periodic systems, although non-periodic system with a supercell approach is also possible, it will however become inefficient when the unit cell contains too many atoms. Additional comments: The readers are encouraged to visit http://code.google.com/p/fix-phonon for subsequent update of the code as well as the associated postprocessing code, so as to keep up with the latest version of LAMMPS. Running time: Running time depends on the system size, the numbers of processors used, and the complexity of the force field, like a typical molecular dynamics simulation. For the third example shown in this paper, it took about 2.5 hours on an Intel Xeon X3220 architecture (2.4G, quadcore).", "paper_title": "Phonon dispersion measured directly from molecular dynamics simulations", "paper_id": "WOS:000293486000013"}