{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "video_games"}, {"score": 0.03903762293211749, "phrase": "metadata_schema"}, {"score": 0.0047689174754929195, "phrase": "interactive_media"}, {"score": 0.0047006879240764935, "phrase": "increasing_interest"}, {"score": 0.004480196733208298, "phrase": "current_descriptive_practices"}, {"score": 0.004148631410346188, "phrase": "diverse_user_groups"}, {"score": 0.0037683358267785435, "phrase": "standardized_metadata_schema"}, {"score": 0.0036261282565554507, "phrase": "multiple_approachescollaborative_review"}, {"score": 0.003108814986752103, "phrase": "particular_elements"}, {"score": 0.0029914213495838998, "phrase": "data_description"}, {"score": 0.0029343925814926787, "phrase": "digitally_distributed_games"}, {"score": 0.0028646286762572274, "phrase": "user_studies"}, {"score": 0.0025892330566358503, "phrase": "additional_content"}, {"score": 0.0025644240336018045, "phrase": "networked_features"}, {"score": 0.002443890721386284, "phrase": "evaluation_results"}, {"score": 0.0023743009016047424, "phrase": "new_element_definitions"}, {"score": 0.002340250894008014, "phrase": "revised_schema"}, {"score": 0.0021049977753042253, "phrase": "video_game_metadata"}], "paper_keywords": ["metadata", " user studies", " multimedia"], "paper_abstract": "Despite increasing interest in and acknowledgment of the significance of video games, current descriptive practices are not sufficiently robust to support searching, browsing, and other access behaviors from diverse user groups. To address this issue, the Game Metadata Research Group at the University of Washington Information School, in collaboration with the Seattle Interactive Media Museum, worked to create a standardized metadata schema. This metadata schema was empirically evaluated using multiple approachescollaborative review, schema testing, semi-structured user interview, and a large-scale survey. Reviewing and testing the schema revealed issues and challenges in sourcing the metadata for particular elements, determining the level of granularity for data description, and describing digitally distributed games. The findings from user studies suggest that users value various subject and visual metadata, information about how games are related to each other, and data regarding game expansions/alterations such as additional content and networked features. The metadata schema was extensively revised based on the evaluation results, and we present the new element definitions from the revised schema in this article. This work will serve as a platform and catalyst for advances in the design and use of video game metadata.", "paper_title": "Empirical evaluation of metadata for video games and interactive media", "paper_id": "WOS:000368338400016"}