{"auto_keywords": [{"score": 0.03628726402378378, "phrase": "knowledge-sharing_intentions"}, {"score": 0.015445102115580495, "phrase": "china"}, {"score": 0.014137478719357437, "phrase": "cultural_values"}, {"score": 0.006020561673957471, "phrase": "uncertainty_avoidance"}, {"score": 0.00481495049065317, "phrase": "sharing_intention"}, {"score": 0.004543352284098364, "phrase": "today's_knowledge-based_economy"}, {"score": 0.0044430006374681285, "phrase": "knowledge-sharing_studies"}, {"score": 0.004267896572751978, "phrase": "national_level"}, {"score": 0.00419229472352669, "phrase": "individual_beliefs"}, {"score": 0.004009074013302036, "phrase": "individual_cultural_values"}, {"score": 0.0038510053729959074, "phrase": "cultural_effects"}, {"score": 0.0036335821512795026, "phrase": "integrative_effects"}, {"score": 0.0035851703423654432, "phrase": "individual's_and_country's_cultural_values"}, {"score": 0.003474694300991964, "phrase": "motivational_factors"}, {"score": 0.003397866151093552, "phrase": "social_exchange_theory"}, {"score": 0.0029185025683687634, "phrase": "chinese"}, {"score": 0.0028539179130824786, "phrase": "american_employees"}, {"score": 0.0025518429503461736, "phrase": "important_roles"}, {"score": 0.0025291018422967083, "phrase": "knowledge_sharing"}, {"score": 0.0021049977753042253, "phrase": "knowledge_self-efficacy"}], "paper_keywords": ["knowledge sharing", " social exchange theory", " national culture"], "paper_abstract": "In today's knowledge-based economy, most of the knowledge-sharing studies have investigated the effects of cultural values at the national level. However, individual beliefs and behaviors might also be influenced and modified by individual cultural values. To understand the effects of cultural values, cultural effects at both the individual and country levels should be considered. This study is to investigate the integrative effects of the individual's and country's cultural values on knowledge sharing. We examine motivational factors affecting knowledge-sharing intentions based on social exchange theory and incorporate individualism/collectivism and uncertainty avoidance as moderators. On the basis of a survey of 394 employees conducted in the United States and China, the results show that rewards are significantly related to knowledge-sharing intentions for Chinese employees but not for American employees. Reciprocity and knowledge self-efficacy significantly impact knowledge-sharing intentions in the two countries. Our results also demonstrate that the individual's and country's cultural values play important roles in knowledge sharing. In the United States, individualism/collectivism is found to moderate the relationship between rewards and knowledge-sharing intentions. In China, individualism/collectivism is found to moderate the relationship between reputation and knowledge-sharing intentions, while uncertainty avoidance is found to moderate the relationship between knowledge self-efficacy and knowledge-sharing intentions.", "paper_title": "Knowledge sharing intention in the United States and China: a cross-cultural study", "paper_id": "WOS:000354420800004"}