{"auto_keywords": [{"score": 0.04534393383857731, "phrase": "intelligent_resources"}, {"score": 0.00826234077543045, "phrase": "specified_condition"}, {"score": 0.00481495049065317, "phrase": "meme_media_technologies"}, {"score": 0.004696491408936132, "phrase": "formal_model"}, {"score": 0.004638354165775803, "phrase": "aggregate_ad_hoc_federation"}, {"score": 0.004599994523941615, "phrase": "geographically_distributed_intelligent_resources"}, {"score": 0.004376378707877484, "phrase": "ad_hoc_federation"}, {"score": 0.003863568356785813, "phrase": "overall_federation"}, {"score": 0.003615016816532732, "phrase": "large_sets"}, {"score": 0.0030357976028714557, "phrase": "large_set"}, {"score": 0.0028760125558659907, "phrase": "different_sets"}, {"score": 0.002735972929840289, "phrase": "ad_hoc_aggregate_federation"}, {"score": 0.002668524425703961, "phrase": "meta_relations"}, {"score": 0.0022782315534795516, "phrase": "cartesian_product"}, {"score": 0.002249961956629804, "phrase": "different_resource_sets"}, {"score": 0.0021049977753042253, "phrase": "defined_relation"}], "paper_keywords": [""], "paper_abstract": "This paper proposes a formal model for the aggregate ad hoc federation of geographically distributed intelligent resources accessible through the Web. We already proposed frameworks for one-by-one ad hoc federation of intelligent resources over the Web. They can define interoperation among intelligent resources over the Web as a set of interoperations between two intelligent resources. They allow us to define an overall federation by repetitively combining resources. This paper deals with a case in which we have large sets of intelligent resources accessible through the Web. Each set is assumed to consist of resources of the same type, and to be accessible through the Web in the same way. This paper focuses on how to define and to execute a large set of federations, each of which defines interoperation among resources taken from different sets of resources. Such federation is called aggregate federation. Our new framework for ad hoc aggregate federation will be formalized based on meta relations and their relational expressions, and enables users to flexibly select some resources satisfying a specified condition from each set of resources of the same kind, to define a relation of resources satisfying a specified condition as a subset of the Cartesian product of these different resource sets, and to define and to execute interoperation among resources in each tuple in the defined relation.", "paper_title": "Knowledge federation over the Web based on meme media technologies", "paper_id": "WOS:000236905700010"}