{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "planar_graphs"}, {"score": 0.030237401148615783, "phrase": "flow_relaxation"}, {"score": 0.004674952036988355, "phrase": "maximum_edge-disjoint_paths_problem"}, {"score": 0.003883194688426525, "phrase": "edge-disjoint_paths"}, {"score": 0.003834354624599925, "phrase": "natural_multicommodity_flow_relaxation"}, {"score": 0.003568932067237836, "phrase": "g._motivated"}, {"score": 0.0032387402145603412, "phrase": "c_paths"}, {"score": 0.0029764767329116875, "phrase": "previous_work"}, {"score": 0.002723862897844177, "phrase": "well-linked_subproblems"}, {"score": 0.002503187934017557, "phrase": "alternative_decomposition"}, {"score": 0.0023594164302719635, "phrase": "okamura-seymour"}, {"score": 0.0022051664509486206, "phrase": "single_face"}, {"score": 0.002131857309586904, "phrase": "constant_factor_approximation"}, {"score": 0.0021049977753042253, "phrase": "all-or-nothing_flow_problem"}], "paper_keywords": ["edge-disjoint paths", " planar graphs", " multicommodity flow", " congestion"], "paper_abstract": "We study the maximum edge-disjoint paths problem in undirected planar graphs: given a graph G and node pairs (demands) s(1)t(1), s(2)t(2), ... , s(k)t(k), the goal is to maximize the number of demands that can be connected (routed) by edge-disjoint paths. The natural multicommodity flow relaxation has an Omega(root n) integrality gap, where n is the number of nodes in G. Motivated by this, we consider solutions with small constant congestion c > 1, that is, solutions in which up to c paths are allowed to use an edge (alternatively, each edge has a capacity of c). In previous work we obtained an O(log n) approximation with congestion 2 via the flow relaxation. This was based on a method of decomposing into well-linked subproblems. In this paper we obtain an O(1) approximation with congestion 4. To obtain this improvement we develop an alternative decomposition that is specific to planar graphs. The decomposition produces instances that we call Okamura-Seymour (OS) instances. These have the property that all terminals lie on a single face. Another ingredient we develop is a constant factor approximation for the all-or-nothing flow problem on OS instances via the flow relaxation.", "paper_title": "EDGE-DISJOINT PATHS IN PLANAR GRAPHS WITH CONSTANT CONGESTION", "paper_id": "WOS:000267744400010"}