{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "branch_integration"}, {"score": 0.0047292449487169345, "phrase": "large_applications"}, {"score": 0.004421156723819163, "phrase": "version_control_systems"}, {"score": 0.004041238873048836, "phrase": "program_entities"}, {"score": 0.0037608593980593035, "phrase": "particular_change"}, {"score": 0.003499864176875713, "phrase": "manual_and_tedious_comparison"}, {"score": 0.002543043781904587, "phrase": "integrator's_work"}, {"score": 0.002453116398642071, "phrase": "important_queries"}, {"score": 0.0022218413146898887, "phrase": "development_work"}, {"score": 0.0021920373388760314, "phrase": "open-source_project"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Branch", " Source code changes", " Stream of changes", " Change dependencies", " Merge"], "paper_abstract": "When developing large applications, integrators face the problem of integrating changes between branches or forks. While version control systems provide support for merging changes, this support is mostly text-based, and does not take the program entities into account. Furthermore, there exists no support for assessing which other changes a particular change depends on have to be integrated. Consequently, integrators are left to perform a manual and tedious comparison of the changes within the sequence of their branch and to successfully integrate them. In this paper, we present an approach that analyzes changes within a sequence of changes (stream of changes): such analysis identifies and characterizes dependencies between the changes. The approach identifies changes as autonomous, only used by others, only using other changes, or both. Such a characterization aims at easing the integrator's work. In addition, the approach supports important queries that an integrator otherwise has to perform manually. We applied the approach to a stream of changes representing 5 years of development work on an open-source project and report our experiences. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Supporting streams of changes during branch integration", "paper_id": "WOS:000345180800007"}