{"auto_keywords": [{"score": 0.04891121776613697, "phrase": "capital_markets"}, {"score": 0.011012516325337757, "phrase": "shareholder_wealth"}, {"score": 0.006327258713237582, "phrase": "greater_value_creation"}, {"score": 0.004739874550843914, "phrase": "merger_and_acquisition_integrations"}, {"score": 0.004521566043596533, "phrase": "primary_objective"}, {"score": 0.004468658800386873, "phrase": "negative_reactions"}, {"score": 0.004198560607105165, "phrase": "merged_firm"}, {"score": 0.004133055661437163, "phrase": "standalone_values"}, {"score": 0.004048133389015525, "phrase": "positive_stock_price_reactions"}, {"score": 0.003916098498242888, "phrase": "prior_research"}, {"score": 0.003071965703296204, "phrase": "acquirer's_it_capabilities"}, {"score": 0.0028330357751826934, "phrase": "stock_price"}, {"score": 0.0027513878455384445, "phrase": "industry_relatedness"}, {"score": 0.0027144998108177133, "phrase": "same-industry_acquisition"}, {"score": 0.0026720866990543744, "phrase": "similar_operating_models"}, {"score": 0.0026600905156986317, "phrase": "competitive_dynamics"}, {"score": 0.0026421968781004173, "phrase": "regulatory_context"}, {"score": 0.0026009105281485888, "phrase": "weaker_it_resources"}, {"score": 0.002571814826994953, "phrase": "superior_it_resources"}, {"score": 0.002425670010594346, "phrase": "acquirer's_track_record"}, {"score": 0.0023931384164668835, "phrase": "profitably_growing_acquirer"}, {"score": 0.0023770362063833903, "phrase": "superior_it_capabilities"}, {"score": 0.0023241387549221408, "phrase": "potential_disruption_risks"}, {"score": 0.0022878109064370794, "phrase": "newly_acquired_target"}, {"score": 0.0021049977753042253, "phrase": "acquirer's_shareholders"}], "paper_keywords": ["corporate mergers and acquisitions", " IT integration capability", " performance", " value creation", " event study"], "paper_abstract": "In mergers and acquisitions (M&A), a primary objective of acquirer is to integrate IT resources of the target with its own. IT M&A integration is assumed to create synergies, which in turn increase shareholder wealth by making the value of the merged firm greater than the sum of the standalone values of the two firms. In this study, we challenge this assumption and argue that IT M&A integration does not always lead to greater value creation. Prior research on IT M&A integrations indicates that IT resources are often not scale-free in M&A: that is, they do not transfer easily and costlessly from an acquirer to its target or vice versa. In fact, IT M&A integration can destroy value rather than create it when IT resources are not scale-free. We theorize about the contingencies under which IT M&A integration can create value for shareholders of acquirers. We test our hypotheses in a sample of 549 M&A transactions between 1998 and 2007. We find that, on average, capital markets react negatively with M&A announcements of acquirers whose IT capabilities are superior relative to those of the targets. The superiority of the acquirer's IT capabilities signals that the acquirer is likely to rip and replace IT resources of the target. This IT M&A integration approach increases risks of disruption to target's operations and revenue growth. Capital markets take such risks into account and reduce the stock price of the acquirer. One contingency that reduces the negative reactions of capital markets is industry relatedness of target. In a same-industry acquisition, an acquirer and its target have similar operating models, competitive dynamics, and regulatory context. Thus, ripping and replacing weaker IT resources of the target with superior IT resources of the acquirer creates expectations of more efficient operation, engenders positive stock price reactions, and increases shareholder wealth. Another contingency that reduces the negative reactions of capital markets is the acquirer's track record in profitable growth. A profitably growing acquirer that has superior IT capabilities increases the confidence of capital markets that it can minimize potential disruption risks of IT integration, continue its profitable growth pattern with newly acquired target, engender positive stock price reactions, and create shareholder wealth. These findings indicate that IT M&A integration does not always lead to greater value creation in M&A. The study makes a contribution by identifying the contingencies under which ITM&A integration creates wealth for acquirer's shareholders.", "paper_title": "When IT capabilities are not scale-free in merger and acquisition integrations: how do capital markets react to IT capability asymmetries between acquirer and target?", "paper_id": "WOS:000351859300003"}