{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "antibiotic_therapy"}, {"score": 0.010282334609845347, "phrase": "treatment_history"}, {"score": 0.0055058001693332635, "phrase": "complete_decision_support_system"}, {"score": 0.004518442937844318, "phrase": "complicated_process"}, {"score": 0.0038194503801108324, "phrase": "current_treatment"}, {"score": 0.0035677736570659813, "phrase": "antibiotic_treatments"}, {"score": 0.0034876091188625535, "phrase": "systematic_basis"}, {"score": 0.003424771860049617, "phrase": "antibiotic_treatment"}, {"score": 0.0033175095965171674, "phrase": "stochastic_model"}, {"score": 0.0032429499567088113, "phrase": "causal_probabilistic_network"}, {"score": 0.0032135990914571996, "phrase": "cpn"}, {"score": 0.0030429511467945525, "phrase": "bacteriology_database"}, {"score": 0.003015401937358271, "phrase": "data_on_patient_and_episode_unique_pathogens"}, {"score": 0.002305589818994465, "phrase": "theoretical_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["causal probabilistic networks", " bacterial infections", " antibiotic therapy", " cross-resistance"], "paper_abstract": "Objective: Selection of antibiotic therapy is a complicated process, depending on, among others, the effect of cross-resistance between antibiotics. We propose a model, which incorporates information about treatment history in the form of information on the success or failure of the current treatment and which combines this with data on cross-resistance to predict the susceptibility to future antibiotic treatments, thus providing a systematic basis for revision of antibiotic treatment. Methods and material: The stochastic model was built as a causal probabilistic network (CPN). Data used in the model were based on a bacteriology database including data on patient and episode unique pathogens cultured from a microbiological sample. Results: In this paper, we develop a CPN that can exploit knowledge about cross-resistance between two consecutive treatments, explore the properties of this CPN and consider how the CPN can be integrated into a complete decision support system for selection of antibiotic therapy. Conclusion: The model presented may be useful both as a theoretical tool describing cross-resistance between antibiotics and as a part of complete decision support system for selection of antibiotic therapy. (C) 2007 Elsevier B.V. ALL rights reserved.", "paper_title": "A stochastic model of susceptibility to antibiotic therapy - The effects of cross-resistance and treatment history", "paper_id": "WOS:000246760900005"}