{"auto_keywords": [{"score": 0.049823548738281626, "phrase": "infection_control_guidelines"}, {"score": 0.00481495049065317, "phrase": "user-oriented_communication"}, {"score": 0.004467605250722042, "phrase": "expert-driven_guideline_format"}, {"score": 0.0043496956926564615, "phrase": "existing_guidelines"}, {"score": 0.004291908001030158, "phrase": "practical_information_needs"}, {"score": 0.00426900754050533, "phrase": "health_care_workers"}, {"score": 0.004189809878977535, "phrase": "user-centered_design_process"}, {"score": 0.004112075406940072, "phrase": "initial_study"}, {"score": 0.0038357160878153087, "phrase": "usability_problems"}, {"score": 0.0037948736326503534, "phrase": "poorly_structured_information"}, {"score": 0.003774615159529685, "phrase": "insufficient_quality"}, {"score": 0.0032058978923791078, "phrase": "hcws'_behaviors"}, {"score": 0.0031045097974912138, "phrase": "second_study"}, {"score": 0.003014381456564809, "phrase": "first_study"}, {"score": 0.0029034358982402346, "phrase": "correctly_completed_tasks"}, {"score": 0.0028494995146217754, "phrase": "task_completion"}, {"score": 0.0027446057983474994, "phrase": "paper-based_guidelines"}, {"score": 0.002693611989967953, "phrase": "poor_information_quality"}, {"score": 0.0026720477895635876, "phrase": "mismatch_m_vocabulary"}, {"score": 0.0026223985384227957, "phrase": "structural_problems"}, {"score": 0.0025394168853656893, "phrase": "navigation_structure"}, {"score": 0.0024922258873137093, "phrase": "card_sort"}, {"score": 0.0024459097079751507, "phrase": "standardized_answer_format"}, {"score": 0.0024263237087568464, "phrase": "common_usability_principles"}, {"score": 0.0023621600613813435, "phrase": "development_process"}, {"score": 0.002203146732460841, "phrase": "health_care-associated_infections"}, {"score": 0.002179649733678648, "phrase": "concrete_steps"}, {"score": 0.0021334032621986043, "phrase": "design_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": ["User-centered design", " Usability", " Infectious diseases"], "paper_abstract": "Currently, infection control guidelines in hospitals and other health care institutions are more expert-driven than user-oriented In order to enhance the usability of the expert-driven guideline format, we developed a website for the communication of existing guidelines that better fit the practical information needs of health care workers (HCWs) We employed a user-centered design process that involved two studies In the initial study. 28 HCWs were asked to solve tasks using existing, paper-based infection control guidelines In order to detect their strategies and problems. the participants were asked to think aloud Usability problems occurred due to poorly structured information, insufficient quality of information, and a mismatch between experts' and HCWs' vocabulary To overcome these shortcomings, three design principles were applied for communicating infection control guidelines better navigation (the guidelines should be searchable in several ways). multimodality (the guidelines should not be presented as text only), and action-orientation (the guidelines should be presented as HCWs' behaviors) A website was developed to meet these principles In the second study, the same 28 HCWs completed tasks identical to those of the first study while thinking aloud, but this time using the website The percentage of correctly completed tasks increased and the mean time for task completion decreased significantly Also, respondents were more satisfied with the website than the paper-based guidelines The number of problems due to poor information quality and a mismatch m vocabulary declined. although the number of structural problems increased This can probably be explained by the fact that the navigation structure was user-generated (using Card Sort), in contrast to a standardized answer format based on common usability principles Overall, we found that involving HCWs in the development process is important to create a sense of ownership and to foster the implementation of the guidelines, which might eventually result in compliance and reduce health care-associated infections This paper outlines concrete steps for how to involve HCWs in the design process (C) 2009 Elsevier Ltd All rights reserved", "paper_title": "From expert-driven to user-oriented communication of infection control guidelines", "paper_id": "WOS:000277930900002"}