{"auto_keywords": [{"score": 0.04820189656526341, "phrase": "hiv_integrase"}, {"score": 0.036070228774342114, "phrase": "first_stage"}, {"score": 0.03112309142641145, "phrase": "visual_inspection"}, {"score": 0.00481495049065317, "phrase": "autodock_vina"}, {"score": 0.004776608455951671, "phrase": "common_pharmacophore_engine"}, {"score": 0.0047385702897315436, "phrase": "low_diversity_library"}, {"score": 0.004362738436361684, "phrase": "macromolecular_recognition"}, {"score": 0.004158290806404304, "phrase": "hiv_infections"}, {"score": 0.004125169032596454, "phrase": "olson"}, {"score": 0.004103451021752995, "phrase": "levy"}, {"score": 0.004016594765266821, "phrase": "computational_blind_challenge"}, {"score": 0.003687960013746783, "phrase": "fda._positive_control_cross-docking_experiments"}, {"score": 0.003600456768296912, "phrase": "initial_ensemble"}, {"score": 0.003377097707054532, "phrase": "virtual_screens"}, {"score": 0.0032272929113113203, "phrase": "second_stage"}, {"score": 0.0028089634624677957, "phrase": "free_energy_simulations"}, {"score": 0.0026557696319295904, "phrase": "significantly_lower_amount"}, {"score": 0.002641621667026613, "phrase": "structural_diversity"}, {"score": 0.0025857775575426276, "phrase": "prospective_virtual_screens"}, {"score": 0.0025514745448798363, "phrase": "hit_rates"}, {"score": 0.002405853977978678, "phrase": "second_stage_challenge"}, {"score": 0.002361282057435583, "phrase": "ad_vina"}, {"score": 0.002317533977770783, "phrase": "third_place"}, {"score": 0.002250415129116109, "phrase": "successful_results"}, {"score": 0.0021910825909008946, "phrase": "computational_structure-based_drug_discovery_tools"}, {"score": 0.002105000910244816, "phrase": "nih"}], "paper_keywords": ["Virtual screening", " Ligand docking", " Computational pipeline", " HIV integrase", " Computational drug design", " Docking challenge", " AutoDock Vina"], "paper_abstract": "To rigorously assess the tools and protocols that can be used to understand and predict macromolecular recognition, and to gain more structural insight into three newly discovered allosteric binding sites on a critical drug target involved in the treatment of HIV infections, the Olson and Levy labs collaborated on the SAMPL4 challenge. This computational blind challenge involved predicting protein-ligand binding against the three allosteric sites of HIV integrase (IN), a viral enzyme for which two drugs (that target the active site) have been approved by the FDA. Positive control cross-docking experiments were utilized to select 13 receptor models out of an initial ensemble of 41 different crystal structures of HIV IN. These 13 models of the targets were selected using our new \"Rank Difference Ratio'' metric. The first stage of SAMPL4 involved using virtual screens to identify 62 active, allosteric IN inhibitors out of a set of 321 compounds. The second stage involved predicting the binding site(s) and crystallographic binding mode(s) for 57 of these inhibitors. Our team submitted four entries for the first stage that utilized: (1) AutoDock Vina (AD Vina) plus visual inspection; (2) a new common pharmacophore engine; (3) BEDAM replica exchange free energy simulations, and a Consensus approach that combined the predictions of all three strategies. Even with the SAMPL4's very challenging compound library that displayed a significantly lower amount of structural diversity than most libraries that are conventionally employed in prospective virtual screens, these approaches produced hit rates of 24, 25, 34, and 27 %, respectively, on a set with 19 % declared binders. Our only entry for the second stage challenge was based on the results of AD Vina plus visual inspection, and it ranked third place overall according to several different metrics provided by the SAMPL4 organizers. The successful results displayed by these approaches highlight the utility of the computational structure-based drug discovery tools and strategies that are being developed to advance the goals of the newly created, multi-institution, NIH-funded center called the \"HIV Interaction and Viral Evolution Center''.", "paper_title": "Virtual screening with AutoDock Vina and the common pharmacophore engine of a low diversity library of fragments and hits against the three allosteric sites of HIV integrase: participation in the SAMPL4 protein-ligand binding challenge", "paper_id": "WOS:000337043500009"}