{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "real-coded_genetic_algorithm"}, {"score": 0.047424185998726213, "phrase": "convergence_speed"}, {"score": 0.0453665111651286, "phrase": "real-coded_elitist_non-dominated_sorting_genetic_algorithm"}, {"score": 0.03084930029050414, "phrase": "new_operator"}, {"score": 0.004515967518891287, "phrase": "binary-coded_elitist_non-dominated_sorting_genetic_algorithm"}, {"score": 0.003846926701870193, "phrase": "latter_suits"}, {"score": 0.0037924666577694222, "phrase": "real_nature"}, {"score": 0.00335950642866031, "phrase": "simulated_binary_jumping_gene"}, {"score": 0.0033001333942688778, "phrase": "present_study"}, {"score": 0.003218764138744059, "phrase": "existing_jumping_gene_operators"}, {"score": 0.002975826686621829, "phrase": "binary_version"}, {"score": 0.002654730366598922, "phrase": "newly_developed_operator"}, {"score": 0.0026264601495742295, "phrase": "significant_increase"}, {"score": 0.0022608057001451414, "phrase": "faster_convergence"}, {"score": 0.0022447206386952126, "phrase": "real-life_multi-objective_optimization_problems"}, {"score": 0.0021893168527276088, "phrase": "industrial_problem"}, {"score": 0.002173739308244513, "phrase": "multiobjective_optimization"}, {"score": 0.002150580119047236, "phrase": "dynamic_steam_reformer"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Evolution", " Genetic algorithm", " Multiobjective optimization", " Jumping gene", " Real-coded algorithm", " Steam reformer"], "paper_abstract": "The concept of jumping gene from biology has become quite popular for increasing the convergence speed of binary-coded elitist non-dominated sorting genetic algorithm. This inspired several researchers to implement this concept in real-coded elitist non-dominated sorting genetic algorithm which is free from limitations of binary coding. However, these implementations have achieved only a limited success. This is primarily due to their focus on mimicking the procedure instead of simulating its effect whereas the latter suits more to the real nature of variables as simulated forms of the crossover and the mutation operations are commonly used in real-coded genetic algorithm. In order to address this shortcoming, a new jumping gene operator, namely, simulated binary jumping gene is developed in the present study. For this, a detailed qualitative analysis of all existing jumping gene operators is performed. Unlike other real-coded jumping gene operators, the new operator simulates the concept of jumping gene closely to that used in the binary version. The efficacy of the new operator is then tested quantitatively using well-known indicators of generational distance, hyper-volume ratio and spacing over thirty-seven challenging multiobjective optimization problems from the literature. The results obtained with the inclusion of newly developed operator show a significant increase in convergence speed of real-coded elitist non-dominated sorting genetic algorithm, particularly for the restricted number of generations. Also, the performance of the algorithm with the new operator is found to be better than that with other existing real-coded jumping gene operators. The effectiveness of the new operator in achieving faster convergence for real-life multi-objective optimization problems is further established by solving the industrial problem of multiobjective optimization of a dynamic steam reformer. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Simulated binary jumping gene: A step towards enhancing the performance of real-coded genetic algorithm", "paper_id": "WOS:000362380600027"}