{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "additional_citations"}, {"score": 0.017611567858810108, "phrase": "rank_order"}, {"score": 0.017166022197973904, "phrase": "jcr_groups"}, {"score": 0.00471193241675062, "phrase": "journal_citation_report_categories"}, {"score": 0.004611108249179507, "phrase": "new_approach"}, {"score": 0.004454237726525018, "phrase": "jcr_categories"}, {"score": 0.004049709080817396, "phrase": "journal_impact_factor"}, {"score": 0.003945879572348638, "phrase": "large_set"}, {"score": 0.0038115548814680873, "phrase": "jif"}, {"score": 0.003303956524762543, "phrase": "thomson-reuters"}, {"score": 0.0024820711838337713, "phrase": "internal_structure"}, {"score": 0.0021049977753042253, "phrase": "small_increases"}], "paper_keywords": ["Journal impact factor", " Journal citation report", " Citations", " Journal rankings"], "paper_abstract": "We use a new approach to study the ranking of journals in JCR categories. The objectives of this study were to empirically evaluate the effect of increases in citations on the computation of the journal impact factor (JIF) for a large set of journals as measured by changes in JIF, and to ascertain the influence of additional citations on the rank order of journals according their new JIFs within JCR groups. To do so, modified JIFs were computed by adding additional citations to the number used by Thomson-Reuters to compute the JIF of journals listed in the JCR for 2008. We considered the effect on rank order of a given journal of adding 1, 2, 3 or more citations to the number used to compute the JIF, keeping everything else equal (i.e., without changing the JIF of other journals in a given group). The effect of additional citations on the internal structure of rankings in JCR groups increased with the number of citations added. In about one third of JCR groups, about half the journals changed their rank order when 1-5 citations were added. However, in general the rank order tended to be relatively stable after small increases in citations.", "paper_title": "The effect of additional citations in the stability of Journal Citation Report categories", "paper_id": "WOS:000330622600020"}