{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "sentential_context"}, {"score": 0.004630755876583033, "phrase": "obvious_place"}, {"score": 0.004549366134876482, "phrase": "automatic_discovery"}, {"score": 0.004104621766670225, "phrase": "individual_words"}, {"score": 0.004061160863655662, "phrase": "overall_emotion"}, {"score": 0.0036900720643677034, "phrase": "neutral_sentence"}, {"score": 0.0035867530188337933, "phrase": "emotional_word"}, {"score": 0.00346164863873186, "phrase": "different_emotion_classes"}, {"score": 0.0033172506969692626, "phrase": "prior_and_contextual_emotion"}, {"score": 0.0030354183220734064, "phrase": "contextual_emotion"}, {"score": 0.0029714103096967225, "phrase": "syntactic_structure"}, {"score": 0.0028677070439412427, "phrase": "emotion_classes"}, {"score": 0.002777463594061196, "phrase": "different_feature_sets"}, {"score": 0.0027577972695911825, "phrase": "multiple_classification_methods"}, {"score": 0.0026805109390121706, "phrase": "promising_learning_method"}, {"score": 0.0021503823972534096, "phrase": "best_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sentiment analysis", " Polarity", " Emotion", " Prior emotion", " Contextual emotion", " Syntactic features", " Natural language processing", " Machine learning"], "paper_abstract": "A set of words labeled with their prior emotion is an obvious place to start on the automatic discovery of the emotion of a sentence, but it is clear that context must also be considered. It may be that no simple function of the labels on the individual words captures the overall emotion of the sentence; words are interrelated and they mutually influence their affect-related interpretation. It happens quite often that a word which invokes emotion appears in a neutral sentence, or that a sentence with no emotional word carries an emotion. This could also happen among different emotion classes. The goal of this work is to distinguish automatically between prior and contextual emotion, with a focus on exploring features important in this task. We present a set of features which enable us to take the contextual emotion of a word and the syntactic structure of the sentence into account to put sentences into emotion classes. The evaluation includes assessing the performance of different feature sets across multiple classification methods. We show the features and a promising learning method which significantly outperforms two reasonable baselines. We group our features by the similarity of their nature. That is why another facet of our evaluation is to consider each group of the features separately and investigate how well they contribute to the result. The experiments show that all features contribute to the result, but it is the combination of all the features that gives the best performance. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Prior and contextual emotion of words in sentential context", "paper_id": "WOS:000326257500006"}