{"auto_keywords": [{"score": 0.04980688610255404, "phrase": "research_groups"}, {"score": 0.013234457156970986, "phrase": "lower-performance_groups"}, {"score": 0.012938706641363732, "phrase": "top-performance_groups"}, {"score": 0.008303320692029896, "phrase": "top-performance_and_lower-performance_groups"}, {"score": 0.005721696164281573, "phrase": "basic_network"}, {"score": 0.00481495049065317, "phrase": "bibliometric_statistical_properties"}, {"score": 0.004483909657713567, "phrase": "bibliometric_characteristics"}, {"score": 0.00438283914152565, "phrase": "intriguing_differences"}, {"score": 0.004223415145617665, "phrase": "latter_differences"}, {"score": 0.0041517954514423625, "phrase": "research_management_strategies"}, {"score": 0.00401216440036853, "phrase": "larger_size-dependent_cumulative_advantage"}, {"score": 0.0038661711901934043, "phrase": "larger_groups"}, {"score": 0.003736110068915636, "phrase": "not-cited_publications"}, {"score": 0.003641433168173135, "phrase": "simple_model"}, {"score": 0.0035796471115594553, "phrase": "microlevel_lead"}, {"score": 0.0035491469311213, "phrase": "observed_phenomena"}, {"score": 0.0034297140422566577, "phrase": "novel_concept"}, {"score": 0.0034102016621879927, "phrase": "hierarchically_layered_networks"}, {"score": 0.00308610073274614, "phrase": "cumulative_size_advantage"}, {"score": 0.003016442355995592, "phrase": "preferential_attachment"}, {"score": 0.002965229277927781, "phrase": "highly_connected_nodes"}, {"score": 0.002706383680762465, "phrase": "research_group_network"}, {"score": 0.0023936956017015696, "phrase": "size-dependent_mechanism"}, {"score": 0.0023530305476484807, "phrase": "quite_common_characteristic"}, {"score": 0.002339629270626007, "phrase": "complex_networks"}, {"score": 0.0022479284902217006, "phrase": "performance-related_differences"}, {"score": 0.0021170579470073305, "phrase": "entire_range"}, {"score": 0.0021049977753042253, "phrase": "journal_impact"}], "paper_keywords": [""], "paper_abstract": "In this article we distinguish between top-performance and lower-performance groups in the analysis of statistical properties of bibliometric characteristics of two large sets of research groups. We find intriguing differences between top-performance and lower-performance groups, and between the two sets of research groups. These latter differences may indicate the influence of research management strategies. We report the following two main observations: First, lower-performance groups have a larger size-dependent cumulative advantage for receiving citations than top-performance groups. Second, regardless of performance, larger groups have fewer not-cited publications. Particularly for the lower-performance groups, the fraction of not-cited publications decreases considerably with size. We introduce a simple model in which processes at the microlevel lead to the observed phenomena at the macrolevel. Next, we fit our findings into the novel concept of hierarchically layered networks. In this concept, which provides the \"infrastructure\" for the model, a network of research groups constitutes a layer of one hierarchical step higher than the basic network of publications connected by citations. The cumulative size advantage of citations received by a group resembles preferential attachment in the basic network in which highly connected nodes (publications) increase their connectivity faster than less connected nodes. But in our study it is size that causes an advantage. In general, the larger a group (node in the research group network), the more incoming links this group acquires in a nonlinear, cumulative way. Nevertheless, top-performance groups are about an order of magnitude more efficient in creating linkages (i.e., receiving citations) than lower-performance groups. This implies that together with the size-dependent mechanism, preferential attachment, a quite common characteristic of complex networks, also works. Finally, in the framework of this study on performance-related differences of bibliometric properties of research groups, we also find that top-performance groups are, on average, more successful in the entire range of journal impact.", "paper_title": "Performance-related differences of bibliometric statistical properties of research groups: Cumulative advantages and hierarchically layered networks", "paper_id": "WOS:000246285500006"}