{"auto_keywords": [{"score": 0.0403276584543565, "phrase": "combined_minutiae_template"}, {"score": 0.00481495049065317, "phrase": "privacy_protection"}, {"score": 0.004699916946246509, "phrase": "novel_system"}, {"score": 0.00464343008299973, "phrase": "fingerprint_privacy"}, {"score": 0.0045324756541157574, "phrase": "new_identity"}, {"score": 0.004266501496765747, "phrase": "minutiae_positions"}, {"score": 0.003920049436883885, "phrase": "extracted_information"}, {"score": 0.003431384878608803, "phrase": "two-stage_fingerprint_matching_process"}, {"score": 0.0032038465090068646, "phrase": "complete_minutiae_feature"}, {"score": 0.003165283275312972, "phrase": "single_fingerprint"}, {"score": 0.0027816546451972725, "phrase": "original_minutiae_templates"}, {"score": 0.0027041233221381756, "phrase": "existing_fingerprint_reconstruction_approach"}, {"score": 0.0025761937402886954, "phrase": "alike_combined_fingerprint"}, {"score": 0.002524688179363081, "phrase": "new_virtual_identity"}, {"score": 0.0024052270356036743, "phrase": "minutiae-based_finger-print_matching_algorithms"}, {"score": 0.0021917966722180132, "phrase": "state-of-the-art_technique"}, {"score": 0.0021049977753042253, "phrase": "better_new_virtual_identity"}], "paper_keywords": ["Combination", " fingerprint", " minutiae", " privacy", " protection"], "paper_abstract": "We propose here a novel system for protecting fingerprint privacy by combining two different fingerprints into a new identity. In the enrollment, two fingerprints are captured from two different fingers. We extract the minutiae positions from one fingerprint, the orientation from the other fingerprint, and the reference points from both fingerprints. Based on this extracted information and our proposed coding strategies, a combined minutiae template is generated and stored in a database. In the authentication, the system requires two query fingerprints from the same two fingers which are used in the enrollment. A two-stage fingerprint matching process is proposed for matching the two query fingerprints against a combined minutiae template. By storing the combined minutiae template, the complete minutiae feature of a single fingerprint will not be compromised when the database is stolen. Furthermore, because of the similarity in topology, it is difficult for the attacker to distinguish a combined minutiae template from the original minutiae templates. With the help of an existing fingerprint reconstruction approach, we are able to convert the combined minutiae template into a real-look alike combined fingerprint. Thus, a new virtual identity is created for the two different fingerprints, which can be matched using minutiae-based finger-print matching algorithms. The experimental results show that our system can achieve a very low error rate with FRR = 0.4% at FAR = 0.1%. Compared with the state-of-the-art technique, our work has the advantage in creating a better new virtual identity when the two different fingerprints are randomly chosen.", "paper_title": "Fingerprint Combination for Privacy Protection", "paper_id": "WOS:000318596100008"}