{"auto_keywords": [{"score": 0.04775244230872765, "phrase": "rtvp"}, {"score": 0.008713768692145006, "phrase": "response_time_variability_problem"}, {"score": 0.008391617604943502, "phrase": "psychoclonal_algorithm"}, {"score": 0.004696608876994947, "phrase": "psychoclonal_approach"}, {"score": 0.004490842671590769, "phrase": "combinatorial_scheduling_problem"}, {"score": 0.004209369306023422, "phrase": "wide_range"}, {"score": 0.004167653403322565, "phrase": "real_life_applications"}, {"score": 0.004024863549087511, "phrase": "hard_real-time_systems"}, {"score": 0.00392586404888927, "phrase": "network_environments"}, {"score": 0.0033306180744375616, "phrase": "necessary_resources"}, {"score": 0.0031372369299648203, "phrase": "heuristic_techniques"}, {"score": 0.0029995904128330276, "phrase": "grasp"}, {"score": 0.0027284410545226306, "phrase": "non-small_instances"}, {"score": 0.002687922713487696, "phrase": "rtvp."}, {"score": 0.002444883254621769, "phrase": "maslow's_hierarchy"}, {"score": 0.002136747803494932, "phrase": "proposed_psychoclonal_algorithm"}], "paper_keywords": ["Response time variability", " Fair sequences", " Scheduling", " Psychoclonal algorithm", " Clonal selection", " Metaheuristics"], "paper_abstract": "The response time variability problem (RTVP) is a combinatorial scheduling problem that has recently appeared in the literature. This problem has a wide range of real life applications in fields such as manufacturing, hard real-time systems, operating systems and network environments. Originally, the RTVP occurs whenever products, clients or jobs need to be sequenced in such a way that the variability in the time between the instants at which they receive the necessary resources is minimized. Since the RTVP is hard to solve, heuristic techniques are needed for solving it. Three metaheuristic-multi-start, GRASP and PSO-algorithms proposed for solving the RTVP in two previous studies have been the most efficient to date in solving non-small instances of the RTVP. We propose solving the RTVP by means of a psychoclonal algorithm based approach. The psychoclonal algorithm inherits its attributes from Maslow's hierarchy of needs theory and the artificial immune system (AIS) approach, specifically the clonal selection principle. In this paper, we compare the proposed psychoclonal algorithm with the three aforementioned metaheuristic algorithms and show that, on average, the psychoclonal algorithm strongly improves on the results obtained.", "paper_title": "Solving the response time variability problem by means of a psychoclonal approach", "paper_id": "WOS:000276908400006"}