{"auto_keywords": [{"score": 0.04601284855430019, "phrase": "coding_scheme"}, {"score": 0.014582669432104114, "phrase": "noiseless_feedback"}, {"score": 0.00481495049065317, "phrase": "unknown_channel"}, {"score": 0.004674952036988355, "phrase": "exact_expression"}, {"score": 0.0046161999598320486, "phrase": "reliability_function"}, {"score": 0.0045581828632009795, "phrase": "discrete_memoryless_channel"}, {"score": 0.003834354624599925, "phrase": "family_q"}, {"score": 0.0036450381529042103, "phrase": "burnashev's_exponent"}, {"score": 0.0035539019235553897, "phrase": "nontrivial_rate"}, {"score": 0.0030657684627749364, "phrase": "feedback_coding_strategy"}, {"score": 0.002758597251689795, "phrase": "corresponding_burnashev's_exponent"}, {"score": 0.0026112013707473938, "phrase": "error_probability"}, {"score": 0.0024926348205500715, "phrase": "feedback_code_design"}, {"score": 0.002450864311898833, "phrase": "blind_schemes"}, {"score": 0.0023794391656001466, "phrase": "best_coding_scheme"}, {"score": 0.002242758902593467, "phrase": "converse_result"}], "paper_keywords": ["Burnashev's exponent", " error exponent", " feedback", " universal channel coding", " variable-length coding"], "paper_abstract": "Burnashev in 1976 gave an exact expression for the reliability function of a discrete memoryless channel (DMC) with noiseless feedback. A coding scheme that achieves this exponent needs, in general, to know the statistics of the channel. Suppose now that the coding scheme is designed knowing only that the channel belongs to a family Q of DMCs. Is there a coding scheme with noiseless feedback that achieves Burnashev's exponent uniformly over Q at a nontrivial rate? We answer the question in the affirmative for two families of channels (binary symmetric, and Z). For these families we show that, for any given fraction, there is a feedback coding strategy such that for any member of the family: i) guarantees this fraction of its capacity as rate, and ii) guarantees the corresponding Burnashev's exponent. Therefore, for these families, in terms of delay and error probability, the knowledge of the channel becomes asymptotically irrelevant in feedback code design: there are blind schemes that perform as well as the best coding scheme designed with the foreknowledge of the channel under use. However, a converse result shows that, in general, even for families that consist of only two channels, such blind schemes do not exist.", "paper_title": "Variable length coding over an unknown channel", "paper_id": "WOS:000237147400021"}