{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "information_production_processes"}, {"score": 0.03399585439608465, "phrase": "lotkaian_system"}, {"score": 0.004318881178805575, "phrase": "general_transformation_function"}, {"score": 0.004046020290832207, "phrase": "fellman-jakobsson_transformation"}, {"score": 0.0037903327482565097, "phrase": "dual_informetric_theory"}, {"score": 0.003728966994353039, "phrase": "double_transformation"}, {"score": 0.0036288825833675127, "phrase": "rank-frequency_function"}, {"score": 0.0034554281349858836, "phrase": "new_size-frequency_function"}, {"score": 0.003344407169522133, "phrase": "power_law_transformations"}, {"score": 0.0030487828775502563, "phrase": "new_lotka_exponent"}, {"score": 0.00295078850927459, "phrase": "new_exponent"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["evolution", " IPP", " information production process", " Lotka", " Zipf", " network"], "paper_abstract": "Evolution of information production processes (IPPs) can be described by a general transformation function for the sources and for the items. It generalises the Fellman-Jakobsson transformation which only works on the items. In this paper the dual informetric theory of this double transformation, defined by the rank-frequency function, is described by, e.g. determining the new size-frequency function. The special case of power law transformations is studied thereby showing that a Lotkaian system is transformed into another Lotkaian system, described by a new Lotka exponent. We prove that the new exponent is smaller (larger) than the original one if and only if the change in the sources is smaller (larger) than that of the items. Applications to the study of the evolution of networks are given, including cases of deletion of nodes and/or links but also applications to other fields are given. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "General evolutionary theory of information production processes and applications to the evolution of networks", "paper_id": "WOS:000253644900002"}