{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "example-driven_synthesis_approach"}, {"score": 0.004652963867892925, "phrase": "target_character"}, {"score": 0.004178351419209898, "phrase": "corresponding_portions"}, {"score": 0.003978866233891427, "phrase": "affine_matrix"}, {"score": 0.0036256123915754303, "phrase": "corresponding_parts"}, {"score": 0.0034020946201397057, "phrase": "new_research_contributions"}, {"score": 0.0028106505443369545, "phrase": "source_animations"}, {"score": 0.0024028135317872, "phrase": "full_angel_animation_video"}, {"score": 0.002333193766510394, "phrase": "dolphin_animations"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["sketch", " animation", " deformations", " mean value coordinates", " interactive animating tools"], "paper_abstract": "In this paper, we propose an example-driven synthesis approach to create 3D animation of a target character. Our approach consists of the following steps: (a) a sketch-based mapping between parts of the sources and corresponding portions of the target; (b) calculating the affine matrix of the source mesh for each vertex; W deforming the target based on the deformations of the corresponding parts of the sources by means of mean value coordinates. We provide new research contributions on all these topics and integrate them into our newly developed prototype animating system. Our approach is general and does not require the sources and target to share the same number of vertices or triangles, or to have matching connectivity. In our system, source animations can be any 3D animations and the target can even be unstructured or point cloud. Our approach is intuitive and is able to produce highly authentic 3D animations. We demonstrate our approach by constructing a full angel animation video from parts of kid and dolphin animations. Other animating examples produced from our prototype system are also given in the paper to illustrate our approach. Copyright (c) 2007 John Wiley & Sons, Ltd.", "paper_title": "Animating by example", "paper_id": "WOS:000250211000004"}