{"auto_keywords": [{"score": 0.04174666335988992, "phrase": "cpoe_system"}, {"score": 0.010534149596101248, "phrase": "nurse-physician_collaboration"}, {"score": 0.010417862261524134, "phrase": "medication_process"}, {"score": 0.007111454310603852, "phrase": "paper-based_system"}, {"score": 0.00523449261793863, "phrase": "nurses'_attitudes"}, {"score": 0.00481495049065317, "phrase": "computerized_physician_order_entry_system"}, {"score": 0.004403480614319231, "phrase": "recent_studies"}, {"score": 0.003696390664266446, "phrase": "erasmus_medical_centre"}, {"score": 0.0034437574674180365, "phrase": "former_paper-based_system"}, {"score": 0.0030225753906647935, "phrase": "response_rates"}, {"score": 0.0029889584492584073, "phrase": "analyzed_questions"}, {"score": 0.00295571428544335, "phrase": "pre-_and_post-implementation_questionnaires"}, {"score": 0.002784540221128404, "phrase": "mixed_impact"}, {"score": 0.002763850622950247, "phrase": "medication_work"}, {"score": 0.0027026971435126553, "phrase": "main_non-supportive_features"}, {"score": 0.002499094513009327, "phrase": "supportive_features"}, {"score": 0.0024529174827030787, "phrase": "non-supportive_features"}, {"score": 0.002398627220761343, "phrase": "synchronisation_and_feedback_mechanisms"}, {"score": 0.0023807981747706376, "phrase": "nurse-physician_collaborations"}, {"score": 0.0022096205841489786, "phrase": "affected_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "impaired_mechanisms"}], "paper_keywords": ["Collaboration", " CPOE", " Interoperability", " Patient safety", " Evaluation", " Communication", " Medication system", " Medication order entry system"], "paper_abstract": "Background: Due to their efficiency and safety potential, computerized physician order entry (CPOE) systems are gaining considerable attention in in-patient settings. However, recent studies have shown that these systems may undermine the efficiency and safety of the medication process by impeding nurse-physician collaboration. Objective: To evaluate the effects of a CPOE system on the mechanisms whereby nurses and physicians maintain their collaboration in the medication process. Setting and methodology: Six internal medicine wards at the Erasmus Medical Centre were included in this study. A questionnaire was used to record nurses' attitudes towards the effectiveness of the former paper-based system. A similar questionnaire was used to evaluate nurses' attitudes with respect to a CPOE system that replaced the paper-based system. The data were complemented and triangulated through interviews with physicians and nurses. Results: Response rates for the analyzed questions in the pre- and post-implementation questionnaires were 54.3% (76/140) and 52.14% (73/140). The CPOE system had a mixed impact on medication work: while it improved the main non-supportive features of the paper-based system, it lacked its main supportive features. The inter-views revealed more detailed supportive and non-supportive features of the two systems. A comparison of supportive features of the paper-based system with non-supportive features of the CPOE system showed that synchronisation and feedback mechanisms in nurse-physician collaborations have been impaired after the CPOE system was introduced, Conclusion: This study contributes to an understanding of the affected mechanisms in nurse-physician collaboration using a CPOE system. It provides recommendations for repairing the impaired mechanisms and for redesigning the CPOE system and thus for better supporting these structures. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Impact of a computerized physician order entry system on nurse-physician collaboration in the medication process", "paper_id": "WOS:000260238000003"}