{"auto_keywords": [{"score": 0.04924143139933198, "phrase": "subjective_value"}, {"score": 0.040179907029343674, "phrase": "wta-wtp_ratio"}, {"score": 0.015719716506582538, "phrase": "source_nature"}, {"score": 0.004361645961515043, "phrase": "wtp"}, {"score": 0.0038953958723049287, "phrase": "exclusive_original"}, {"score": 0.003773449694108617, "phrase": "animated_computer_simulation"}, {"score": 0.0037336520904376687, "phrase": "business_game"}, {"score": 0.0031176485976102688, "phrase": "endowment_effect_theory"}, {"score": 0.0028437313714204087, "phrase": "private_goods"}, {"score": 0.002793874145713024, "phrase": "intuitively_expected_unity"}, {"score": 0.002764379205581817, "phrase": "wta-wtp_ratios"}, {"score": 0.0026214978443388653, "phrase": "\"original\"_form"}, {"score": 0.002259426425685763, "phrase": "copy_information"}, {"score": 0.0021654633404434623, "phrase": "original_information"}, {"score": 0.0021199543519570376, "phrase": "online_trading"}, {"score": 0.0021049977753042253, "phrase": "online_sharing"}], "paper_keywords": [""], "paper_abstract": "This is an empirical, experimental investigation of the value of information, as perceived through the willingness to purchase information (WTP) and the willingness to sell it (accept payment, WTA). We examined the effects of source nature: expertise versus content, and source status: copy versus exclusive original of information on the WTA-WTP ratio. In an animated computer simulation of a business game, players could maximize their profits by making choices regarding inventory and prices. Participants were offered the chance to bid for buying or selling information regarding the weather that may affect demand. We find, as hypothesized, that the subjective value of information does indeed follow the predictions of endowment effect theory. The ratio of willingness to accept to willingness to purchase (WTA-WTP) recorded for the 294 subjects resembles the ratio common for private goods, rather than the intuitively expected unity. The WTA-WTP ratios diverged from unity more often and in a more pronounced manner for information traded in the \"original\" form rather than as a copy of the original, although even for copies the WTA-WTP ratio is still double. The results yield a value of about three for the WTA-WTP ratio for original information whether the source is content or expertise. Copy information received a subjective value that was significantly different (lower) than original information. The implications for both online trading and online sharing of information are discussed.", "paper_title": "The effect of source nature and status on the subjective value of information", "paper_id": "WOS:000234932600004"}