{"auto_keywords": [{"score": 0.03629822367331735, "phrase": "foucauldian_discourse_analysis"}, {"score": 0.00810506190414094, "phrase": "phenomenological_analysis"}, {"score": 0.00481495049065317, "phrase": "discourse_analysis"}, {"score": 0.004715976515113203, "phrase": "purpose_-_the_purpose"}, {"score": 0.004349955692802962, "phrase": "iconic_taxonomic_designation"}, {"score": 0.004134508282135594, "phrase": "particular_way"}, {"score": 0.004058826900076531, "phrase": "search_engine"}, {"score": 0.0035911304319927754, "phrase": "phenomenological_discourse_analysis"}, {"score": 0.003541689414992537, "phrase": "authors_can_components"}, {"score": 0.003525360267068501, "phrase": "eidetic_bracketing"}, {"score": 0.0035010071030752883, "phrase": "husserlian"}, {"score": 0.003468796799802612, "phrase": "noetic_reduction"}, {"score": 0.0033044757952469593, "phrase": "alternative_explanations"}, {"score": 0.003289236723188792, "phrase": "empirical_evidence"}, {"score": 0.0031918759137610523, "phrase": "iconic_\"authorship"}, {"score": 0.003118942369691329, "phrase": "findings_-_an_\"author"}, {"score": 0.00309023627455429, "phrase": "iconic_name"}, {"score": 0.0029849147334986424, "phrase": "public_discourse"}, {"score": 0.002850032622120692, "phrase": "cultural_sublimation"}, {"score": 0.002823794505493987, "phrase": "power_broker"}, {"score": 0.0027086722644157598, "phrase": "intellectual_content"}, {"score": 0.0026899455459275575, "phrase": "published_work"}, {"score": 0.0026713479499731324, "phrase": "library_catalog's_attribution"}, {"score": 0.002610277190191563, "phrase": "foucauldian_discursive_comprehension"}, {"score": 0.0025271105810644253, "phrase": "main_assets"}, {"score": 0.0023144575093047084, "phrase": "named_authorial_entities"}, {"score": 0.0022563011263787847, "phrase": "lived_experience"}, {"score": 0.002174303033371869, "phrase": "combined_way"}, {"score": 0.0021492935956059283, "phrase": "new_aspects"}, {"score": 0.0021147618956483556, "phrase": "search_engines"}, {"score": 0.0021049977753042253, "phrase": "library_catalogs"}], "paper_keywords": ["Search engines", " Catalogues", " Epistemology", " Postmodernism"], "paper_abstract": "Purpose - The purpose of this paper is to discuss and shed light on the following questions: What is an author? Is it a person who writes? Or, is it, in information, an iconic taxonomic designation (some might say a \"classification\") for a group of writings that are recognized by the public in some particular way? What does it mean when a search engine, or catalog, asks a user to enter the name of an author? And how does that accord with the manner in which the data have been entered in association with the names of the entities identified with the concept of authorship? Design/methodology/approach - The authors use several cases as bases of phenomenological discourse analysis, combining as best the authors can components of eidetic bracketing (a Husserlian technique for isolating noetic reduction) with Foucauldian discourse analysis. The two approaches are not sympathetic or together cogent, so the authors present them instead as alternative explanations alongside empirical evidence. In this way the authors are able to isolate components of iconic \"authorship\" and then subsequently engage them in discourse. Findings - An \"author\" is an iconic name associated with a class of works. An \"author\" is a role in public discourse between a set of works and the culture that consumes them. An \"author\" is a role in cultural sublimation, or a power broker in deabstemiation. An \"author\" is last, if ever, a person responsible for the intellectual content of a published work. The library catalog's attribution of \"author\" is at odds with the Foucauldian discursive comprehension of the role of an \"author.\" Originality/value - One of the main assets of this paper is the combination of Foucauldian discourse analysis with phenomenological analysis for the study of the \"author.\" The authors turned to Foucauldian discourse analysis to discover the loci of power in the interactions of the public with the named authorial entities. The authors also looked to phenomenological analysis to consider the lived experience of users who encounter the same named authorial entities. The study of the \"author\" in this combined way facilitated the revelation of new aspects of the role of authorship in search engines and library catalogs.", "paper_title": "What is an author now? Discourse analysis applied to the idea of an author", "paper_id": "WOS:000369171000012"}