{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "referential-uncooperative_situation"}, {"score": 0.015042865581990068, "phrase": "bilevel_decision_problem"}, {"score": 0.014761647623557366, "phrase": "leader's_decision"}, {"score": 0.00443308765153716, "phrase": "upper_level"}, {"score": 0.004159997145421619, "phrase": "lower_level"}, {"score": 0.004081385289516914, "phrase": "multiple_followers"}, {"score": 0.0033084729942065142, "phrase": "popular_situations"}, {"score": 0.003026391655379905, "phrase": "cross_reference"}, {"score": 0.002988101395789399, "phrase": "decision_information"}, {"score": 0.0028037753646260937, "phrase": "well-known_branch"}, {"score": 0.0026307897899760383, "phrase": "one-leader-and-one-follower_linear_bilevel_decision_problem"}, {"score": 0.0023758843175179702, "phrase": "linear_referential_uncooperative_bilevel_multi-follower_decision_model"}, {"score": 0.0021049977753042253, "phrase": "illustrative_examples"}], "paper_keywords": ["linear bilevel programming", " branch and bound algorithm", " optimization", " multi-followers"], "paper_abstract": "Within the framework of any bilevel decision problem, a leader's decision at the upper level is influenced by the reaction of their follower at the lower level. When multiple followers are involved in a bilevel decision problem, the leader's decision will not only be affected by the reactions of those followers, but also by the relationships among those followers. One of the popular situations within this framework is where these followers are uncooperatively making decisions while having cross reference of decision information, called a referential-uncooperative situation in this paper. The well-known branch and bound algorithm has been successfully applied to a one-leader-and-one-follower linear bilevel decision problem. This paper extends this algorithm to deal with the above mentioned linear bilevel multi-follower decision problem by means of a linear referential uncooperative bilevel multi-follower decision model. It then proposes an extended branch and bound algorithm to solve this problem with a set of illustrative examples in a referential-uncooperative situation.", "paper_title": "An extended branch and bound algorithm for bilevel multi-follower decision making in a referential-uncooperative situation", "paper_id": "WOS:000250926500010"}