{"auto_keywords": [{"score": 0.047617154407647785, "phrase": "transformational_play"}, {"score": 0.004751889650408546, "phrase": "game-based_curriculum"}, {"score": 0.0046079260641779755, "phrase": "theoretical_articulation"}, {"score": 0.004201571673071299, "phrase": "educational_content"}, {"score": 0.003916098498242888, "phrase": "play_space"}, {"score": 0.0036179751816682454, "phrase": "theoretical_ideas"}, {"score": 0.00308788133472785, "phrase": "persuasive_writing"}, {"score": 0.002941913249957503, "phrase": "significant_learning_gains"}, {"score": 0.002802825862847951, "phrase": "game-based_classroom"}, {"score": 0.002717750004930131, "phrase": "game-based_unit"}, {"score": 0.002693919110230191, "phrase": "significantly_higher_levels"}, {"score": 0.0026352496813713292, "phrase": "different_goals"}, {"score": 0.002488604965680912, "phrase": "quantitative_and_qualitative_results"}, {"score": 0.002248816575548875, "phrase": "game_design_methodologies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Videogames", " Play theory", " Learning environments", " Educational technology", " Persuasive writing"], "paper_abstract": "Grounded in our work on designing game-based curriculum, this paper begins with a theoretical articulation of transformational play. Students who play transformationally become protagonists who use the knowledge, skills, and concepts of the educational content to first make sense of a situation and then make choices that actually transform the play space and themselves they are able to see how that space changed because of their own efforts. Grounding these theoretical ideas, in this manuscript we describe one curriculum design informed by this theory. We also describe a study of the same teacher who was observed teaching two different curricula (game-based versus story-based) about persuasive writing. Results showed that while students in both classes demonstrated significant learning gains, the gains were significantly greater for students in the game-based classroom. Additionally, students assigned the game-based unit reported significantly higher levels of engagement, had different goals motivating their participation, and received fewer teacher reprimands to stay on task. Both quantitative and qualitative results are interpreted in terms of the theory of transformational play, which guided the design. Implications in terms of the power of game design methodologies for schools as well as learning theory more generally are discussed. Published by Elsevier Ltd.", "paper_title": "Game-based curriculum and transformational play: Designing to meaningfully positioning person, content, and context", "paper_id": "WOS:000298524300045"}