{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multirate_anypath_routing"}, {"score": 0.015547084727554788, "phrase": "wireless_multihop_networks"}, {"score": 0.004528156929805637, "phrase": "new_routing_paradigm"}, {"score": 0.00445293569103488, "phrase": "opportunistic_routing"}, {"score": 0.004072275820209647, "phrase": "selected_transmission_rate"}, {"score": 0.0030967107893195246, "phrase": "transmission_rate"}, {"score": 0.0027690086059100495, "phrase": "proposed_algorithms"}, {"score": 0.0027382040767844093, "phrase": "roughly_the_same_running_time"}, {"score": 0.002707741309851526, "phrase": "regular_shortest-path_algorithms"}, {"score": 0.0025892330566358503, "phrase": "routing_protocols"}, {"score": 0.0022013916728990564, "phrase": "best_case"}], "paper_keywords": ["Anypath routing", " multirate", " opportunistic routing", " routing algorithms", " wireless multihop networks"], "paper_abstract": "In this paper, we present a new routing paradigm that generalizes opportunistic routing for wireless multihop networks. In multirate anypath routing, each node uses both a set of next-hops and a selected transmission rate to reach a destination. Using this rate, a packet is broadcast to the nodes in the set, and one of them forwards the packet on to the destination. To date, there is no theory capable of jointly optimizing both the set of next-hops and the transmission rate used by each node. We solve this by introducing two polynomial-time routing algorithms and provide the proof of their optimality. The proposed algorithms have roughly the same running time as regular shortest-path algorithms and are therefore suitable for deployment in routing protocols. We conducted measurements in an 802.11b testbed network, and our trace-driven analysis shows that multirate anypath routing is on average 80% better than 11-Mbps anypath routing, with a factor of 6.4 improvement in the best case. If the rate is fixed at 1 Mbps instead, performance improves by a factor of 5.4 on average.", "paper_title": "Polynomial-Time Algorithms for Multirate Anypath Routing in Wireless Multihop Networks", "paper_id": "WOS:000305583700009"}