{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "buffer_allocation_problem"}, {"score": 0.01554385724354337, "phrase": "ann"}, {"score": 0.010566730230778016, "phrase": "reliable_production_lines"}, {"score": 0.006250179105955416, "phrase": "production_lines"}, {"score": 0.0053824533808411335, "phrase": "bapann"}, {"score": 0.004742416895495626, "phrase": "major_design_problems"}, {"score": 0.004691273968935458, "phrase": "manufacturing_systems"}, {"score": 0.00466085208934021, "phrase": "well-known_buffer_allocation_problem"}, {"score": 0.004511663118269957, "phrase": "space_requirements"}, {"score": 0.004482400730101345, "phrase": "production_floor"}, {"score": 0.004395742407834023, "phrase": "decoupling_impact"}, {"score": 0.004292088804111491, "phrase": "production_line_designers"}, {"score": 0.004118751115632515, "phrase": "large_production_lines"}, {"score": 0.0038927977266524543, "phrase": "bap"}, {"score": 0.0037517752294252494, "phrase": "operational_level"}, {"score": 0.0036712117267198342, "phrase": "strategic_level"}, {"score": 0.0036001794190746814, "phrase": "preliminary_results"}, {"score": 0.0035152193164443473, "phrase": "optimal_solution"}, {"score": 0.0034923971323840433, "phrase": "specific_search_algorithm"}, {"score": 0.0031466922346569293, "phrase": "production_line"}, {"score": 0.0031059504195562284, "phrase": "decision_support_system"}, {"score": 0.003012919635505122, "phrase": "user_friendly_format"}, {"score": 0.002967451330258819, "phrase": "large_number"}, {"score": 0.0029417772734240196, "phrase": "test_data"}, {"score": 0.0028848175372707843, "phrase": "extensive_experiments"}, {"score": 0.0027862576750944277, "phrase": "myopic_algorithm"}, {"score": 0.0027561518399614716, "phrase": "search_algorithm"}, {"score": 0.002679386232765167, "phrase": "test_sets"}, {"score": 0.002650432086717502, "phrase": "average_accuracy"}, {"score": 0.0023982749733789882, "phrase": "bapann's_functionalities"}, {"score": 0.002351813899450668, "phrase": "illustrative_scenarios"}, {"score": 0.0023162992352421564, "phrase": "proposed_method"}, {"score": 0.0022862842794715934, "phrase": "required_cpu_time"}, {"score": 0.0022468671200629024, "phrase": "production_line_designer"}, {"score": 0.0021937733197480397, "phrase": "balanced_reliable_production_lines"}, {"score": 0.002160640052461594, "phrase": "convenient_fashion"}, {"score": 0.002132637840285576, "phrase": "tedious_and_complex_mathematical_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["The buffer allocation problem", " Production lines", " Decision support system", " Artificial neural networks"], "paper_abstract": "One of the major design problems in the context of manufacturing systems is the well-known Buffer Allocation Problem (BAP). This problem arises from the cost involved in terms of space requirements on the production floor and the need to keep in mind the decoupling impact of buffers in increasing the throughput of the line. Production line designers often need to solve the Buffer Allocation Problem (BAP), but this can be difficult, especially for large production lines, because the task is currently highly time consuming. Designers would be interested in a tool that would rapidly provide the solution to the BAP, even if only a near optimal solution is found, especially when they have to make their decisions at an operational level (e.g. hours). For decisions at a strategic level (e.g. years), such a tool would provide preliminary results that would be useful, before attempting to find the optimal solution with a specific search algorithm. The aim of this study is to create such a tool. More specifically, an Artificial Neural Network (ANN) based decision support system is developed to assist production line designers in making decisions concerning the Buffer Allocation Problem (BAP) in reliable production lines. The aim of the ANN is to predict the performance of the production line based on its characteristics. The decision support system has been designed to allow for these data to be outputted in a user friendly format. To develop such an ANN, a large number of training and test data is required. To collect these data, extensive experiments were performed on a carefully chosen set of production lines. Because of its speed, the myopic algorithm was used as the search algorithm for the experiments. The performance of the ANN is examined for test sets of production lines and an average accuracy close to 99% is found. The performance of the ANN is compared with that of other well established surface fitting methods and its superiority is confirmed. Based on the results from (a) the experiments and (b) the developed ANN, a decision support system, called BAPANN, is designed and implemented. BAPANN's functionalities and capabilities are demonstrated via the use of illustrative scenarios, showing the effectiveness of the proposed method measured in terms of the required CPU time. In summary, BAPANN provides the production line designer with a powerful, efficient and accurate tool to make decisions on the buffer allocation problem for balanced reliable production lines. This is done in a convenient fashion without involving the designer in tedious and complex mathematical analysis. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "An artificial neural network based decision support system for solving the buffer allocation problem in reliable production lines", "paper_id": "WOS:000328234000050"}