{"auto_keywords": [{"score": 0.044340662163821175, "phrase": "traditional_back-pressure_algorithm"}, {"score": 0.005285531365888058, "phrase": "traffic_load"}, {"score": 0.00481495049065317, "phrase": "pressure-type_algorithms"}, {"score": 0.0047015581134516055, "phrase": "tassiulas"}, {"score": 0.004664353877617358, "phrase": "ephremides"}, {"score": 0.00446490613141384, "phrase": "multihop_wireless_networks"}, {"score": 0.004325208730208653, "phrase": "significant_weakness"}, {"score": 0.004156691746581458, "phrase": "feasible_paths"}, {"score": 0.004010624853427534, "phrase": "extensive_exploration"}, {"score": 0.0037634608487353183, "phrase": "light_or_moderate_loads"}, {"score": 0.0036601552758254757, "phrase": "unnecessarily_long_routes"}, {"score": 0.0034895911869254146, "phrase": "end-to-end_delay"}, {"score": 0.003287482882222731, "phrase": "network_stability"}, {"score": 0.0031217859267564344, "phrase": "optimal_routes"}, {"score": 0.0030847461428168614, "phrase": "shortest-path_information"}, {"score": 0.0030239842475439814, "phrase": "average_path_lengths"}, {"score": 0.0027594936602962075, "phrase": "first_decreases"}, {"score": 0.002662393295121998, "phrase": "network_load"}, {"score": 0.0025892330566358503, "phrase": "surprising_low-load_behavior"}, {"score": 0.0023069016803337365, "phrase": "proposed_algorithm"}, {"score": 0.0021905197289213973, "phrase": "long_paths"}], "paper_keywords": ["Back-pressure routing", " delay reduction", " shortest-path routing", " throughput-optimal"], "paper_abstract": "Back-pressure-type algorithms based on the algorithm by Tassiulas and Ephremides have recently received much attention for jointly routing and scheduling over multihop wireless networks. However, this approach has a significant weakness in routing because the traditional back-pressure algorithm explores and exploits all feasible paths between each source and destination. While this extensive exploration is essential in order to maintain stability when the network is heavily loaded, under light or moderate loads, packets may be sent over unnecessarily long routes, and the algorithm could be very inefficient in terms of end-to-end delay and routing convergence times. This paper proposes a new routing/scheduling back-pressure algorithm that not only guarantees network stability (throughput optimality), but also adaptively selects a set of optimal routes based on shortest-path information in order to minimize average path lengths between each source and destination pair. Our results indicate that under the traditional back-pressure algorithm, the end-to-end packet delay first decreases and then increases as a function of the network load (arrival rate). This surprising low-load behavior is explained due to the fact that the traditional back-pressure algorithm exploits all paths (including very long ones) even when the traffic load is light. On the other-hand, the proposed algorithm adaptively selects a set of routes according to the traffic load so that long paths are used only when necessary, thus resulting in much smaller end-to-end packet delays as compared to the traditional back-pressure algorithm.", "paper_title": "On Combining Shortest-Path and Back-Pressure Routing Over Multihop Wireless Networks", "paper_id": "WOS:000291682000018"}