{"auto_keywords": [{"score": 0.0456315961504987, "phrase": "mobile_devices"}, {"score": 0.01063334282779827, "phrase": "cyber_foraging"}, {"score": 0.0048189640602846915, "phrase": "survey"}, {"score": 0.00476323161560059, "phrase": "taxonomy_of_cyber_foraging_of_mobile_devices"}, {"score": 0.004661446705304497, "phrase": "ever-increasing_advancement"}, {"score": 0.004611369021812453, "phrase": "mobile_device_technology"}, {"score": 0.004072573194988867, "phrase": "powerful_non-mobile_computers"}, {"score": 0.0038375280115736958, "phrase": "lower_performance"}, {"score": 0.003796267885124202, "phrase": "traditional_less-constrained_and_non-mobile_computers"}, {"score": 0.0032806521851034766, "phrase": "performance_disparity"}, {"score": 0.0031759067385562553, "phrase": "non-mobile_computers"}, {"score": 0.0025857324180891526, "phrase": "resource-constrained_mobile_devices"}, {"score": 0.0024231382864800173, "phrase": "existing_cyber_foraging_approaches"}, {"score": 0.0021394674440767124, "phrase": "migration_support"}], "paper_keywords": ["Cyber Foraging", " Mobile Devices", " Resource-Constrained Computing", " Taxonomy"], "paper_abstract": "With the ever-increasing advancement of mobile device technology and their pervasive usage, users expect to run their applications on mobile devices and get the same performance as if they used to run their applications on powerful non-mobile computers. There is a challenge though in that mobile devices deliver lower performance than traditional less-constrained and non-mobile computers because they are constrained by weight, size, and mobility in spite of all their advancements in recent years. One of the most common solutions that has ameliorated this performance disparity is cyber foraging, wherein nearby non-mobile computers called surrogates are utilized to run the whole or parts of applications on behalf of mobile devices. In this paper, we present a survey of cyber foraging as a solution to resolve the challenges of computing on resource-constrained mobile devices. We also explain the most notable cyber foraging systems and present a categorization of existing cyber foraging approaches considering their type of dynamicity, granularity, metrics used, surrogate types and scale, location of their decision maker unit, remoteness of execution, migration support, and their overheads.", "paper_title": "A Survey and Taxonomy of Cyber Foraging of Mobile Devices", "paper_id": "WOS:000315392500016"}