{"auto_keywords": [{"score": 0.0448143060594691, "phrase": "consensus_process"}, {"score": 0.00481495049065317, "phrase": "incomplete_preferences"}, {"score": 0.004726382602809228, "phrase": "high_level"}, {"score": 0.004554082077300675, "phrase": "group_decision"}, {"score": 0.004388035083357706, "phrase": "moderator_task"}, {"score": 0.003712362078915926, "phrase": "implemented_web"}, {"score": 0.003054009753601139, "phrase": "incomplete_preference_relations"}, {"score": 0.0027188259793109264, "phrase": "group_consensus_level"}, {"score": 0.0026687115458522326, "phrase": "individual_consistency"}, {"score": 0.002607362103727335, "phrase": "consistency_measures"}, {"score": 0.002523828967909659, "phrase": "uninorm_operators"}, {"score": 0.0023427844897844093, "phrase": "web_interface"}, {"score": 0.0022889103976458437, "phrase": "distributed_consensus_processes"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Consensus", " Group decision making", " Incomplete preference relations", " Multi-granular linguistic preferences", " Web"], "paper_abstract": "Reaching a high level of consensus among experts is critical in group decision making problems Usually, it is the moderator task to assure that the consensus process is carried out properly and. if possible, to offer recommendations to the expert in order to change their opinions and narrow their differences. In this paper we present an implemented web based consensus support system that is able to help, or even replace, the moderator in a consensus process where experts are allowed to provide their preferences using one of many types (fuzzy, linguistic and multi-granular linguistic) of incomplete preference relations. This system is based on both consistency and consensus measures and it has been designed to provide advice to the experts to increase group consensus level while maintaining the individual consistency of each expert The consistency measures are characterized by and computed using uninorm operators When appropriate, the system also helps experts to reduce the incompleteness of their preference relations The web interface allows to carry out distributed consensus processes and thus, experts do not necessarily need to physically meet together. (C) 2010 Elsevier Inc All rights reserved", "paper_title": "A web based consensus support system for group decision making problems and incomplete preferences", "paper_id": "WOS:000283389800002"}