{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "abstract_argumentation"}, {"score": 0.040523767794461374, "phrase": "acceptability_semantics"}, {"score": 0.004322967486451877, "phrase": "global_decision"}, {"score": 0.00374399358035391, "phrase": "recursive_definition"}, {"score": 0.00368673793612343, "phrase": "global_assignment"}, {"score": 0.0036303546926971966, "phrase": "acceptable_and_non-acceptable_subsets"}, {"score": 0.003378385493203297, "phrase": "generally_accepted_intuition"}, {"score": 0.002910545717767559, "phrase": "challenging_argument"}, {"score": 0.002559444836360178, "phrase": "earlier_studies"}, {"score": 0.002494466951433885, "phrase": "logic_programming"}, {"score": 0.0022973933270056743, "phrase": "model_semantics"}, {"score": 0.002193447487477984, "phrase": "recursively_defined_argumentation_semantics"}, {"score": 0.0021049977753042253, "phrase": "standard_semantics"}], "paper_keywords": ["Argumentation", " computational logic", " artificial intelligence"], "paper_abstract": "Arguments need to be judged against other arguments. The decision to accept or reject an argument is generally a global decision that involves examining the same question for other arguments that oppose or can defend the argument in question. This article presents the acceptability semantics for abstract argumentation that through a recursive definition gives a global assignment of the acceptable and non-acceptable subsets of arguments. This semantics stems from the aim to formalize directly the generally accepted intuition that: 'An argument can be accepted if and only if all its challenging arguments can be rejected.' The acceptability semantics tightly integrates the notion of defending against a challenging argument by counter-attacking it with the notion of self-defeating (or self-rejecting) arguments that (help to) bring about their own non-acceptability. The proposal is motivated by earlier studies of the semantics of Logic Programming (LP) in terms of argumentation, where the basic well founded and stable model semantics of LP can be uniformly captured using a recursively defined argumentation semantics for Negation as Failure and where these standard semantics of LP can be further extended through argumentation.", "paper_title": "On the semantics of abstract argumentation", "paper_id": "WOS:000325170500003"}