{"auto_keywords": [{"score": 0.029597415979366777, "phrase": "cbr"}, {"score": 0.00481495049065317, "phrase": "large_mobile_ad_hoc_networks"}, {"score": 0.0046834372388970405, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.0046404988337040804, "phrase": "manets"}, {"score": 0.004513631630494221, "phrase": "prior_knowledge"}, {"score": 0.004211594861013822, "phrase": "asynchrony_properties"}, {"score": 0.0031918759137610523, "phrase": "performance_decline"}, {"score": 0.0031045562469735307, "phrase": "network_increases"}, {"score": 0.0025923493454729097, "phrase": "df"}, {"score": 0.0025329623864528317, "phrase": "inter-cluster_communication"}, {"score": 0.0022878396720586044, "phrase": "performance_evaluation_results"}, {"score": 0.0022149235007885826, "phrase": "system_performance"}, {"score": 0.002174303033371869, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Mobile ad hoc networks", " Publish/subscribe system"], "paper_abstract": "Since nodes that compose mobile ad hoc networks (MANETs) does not have any prior knowledge about other nodes in many cases, the publish/Subscribe communication paradigm that has the decoupling and asynchrony properties can be useful to share information between nodes. Existing publish/subscribe services for MANETs can be categorized into document flooding (DF), destination-based routing (DBR), and content-based routing (CBR). Although those approaches may work well when the size of network is small, all of them suffer from the performance decline as the size of the network increases. In this paper, we compare those approaches, and then propose a scalable publish/subscribe communication scheme in large MANETs by combining DF and CBR hierarchically. Our approach is to cluster all nodes in networks and to exploit CBR and DF for the intra- and inter-cluster communication, respectively. By using this approach, we can effectively utilize benefits of both approaches. Then, we present performance evaluation results which validate Our idea with respect to system performance and scalability. Crown Copyright (C) 2009 Published by Elsevier Inc. All rights reserved.", "paper_title": "A scalable publish/subscribe system for large mobile ad hoc networks", "paper_id": "WOS:000268518800008"}