{"auto_keywords": [{"score": 0.04880364979195164, "phrase": "pso"}, {"score": 0.03803821204435122, "phrase": "pso-mam"}, {"score": 0.026755252309098698, "phrase": "apso-mam"}, {"score": 0.00481495049065317, "phrase": "multiple_adaptive_methods"}, {"score": 0.004737579882204798, "phrase": "swarm_optimization"}, {"score": 0.004252469672259375, "phrase": "intelligent_augmented_particle_swarm_optimization"}, {"score": 0.0038375280115736958, "phrase": "diverse_functions"}, {"score": 0.003158776195052182, "phrase": "parameter_control_mechanism"}, {"score": 0.0029602552900111407, "phrase": "pso-mam."}, {"score": 0.002928399649340438, "phrase": "new_method"}, {"score": 0.002127915423138391, "phrase": "compared_pso_algorithms"}, {"score": 0.0021049977753042253, "phrase": "evolutionary_algorithms"}], "paper_keywords": ["Adaptive", " cauchy mutation", " nonuniform mutation", " parameter control", " particle swarm optimization (PSO)", " subgradient"], "paper_abstract": "Particle swarm optimization (PSO) has attracted much attention and has been applied to many scientific and engineering applications in the last decade. Most recently, an intelligent augmented particle swarm optimization with multiple adaptive methods (PSO-MAM) was proposed and was demonstrated to be effective for diverse functions. However, inherited from PSO, the performance of PSO-MAM heavily depends on the settings of three parameters: the two learning factors and the inertia weight. In this paper, we propose a parameter control mechanism to adaptively change the parameters and thus improve the robustness of PSO-MAM. A new method, adaptive PSO-MAM (APSO-MAM) is developed that is expected to be more robust than PSO-MAM. We comprehensively evaluate the performance of APSO-MAM by comparing it with PSO-MAM and several state-of-the-art PSO algorithms and evolutionary algorithms. The proposed parameter control method is also compared with several existing parameter control methods. The experimental results demonstrate that APSO-MAM outperforms the compared PSO algorithms and evolutionary algorithms, and is more robust than PSO-MAM.", "paper_title": "An Adaptive Particle Swarm Optimization With Multiple Adaptive Methods", "paper_id": "WOS:000325392900006"}