{"auto_keywords": [{"score": 0.047445251470313525, "phrase": "planar_surface"}, {"score": 0.011383067154304701, "phrase": "manufacturing_bias"}, {"score": 0.011023642720618508, "phrase": "geometric_bias"}, {"score": 0.00959862715942641, "phrase": "gaussian"}, {"score": 0.004816301850482534, "phrase": "orientation"}, {"score": 0.004725096507471105, "phrase": "frequency_distributions"}, {"score": 0.004636911517556731, "phrase": "new_mathematical_model"}, {"score": 0.004587257596576765, "phrase": "geometric_variations"}, {"score": 0.004489532034272497, "phrase": "probabilistic_representations"}, {"score": 0.004346816400239166, "phrase": "multidimensional_variations"}, {"score": 0.004163531538667519, "phrase": "geometric_tolerances"}, {"score": 0.004107848907565576, "phrase": "new_model"}, {"score": 0.003087305801054765, "phrase": "mating_envelope"}, {"score": 0.0030295940341691203, "phrase": "frequency_distribution"}, {"score": 0.0028244964420118587, "phrase": "orientation_variations"}, {"score": 0.0026689945874011807, "phrase": "asme_standard"}, {"score": 0.0024748609903955656, "phrase": "six_standard_deviations"}, {"score": 0.002239766348597362, "phrase": "rectangular_faces"}, {"score": 0.0021335895626854538, "phrase": "convex_plane-segment"}, {"score": 0.0021049977753042253, "phrase": "target_face"}], "paper_keywords": [""], "paper_abstract": "A new mathematical model for representing the geometric variations of a planar surface is extended to include probabilistic representations for a 1D dimension of interest, which can be determined from multidimensional variations of the planar surface on a part. The model is compatible with the ASME/ANSI/ISO Standards for geometric tolerances. Central to the new model is a Tolerance-Map (R) (T-Map (R)) (Patent No. 6963824), a hypothetical volume of points that models the 3D variations in location and orientation of a feature, which can arise from tolerances on size, position, orientation, and form. The 3D variations of a planar surface are decomposed into manufacturing bias, i.e., toward certain regions of a Tolerance-Map, and into geometric bias that can be computed from the geometry of T-Maps. The geometric bias arises from the shape of the feature, the tolerance-zone, and the control used on the mating envelope. Influence of manufacturing bias on the frequency distribution of 1D dimension of interest is demonstrated with two examples: the multidimensional truncated Gaussian distribution and the uniform distribution. In this paper, form and orientation variations are incorporated as subsets in order to model the coupling between size and form variations, as permitted by the ASME Standard when the amounts of these variations differ. Two distributions for flatness, i.e., the uniform distribution and the Gaussian distribution that has been truncated symmetrically to six standard deviations, are used as examples to illustrate the influence of form on the dimension of interest. The influence of orientation (parallelism and perpendicularity) refinement on the frequency distribution for the dimension of interest is demonstrated. Although rectangular faces are utilized in this paper to illustrate the method, the same techniques may be applied to any convex plane-segment that serves as a target face. [DOI: 10.1115/1.3503881]", "paper_title": "Effects of Size, Orientation, and Form Tolerances on the Frequency Distributions of Clearance Between Two Planar Faces", "paper_id": "WOS:000289117400002"}