{"auto_keywords": [{"score": 0.03287949428434952, "phrase": "proposed_algorithm"}, {"score": 0.01331157044867632, "phrase": "equality_constraints"}, {"score": 0.004016072233242585, "phrase": "mixed_variables"}, {"score": 0.00344062888674746, "phrase": "pso_algorithm"}, {"score": 0.0033045378860812403, "phrase": "mixed-integer_non-linear_programming"}, {"score": 0.0031738126998349775, "phrase": "discrete_variables"}, {"score": 0.002888488567436329, "phrase": "continuous_and_discrete_variables"}, {"score": 0.002664375650349975, "phrase": "non-convex_minlp_problems"}, {"score": 0.0024576084154573396, "phrase": "test_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["mixed-integer non-linear programming (MINLP)", " particle swarm optimization (PSO)", " equality constraint"], "paper_abstract": "An improved particle swarm optimization (PSO) algorithm was developed for solving non-convex NLP/MINLP problem with equality and/or inequality constraints. The problem is transformed into with no equality constraints after mixed variables are partitioned and reduced variables for optimization are identified through analyzing and tearing equality constraints. The transformation is implicitly implemented in the PSO algorithm. In addition. for mixed-integer non-linear programming (MINLP) problems, discrete variables in the proposed algorithm are updated independently according to a given criterion instead of updating continuous and discrete variables simultaneously. Thus, the proposed algorithm is able to solve the non-convex MINLP problems. Several NLP/MINLP problems including three process synthesis problems are performed. For the test problems, the proposed algorithm demonstrates its advantages in applicability and efficiency for solving non-convex NLP/MINLP problems with equality and/or inequality constraints. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "An improved PSO algorithm for solving non-convex NLP/MINLP problems with equality constraints", "paper_id": "WOS:000243811900007"}