{"auto_keywords": [{"score": 0.04182833290656605, "phrase": "processor_cycles"}, {"score": 0.037349556578438504, "phrase": "web_applications"}, {"score": 0.00481495049065317, "phrase": "bandwidth_improvements"}, {"score": 0.00470325458481566, "phrase": "enhanced_network_interfaces"}, {"score": 0.004529881123652277, "phrase": "high_communication_throughputs"}, {"score": 0.004281678802569817, "phrase": "network_links"}, {"score": 0.003916098498242888, "phrase": "communication_tasks"}, {"score": 0.0034984340449789745, "phrase": "network_interface"}, {"score": 0.00257708070026329, "phrase": "distributed_network_interface"}, {"score": 0.002291089893848235, "phrase": "web_servers"}, {"score": 0.0022168460543913787, "phrase": "relevant_conclusions"}, {"score": 0.0021551222226685648, "phrase": "different_approaches"}, {"score": 0.0021049977753042253, "phrase": "high-performance_network_interfaces"}], "paper_keywords": ["Dynamic and static web servers", " Full-system simulation", " Multicore and multiprocessor nodes", " Network interface", " Offloading", " Onloading", " Web server evaluation"], "paper_abstract": "Markets nowadays demand applications that require high communication throughputs to reach their adequate levels of performance. Although the bandwidth of the network links has increased allowing multiple gigabits per second, taking advantage of these links accounts for a high communication overhead, and thus a lot of processor cycles are used for communication tasks, diminishing the processor cycles that remain available for the application. In this paper, we evaluate the performance in web applications of a network interface that as it is distributed among the processors currently available in the node takes advantage of both the hardware (multiprocessor nodes and multicore architectures, as well as programmable network interface cards) and software elements present in the system, thus improving not only the effective communication throughputs and latencies, but also the capacity of the nodes to satisfy the requirements of the applications. Here, the usefulness of this distributed network interface to improve the performance of either static or dynamic web servers is shown. The ubiquity and the different computation/communication rates that can be found in web applications make the analysis of web servers interesting, as it could provide relevant conclusions about the efficiency of the different approaches to the design of high-performance network interfaces.", "paper_title": "Leveraging bandwidth improvements to web servers through enhanced network interfaces", "paper_id": "WOS:000322326800004"}