{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "general_documents"}, {"score": 0.047627337436909195, "phrase": "title_extraction"}, {"score": 0.00634204672343037, "phrase": "powerpoint"}, {"score": 0.004781357546476652, "phrase": "machine_learning"}, {"score": 0.004259582098193949, "phrase": "specific_genres"}, {"score": 0.004185632403886255, "phrase": "book_chapters"}, {"score": 0.004156411748278609, "phrase": "technical_papers"}, {"score": 0.0038887521594153608, "phrase": "research_papers"}, {"score": 0.003702581068329137, "phrase": "automatic_title_extraction"}, {"score": 0.003625537203803235, "phrase": "case_study"}, {"score": 0.0033919477901198716, "phrase": "sample_documents"}, {"score": 0.0033564619316337634, "phrase": "word_and_powerpoint"}, {"score": 0.003263631515158206, "phrase": "training_data"}, {"score": 0.003240826566478551, "phrase": "train_machine_learning_models"}, {"score": 0.003162252895465901, "phrase": "trained_models"}, {"score": 0.003010757286626405, "phrase": "font_size"}, {"score": 0.002866498582226632, "phrase": "formatting_information"}, {"score": 0.002826562521633885, "phrase": "quite_accurate_extraction"}, {"score": 0.002729287488046052, "phrase": "word"}, {"score": 0.0024912073108138613, "phrase": "intranet_data"}, {"score": 0.002149799391146313, "phrase": "search_ranking_results"}, {"score": 0.0021347607855562102, "phrase": "document_retrieval"}, {"score": 0.0021049977753042253, "phrase": "extracted_titles"}], "paper_keywords": ["information extraction", " metadata extraction", " machine learning", " search"], "paper_abstract": "In this paper, we propose a machine learning approach to title extraction from general documents. By general documents, we mean documents that can belong to any one of a number of specific genres, including presentations, book chapters, technical papers, brochures, reports, and letters. Previously, methods have been proposed mainly for title extraction from research papers. It has not been clear whether it could be possible to conduct automatic title extraction from general documents. As a case study, we consider extraction from Office including Word and PowerPoint. In our approach, we annotate titles in sample documents (for Word and PowerPoint, respectively) and take them as training data, train machine learning models, and perform title extraction using the trained models. Our method is unique in that we mainly utilize formatting information such as font size as features in the models. It turns out that the use of formatting information can lead to quite accurate extraction from general documents. Precision and recall for title extraction from Word are 0.810 and 0.837, respectively, and precision and recall for title extraction from PowerPoint are 0.875 and 0.895, respectively in an experiment on intranet data. Other important new findings in this work include that we can train models in one domain and apply them to other domains, and more surprisingly we can even train models in one language and apply them to other languages. Moreover, we can significantly improve search ranking results in document retrieval by using the extracted titles. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic extraction of titles from general documents using machine learning", "paper_id": "WOS:000238550100011"}