{"auto_keywords": [{"score": 0.048153996910559355, "phrase": "cloud_computing"}, {"score": 0.00481495049065317, "phrase": "enterprise_cloud_computing"}, {"score": 0.0045143706249204905, "phrase": "increasingly_prevalent_topic"}, {"score": 0.004332894955218135, "phrase": "hitherto_internal_it_data"}, {"score": 0.00408617426304956, "phrase": "wide_range"}, {"score": 0.003742084495435749, "phrase": "potential_risks"}, {"score": 0.0036126731589251906, "phrase": "cloud_computing_adoption"}, {"score": 0.002924694271730544, "phrase": "cloud_based_solutions"}, {"score": 0.002339771435910601, "phrase": "current_legal_and_technical_complexity"}, {"score": 0.0021049977753042253, "phrase": "user_companies"}], "paper_keywords": ["Enterprise cloud computing", " risks", " risk management", " legal", " technical", " data security"], "paper_abstract": "Cloud computing has become an increasingly prevalent topic in recent years. However, migrating hitherto internal IT data and applications to the cloud is associated with a wide range of risks and challenges. The study reported in this paper aims to explore potential risks that organisations may encounter during cloud computing adoption, as well as to assess and prioritise these risks, from the perspective of IT practitioners and consultants. A questionnaire was designed and distributed to a group of 295 highly experienced IT professionals involved in developing and implementing cloud based solutions, of which 39 (13.2%) responses were collected and analysed. The findings identified a set of 39 cloud computing risks, which concentrated around diverse operational, organisational, technical, and legal areas. The most critical top 10 risks perceived by IT experts were found to be caused by current legal and technical complexity and deficiencies associated with cloud computing, as well as by a lack of preparation and planning of user companies.", "paper_title": "RISKS IN ENTERPRISE CLOUD COMPUTING: THE PERSPECTIVE OF IT EXPERTS", "paper_id": "WOS:000332130900005"}