{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "competitive_neural_networks"}, {"score": 0.004738325072560588, "phrase": "mixed_time-varying_delays"}, {"score": 0.004338076511024884, "phrase": "global_stability"}, {"score": 0.004134137523409649, "phrase": "novel_class"}, {"score": 0.004003511299646736, "phrase": "mixed_time_delays"}, {"score": 0.003939748053452577, "phrase": "discontinuous_activations"}, {"score": 0.0037244390953401533, "phrase": "activation_functions"}, {"score": 0.003549245218355768, "phrase": "sufficient_conditions"}, {"score": 0.002209060366991921, "phrase": "theoretical_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Competitive neural networks", " Mixed time-varying delays", " Discontinuous activation", " Global exponential stability", " Convergence in finite time"], "paper_abstract": "In this paper, the global stability has been investigated for a novel class of competitive neural networks with mixed time delays and discontinuous activations. Without presuming the boundedness of activation functions, we draw two set of sufficient conditions ensuring the existence, uniqueness of the equilibrium, global exponential asymptotic stability of the solution and the associated output of the solution converging to the output equilibrium point in measure, by linear matrix inequality, M-matrix, Leray-Schauder alternative theorem in multivalued analysis, general Lyapunov method, topological degree theory of set-valued map. Meanwhile, we present a result on the global convergence in finite time of given neural networks. The results in the literature are generalized and significantly improved. Finally, one example and simulations are presented to demonstrate the effectiveness of the theoretical results. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Global stability analysis of competitive neural networks with mixed time-varying delays and discontinuous neuron activations", "paper_id": "WOS:000349572600010"}