{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "godel"}, {"score": 0.0044800522651664695, "phrase": "godel's_incompleteness_theorems"}, {"score": 0.004076858589744185, "phrase": "conventional_number_theory"}, {"score": 0.0033015555065209865, "phrase": "present_paper"}, {"score": 0.003088702479841264, "phrase": "godel's_results"}, {"score": 0.003004103583782076, "phrase": "recursion_theory"}, {"score": 0.002873524721802591, "phrase": "apparent_paradox"}, {"score": 0.0027031706928674092, "phrase": "computer_program"}, {"score": 0.0026732973536990373, "phrase": "sufficient_arithmetic_power"}, {"score": 0.00262910358108176, "phrase": "required_computer_program"}, {"score": 0.0022007302738063566, "phrase": "truth_status"}, {"score": 0.002152332983488664, "phrase": "formal_models"}, {"score": 0.0021049977753042253, "phrase": "turing_machines"}], "paper_keywords": ["Godel's incompleteness", " Turing computability", " Penrose", " axioms", " consistency"], "paper_abstract": "It is well understood and appreciated that Godel's Incompleteness Theorems apply to sufficiently strong, formal deductive systems. In particular, the theorems apply to systems which are adequate for conventional number theory. Less well known is that there exist algorithms which can be applied to such a system to generate a Godel-sentence for that system. Although the generation of a sentence is not equivalent to proving its truth, the present paper argues that the existence of these algorithms, when conjoined with Godel's results and accepted theorems of recursion theory, does provide the basis for an apparent paradox. The difficulty arises when such an algorithm is embedded within a computer program of sufficient arithmetic power. The required computer program (an AI system) is described herein, and the paradox is derived. A solution to the paradox is proposed, which, it is argued, illuminates the truth status of axioms in formal models of programs and Turing machines.", "paper_title": "Consistency, Turing computability and Godel's first incompleteness theorem", "paper_id": "WOS:000252675100001"}