{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "biomedical_event_extraction"}, {"score": 0.015584136663308676, "phrase": "hidden_topics"}, {"score": 0.0064000345130823385, "phrase": "un-annotated_data"}, {"score": 0.005451684056798053, "phrase": "annotated_corpus"}, {"score": 0.0045418465969859064, "phrase": "rna_production"}, {"score": 0.004457217172309362, "phrase": "proposed_framework"}, {"score": 0.004449949342789427, "phrase": "current_knowledge"}, {"score": 0.004424034641288626, "phrase": "drug_reactions"}, {"score": 0.004246790720119858, "phrase": "explicit_structure"}, {"score": 0.004197460986909444, "phrase": "life_science"}, {"score": 0.004064726810375669, "phrase": "computer-based_systems"}, {"score": 0.003924689521676555, "phrase": "molecular_events"}, {"score": 0.0039018217318645115, "phrase": "research_articles"}, {"score": 0.003856483559039742, "phrase": "community-wide_efforts"}, {"score": 0.0037784009327138115, "phrase": "statistical_models"}, {"score": 0.003745420968144244, "phrase": "large-scale_annotated_corpora"}, {"score": 0.003701893378341912, "phrase": "models'_parameters"}, {"score": 0.0035019219604505904, "phrase": "semi-supervised_learning"}, {"score": 0.0034511113746862796, "phrase": "feasible_solution"}, {"score": 0.0033127168183223876, "phrase": "semi-supervised_learning_framework"}, {"score": 0.003152082324187236, "phrase": "un-annotated_corpus"}, {"score": 0.003088217568464489, "phrase": "event_annotations"}, {"score": 0.0027472573325469144, "phrase": "newly_assigned_event_annotations"}, {"score": 0.0025987195907507393, "phrase": "multi-level_event_extraction_corpus"}, {"score": 0.00254603795454036, "phrase": "experimental_results"}, {"score": 0.0022450038337918934, "phrase": "state-of-the-art_event_extraction_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Semi-supervised learning", " Biomedical event extraction", " Latent Dirichlet allocation", " K nearest neighbor"], "paper_abstract": "Objectives: Scientists have devoted decades of efforts to understanding the interaction between proteins or RNA production. The information might empower the current knowledge on drug reactions or the development of certain diseases. Nevertheless, due to the lack of explicit structure, literature in life science, one of the most important sources of this information, prevents computer-based systems from accessing. Therefore, biomedical event extraction, automatically acquiring knowledge of molecular events in research articles, has attracted community-wide efforts recently. Most approaches are based on statistical models, requiring large-scale annotated corpora to precisely estimate models' parameters. However, it is usually difficult to obtain in practice. Therefore, employing un-annotated data based on semi-supervised learning for biomedical event extraction is a feasible solution and attracts more interests. Methods and material: In this paper, a semi-supervised learning framework based on hidden topics for biomedical event extraction is presented. In this framework, sentences in the un-annotated corpus are elaborately and automatically assigned with event annotations based on their distances to these sentences in the annotated corpus. More specifically, not only the structures of the sentences, but also the hidden topics embedded in the sentences are used for describing the distance. The sentences and newly assigned event annotations, together with the annotated corpus, are employed for training. Results: Experiments were conducted on the multi-level event extraction corpus, a golden standard corpus. Experimental results show that more than 2.2% improvement on F-score on biomedical event extraction is achieved by the proposed framework when compared to the state-of-the-art approach. Conclusion: The results suggest that by incorporating un-annotated data, the proposed framework indeed improves the performance of the state-of-the-art event extraction system and the similarity between sentences might be precisely described by hidden topics and structures of the sentences. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A semi-supervised learning framework for biomedical event extraction based on hidden topics", "paper_id": "WOS:000356553800005"}