{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_and_effective_lower_bounds"}, {"score": 0.004706453355638515, "phrase": "constrained_project_scheduling_problem"}, {"score": 0.004247560712327667, "phrase": "lower_bounds"}, {"score": 0.003746779951069909, "phrase": "energetic_reasoning"}, {"score": 0.003683213029483699, "phrase": "major_contribution"}, {"score": 0.003419943984098415, "phrase": "new_lower_bounds"}, {"score": 0.0030164423559955896, "phrase": "comprehensive_computational_study"}, {"score": 0.0028653893877383188, "phrase": "strong_evidence"}, {"score": 0.0028167336373711494, "phrase": "deceptively_simple_dual_feasible_function-based_lower_bound"}, {"score": 0.002442025065383455, "phrase": "effective_shaving_procedure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Resource constrained project scheduling problem", " Lower bounds", " Energetic reasoning", " Dual feasible functions"], "paper_abstract": "We present new and effective lower bounds for the resource constrained project scheduling problem. This problem is widely known to be notoriously difficult to solve due to the lack of lower bounds that are both tight and fast. In this paper, we propose several new lower bounds that are based on the concept of energetic reasoning. A major contribution of this work is to investigate several enhanced new feasibility tests that prove useful for deriving new lower bounds that consistently outperform the classical energetic reasoning-based lower bound. In particular, we present the results of a comprehensive computational study, carried out on 1560 benchmark instances, that provides strong evidence that a deceptively simple dual feasible function-based lower bound is highly competitive with a state-of-the-art lower bound while being extremely fast. Furthermore, we found that an effective shaving procedure enables to derive an excellent lower bound that often outperforms the best bound from the literature while being significantly simpler. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Enhanced energetic reasoning-based lower bounds for the resource constrained project scheduling problem", "paper_id": "WOS:000296000600029"}