{"auto_keywords": [{"score": 0.02927701149985092, "phrase": "high_dimensional_space"}, {"score": 0.015719716506582538, "phrase": "adaptive_random_testing"}, {"score": 0.015259415531577416, "phrase": "failure-unrelated_parameters"}, {"score": 0.010513628128326508, "phrase": "fscs-art"}, {"score": 0.004719473826242326, "phrase": "high_dimensional_input_domains"}, {"score": 0.004444203710097833, "phrase": "random_testing"}, {"score": 0.004040688646993609, "phrase": "art_algorithms"}, {"score": 0.003901407184706592, "phrase": "program_input_parameters"}, {"score": 0.003306559295382181, "phrase": "high_dimensional_input_domain"}, {"score": 0.002976019715894587, "phrase": "filtering_process"}, {"score": 0.0027881294891497115, "phrase": "better_failure_detection_effectiveness"}, {"score": 0.0022925278792429553, "phrase": "real_life_programs"}, {"score": 0.0022133711375320266, "phrase": "fscs-art-fe"}, {"score": 0.0021049977753042253, "phrase": "similar_problems"}], "paper_keywords": ["software testing", " random testing", " adaptive random testing", " fixed-sized-candidate-set ART", " high dimension problem", " failure-unrelated parameters"], "paper_abstract": "Adaptive random testing (ART), an enhancement of random testing (RT), aims to both randomly select and evenly spread test cases. Recently, it has been observed that the effectiveness of some ART algorithms may deteriorate as the number of program input parameters (dimensionality) increases. In this article, we analyse various problems of one ART algorithm, namely fixed-sized-candidate-set ART (FSCS-ART), in the high dimensional input domain setting, and study how FSCS-ART can be further enhanced to address these problems. We propose to add a filtering process of inputs into FSCS-ART to achieve a more even-spread of test cases and better failure detection effectiveness in high dimensional space. Our study shows that this solution, termed as FSCS-ART-FE, can improve FSCS-ART not only in the case of high dimensional space, but also in the case of having failure-unrelated parameters. Both cases are common in real life programs. Therefore, we recommend using FSCS-ART-FE instead of FSCS-ART whenever possible. Other ART algorithms may face similar problems as FSCS-ART; hence our study also brings insight into the improvement of other ART algorithms in high dimensional space.", "paper_title": "Enhancing adaptive random testing for programs with high dimensional input domains or failure-unrelated parameters", "paper_id": "WOS:000257959700003"}