{"auto_keywords": [{"score": 0.04262684978582361, "phrase": "topologically_diverse_scaffolds"}, {"score": 0.0047689174754929195, "phrase": "glycogen_synthase_kinase"}, {"score": 0.004567129988306349, "phrase": "potential_therapeutic_target"}, {"score": 0.0042495320879288615, "phrase": "new_lead_identification_protocol"}, {"score": 0.004108942392772092, "phrase": "competitive_inhibitors"}, {"score": 0.0036261282565554507, "phrase": "comparative_molecular_field_analysis"}, {"score": 0.0035399770257915466, "phrase": "comparative_molecular_similarity_indices_analysis"}, {"score": 0.00334144503360907, "phrase": "pubchem_database"}, {"score": 0.003262035294895737, "phrase": "lipinski's_rules"}, {"score": 0.003123808471618783, "phrase": "flexx-dock_program"}, {"score": 0.002703869368554536, "phrase": "beta_inhibition_values"}, {"score": 0.0025892330566358503, "phrase": "active_hits"}, {"score": 0.00236289633510808, "phrase": "hits_rate"}, {"score": 0.002219516542316085, "phrase": "structure-based_approaches"}, {"score": 0.0021049977753042253, "phrase": "new_hits"}], "paper_keywords": [""], "paper_abstract": "Glycogen synthase kinase 3 beta (GSK-3 beta) is a potential therapeutic target for cancer, type-2 diabetes, and Alzheimer's disease. This paper proposes a new lead identification protocol that predicts new GSK-3 beta ATP competitive inhibitors with topologically diverse scaffolds. First, three-dimensional quantitative structure activity relationship (3D QSAR) models were built and validated. These models are based upon known GSK-3 beta inhibitors, benzofuran-3-yl-(indol-3-yl) maleimides, by means of comparative molecular field analysis (CoMFA) and comparative molecular similarity indices analysis (CoMSIA). Second, 28 826 maleimide derivatives were selected from the PubChem database. After filtration via Lipinski's rules, 10 429 maleimide derivatives were left. Third, the FlexX-dock program was employed to virtually screen the 10 429 compounds against GSK-3 beta. This resulted in 617 virtual hits. Fourth, the 3D QSAR models predicted that from the 617 virtual hits, 93 compounds would have GSK-3 beta inhibition values of less than 15 nM. Finally, from the 93 predicted active hits, 23 compounds were confirmed as GSK-3 beta inhibitors from literatures; their GSK-3 beta inhibition ranged from 1.3 to 480 nM. Therefore, the hits rate of our virtual screening protocol is greater than 25%. The protocol combines ligand- and structure-based approaches and therefore validates both approaches and is capable of identifying new hits with topologically diverse scaffolds.", "paper_title": "A New Protocol for Predicting Novel GSK-3 beta ATP Competitive Inhibitors", "paper_id": "WOS:000292010100022"}