{"auto_keywords": [{"score": 0.027618514913508304, "phrase": "baseline_nyquist-domain_detector"}, {"score": 0.00481495049065317, "phrase": "signal_processing"}, {"score": 0.00478867907727921, "phrase": "direct_computations"}, {"score": 0.004762550320451225, "phrase": "compressively_sensed_data"}, {"score": 0.004472078324288593, "phrase": "efficient_representations"}, {"score": 0.004363277689798392, "phrase": "signal_processing_system"}, {"score": 0.004063547375196532, "phrase": "compressive_sensing"}, {"score": 0.003964646257072569, "phrase": "minimal_computational_cost"}, {"score": 0.003910740988145338, "phrase": "random_projections"}, {"score": 0.003857565803059891, "phrase": "key_drawback"}, {"score": 0.0037533665683654113, "phrase": "inference_frameworks"}, {"score": 0.0037328656607036447, "phrase": "signal_analysis"}, {"score": 0.0036121819729961384, "phrase": "signal_processing_operations"}, {"score": 0.003382354267177914, "phrase": "compressed_representations"}, {"score": 0.003309030835969531, "phrase": "mathematical_framework"}, {"score": 0.0032372917632693403, "phrase": "significant_computational-energy_savings"}, {"score": 0.0031671030360367843, "phrase": "explicit_energy-versus-accuracy_tradeoffs"}, {"score": 0.002965509518226379, "phrase": "neural_prosthesis"}, {"score": 0.0029412271277166873, "phrase": "wavelet_features"}, {"score": 0.0029171429862165327, "phrase": "compressively_sensed_spikes"}, {"score": 0.0027464325217130283, "phrase": "spike_count"}, {"score": 0.002709045632654716, "phrase": "-rate_estimation"}, {"score": 0.002447711877257318, "phrase": "epileptic_seizures"}, {"score": 0.0024276590297034064, "phrase": "spectral-energy_features"}, {"score": 0.0024077700683153886, "phrase": "compressively_sensed_electroencephalogram"}, {"score": 0.002368478483077156, "phrase": "end-to-end_algorithm"}], "paper_keywords": ["Compressed sensing", " digital signal processing", " linear systems", " machine learning", " spike sorting", " seizure detection"], "paper_abstract": "Sparsity is characteristic of a signal that potentially allows us to represent information efficiently. We present an approach that enables efficient representations based on sparsity to be utilized throughout a signal processing system, with the aim of reducing the energy and/or resources required for computation, communication, and storage. The representation we focus on is compressive sensing. Its benefit is that compression is achieved with minimal computational cost through the use of random projections; however, a key drawback is that reconstruction is expensive. We focus on inference frameworks for signal analysis. We show that reconstruction can be avoided entirely by transforming signal processing operations (e.g., wavelet transforms, finite impulse response filters, etc.) such that they can be applied directly to the compressed representations. We present a methodology and a mathematical framework that achieve this goal and also enable significant computational-energy savings through operations over fewer input samples. This enables explicit energy-versus-accuracy tradeoffs that are under the control of the designer. We demonstrate the approach through two case studies. First, we consider a system for neural prosthesis that extracts wavelet features directly from compressively sensed spikes. Through simulations, we show that spike sorting can be achieved with 54x fewer samples, providing an accuracy of 98.63% in spike count, 98.56% in firing-rate estimation, and 96.51% in determining the coefficient of variation; this compares with a baseline Nyquist-domain detector with corresponding performance of 98.97%, 99.69%, and 97.09%, respectively. Second, we consider a system for detecting epileptic seizures by extracting spectral-energy features directly from compressively sensed electroencephalogram. Through simulations of the end-to-end algorithm, we show that detection can be achieved with 21x fewer samples, providing a sensitivity of 94.43%, false alarm rate of 0.1543/h, and latency of 4.70 s; this compares with a baseline Nyquist-domain detector with corresponding performance of 96.03%, 0.1471/h, and 4.59 s, respectively.", "paper_title": "Signal Processing With Direct Computations on Compressively Sensed Data", "paper_id": "WOS:000348377200003"}