{"auto_keywords": [{"score": 0.04916281891691642, "phrase": "network_coding"}, {"score": 0.0060902893444316, "phrase": "wireless_multihop_networks"}, {"score": 0.005831445421175519, "phrase": "lifetime_maximization"}, {"score": 0.005110488498019994, "phrase": "fanc"}, {"score": 0.004815187692930321, "phrase": "lifetime"}, {"score": 0.004125027493339274, "phrase": "pure_routing"}, {"score": 0.003987755561492638, "phrase": "energy_minimization"}, {"score": 0.003855034057431947, "phrase": "lifetime_maximization_problems"}, {"score": 0.0031614748814351823, "phrase": "first_case"}, {"score": 0.002925899335792914, "phrase": "one-hop_network_coding"}, {"score": 0.0026175952455594277, "phrase": "network_coding_schemes"}, {"score": 0.0022202042044679984, "phrase": "performance_gain"}, {"score": 0.002135812692862058, "phrase": "flow_asymmetry"}, {"score": 0.0021049977753042253, "phrase": "power_control_ability"}], "paper_keywords": ["network coding", " lifetime maximization", " linear programming", " flow augmenting routing", " wireless multihop networks"], "paper_abstract": "In this paper, we consider the lifetime maximization routing with network coding in wireless multihop networks. We first show that lifetime maximization with network coding is different from pure routing, throughput maximization with network coding and energy minimization with network coding. Then we formulate lifetime maximization problems in three different cases of (i) no network coding, (ii) two-way network coding, and (iii) overhearing network coding. To solve these problems, we use flow augmenting routing (FA) for the first case, and then extend the FA with network coding (FANC) by using energy minimized one-hop network coding. After that, we investigate the influence of parameters of FANC, evaluate the performance of FANC with two-way and overhearing network coding schemes and compare it with that without network coding under two different power control models, namely, protocol and physical ones. The results show that the lifetime can be improved significantly by using network coding, and the performance gain of network coding decreases with the increase of flow asymmetry and the power control ability.", "paper_title": "Lifetime maximization routing with network coding in wireless multihop networks", "paper_id": "WOS:000317246800004"}