{"auto_keywords": [{"score": 0.03716518221657689, "phrase": "aosd-br_community"}, {"score": 0.02277052091477958, "phrase": "aosd"}, {"score": 0.019355026128616268, "phrase": "brazil"}, {"score": 0.00481495049065317, "phrase": "aosd_brazilian_research_community"}, {"score": 0.004750440867604888, "phrase": "aspect-oriented_software_development"}, {"score": 0.004608422081389008, "phrase": "advanced_separation"}, {"score": 0.004500891637057374, "phrase": "software_development_lifecycle"}, {"score": 0.004440570928903645, "phrase": "distinctive_emphasis"}, {"score": 0.004410713064804144, "phrase": "modular_structures"}, {"score": 0.004351595642056769, "phrase": "traditional_abstraction_boundaries"}, {"score": 0.004122911675081472, "phrase": "aosd-br_research_community"}, {"score": 0.003879919492075319, "phrase": "different_contributions"}, {"score": 0.0035659209800190847, "phrase": "organized_characterization"}, {"score": 0.003459191419478298, "phrase": "international_aosd_research_community"}, {"score": 0.003104849179057156, "phrase": "aosd_international_community"}, {"score": 0.003073545175760353, "phrase": "brazilian_software_engineering_community"}, {"score": 0.003032295420569351, "phrase": "data_collection"}, {"score": 0.0027307746993761035, "phrase": "main_milestones"}, {"score": 0.002535115422089855, "phrase": "key_challenges"}, {"score": 0.0023774292521631093, "phrase": "aosd-br_community_outcomes"}, {"score": 0.002345500021653278, "phrase": "well-known_indicators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Aspect-Oriented Software Development", " Modularity", " Research impact"], "paper_abstract": "Background: Aspect-Oriented Software Development (AOSD) is a paradigm that promotes advanced separation of concerns and modularity throughout the software development lifecycle, with a distinctive emphasis on modular structures that cut across traditional abstraction boundaries. In the last 15 years, research on AOSD has boosted around the world. The AOSD-BR research community (AOSD-BR stands for AOSD in Brazil) emerged in the last decade, and has provided different contributions in a variety of topics. However, despite some evidence in terms of the number and quality of its outcomes, there is no organized characterization of the AOSD-BR community that positions it against the international AOSD Research community and the Software Engineering Research community in Brazil. Aims: In this paper, our main goal is to characterize the AOSD-BR community with respect to the research developed in the last decade, confronting it with the AOSD international community and the Brazilian Software Engineering community. Method: Data collection, validation and analysis were performed in collaboration with several researchers of the AOSD-BR community. The characterization was presented from three different perspectives: (i) a historical timeline of events and main milestones achieved by the community; (ii) an overview of the research developed by the community, in terms of key challenges, open issues and related work; and (iii) an analysis on the impact of the AOSD-BR community outcomes in terms of well-known indicators, such as number of papers and number of citations. Results: Our analysis showed that the AOSD-BR community has impacted both the international AOSD Research community and the Software Engineering Research community in Brazil. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "The crosscutting impact of the AOSD Brazilian research community", "paper_id": "WOS:000316831700004"}