{"auto_keywords": [{"score": 0.04040057701105385, "phrase": "different_tautomeric_forms"}, {"score": 0.015719716506582538, "phrase": "hppd_inhibitors"}, {"score": 0.015634121752750446, "phrase": "psa"}, {"score": 0.015129496108747715, "phrase": "comfa_models"}, {"score": 0.014561108585346432, "phrase": "comfa_results"}, {"score": 0.004593993534002452, "phrase": "present_study"}, {"score": 0.0040454315047320204, "phrase": "atom_alignment_technique"}, {"score": 0.0038703397652790237, "phrase": "structural_alignments"}, {"score": 0.0038171874077517274, "phrase": "significant_difference"}, {"score": 0.0036823699601344962, "phrase": "great_extent"}, {"score": 0.003260303822646129, "phrase": "data_sets"}, {"score": 0.0032244131604567323, "phrase": "psa_inhibitors"}, {"score": 0.003206615786563051, "phrase": "excellent_aos-aps_comfa_models"}, {"score": 0.0030592380520393985, "phrase": "seven_components"}, {"score": 0.002983968624542411, "phrase": "almost_no_significant_difference"}, {"score": 0.0027690604068575024, "phrase": "anxiolytic_agents"}, {"score": 0.002746155563830053, "phrase": "keto_tautomer"}, {"score": 0.002708399936381754, "phrase": "active_form"}, {"score": 0.0026859955072188932, "phrase": "pbi_type_inhibitors"}, {"score": 0.002663775916972667, "phrase": "measurably_better_results"}, {"score": 0.0026126405272417783, "phrase": "eight_components"}, {"score": 0.0025202582748972122, "phrase": "five_components"}, {"score": 0.0024650347199954817, "phrase": "proper_tautomer"}, {"score": 0.00244463852203525, "phrase": "comfa_studies"}, {"score": 0.0023976997077055193, "phrase": "substantial_differences"}, {"score": 0.002377859325230963, "phrase": "electrostatic_field_contours"}, {"score": 0.0022747775135581083, "phrase": "steric_field_contour_maps"}, {"score": 0.0022249209015955305, "phrase": "resulting_new_potent_ligands"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["tautomerism", " 3D-QSAR", " CoMFA", " molecular modeling"], "paper_abstract": "The present study was design to examine the effect of tautomerism upon the CoMFA results. Three selected data sets involving protropic tautomerism, which are 21 p-hydroxyphenylpyruvate dioxygenase (HPPD) inhibitors, 35 inhibitors of puromycin-sensitive aminopeptidase (PSA), and 67 anxiolytic agents, were used for this purpose. Atom-by-atom alignment technique was adopted to superimpose the molecules in the data sets onto a template. The structural alignments using different tautomeric forms had no significant difference except the atoms involved in tautomerism, which ensures, to a great extent, that the difference, of the CoMFA results result primarily from the tautomerism. All-orientation and all-placement search (AOS-APS) based CoMFA models, in addition to the conventional ones, were derived for each system and proved to be capable of yielding much improved statistical results. In the cases of the data sets of HPPD inhibitors and PSA inhibitors, excellent AOS-APS CoMFA models (q(2) > 0.8 with four components for the former and q(2) > 0.7 with seven components for the latter) were obtained, and almost no significant difference in statistical quality was observed when using different tautomeric forms to derive the models. However, it was not the case when treating the data set of anxiolytic agents. The keto tautomer, which was the active form of the PBI type inhibitors, produced measurably better results (q(2) = 0.54 with eight components) than that the enol one (q(2) = 0.37 with five components), indicating the importance of selecting proper tautomer in the CoMFA studies. Furthermore, there existed some substantial differences of the electrostatic field contours between the two different tautomeric forms for all of the three systems considered, whereas the differences in the steric field contour maps were limited. This implies that the resulting new potent ligands may be quite different if one utilizes the CoMFA models of different tautomeric forms for guiding further structural refinements. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Three-dimensional QSAR of HPPD inhibitors, PSA inhibitors, and anxiolytic agents: Effect of tautomerism on the CoMFA models", "paper_id": "WOS:000250182400011"}