{"auto_keywords": [{"score": 0.04952782290107844, "phrase": "string_y"}, {"score": 0.00481495049065317, "phrase": "factor_u"}, {"score": 0.0043718794256931435, "phrase": "cover_u"}, {"score": 0.004304856672196293, "phrase": "border-both_prefix"}, {"score": 0.003954109842050071, "phrase": "y._covers"}, {"score": 0.003789561910103601, "phrase": "linear-time_algorithms"}, {"score": 0.0034008496666026585, "phrase": "exact_concatenations"}, {"score": 0.00317221667574882, "phrase": "still_a_string"}, {"score": 0.003087500254099842, "phrase": "single_u"}, {"score": 0.002802941205762953, "phrase": "minimum_k-cover"}, {"score": 0.0025162015731238006, "phrase": "np"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Periodicity", " Quasiperiodicity", " Covers", " Seeds"], "paper_abstract": "A factor u of a string y is a cover of y if every letter of y lies within some occurrence of u in y; thus every cover u is also a border-both prefix and suffix-of y. If u is a cover of a superstring of y then u is a seed of y. Covers and seeds are two formalisations of quasiperiodicity, and there exist linear-time algorithms for computing all the covers and seeds of y. A string y covered by u thus generalises the idea of a repetition; that is, a string composed of exact concatenations of u. Even though a string is coverable somewhat more frequently than it is a repetition, still a string that can be covered by a single u is rare. As a result, seeking to find a more generally applicable and descriptive notion of cover, many articles were written on the computation of a minimum k-cover of y; that is, the minimum cardinality set of strings of length k that collectively cover y. Unfortunately, this computation turns out to be NP-hard. Therefore, in this article, we propose new, simple, easily-computed, and widely applicable notions of string covering that provide an intuitive and useful characterisation of a string: the enhanced cover; the enhanced left cover; and the enhanced left seed. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Enhanced string covering", "paper_id": "WOS:000326007400007"}