{"auto_keywords": [{"score": 0.04849105041601803, "phrase": "remote_services"}, {"score": 0.00481495049065317, "phrase": "personal_information"}, {"score": 0.004425616928975799, "phrase": "current_internet"}, {"score": 0.0043699845927285905, "phrase": "default_assumption"}, {"score": 0.003982741546775355, "phrase": "user's_ip_address"}, {"score": 0.003883194688426525, "phrase": "privoxy"}, {"score": 0.0038343546245999285, "phrase": "even_nats"}, {"score": 0.0032250961348210473, "phrase": "-not_necessarily_more_anonymity"}, {"score": 0.0031577303835881964, "phrase": "cross-layer_architecture"}, {"score": 0.0030787405733989615, "phrase": "pseudonym_abstraction"}, {"score": 0.0026782279715171866, "phrase": "single_machine"}, {"score": 0.002389514188569084, "phrase": "multiple_globally-routable_addresses"}, {"score": 0.0022522565004588113, "phrase": "unlinkable_pseudonyms"}, {"score": 0.0022238834225283594, "phrase": "chrome_web_browser"}], "paper_keywords": ["Privacy", " IPv6", " Pseudonym", " Web tracking"], "paper_abstract": "As personal information increases in value, the incentives for remote services to collect as much of it as possible increase as well. In the current Internet, the default assumption is that all behavior can be correlated using a variety of identifying information, not the least of which is a user's IP address. Tools like Tor, Privoxy, and even NATs, are located at the opposite end of the spectrum and prevent any behavior from being linked. Instead, our goal is to provide users with more control over linkability-which activites of the user can be correlated at the remote services-not necessarily more anonymity. We design a cross-layer architecture that provides users with a pseudonym abstraction. To the user, a pseudonym represents a set of activities that the user is fine with linking, and to the outside world, a pseudonym gives the illusion of a single machine. We provide this abstraction by associating each pseudonym with a unique, random address drawn from the IPv6 address space, which is large enough to provide each device with multiple globally-routable addresses. We have implemented and evaluated a prototype that is able to provide unlinkable pseudonyms within the Chrome web browser in order to demonstrate the feasibility, efficacy, and expressiveness of our approach.", "paper_title": "Expressive Privacy Control with Pseudonyms", "paper_id": "WOS:000327465900032"}