{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "yao-like_subgraphs"}, {"score": 0.04966008989090485, "phrase": "unit_disk_graphs"}, {"score": 0.004648609688625397, "phrase": "present_paper"}, {"score": 0.004547564208690591, "phrase": "local_deterministic_algorithm"}, {"score": 0.00431388720289049, "phrase": "geometric_graphs"}, {"score": 0.004220086640742953, "phrase": "positive_integers_l"}, {"score": 0.0039333604469462356, "phrase": "unit_circle"}, {"score": 0.0027660443371695024, "phrase": "original_underlying_unit_disk_graph"}, {"score": 0.0026121403051734744, "phrase": "constant_number"}, {"score": 0.0024130437638400404, "phrase": "local_algorithms"}, {"score": 0.0023708980662168547, "phrase": "maximal_degree"}, {"score": 0.002258745901862197, "phrase": "global_algorithm"}], "paper_keywords": ["Edge colouring", " Geometric graphs", " Unit Disk Graphs", " Local algorithm", " Location awareness", " Wedge", " Wireless network"], "paper_abstract": "The focus of the present paper is on providing a local deterministic algorithm for colouring the edges of Yao-like subgraphs of Unit Disk Graphs. These are geometric graphs such that for some positive integers l, k the following property holds at each node nu: if we partition the unit circle centered at nu into 2k equally sized wedges then each wedge can contain at most I points different from nu. We assume that the nodes are location aware, i.e. they know their Cartesian coordinates in the plane. The algorithm presented is local in the sense that each node can receive information emanating only from nodes which are at most a constant (depending on k and l, but not on the size of the graph) number of hops (measured in the original underlying Unit Disk Graph) away from it, and hence the algorithm terminates in a constant number of steps. The number of colours used is 2kl + 1 and this is optimal for local algorithms (since the maximal degree is 2kl and a colouring with 2kl colours can only be constructed by a global algorithm), thus showing that in this class of graphs the price for locality is only one additional colour. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Local edge colouring of Yao-like subgraphs of Unit Disk Graphs", "paper_id": "WOS:000264537200010"}