{"auto_keywords": [{"score": 0.04392019422481263, "phrase": "hs_algorithm"}, {"score": 0.02836010098303232, "phrase": "proposed_iths_algorithm"}, {"score": 0.004757087682427765, "phrase": "population-based_metaheuristic_optimisation_algorithm"}, {"score": 0.004606148097788071, "phrase": "music_improvisation_process"}, {"score": 0.004301046274139699, "phrase": "better_harmony"}, {"score": 0.0040485975929323, "phrase": "diverse_problems"}, {"score": 0.0037955672944969287, "phrase": "different_parameters"}, {"score": 0.0036454883790271843, "phrase": "new_variant"}, {"score": 0.003515479934694842, "phrase": "proper_balance"}, {"score": 0.003417565253539315, "phrase": "search_process"}, {"score": 0.0033492947290751996, "phrase": "proper_pitch_adjustment_strategy"}, {"score": 0.003064702016306719, "phrase": "hms"}, {"score": 0.00301560261110296, "phrase": "harmony_memory"}, {"score": 0.0027929100418926725, "phrase": "iths_algorithm"}, {"score": 0.002607598760956807, "phrase": "eight_state-of-the-art_hs_variants"}, {"score": 0.0024642355970277497, "phrase": "proposed_algorithm"}, {"score": 0.0024444073418288703, "phrase": "higher_dimensions"}, {"score": 0.0024149629835339926, "phrase": "scalability_study"}, {"score": 0.0023381630439887184, "phrase": "numerical_results"}, {"score": 0.002218526133566788, "phrase": "convergence_speed"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Harmony Search (HS)", " Metaheuristic", " Optimisation"], "paper_abstract": "The Harmony Search (HS) algorithm is a population-based metaheuristic optimisation algorithm. This algorithm is inspired by the music improvisation process in which the musician searches for harmony and continues to polish the pitches to obtain a better harmony. Although several variants of the HS algorithm have been proposed, their effectiveness in dealing with diverse problems is still unsatisfactory. The performances of these variants mainly depend on the selection of different parameters of the algorithm. In this paper, a new variant of the HS algorithm is proposed that maintains a proper balance between diversification and intensification throughout the search process by automatically selecting the proper pitch adjustment strategy based on its Harmony Memory. However, the performance of the proposed Intelligent Tuned Harmony Search (ITHS) algorithm is influenced by other parameters, such as the Harmony Memory Size (HMS) and the Harmony Memory Considering Rate (HMCR). The effects that varying these parameters have on the performance of the ITHS algorithm is also analysed in detail. The performance of the proposed ITHS algorithm is investigated and compared with eight state-of-the-art HS variants over 17 benchmark functions. Furthermore, to investigate the robustness of the proposed algorithm at higher dimensions, a scalability study is also performed. Finally, the numerical results obtained reflect the superiority of the proposed ITHS algorithm in terms of accuracy, convergence speed, and robustness when compared with other state-of-the-art HS variants. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "An Intelligent Tuned Harmony Search algorithm for optimisation", "paper_id": "WOS:000303093000004"}