{"auto_keywords": [{"score": 0.050078259839000154, "phrase": "comprehensive_ehr"}, {"score": 0.046012599614754526, "phrase": "mixed-methods_case_study"}, {"score": 0.04499603395682032, "phrase": "updated_delone"}, {"score": 0.04486211944048102, "phrase": "mclean_framework"}, {"score": 0.035620716932052585, "phrase": "ehr"}, {"score": 0.0047851345246117455, "phrase": "delone_and_mclean_model"}, {"score": 0.00464599894628502, "phrase": "methodological_approach"}, {"score": 0.0045743946938239565, "phrase": "comprehensive_electronic_health_record"}, {"score": 0.004531960531926522, "phrase": "shake_down_phase"}, {"score": 0.004482949028773004, "phrase": "regional_hospital"}, {"score": 0.004469063493902861, "phrase": "denmark"}, {"score": 0.004434465206030441, "phrase": "formative_evaluation"}, {"score": 0.004272164161788242, "phrase": "information_systems_success"}, {"score": 0.0042325217065689365, "phrase": "user_assessments"}, {"score": 0.003989821982710726, "phrase": "thirteen_individual"}, {"score": 0.00390394385603691, "phrase": "seven_follow-up_focus_group_interviews"}, {"score": 0.003825849505589868, "phrase": "specific_user_assessments"}, {"score": 0.0037962293154262215, "phrase": "group_interviews"}, {"score": 0.0037668375812212654, "phrase": "implementation_team"}, {"score": 0.0037202816351450995, "phrase": "system_provider_assessments"}, {"score": 0.003702971332978746, "phrase": "implementation_process"}, {"score": 0.003623245005375247, "phrase": "ethnographic_observation"}, {"score": 0.0035507457285983268, "phrase": "daily_routine"}, {"score": 0.003512308265830794, "phrase": "health_records"}, {"score": 0.0034905304530177986, "phrase": "daily_system_performance_data"}, {"score": 0.0034581157787619762, "phrase": "factual_information"}, {"score": 0.003447377686834269, "phrase": "system_response"}, {"score": 0.0033941836212930524, "phrase": "positive_experiences"}, {"score": 0.00330048738016436, "phrase": "medical_secretaries"}, {"score": 0.0031994011214033823, "phrase": "professionally_relevant_data"}, {"score": 0.0030110748510795175, "phrase": "key_role"}, {"score": 0.0028917056916949744, "phrase": "mixed-methods_approach"}, {"score": 0.00281184118901173, "phrase": "hospital_staff"}, {"score": 0.0027813801742103163, "phrase": "staff_assessment"}, {"score": 0.0027684263985790526, "phrase": "major_role"}, {"score": 0.002721441841356667, "phrase": "performance_data"}, {"score": 0.0026710924901834614, "phrase": "dimension_'user_satisfaction"}, {"score": 0.0025651667000308677, "phrase": "validated_survey"}, {"score": 0.0025177012935489376, "phrase": "evaluation_design"}, {"score": 0.002509876008627113, "phrase": "constrained_circumstances"}, {"score": 0.0024904187737391807, "phrase": "inherent_limitations"}, {"score": 0.002414082940963702, "phrase": "political_decision_making"}, {"score": 0.0023767948946074547, "phrase": "overall_design"}, {"score": 0.0023546984428119864, "phrase": "ehr_implementation"}, {"score": 0.002314719202577187, "phrase": "health_care_domain"}, {"score": 0.0022825131641434964, "phrase": "valid_and_reliable_results"}, {"score": 0.0022542611024997474, "phrase": "system_providers"}, {"score": 0.002226357953581725, "phrase": "successful_implementation"}, {"score": 0.002131383155056741, "phrase": "high_degree"}, {"score": 0.0021247560305587155, "phrase": "user_involvement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Case study", " Comprehensive electronic health record", " DeLone and McLean success model", " Evaluation", " Electronic health record", " Hospitals", " Mixed-methods", " Shake down phase"], "paper_abstract": "Objective: The article describes the methodological approach to, and results of an evaluation of a comprehensive electronic health record (EHR) in the shake down phase, shortly after its implementation at a regional hospital in Denmark. Design: A formative evaluation based on a mixed-methods case study, designed to be interactive and concurrent was conducted at two hospital departments based on the updated DeLone and McLean framework for evaluating information systems success. Methods: To ascertain user assessments of the EHR, we distributed a questionnaire two months after implementation to four groups of staff (physicians, nurses, medical secretaries, and physiotherapists; n = 244), and at the same time we conducted thirteen individual, semi-structured interviews with representatives from these four groups. Subsequently, seven follow-up focus group interviews were conducted with the four above-mentioned groups, in order to go deeper into specific user assessments. Simultaneously, focus group interviews with two IT departments and the implementation team were conducted, to gain insight into system provider assessments of the implementation process and the EHR. Before, during, and after implementation, 88 h of ethnographic observation were carried out, to give the researchers an understanding of the daily routine of staff, and their use of health records. Finally, daily system performance data were obtained, to gather factual information on system response and downtime. Results: Overall, staff had positive experiences with the EHR and its operational reliability, response time, login and support. Performance was acceptable. Medical secretaries found the use of the patient administration module cumbersome, and physicians found the establishment of the overview of professionally relevant data challenging. There were demands for improvements to these and other functionalities, and for the EHR to be integrated with other systems and databases. Limitations: Evaluations immediately following implementation are inherently difficult, but was required because a key role was to inform decision-making upon enrollment at other hospitals and systematically identify barriers in this respect. The strength of the evaluation is the mixed-methods approach. Further, the evaluation was based on assessments from staff in two departments that comprise around 50% of hospital staff. A weakness may be that staff assessment plays a major role in interviews and survey. These though are supplemented by performance data and observation. Also, the evaluation primarily reports upon the dimension 'user satisfaction', since use of the EHR is mandatory. Finally, generalizability may be low, since the evaluation was not based on a validated survey. All in all, however, the evaluation proposes an evaluation design in constrained circumstances. Conclusions: Despite inherent limitations, evaluation of a comprehensive EHR shortly after implementation may be necessary, can be conducted, and may inform political decision making. The updated DeLone and McLean framework was constructive in the overall design of the evaluation of the EHR implementation, and allowed the model to be adapted to the health care domain by being methodological flexible. The mixed-methods case study produced valid and reliable results, and was accepted by staff, system providers, and political decision makers. The successful implementation may be attributed to the configurability of the EHR and to factors such as an experienced, competent implementation organization at the hospital, upgraded soft- and hardware, and a high degree of user involvement. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Evaluation of a comprehensive EHR based on the DeLone and McLean model for IS success: Approach, results, and success factors", "paper_id": "WOS:000324312000004"}