{"auto_keywords": [{"score": 0.04931727328027492, "phrase": "network_communities"}, {"score": 0.02346294563925222, "phrase": "lm_algorithm"}, {"score": 0.00481495049065317, "phrase": "spectral_characterization"}, {"score": 0.004776484866276242, "phrase": "scalable_mining_of_network_communities"}, {"score": 0.004390607370861926, "phrase": "network_community_mining_problem"}, {"score": 0.004338077155644244, "phrase": "ncmp"}, {"score": 0.004035777314816881, "phrase": "wide_variety"}, {"score": 0.0036798490617699227, "phrase": "ncmps"}, {"score": 0.0033552055241931346, "phrase": "existing_studies"}, {"score": 0.003083793024782014, "phrase": "stochastic_model"}, {"score": 0.0029386456078004863, "phrase": "hierarchical_community_structure"}, {"score": 0.002868646843975439, "phrase": "local_mixing_properties"}, {"score": 0.0027778947555117243, "phrase": "large-deviation_theory"}, {"score": 0.0027008385562908425, "phrase": "community_structures"}, {"score": 0.0025633455664747606, "phrase": "above-mentioned_relationship"}, {"score": 0.002502264043067568, "phrase": "general_framework"}, {"score": 0.002432834929068545, "phrase": "mining_network_communities"}, {"score": 0.0022630008787375435, "phrase": "efficient_implementation"}, {"score": 0.0021049977753042253, "phrase": "large-scale_networks"}], "paper_keywords": ["Social network", " community structure", " Markov chain", " local mixing", " large-deviation theory"], "paper_abstract": "Network communities refer to groups of vertices within which their connecting links are dense but between which they are sparse. A network community mining problem (or NCMP for short) is concerned with the problem of finding all such communities from a given network. A wide variety of applications can be formulated as NCMPs, ranging from social and/or biological network analysis to web mining and searching. So far, many algorithms addressing NCMPs have been developed and most of them fall into the categories of either optimization based or heuristic methods. Distinct from the existing studies, the work presented in this paper explores the notion of network communities and their properties based on the dynamics of a stochastic model naturally introduced. In the paper, a relationship between the hierarchical community structure of a network and the local mixing properties of such a stochastic model has been established with the large-deviation theory. Topological information regarding to the community structures hidden in networks can be inferred from their spectral signatures. Based on the above-mentioned relationship, this work proposes a general framework for characterizing, analyzing, and mining network communities. Utilizing the two basic properties of metastability, i.e., being locally uniform and temporarily fixed, an efficient implementation of the framework, called the LM algorithm, has been developed that can scalably mine communities hidden in large-scale networks. The effectiveness and efficiency of the LM algorithm have been theoretically analyzed as well as experimentally validated.", "paper_title": "On the Spectral Characterization and Scalable Mining of Network Communities", "paper_id": "WOS:000298381000011"}