{"auto_keywords": [{"score": 0.049785738585502004, "phrase": "sensor-grid"}, {"score": 0.006620741719636911, "phrase": "cbpsid_system"}, {"score": 0.0056101690683906455, "phrase": "overlapping_predicates"}, {"score": 0.004782395863714502, "phrase": "sgim"}, {"score": 0.0047531095169564335, "phrase": "dgim"}, {"score": 0.004297630834375944, "phrase": "huge_sensor_data"}, {"score": 0.0042321061143641625, "phrase": "entire_sensor-grid_environment"}, {"score": 0.004167576249058047, "phrase": "existing_works"}, {"score": 0.003871215272202998, "phrase": "dynamic_changes"}, {"score": 0.0035958527554878655, "phrase": "existing_event-matching_algorithms"}, {"score": 0.0035084732022668654, "phrase": "interval_range_predicates"}, {"score": 0.0032388418727065144, "phrase": "dynamic_and_fast_event-matching_algorithm"}, {"score": 0.003218977531454772, "phrase": "cgim"}, {"score": 0.003189408489240117, "phrase": "cbpsid"}, {"score": 0.0030362200439452585, "phrase": "single_and_composite_event_matching"}, {"score": 0.002846238033172098, "phrase": "appropriate_number"}, {"score": 0.002811418334221172, "phrase": "different_statistical_distributions"}, {"score": 0.0027770234187618815, "phrase": "run_time"}, {"score": 0.0027178389866989775, "phrase": "experimental_evaluation"}, {"score": 0.00269286089128731, "phrase": "proposed_algorithm"}, {"score": 0.0026681117410294708, "phrase": "sensor-grid_based_u-healthcare_scenario"}, {"score": 0.0026032174806986256, "phrase": "existing_algorithms"}, {"score": 0.0025792900811616474, "phrase": "experimental_results"}, {"score": 0.002524309110841349, "phrase": "evaluation_cost"}, {"score": 0.0021909737736168122, "phrase": "cgim_algorithm"}, {"score": 0.0021310870821926917, "phrase": "online_job_sites"}], "paper_keywords": ["Sensor-Grid", " Content-based publish/subscribe system", " Information dissemination", " Event-matching algorithm", " Subscription distributions and clustering method"], "paper_abstract": "In this paper, we discuss one of the most important issues in Sensor-Grid, i.e., to develop a fast and flexible content-based publish/subscribe information dissemination (CBPSID) system for automatic fusion, interpretation, sharing and delivery of huge sensor data to consumers as the entire Sensor-Grid environment is very dynamic. Existing works to develop the CBPSID system in Sensor-Grid mostly focus on reducing the effort to define and maintain subscriptions and to handle the difficulty of dynamic changes of publishers and consumers data. However, the performance of a CBPSID system in Sensor-Grid is bounded by the expensive matching/evaluation cost of events. Existing event-matching algorithms are not very efficient, especially for interval range predicates or overlapping predicates in subscriptions which are practical in Sensor-Grid as well as other application areas. So in this paper we discuss the above challenge and propose a dynamic and fast event-matching algorithm called CGIM for the CBPSID system in Sensor-Grid. The algorithm supports range predicates or overlapping predicates very well and provides single and composite event matching. It uses two approaches, called SGIM and DGIM, to group the subscriptions by the predicates and dynamically identifies appropriate number of groups considering different statistical distributions of subscriptions at run time. Also, we present an experimental evaluation of the proposed algorithm in a Sensor-Grid based u-Healthcare scenario using synthetic workloads and compare its performance with existing algorithms. The experimental results show that our algorithm significantly reduces the evaluation cost (on average using SGIM by 79% and DGIM by 88%) comparing with others and guarantees the scalability with respect to the number of subscriptions as well as the number of predicates and events. In addition, further experiments were conducted by applying the CGIM algorithm in other application areas, e.g. in the publish/subscribe system for online job sites, to show its diverse utilization and scalability.", "paper_title": "A dynamic and fast event matching algorithm for a content-based publish/subscribe information dissemination system in Sensor-Grid", "paper_id": "WOS:000284245700003"}