{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "benzoic_acids"}, {"score": 0.01053047327913203, "phrase": "different_solvents"}, {"score": 0.004135859558144883, "phrase": "usual_molecular_descriptors"}, {"score": 0.004008820473628357, "phrase": "physical_properties"}, {"score": 0.0038106195546165574, "phrase": "seven_descriptors"}, {"score": 0.0034971932704828197, "phrase": "external_prediction"}, {"score": 0.002888396879326153, "phrase": "statistical_results"}, {"score": 0.002865929543375884, "phrase": "small_subsets"}, {"score": 0.0027995677499976406, "phrase": "non-ortho-substituted_acids"}, {"score": 0.002745438358145758, "phrase": "protic_or_aprotic_solvents"}, {"score": 0.0024514505056251316, "phrase": "chemical_nature"}, {"score": 0.0022939396079753463, "phrase": "dissociation_process"}, {"score": 0.0022495644368875686, "phrase": "derived_model"}, {"score": 0.002146527342660575, "phrase": "larger_set"}, {"score": 0.002129818297734379, "phrase": "aromatic_neutral_acids"}], "paper_keywords": ["benzoic acids", " different solvents", " multicomponent systems", " neural networks", " pK(a)", " QSPR"], "paper_abstract": "A Computational Neural Network (CNN) derived model is proposed for the pK(a) prediction of benzoic acids in different solvents. The system studied contains 519 pK(a) values corresponding to 136 benzoic acids determined in water and in 8 organic solvents. The benzoic acids were described by the usual molecular descriptors and the solvents by a number of physical properties and by several parameters of the most widely used polarity solvent scales. The model is composed of seven descriptors - five of them corresponding to the solute and the other two to the solvents - and was validated by an external prediction set. The three sets of values needed in the analysis, training, prediction, and cross-validation, have the same squared correlation coefficient (0.998) and Root-Mean Square Error (RMSE) (0.21) values. The robustness of the model is also given for the statistical results for small subsets, such as ortho- and non-ortho-substituted acids, those obtained in protic or aprotic solvents, those obtained in each solvent, and even those for the set of pK(a) values of one specific acid in several solvents. The descriptors encode information about the chemical nature of the solutes and the solvents that is clearly related to the interactions present in the dissociation process in solution. The derived model also has the ability to predict pK(a) values of a larger set of aromatic neutral acids, containing both phenols and benzoic acids.", "paper_title": "QSPR prediction of pK(a) for benzoic acids in different solvents", "paper_id": "WOS:000256208900004"}