{"auto_keywords": [{"score": 0.049792109409163725, "phrase": "biomedical_articles"}, {"score": 0.017126603564408472, "phrase": "classification_models"}, {"score": 0.010612387000973441, "phrase": "statistical_analysis"}, {"score": 0.007705691067982364, "phrase": "graphical_representations"}, {"score": 0.005491064393224778, "phrase": "svm"}, {"score": 0.004644451060812007, "phrase": "important_task"}, {"score": 0.004520532341696593, "phrase": "genes_relationships"}, {"score": 0.004453116532937849, "phrase": "biochemical_pathways"}, {"score": 0.004347327095048136, "phrase": "standardized_and_structured_vocabularies"}, {"score": 0.004218602458288531, "phrase": "bio-ontolgy_terms"}, {"score": 0.00396050388346298, "phrase": "data_mining"}, {"score": 0.003889693671417058, "phrase": "maximum_entropy"}, {"score": 0.0038663716354483176, "phrase": "support_vector_machines"}, {"score": 0.0036516442918817214, "phrase": "existing_methods"}, {"score": 0.003298697143451424, "phrase": "linear"}, {"score": 0.003021141590548526, "phrase": "test_datasets"}, {"score": 0.002984990015496695, "phrase": "confusion_matrix"}, {"score": 0.0028446460307503343, "phrase": "andrew's_curves"}, {"score": 0.0026543514413663893, "phrase": "proposed_methodology"}, {"score": 0.002529513507222548, "phrase": "lda_models"}, {"score": 0.0024619688076410262, "phrase": "lda"}, {"score": 0.0023460767171603054, "phrase": "specific_data"}, {"score": 0.002262802370005939, "phrase": "functional_gene_annotation"}, {"score": 0.0022155944576897862, "phrase": "good_performance"}, {"score": 0.0021433882705962034, "phrase": "bio-text_data_structure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["genes annotation", " gene ontology", " Linear discriminant analysis", " classification", " text mining"], "paper_abstract": "Background: Functional annotation of genes is an important task in biology since it facilitates the characterization of genes relationships and the understanding of biochemical pathways. The various gene functions can be described by standardized and structured vocabularies, called bio-ontologies. The assignment of bio-ontolgy terms to genes is carried out by means of applying certain methods to datasets extracted from biomedical articles. These methods originate from data mining and machine learning and include maximum entropy or support vector machines (SVM). Purpose: The aim of this paper is to propose an alternative to the existing methods for functionally annotating genes. The methodology involves building of classification models, validation and graphical representations of the results and reduction of the dimensions of the dataset. Methods: Classification models are constructed by Linear discriminant analysis (LDA). The validation of the models is based on statistical analysis and interpretation of the results involving techniques like hold-out samples, test datasets and metrics like confusion matrix, accuracy, recall, precision and F-measure. Graphical representations, such as boxplots, Andrew's curves and scatterplots of the variables resulting from the classification models are also used for validating and interpreting the results. Results: The proposed methodology was applied to a dataset extracted from biomedical articles for 12 Gene Ontology terms. The validation of the LDA models and the comparison with the SVM show that LDA (mean F-measure 75.4%) outperforms the SVM (mean F-measure 68.7%) for the specific data. Conclusion: The application of certain statistical methods can be beneficial for functional gene annotation from biomedical articles. Apart from the good performance the results can be interpreted and give insight of the bio-text data structure. (c) 2006 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Gene functional annotation by statistical analysis of biomedical articles", "paper_id": "WOS:000247851400005"}