{"auto_keywords": [{"score": 0.04829600554967144, "phrase": "caalyx"}, {"score": 0.015719716506582538, "phrase": "health_care_services"}, {"score": 0.010656374104425484, "phrase": "caalyx_system"}, {"score": 0.004704606570771145, "phrase": "proposed_health_care_services_innovations"}, {"score": 0.004510390150349438, "phrase": "healthcare_innovation"}, {"score": 0.004324156573795793, "phrase": "elderly_people"}, {"score": 0.004251825029135707, "phrase": "knowledge_base"}, {"score": 0.004207230913063179, "phrase": "respective_characteristic_vital_sign_changes"}, {"score": 0.003999578057088828, "phrase": "extensive_research"}, {"score": 0.003957619050032012, "phrase": "particular_needs"}, {"score": 0.0038996120252338556, "phrase": "home_health_services"}, {"score": 0.0037861265016041813, "phrase": "greater_confidence"}, {"score": 0.003660452313567116, "phrase": "clinical_data"}, {"score": 0.0035539019235553897, "phrase": "appropriate_clinical_measures"}, {"score": 0.0034577317021457095, "phrase": "ongoing_works"}, {"score": 0.0031114107447299086, "phrase": "elderly_users"}, {"score": 0.0028654728453890426, "phrase": "video_cameras"}, {"score": 0.0027123819773059127, "phrase": "caretaker_system"}, {"score": 0.0027009493171069763, "phrase": "attention_and_care_services"}, {"score": 0.002519101224544694, "phrase": "ageing_european_society"}, {"score": 0.0024979058181672604, "phrase": "added_burden"}, {"score": 0.002487374917880839, "phrase": "future_generations"}, {"score": 0.002466445792667932, "phrase": "'elderly-to-working-age-people'_ratio"}, {"score": 0.002349467661235186, "phrase": "active_life"}, {"score": 0.002242758902593467, "phrase": "clear_impact"}, {"score": 0.002228587380365811, "phrase": "older_persons'_autonomy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Ambient Assisted Living", " Elderly healthcare", " Sensor network", " Personal area network", " Location-based system", " Fall and mobility sensor", " Caretaker site", " Home System", " Observation patterns", " CAALYX", " eHealth", " eInclusion"], "paper_abstract": "Purpose: This paper describes proposed health care services innovations, provided by a system called CAALYX (Complete Ambient Assisted Living eXperiment). CAALYX aimed to provide healthcare innovation by extending the state-of-the-art in tele-healthcare, by focusing on increasing the confidence of elderly people living autonomously, by building on the knowledge base of the most common disorders and respective characteristic vital sign changes for this age group. Methods: A review of the state-of-the-art on health care services was carried out. Then, extensive research was conducted on the particular needs of the elderly in relation to home health services that, if offered to them, could improve their day life by giving them greater confidence and autonomy. To achieve this, we addressed issues associated with the gathering of clinical data and interpretation of these data, as well as possibilities of automatically triggering appropriate clinical measures. Considering this initial work we started the identification of initiatives, ongoing works and technologies that could be used for the development of the system. After that, the implementation of CAALYX was done. Findings: The innovation in CAALYX system considers three main areas of contribution: (i) The Roaming Monitoring System that is used to collect information on the well-being of the elderly users; (ii) The Home Monitoring System that is aimed at helping the elders independently living at home being implemented by a device (a personal computer or a set top box) that supports the connection of sensors and video cameras that may be used for monitoring and for interaction with the elder; (iii) The Central Care Service and Monitoring System that is implemented by a Caretaker System where attention and care services are provided to elders, where actors as Caretakers, Doctors and Relatives are logically linked to elders. Innovations in each of these areas are presented here. Conclusions: The ageing European society is placing an added burden on future generations, as the 'elderly-to-working-age-people' ratio is set to steadily increase in the future. Nowadays, quality of life and fitness allows for most older persons to have an active life well into their eighties. Furthermore, many older persons prefer to live in their own house and choose their own lifestyle. The CAALYX system can have a clear impact in increasing older persons' autonomy, by ensuring that they do not need to leave their preferred environment in order to be properly monitored and taken care of. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Innovations in health care services: The CAALYX system", "paper_id": "WOS:000326372800007"}