{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cochromatic_number"}, {"score": 0.01295967240368833, "phrase": "running_time"}, {"score": 0.004770461993586338, "phrase": "disjoint_rectangle_stabbing"}, {"score": 0.004726382602809228, "phrase": "iterative_localization"}, {"score": 0.0046394362688524475, "phrase": "permutation_pi"}, {"score": 0.004408456735066782, "phrase": "positive_integer_k"}, {"score": 0.003543804852018315, "phrase": "np-complete_problem"}, {"score": 0.0033515736929172644, "phrase": "n_vertices"}, {"score": 0.0031845067058084613, "phrase": "mentioned_running_time"}, {"score": 0.002656327554326748, "phrase": "\"iterative_localization"}, {"score": 0.0022889103976458437, "phrase": "non-overlapping_axis-parallel_rectangles"}, {"score": 0.002164602220179823, "phrase": "horizontal_and_vertical_lines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "Given a permutation pi of {1, ..., n} and a positive integer k, can n be partitioned into at most k subsequences, each of which is either increasing or decreasing? We give an algorithm with running time 2(o(k2 log k)) n(o(1)) that solves this problem, thereby showing that it is fixed parameter tractable. This NP-complete problem is equivalent to deciding whether the cochromatic number of a given permutation graph on n vertices is at most k. Our algorithm solves in fact a more general problem: within the mentioned running time, it decides whether the cochromatic number of a given perfect graph on n vertices is at most k. To obtain our result we use a combination of two well-known techniques within parameterized algorithms: iterative compression and greedy localization. Consequently we name this combination \"iterative localization\". We further demonstrate the power of this combination by giving an algorithm with running time 2(o(k2 log k)) n log n that decides whether a given set of n non-overlapping axis-parallel rectangles can be stabbed by at most k of a given set of horizontal and vertical lines. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Fixed-parameter algorithms for COCHROMATIC NUMBER and DISJOINT RECTANGLE STABBING via iterative localization", "paper_id": "WOS:000331131800007"}