{"auto_keywords": [{"score": 0.03744658332079375, "phrase": "threshold_value"}, {"score": 0.015719716506582538, "phrase": "sows'_visits"}, {"score": 0.013683039496282945, "phrase": "response_time"}, {"score": 0.013517321540613208, "phrase": "false_alarms"}, {"score": 0.013418842582151343, "phrase": "previously_published_attempts"}, {"score": 0.010825129489949088, "phrase": "relative_deviation"}, {"score": 0.01074605054283321, "phrase": "forecasted_frequency"}, {"score": 0.00862208205349563, "phrase": "previous_attempts"}, {"score": 0.007280544195664705, "phrase": "detection_method"}, {"score": 0.004686462184176846, "phrase": "automatic_detection"}, {"score": 0.004595165037153627, "phrase": "gestation_department"}, {"score": 0.003802135020791801, "phrase": "multiprocess_dynamic_linear_model"}, {"score": 0.0037834649508375544, "phrase": "first_order_markov_probabilities"}, {"score": 0.0034034331737042363, "phrase": "dynamic_generalised_linear_model"}, {"score": 0.003069006373093756, "phrase": "bayes_theorem"}, {"score": 0.0030464123943266673, "phrase": "combined_probability"}, {"score": 0.0027537467491942896, "phrase": "previously_published_studies"}, {"score": 0.0025575259565542912, "phrase": "duration_model"}, {"score": 0.002538687900036229, "phrase": "combined_model"}, {"score": 0.0025075982071533945, "phrase": "frequency_model"}, {"score": 0.0023811153883132536, "phrase": "day-to-day_basis"}, {"score": 0.0022890371899188466, "phrase": "sow_clays"}, {"score": 0.002157538586313944, "phrase": "present_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Automatic", " Group housing", " Heat detection", " Sow", " Oestrus", " State space model"], "paper_abstract": "This paper suggests a method for automatic detection of sows returning to oestrus in the gestation department. The detection is based on monitoring of sows' visits to a boar, where the duration and frequency of visits are modelled separately and subsequently combined. The hypothesis is that it is possible to reduce the response time and the number of false alarms compared to previously published attempts. The duration of visits to a boar is defined as seconds per hour the sow is near the boar - logarithmically transformed. The duration is modelled with a multiprocess dynamic linear model with first order Markov probabilities. The indicator of oestrus is the probability of the model describing oestrus, P(M(OE)), and it is monitored with a threshold value. The frequency of visits to a boar is defined as number of visits per 6 h. A dynamic generalised linear model with two built-in diurnal periods is applied. The indicator of oestrus is the relative deviation from the forecasted frequency, which is monitored with a threshold value. The probability, P(M(OE)), and the relative deviation from the forecasted frequency are combined by means of Bayes Theorem. The combined probability of oestrus is monitored with a threshold value as well. Results indicate that the specificity is superior compared to previously published attempts. The model describing duration alone yields the most satisfactory specificity - 99.4% per sow clay, which is considerably greater than previously published studies. Furthermore, this model detects 87.4% of the sows entering oestrus, which is slightly lower than previous attempts. The response time of the models is 1 h for the duration model and the combined model and 6h for the frequency model. This is better than previous attempts. Even though the specificity is greater, the proportion of false alarms on a day-to-day basis is still too high (91.0%), which is due to the very large proportion of the sow clays defined as non-oestrus. In order to improve the specificity of the detection method, it is suggested to combine the detection method in the present study with other information sources about oestrus. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Detecting oestrus by monitoring sows' visits to a boar", "paper_id": "WOS:000283271800004"}