{"auto_keywords": [{"score": 0.049100450513748305, "phrase": "digital_libraries"}, {"score": 0.008207381299295347, "phrase": "quality_dimensions"}, {"score": 0.00481495049065317, "phrase": "good_digital_library"}, {"score": 0.004283019592801715, "phrase": "formal_framework"}, {"score": 0.004195547459310517, "phrase": "streams"}, {"score": 0.003997891221012094, "phrase": "major_dl_concept"}, {"score": 0.003757480190200645, "phrase": "numerical_indicators"}, {"score": 0.0036301992752948956, "phrase": "key_concepts"}, {"score": 0.003592859432554987, "phrase": "minimal_dl"}, {"score": 0.0028616432465945097, "phrase": "response_time"}, {"score": 0.0026616868981501006, "phrase": "service_failures"}, {"score": 0.002580315755140875, "phrase": "key_dl_concepts"}, {"score": 0.0024333239726872604, "phrase": "\"real-world\"_digital_libraries"}, {"score": 0.002367071650093765, "phrase": "proposed_dimensions"}, {"score": 0.0023507916951658455, "phrase": "dl_quality"}, {"score": 0.0023265809733919547, "phrase": "expanded_version"}, {"score": 0.002302619021497886, "phrase": "workshop's_consensus_view"}, {"score": 0.00227890329511847, "phrase": "life_cycle"}, {"score": 0.002163930783583212, "phrase": "quality_issues"}, {"score": 0.0021049977753042253, "phrase": "improved_-_as_well_as_how_possible_quality_problems"}], "paper_keywords": ["quality", " evaluation", " digital libraries", " theory", " information life cycle"], "paper_abstract": "In this article, we elaborate on the meaning of quality in digital libraries (DLs) by proposing a model that is deeply grounded in a formal framework for digital libraries: 5S (Streams, Structures, Spaces, Scenarios, and Societies). For each major DL concept in the framework we formally define a number of dimensions of quality and propose a set of numerical indicators for those quality dimensions. In particular, we consider key concepts of a minimal DL: catalog, collection, digital object, metadata specification, repository, and services. Regarding quality dimensions, we consider: accessibility, accuracy, completeness, composability, conformance, consistency, effectiveness, efficiency, extensibility, pertinence, preservability, relevance, reliability, reusability, significance, similarity, and timeliness. Regarding measurement, we consider characteristics like: response time (with regard to efficiency), cost of migration (with respect to preservability), and number of service failures (to assess reliability). For some key DL concepts, the (quality dimension, numerical indicator) pairs are illustrated through their application to a number of \"real-world\" digital libraries. We also discuss connections between the proposed dimensions of DL quality and an expanded version of a workshop's consensus view of the life cycle of information in digital libraries. Such connections can be used to determine when and where quality issues can be measured, assessed, and improved - as well as how possible quality problems can be prevented, detected, and eliminated. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "What is a good digital library? A quality model for digital libraries", "paper_id": "WOS:000246869800017"}