{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ad_hoc_mobile_network"}, {"score": 0.04291463554374662, "phrase": "transit_nodes"}, {"score": 0.004765686919942249, "phrase": "conventional_mobile_telephone_networks"}, {"score": 0.0046526806928044485, "phrase": "base_station"}, {"score": 0.004374192072307276, "phrase": "base-station_infrastructure"}, {"score": 0.003973619384183145, "phrase": "interesting_questions"}, {"score": 0.0038793218280304825, "phrase": "ad_hoc_mobile_networks"}, {"score": 0.003404998261799824, "phrase": "'credit_balance"}, {"score": 0.0033241495608238884, "phrase": "transit_calls"}, {"score": 0.0032675746199502614, "phrase": "one's_own_calls"}, {"score": 0.0032340913850061764, "phrase": "second_question"}, {"score": 0.003019444345150991, "phrase": "reasonable_quality"}, {"score": 0.0028975361811534265, "phrase": "user's_battery_energy"}, {"score": 0.0027144744718498102, "phrase": "network_occupancy"}, {"score": 0.002640889905429026, "phrase": "stochastic_fluid_models"}, {"score": 0.002398664348595521, "phrase": "user's_handset"}, {"score": 0.0023017619208704067, "phrase": "critical_rates"}, {"score": 0.0021711323811863963, "phrase": "recharge_rates"}, {"score": 0.002141487053045766, "phrase": "critical_values"}, {"score": 0.0021049977753042253, "phrase": "reduced-load_approach"}], "paper_keywords": ["Stochastic fluid model", " Ad hoc network"], "paper_abstract": "In conventional mobile telephone networks, users communicate directly with a base station, via which their call is transferred to the recipient. In an ad hoc mobile network, there is no base-station infrastructure and users need to communicate between themselves, either directly if they are close enough, or via transit nodes if they are not. A number of interesting questions immediately arise in the modeling of ad hoc mobile networks. One that has received attention in the literature concerns how to encourage users to act as transit nodes for calls that they are not partaking in. Solutions to this problem have involved each user maintaining a 'credit balance' which is increased by forwarding transit calls and decreased by transmitting one's own calls. A second question concerns the 'amount of resource' that a network needs in order to be able to operate with a reasonable quality of service. We shall consider this question by modeling each user's battery energy and credit balance as fluids, the rate of increase or decrease of which is modulated by the network occupancy. This results in a network of stochastic fluid models, each modulated by the same background process. In this paper, we shall assume that there is no bound on the energy or the credit that a user's handset can accumulate. Using this model, we can calculate the critical rates of recharge that are necessary and sufficient to guarantee that no calls are lost. For recharge rates less than the critical values, we propose a reduced-load approach to the analysis of the network.", "paper_title": "A stochastic fluid model for an ad hoc mobile network", "paper_id": "WOS:000272576200006"}