{"auto_keywords": [{"score": 0.04922237591220716, "phrase": "convex_polyhedra"}, {"score": 0.046736465664965976, "phrase": "numerical_variables"}, {"score": 0.00481495049065317, "phrase": "space_dimension"}, {"score": 0.004771672073078768, "phrase": "polyhedra_computations"}, {"score": 0.004300951511110487, "phrase": "so-called_double_description"}, {"score": 0.003983016985197904, "phrase": "linear_inequalities"}, {"score": 0.00389404213807752, "phrase": "convex_hull"}, {"score": 0.002889444701599236, "phrase": "affine_equations"}, {"score": 0.002455168454109375, "phrase": "cartesian_product"}, {"score": 0.0024111277643627154, "phrase": "lower_dimensions"}, {"score": 0.0022224972632835416, "phrase": "cartesian_products"}, {"score": 0.0021337783230121286, "phrase": "cartesian_factoring"}, {"score": 0.0021049977753042253, "phrase": "suitable_variable_change"}], "paper_keywords": ["program analysis", " linear relation analysis", " convex polyhedra", " double description", " Cartesian product of polyhedra"], "paper_abstract": "Convex polyhedra are often used to approximate sets of states of programs involving numerical variables. The manipulation of convex polyhedra relies on the so-called double description, consisting of viewing a polyhedron both as the set of solutions of a system of linear inequalities, and as the convex hull of a system of generators, i.e., a set of vertices and rays. The cost of these manipulations is highly dependent on the number of numerical variables, since the size of each representation can be exponential in the dimension of the space. In this paper, we investigate some ways for reducing the dimension: On one hand, when a polyhedron satisfies affine equations, these equations can obviously be used to eliminate some variables. On the other hand, when groups of variables are unrelated with each other, this means that the polyhedron is in fact a Cartesian product of polyhedra of lower dimensions. Detecting such Cartesian factoring is not very difficult, but we adapt also the operations to work on Cartesian products. Finally, we extend the applicability of Cartesian factoring by applying suitable variable change, in order to maximize the factoring.", "paper_title": "Some ways to reduce the space dimension in polyhedra computations", "paper_id": "WOS:000239021600003"}