{"auto_keywords": [{"score": 0.04326843865238173, "phrase": "rna_secondary_structures"}, {"score": 0.015376319150867715, "phrase": "protein-rna_interactions"}, {"score": 0.008713768692145006, "phrase": "base-pairing_probabilities"}, {"score": 0.004703062108628475, "phrase": "unpaired_nucleotides"}, {"score": 0.004274257668843717, "phrase": "secondary_structures"}, {"score": 0.004179824713643488, "phrase": "important_role"}, {"score": 0.004102719715406821, "phrase": "protein-rna_complexes"}, {"score": 0.0039380388343479384, "phrase": "useful_approach"}, {"score": 0.003865376734263166, "phrase": "recent_studies"}, {"score": 0.0034954725617970294, "phrase": "base_pair"}, {"score": 0.003392804886610623, "phrase": "richer_and_more_robust_information"}, {"score": 0.0033177813460815346, "phrase": "single_rna_secondary_structure"}, {"score": 0.002847540262784593, "phrase": "rna_molecules"}, {"score": 0.002815864555488112, "phrase": "known_protein-rna_complexes"}, {"score": 0.002712794864739074, "phrase": "tertiary_structures"}, {"score": 0.002574788013427524, "phrase": "intermolecular_hydrogen_bonds"}, {"score": 0.0025272158996086378, "phrase": "amino_acids"}, {"score": 0.002319431279824863, "phrase": "paired_nucleotides"}, {"score": 0.002285075675790214, "phrase": "intermolecular_hbonds"}, {"score": 0.002128694000627911, "phrase": "mccaskill_model"}, {"score": 0.0021049977753042253, "phrase": "turner's_free_energy"}], "paper_keywords": [""], "paper_abstract": "Motivation: Understanding the details of protein-RNA interactions is important to reveal the functions of both the RNAs and the proteins. In these interactions, the secondary structures of the RNAs play an important role. Because RNA secondary structures in protein-RNA complexes are variable, considering the ensemble of RNA secondary structures is a useful approach. In particular, recent studies have supported the idea that, in the analysis of RNA secondary structures, the base-pairing probabilities (BPPs) of RNAs (i.e. the probabilities of forming a base pair in the ensemble of RNA secondary structures) provide richer and more robust information about the structures than a single RNA secondary structure, for example, the minimum free energy structure or a snapshot of structures in the Protein Data Bank. However, there has been no investigation of the BPPs in protein-RNA interactions. Results: In this study, we analyzed BPPs of RNA molecules involved in known protein-RNA complexes in the Protein Data Bank. Our analysis suggests that, in the tertiary structures, the BPPs (which are computed using only sequence information) for unpaired nucleotides with intermolecular hydrogen bonds (hbonds) to amino acids were significantly lower than those for unpaired nucleotides without hbonds. On the other hand, no difference was found between the BPPs for paired nucleotides with and without intermolecular hbonds. Those findings were commonly supported by three probabilistic models, which provide the ensemble of RNA secondary structures, including the McCaskill model based on Turner's free energy of secondary structures.", "paper_title": "Analysis of base-pairing probabilities of RNA molecules involved in protein-RNA interactions", "paper_id": "WOS:000325485800002"}