{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "navigating_academic-industry_collaborations"}, {"score": 0.0047851345246117455, "phrase": "information_systems_research"}, {"score": 0.00474075475474847, "phrase": "rigor_mortis"}, {"score": 0.0047113960612140335, "phrase": "research_collaboration"}, {"score": 0.004386503433248535, "phrase": "information_systems_researchers"}, {"score": 0.004318881178805575, "phrase": "industry_collaborations"}, {"score": 0.004096635798793164, "phrase": "engaging_industry"}, {"score": 0.003802135020791801, "phrase": "full_range"}, {"score": 0.003743487506598038, "phrase": "reasonable_tradeoffs"}, {"score": 0.003640183972131238, "phrase": "longer-term_sustainable_relationships"}, {"score": 0.003517773841528639, "phrase": "building_blocks"}, {"score": 0.0034100553723847037, "phrase": "strategic_academic-industry_collaborations"}, {"score": 0.0032953582866530966, "phrase": "key_themes"}, {"score": 0.0027172101552870973, "phrase": "academic-industry_research"}, {"score": 0.002691957489907003, "phrase": "roadmap_framework"}, {"score": 0.0025452819305349416, "phrase": "particular_point"}, {"score": 0.002362041061180632, "phrase": "coordinated_manner"}, {"score": 0.0021247560305587155, "phrase": "systematic_and_coordinated_manner"}, {"score": 0.0021049977753042253, "phrase": "academic-industry_collaborations"}], "paper_keywords": ["Academic-industry research linkage", " strategic planning", " technology roadmap", " collaboration"], "paper_abstract": "Research collaboration between industry and academia remains challenging despite progress being made on a number of fronts. We are not implying that all information systems researchers should be engaging in industry collaborations, nor should the value of critique and work exclusively addressing academic and other audiences be viewed as less valuable than those engaging industry. The intent is instead to encourage more industry collaboration, and for those considering such initiatives to roadmap the activities strategically giving consideration to the full range of activities required so reasonable tradeoffs can be made in the context of building longer-term sustainable relationships. We develop a roadmap from literature that organizes the building blocks (component activities) needed to plan and implement strategic academic-industry collaborations over longer time horizons. Specifically, we identify the key themes or layers of (1) Strategic Business Problem(s), (2) Governance, (3) Funding Criteria, (4) Privacy, Security and Ethics, (5) Intellectual Property, (6) Research Design and (7) Recognized Outputs, which need to be in place if you are to succeed with academic-industry research. The roadmap framework highlights the need to consider the implications of the components across each of the layers at a particular point in time (vertical slice), the relationship between layers (dependencies) and the need for aligning the various activities in a coordinated manner; otherwise success at one layer is often undermined by a lack of awareness or failure at another layer. Our hope is that these themes (layers) facilitate organizing this collaboration in a systematic and coordinated manner to produce academic-industry collaborations that progressively improve over time.", "paper_title": "A Strategic Roadmap for Navigating Academic-Industry Collaborations in Information Systems Research: Avoiding Rigor Mortis", "paper_id": "WOS:000357928400003"}