{"auto_keywords": [{"score": 0.03711366874776074, "phrase": "full_epmcreate"}, {"score": 0.009341488648591956, "phrase": "power-only_epmcreate"}, {"score": 0.00481495049065317, "phrase": "optimized_epmcreate"}, {"score": 0.004744018246633455, "phrase": "creativity_enhancement_technique"}, {"score": 0.004697308822154191, "phrase": "web_site_requirements"}, {"score": 0.004515004397496303, "phrase": "requirements_elicitation"}, {"score": 0.003969784439380027, "phrase": "requirements-elicitation_effectiveness"}, {"score": 0.0032724821705972357, "phrase": "university_students"}, {"score": 0.0029784342137867776, "phrase": "high_school's_public_web_site"}, {"score": 0.0028911669203979156, "phrase": "first_experiment"}, {"score": 0.00240662380079115, "phrase": "second_experiment"}, {"score": 0.0021049977753042253, "phrase": "requirement_idea"}], "paper_keywords": ["Creativity", " Creativity enhancement techniques", " Controlled experiment", " Multiple viewpoints", " Optimization of creativity enhancement technique", " Pragmatics of communication", " Requirements elicitation"], "paper_abstract": "Creativity is often needed in requirements elicitation, i.e., requirement idea generation; and techniques to enhance creativity are believed to be useful. This paper describes two controlled experiments to compare the requirements-elicitation effectiveness of three creativity enhancement techniques (CET): (1) full EPMcreate; (2) Power-Only EPMcreate, an optimization of full EPMcreate; and (3) traditional brainstorming. In each experiment, one team of university students applied one of the two or three CETs under study in the experiment to generate ideas for requirements for enhancing a high school's public Web site. The results of the first experiment indicate that Power-Only EPMcreate is more effective, by the quantity and quality of the ideas generated, than the full EPMcreate, which is, in turn, more effective than brainstorming. The results of the second experiment confirm that Power-Only EPMcreate is more effective, by the same measures, than full EPMcreate. In each experiment, for the sake of uniform, reproducible evaluation, a requirement idea is considered high quality if it is both new and useful.", "paper_title": "The effectiveness of an optimized EPMcreate as a creativity enhancement technique for Web site requirements elicitation", "paper_id": "WOS:000307719600002"}