{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "design_process_dynamics"}, {"score": 0.040523767794461374, "phrase": "different_levels"}, {"score": 0.03706515189232586, "phrase": "design_process"}, {"score": 0.004668957916795845, "phrase": "formal_analysis"}, {"score": 0.004390060342250211, "phrase": "formal_theory"}, {"score": 0.00421340730888561, "phrase": "automated_support"}, {"score": 0.004106612344123407, "phrase": "design_processes"}, {"score": 0.0039010428828989826, "phrase": "dynamic_design_properties"}, {"score": 0.0036678472439508484, "phrase": "component-based_design_processes"}, {"score": 0.003413284742632989, "phrase": "generic_properties"}, {"score": 0.0030798711656591948, "phrase": "complex_properties"}, {"score": 0.0023451553255837317, "phrase": "automatic_simulation"}, {"score": 0.0021267708018655493, "phrase": "interlevel_relationships"}], "paper_keywords": ["Declarative Modeling", " Design Processes", " Dynamics", " Logical Analysis", " Simulation"], "paper_abstract": "This paper presents a formal analysis of design process dynamics. Such a formal analysis is a prerequisite to come to a formal theory of design and for the development of automated support for the dynamics of design processes. The analysis was geared toward the identification of dynamic design properties at different levels of aggregation. This approach is specifically suitable for component-based design processes. A complicating factor for supporting the design process is that not only the generic properties of design must be specified, but also the language chosen should be rich enough to allow specification of complex properties of the system Under design. This requires a language rich enough to operate at these different levels. The Temporal Trace Language used in this paper is suitable for that. The paper shows that the analysis at the level of a design process as a whole and at subprocesses thereof is precise enough to allow for automatic simulation. Simulation allows the modeler to manipulate the specifications of the system under design to better understand the interlevel relationships in his design. The approach is illustrated by an example.", "paper_title": "Formal analysis of design process dynamics", "paper_id": "WOS:000280031000010"}