{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiple_disciplines"}, {"score": 0.0047310525657970615, "phrase": "author_research_impact"}, {"score": 0.004527619017250708, "phrase": "citer_analysis"}, {"score": 0.0037973594873521596, "phrase": "citer-based_outcome_measures"}, {"score": 0.0032697235411641695, "phrase": "significant_differences"}, {"score": 0.003212663446866797, "phrase": "citer-based_outcomes"}, {"score": 0.002941913249957503, "phrase": "high_degree"}, {"score": 0.002790511479398411, "phrase": "citation-based_measures"}, {"score": 0.0025106241866273897, "phrase": "social_sciences"}, {"score": 0.0024667783849055634, "phrase": "citer-based_measures"}, {"score": 0.0024024377855956136, "phrase": "slightly_different_rankings"}, {"score": 0.002298902547676131, "phrase": "citer_counts"}, {"score": 0.0021049977753042253, "phrase": "citation_measures"}], "paper_keywords": [""], "paper_abstract": "Author research impact was examined based on citer analysis (the number of citers as opposed to the number of citations) for 90 highly cited authors grouped into three broad subject areas. Citer-based outcome measures were also compared with more traditional citation-based measures for levels of association. The authors found that there are significant differences in citer-based outcomes among the three broad subject areas examined and that there is a high degree of correlation between citer and citation-based measures for all measures compared, except for two outcomes calculated for the social sciences. Citer-based measures do produce slightly different rankings of authors based on citer counts when compared to more traditional citation counts. Examples are provided. Citation measures may not adequately address the influence, or reach, of an author because citations usually do not address the origin of the citation beyond self-citations.", "paper_title": "A Comparison of Citer and Citation-Based Measure Outcomes for Multiple Disciplines", "paper_id": "WOS:000282778400010"}