{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "online_disclosure_of_personally_identifiable_information"}, {"score": 0.004633429997452688, "phrase": "public_and_private_sharing"}, {"score": 0.004545240514015278, "phrase": "personally_identifiable_information"}, {"score": 0.0041023644174418205, "phrase": "security_breaches"}, {"score": 0.0033200826267264383, "phrase": "online_social_networking"}, {"score": 0.003194736764837261, "phrase": "widespread_use"}, {"score": 0.002977061391551628, "phrase": "'wall_posts"}, {"score": 0.0029203055813347874, "phrase": "profile_pages"}, {"score": 0.0028830690329478465, "phrase": "online_social_networks"}, {"score": 0.0021049977753042253, "phrase": "public_channel"}], "paper_keywords": ["Social aspects of security and privacy", " personally identifiable information", " self-disclosure", " social networks (social computing)", " social engineering attacks"], "paper_abstract": "Safeguarding personally identifiable information (PII) is crucial because such information is increasingly used to engineer privacy attacks, identity thefts and security breaches. But is it likely that individuals may choose to just share this information with strangers? This study examines how reciprocation can lead to the disclosure of PII between strangers in online social networking. We demonstrate that the widespread use of public, one-to-many, communication channels such as 'wall posts' and profile pages in online social networks poses an exception to the assumption that reciprocation happens on one-to-one channels. We find that individuals not only reciprocate and share PII when the disclosure of such information is private and directed towards them by a stranger, but also when the stranger shares this information through a public channel that is not directed towards anyone in particular. Implications for privacy and design are discussed.", "paper_title": "Online Disclosure of Personally Identifiable Information with Strangers: Effects of Public and Private Sharing", "paper_id": "WOS:000344604900007"}