{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "common_language"}, {"score": 0.004555499634179394, "phrase": "systems_approach"}, {"score": 0.004513631630494221, "phrase": "systems_science"}, {"score": 0.004410629943506433, "phrase": "historical_origins"}, {"score": 0.004002972723329302, "phrase": "similar_histories"}, {"score": 0.003839962121679795, "phrase": "transparent_communication"}, {"score": 0.0037177622939493084, "phrase": "authors'_research"}, {"score": 0.0031625006830124512, "phrase": "standard_lexicon"}, {"score": 0.002936997013291548, "phrase": "key_concepts"}, {"score": 0.002896535621940078, "phrase": "observer_effect"}, {"score": 0.0021049977753042253, "phrase": "case_studies"}], "paper_keywords": ["Metathinking", " systems analysis", " systems approach", " systems engineering", " systems science", " systems thinking"], "paper_abstract": "The concept of systems thinking (and its embodiment in systems approach and systems science) dates from the historical origins of engineering, policy, and philosophy. However, unlike mathematics, physics, biology, and other fields with similar histories, systems thinking lacks a common language that facilitates transparent communication across domains. Examples from the authors' research and from literature show that research in and the practice of systems thinking would benefit from a common language and foundation of systems thinking. We present for discussion the results of our metathinking approach to a standard lexicon of systems thinking, i.e., the Dimensions of Systems Thinking. We also introduce key concepts including the observer effect of systems thinking, the difference between the scope of the analysis and the boundaries of the system, and the distinction between the metrics and indices of performance of a system. The way forward will be to discuss and debate the elements of the language of systems thinking, to establish criteria for evaluating the quality of systems thinking, and to test this methodology on case studies.", "paper_title": "Systems Thinking About Systems Thinking A Proposal for a Common Language", "paper_id": "WOS:000365406200002"}