{"auto_keywords": [{"score": 0.03268091912168994, "phrase": "functional_discrepancies"}, {"score": 0.02234024635400661, "phrase": "firewall_policy"}, {"score": 0.008598108652193424, "phrase": "firewall_policies"}, {"score": 0.008183764578667003, "phrase": "diverse_firewall_design"}, {"score": 0.00786659820139694, "phrase": "comparison_phase"}, {"score": 0.007763609968087822, "phrase": "resolution_phase"}, {"score": 0.00481495049065317, "phrase": "enterprise_security"}, {"score": 0.004720419202969916, "phrase": "private_networks"}, {"score": 0.0045820747375409435, "phrase": "security_holes"}, {"score": 0.0045218909699308385, "phrase": "malicious_traffic"}, {"score": 0.004447766706144458, "phrase": "private_network"}, {"score": 0.004403874076980828, "phrase": "legitimate_traffic"}, {"score": 0.004360412703519539, "phrase": "normal_business_processes"}, {"score": 0.003845500924733243, "phrase": "important_issue"}, {"score": 0.0034706569037527774, "phrase": "design_phase"}, {"score": 0.0033576858946833587, "phrase": "multiple_teams"}, {"score": 0.0032916702592724217, "phrase": "different_versions"}, {"score": 0.0031845067058084583, "phrase": "resulting_multiple_versions"}, {"score": 0.0028267211555015295, "phrase": "major_technical_challenge"}, {"score": 0.00257640185288362, "phrase": "construction_algorithm"}, {"score": 0.0025509294021449254, "phrase": "shaping_algorithm"}, {"score": 0.002387415084371473, "phrase": "firewall_policy_change_impact_analysis"}, {"score": 0.0022641658133181115, "phrase": "new_threats"}, {"score": 0.0022049428043454966, "phrase": "unintended_side_effects"}, {"score": 0.0021903801614787423, "phrase": "policy_changes"}, {"score": 0.0021049977753042253, "phrase": "firewall_policy_changes"}], "paper_keywords": ["firewall policy", " policy design", " design diversity", " change impact analysis", " network security"], "paper_abstract": "Firewalls are the mainstay of enterprise security and the most widely adopted technology for protecting private networks. An error in a firewall policy either creates security holes that will allow malicious traffic to sneak into a private network or blocks legitimate traffic and disrupts normal business processes, which, in turn, could lead to irreparable, if not tragic, consequences. It has been observed that most firewall policies on the Internet are poorly designed and have many errors. Therefore, how one can design firewall policies correctly is an important issue. In this paper, we propose the method of diverse firewall design, which consists of three phases: a design phase, a comparison phase, and a resolution phase. In the design phase, the same requirement specification of a firewall policy is given to multiple teams who proceed independently to design different versions of the firewall policy. In the comparison phase, the resulting multiple versions are compared with each other to detect all functional discrepancies between them. In the resolution phase, all discrepancies are resolved, and a firewall that is agreed upon by all teams is generated. The major technical challenge in the method of diverse firewall design is how one can discover all functional discrepancies between two given firewall policies. We present a series of three efficient algorithms for solving this problem: a construction algorithm, a shaping algorithm, and a comparison algorithm. The algorithms for discovering all functional discrepancies between two given firewall policies can be used to perform firewall policy change impact analysis as well. Firewall policies often need to be changed, as networks evolve, and new threats emerge. Many firewall policy errors are caused by the unintended side effects of policy changes. Our algorithms can be used directly to compute the impact of firewall policy changes by computing the functional discrepancies between the policy before changes and the policy after changes.", "paper_title": "Diverse firewall design", "paper_id": "WOS:000257869100008"}