{"auto_keywords": [{"score": 0.036360715031530384, "phrase": "collective_efficacy_evolution"}, {"score": 0.031297647005659415, "phrase": "distributed_organizations"}, {"score": 0.007740489563401459, "phrase": "collective_efficacy"}, {"score": 0.004646258518859209, "phrase": "interdependent_network"}, {"score": 0.004378078970574258, "phrase": "members'_cognitive_processes"}, {"score": 0.00430067200637091, "phrase": "important_role"}, {"score": 0.0037731618765688584, "phrase": "intrinsic_property"}, {"score": 0.0035977623578676496, "phrase": "interdependent_network_model"}, {"score": 0.0035341028694769036, "phrase": "simulation_experiments"}, {"score": 0.003290494847464381, "phrase": "planned_behavior"}, {"score": 0.003251552926963083, "phrase": "experiment_results"}, {"score": 0.0031750418391373035, "phrase": "distributed_organizations_operation"}, {"score": 0.002608583927848071, "phrase": "task_difficulty"}, {"score": 0.0025776913268808124, "phrase": "considerable_effect"}, {"score": 0.002399850604120431, "phrase": "interdependent_network_structure"}, {"score": 0.00213023743193503, "phrase": "members'_collective_efficacy"}], "paper_keywords": ["Distributed organizations", " interdependent network", " simulation", " theory of planned behavior", " collective efficacy"], "paper_abstract": "Because of the temporal, spatial, and functional dimensions in distributed organizations, members' cognitive processes play an important role in executing tasks. Coordination is necessary for successfully finishing tasks in distributed organizations. Meanwhile, interdependence between sub-units is an intrinsic property of distributed organizations. We put forward an interdependent network model and applied simulation experiments to study the collective efficacy evolution of distributed organizations based on the theory of planned behavior. Experiment results show several insights for distributed organizations operation: (1) organizational size has an impact on collective efficacy evolution, and a size that is too small or too large is not helpful; (2) task payoff and task cost affect collective efficacy evolution only slightly, while task difficulty has considerable effect on collective efficacy evolution and distribution; (3) coordinating willingness affects interdependent network structure of distributed organizations, and further influences collective efficacy evolution and distribution; (4) a slightly interdependent weight difference between sub-units can benefit collective efficacy evolution and enhance members' collective efficacy; (5) imbalance in the size of sub-units decreases the collective efficacy.", "paper_title": "Modeling and simulation of the collective efficacy of distributed organizations: toward an interdependent network", "paper_id": "WOS:000354483200006"}