{"auto_keywords": [{"score": 0.03497384517240798, "phrase": "participatory_modelling"}, {"score": 0.00481495049065317, "phrase": "stakeholder_engagement"}, {"score": 0.004515655183335171, "phrase": "buzz_words"}, {"score": 0.0044795698035664695, "phrase": "hardly_any_environmental_assessment"}, {"score": 0.004052007312730483, "phrase": "positive_development"}, {"score": 0.003987474771008829, "phrase": "far_too_many_cases"}, {"score": 0.0038925903520043623, "phrase": "lip_service"}, {"score": 0.0036504182609411852, "phrase": "better_decisions"}, {"score": 0.003171740347925348, "phrase": "powerful_tool"}, {"score": 0.003071429173571846, "phrase": "stakeholders_knowledge"}, {"score": 0.002915125480162171, "phrase": "collaborative_learning"}, {"score": 0.0026792166577171476, "phrase": "decision_making"}, {"score": 0.0025736694380861604, "phrase": "overview_paper"}, {"score": 0.002512342528545883, "phrase": "different_types"}, {"score": 0.0024922258873137093, "phrase": "stakeholder_modelling"}, {"score": 0.0024036710362692042, "phrase": "stakeholder_participation"}, {"score": 0.0021049977753042253, "phrase": "future_directions"}], "paper_keywords": ["Participatory modelling", " Companion modelling", " Collaborative decision making", " Shared learning", " Co-learning", " Co-management"], "paper_abstract": "Stakeholder engagement, collaboration, or participation, shared learning or fact-finding, have become buzz words and hardly any environmental assessment or modelling effort today can be presented without some kind of reference to stakeholders and their involvement in the process. This is clearly a positive development, but in far too many cases stakeholders have merely been paid lip service and their engagement has consequentially been quite nominal. Nevertheless, it is generally agreed that better decisions are implemented with less conflict and more success when they are driven by stakeholders, that is by those who will be bearing their consequences. Participatory modelling, with its various types and clones, has emerged as a powerful tool that can (a) enhance the stakeholders knowledge and understanding of a system and its dynamics under various conditions, as in collaborative learning, and (b) identify and clarify the impacts of solutions to a given problem, usually related to supporting decision making, policy, regulation or management. In this overview paper we first look at the different types of stakeholder modelling, and compare participatory modelling to other frameworks that involve stakeholder participation. Based on that and on the experience of the projects reported in this issue and elsewhere, we draw some lessons and generalisations. We conclude with an outline of some future directions. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Modelling with stakeholders", "paper_id": "WOS:000279666700002"}