{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tag_clouds"}, {"score": 0.023123091003398016, "phrase": "credible_content"}, {"score": 0.019602191265063174, "phrase": "semantic_web"}, {"score": 0.009673303927204002, "phrase": "online_content"}, {"score": 0.004778326476360351, "phrase": "online_health_message_forums"}, {"score": 0.004727518163978813, "phrase": "health-oriented_content"}, {"score": 0.004691556052059608, "phrase": "inaccurate_or_inappropriate_medical_information"}, {"score": 0.00465586622330031, "phrase": "health-related_decisions"}, {"score": 0.004515789121272748, "phrase": "recent_internet_technologies"}, {"score": 0.004413491688169667, "phrase": "site_users_'tag"}, {"score": 0.00419648657869902, "phrase": "descriptive_tools"}, {"score": 0.004101392594364389, "phrase": "overall_efforts"}, {"score": 0.0038699836459096817, "phrase": "multiple_word_search_feature"}, {"score": 0.003799644994865129, "phrase": "online_message_forums"}, {"score": 0.0037822602407339757, "phrase": "targeted_respondents"}, {"score": 0.003759203770250454, "phrase": "web_sites_message_forums"}, {"score": 0.0037477280968615722, "phrase": "disease_self-management"}, {"score": 0.003579722603150739, "phrase": "content_area"}, {"score": 0.0035039092345666768, "phrase": "increasing_prevalence"}, {"score": 0.0033828167368883254, "phrase": "purposive_sampling_techniques"}, {"score": 0.0033673326767665454, "phrase": "screening_instrument"}, {"score": 0.0033060996061207632, "phrase": "demographic_and_computer_usage_survey"}, {"score": 0.003280914545428472, "phrase": "usability_tests"}, {"score": 0.003138566996634237, "phrase": "tag_cloud"}, {"score": 0.003124197428430097, "phrase": "six_structured_credibility_terms"}, {"score": 0.003053327420808945, "phrase": "morae_usability"}, {"score": 0.0030069734450902208, "phrase": "participants'_use"}, {"score": 0.0029932045537931734, "phrase": "study_environment"}, {"score": 0.0029613211001885587, "phrase": "spss_version"}, {"score": 0.0029030046480550942, "phrase": "thematic_text_analysis"}, {"score": 0.0028458333272988402, "phrase": "internet_resources"}, {"score": 0.0027139919055565783, "phrase": "message_forums"}, {"score": 0.002545032973501407, "phrase": "structured_credibility_tags"}, {"score": 0.0023323907806977674, "phrase": "structured_tags"}, {"score": 0.002304000094573908, "phrase": "useful_way"}, {"score": 0.0022482489333754603, "phrase": "current_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Internet", " World Wide Web", " Communications media", " Patient education", " Healthcare quality", " Access", " Evaluation"], "paper_abstract": "Background: Web sites with health-oriented content are potentially harmful if inaccurate or inappropriate medical information is used to make health-related decisions. Checklists, rating systems and guidelines have been developed to help people determine what is credible, but recent Internet technologies emphasize applications that are collaborative in nature, including tags and tag clouds, where site users 'tag' or label online content, each using their own labelling system. Concepts such as the date, reference, author, testimonial and quotations are considered predictors of credible content. An understanding of these descriptive tools, how they relate to the depiction of credibility and how this relates to overall efforts to label data in relation to the semantic web has yet to emerge. Purpose: This study investigates how structured (pre-determined) and unstructured (user-generated) tags and tag clouds with a multiple word search feature are used by participants to assess credibility of messages posted in online message forums. The targeted respondents were those using web sites message forums for disease self-management. We also explored the relevancy of our findings to the labelling or indexing of data in the context of the semantic web. Method: Diabetes was chosen as the content area in this study, since (a) this is a condition with increasing prevalence and (b) diabetics have been shown to actively use the Internet to manage their condition. From January to March 2010 participants were recruited using purposive sampling techniques. A screening instrument was used to determine eligibility. The study consisted of a demographic and computer usage survey, a series of usability tests and an interview. We tested participants (N = 22) on two scenarios, each involving tasks that assessed their ability to tag content and search using a tag cloud that included six structured credibility terms (statistics, date, reference, author, testimonial and quotations). MORAE Usability software (version 3.1) was employed to record participants' use of the study environment. The surveys were analyzed using SPSS version 17. Interviews with participants were transcribed, coded and analyzed using thematic text analysis with the aid of NVivo8. Findings: Most participants had experience with Internet resources. However, less than one quarter of this sample had seen or used tags or a tag clouds. The ways in which participants used tags to label the content posted in the message forums varied. Some participants were tagging the information for their own subsequent use, whereas others viewed this process from the perspective of others: they tagged the content in ways that they thought other users would find beneficial. Many participants did not use the structured credibility tags when asked to search for credible content. The interviews corroborated these findings by confirming participants were not considering credibility foremost when tagging. Conclusion: Many participants in this study focused on assessing whether the information was relevant to their current circumstances, after which they would proceed to determine its credibility by corroborating with other sources. The use of structured tags to label information may not be a useful way to encourage the use of tagging, or to indicate credibility in this context. Current applications used in the semantic web automate this process. Therefore it may be useful to engage consumers of online content, in particular health-related content, to be more directly involved in the annotation of this content. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The use of tags and tag clouds to discern credible content in online health message forums", "paper_id": "WOS:000298152700004"}