{"auto_keywords": [{"score": 0.04058608302065266, "phrase": "super-polynomial_lower_bounds"}, {"score": 0.01547829663661341, "phrase": "arithmetic_formulas"}, {"score": 0.007362993969008346, "phrase": "general_arithmetic_formulas"}, {"score": 0.006239765053925701, "phrase": "degree_r"}, {"score": 0.005454938189954406, "phrase": "polynomial_size_formula"}, {"score": 0.004950806961312277, "phrase": "small_degree"}, {"score": 0.00481495049065317, "phrase": "tensor-rank"}, {"score": 0.004594137808658537, "phrase": "tensor_a"}, {"score": 0.003990385737207714, "phrase": "strong_enough_lower_bounds"}, {"score": 0.0037246656582642272, "phrase": "new_approach"}, {"score": 0.0032246835734680377, "phrase": "homogeneous_formula"}, {"score": 0.002944465517142163, "phrase": "polynomial_size_homogeneous_formula"}, {"score": 0.0028715339401553003, "phrase": "nisan"}, {"score": 0.002853582531927053, "phrase": "wigderson"}, {"score": 0.0023864566654035924, "phrase": "set-multilinear_formula"}, {"score": 0.002158505888557746, "phrase": "polynomial_size_set-multilinear_formula"}, {"score": 0.0021049977753042253, "phrase": "set-multilinear_formulas"}], "paper_keywords": ["Theory", " Arithmetic circuits", " lower bounds", " tensor rank", " homogenous circuits", " multilinear circuits"], "paper_abstract": "We show that any explicit example for a tensor A : [n](r)-> F with tensor-rank >= n(r center dot(1-o(1))), where r = r( n) <= log n/log logn is super-constant, implies an explicit super-polynomial lower bound for the size of general arithmetic formulas over F. This shows that strong enough lower bounds for the size of arithmetic formulas of depth 3 imply super-polynomial lower bounds for the size of general arithmetic formulas. One component of our proof is a new approach for homogenization and multilinearization of arithmetic formulas, that gives the following results: We show that for any n-variate homogeneous polynomial f of degree r, if there exists a (fanin-2) formula of size s and depth d for f then there exists a homogeneous formula of size O(((d+r+1)(r))center dot s) for f. In particular, for any r <= O( logn), if there exists a polynomial size formula for f then there exists a polynomial size homogeneous formula for f. This refutes a conjecture of Nisan and Wigderson [1996] and shows that super-polynomial lower bounds for homogeneous formulas for polynomials of small degree imply super-polynomial lower bounds for general formulas. We show that for any n-variate set-multilinear polynomial f of degree r, if there exists a (fanin-2) formula of size s and depth d for f, then there exists a set-multilinear formula of size O((d + 2)(r)center dot s) for f. In particular, for any r <= O(logn/loglogn), if there exists a polynomial size formula for f then there exists a polynomial size set-multilinear formula for f. This shows that super-polynomial lower bounds for set-multilinear formulas for polynomials of small degree imply super-polynomial lower bounds for general formulas.", "paper_title": "Tensor-Rank and Lower Bounds for Arithmetic Formulas", "paper_id": "WOS:000329122700001"}