{"auto_keywords": [{"score": 0.027777288723191733, "phrase": "ccus_and_ccu_networks"}, {"score": 0.01541267179260451, "phrase": "ccus"}, {"score": 0.01338482366924363, "phrase": "enhanced_oil_recovery"}, {"score": 0.013197126676170281, "phrase": "ccus_and_ccu_supply_chain_networks"}, {"score": 0.004693063440166313, "phrase": "ccum."}, {"score": 0.0046398818698302835, "phrase": "multi-scale_framework"}, {"score": 0.004600389726895716, "phrase": "optimal_design"}, {"score": 0.004199407505473398, "phrase": "ccu"}, {"score": 0.0041517954514423625, "phrase": "economic_benefit"}, {"score": 0.003944112858235306, "phrase": "decision_making"}, {"score": 0.0038661711901934043, "phrase": "chain_levels"}, {"score": 0.0038114397487574838, "phrase": "hierarchical_and_multi-scale_framework"}, {"score": 0.003559284776569813, "phrase": "source_plants"}, {"score": 0.0035390378585554547, "phrase": "capture_processes"}, {"score": 0.0035189057079817285, "phrase": "capture_materials"}, {"score": 0.0032954289787083713, "phrase": "best_materials"}, {"score": 0.003258033491409002, "phrase": "large_pool"}, {"score": 0.003239494663887116, "phrase": "candidate_materials"}, {"score": 0.0031394256575067573, "phrase": "u.s."}, {"score": 0.0030078460113945136, "phrase": "optimum_ccu_supply_chain_network"}, {"score": 0.002931569771634119, "phrase": "total_profit"}, {"score": 0.0027141207994340463, "phrase": "ccu_networks"}, {"score": 0.0026986685585382347, "phrase": "zero_net_cost"}, {"score": 0.002527150892127982, "phrase": "novel_materials"}, {"score": 0.0025127604406208668, "phrase": "optimized_process_configurations"}, {"score": 0.002366508404418069, "phrase": "diverse_emission_sources"}, {"score": 0.0021971473452127126, "phrase": "proposed_framework"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Carbon capture and storage", " CO2 utilization", " CO2 sequestration", " CCUS", " CCU", " Optimization"], "paper_abstract": "We present a multi-scale framework for the optimal design of CO2 capture, utilization, and sequestration (CCUS) supply chain network to minimize the cost while reducing stationary CO2 emissions in the United States. We also design a novel CO2 capture and utilization (CCU) network for economic benefit through utilizing CO2 for enhanced oil recovery. Both the designs of CCUS and CCU supply chain networks are multi-scale problems which require decision making at material, process and supply chain levels. We present a hierarchical and multi-scale framework to design CCUS and CCU supply chain networks with minimum investment, operating and material costs. While doing so, we take into consideration the selection of source plants, capture processes, capture materials, CO2 pipelines, locations of utilization and sequestration sites, and amounts of CO2 storage. Each CO2 capture process is optimized, and the best materials are screened from large pool of candidate materials. Our optimized CCUS supply chain network can reduce 50% of the total stationary CO2 emission in the U.S. at a cost of $35.63 per ton of CO2 captured and managed. The optimum CCU supply chain network can capture and utilize CO2 to make a total profit of more than 555 million dollars per year ($9.23 per ton). We have also shown that more than 3% of the total stationary CO2 emissions in the United States can be eliminated through CCU networks at zero net cost. These results highlight both the environmental and economic benefits which can be gained through CCUS and CCU networks. We have designed the CCUS and CCU networks through (i) selecting novel materials and optimized process configurations for CO2 capture, (ii) simultaneous selection of materials and capture technologies, (iii) CO2 capture from diverse emission sources, and (iv) CO2 utilization for enhanced oil recovery. While we demonstrate the CCUS and CCU networks to reduce stationary CO2 emissions and generate profits in the United States, the proposed framework can be applied to other countries and regions as well. (c) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A multi-scale framework for CO2 capture, utilization, and sequestration: CCUS and CCUM", "paper_id": "WOS:000360274600002"}