{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sub-wavelength_lithography"}, {"score": 0.013229931785555146, "phrase": "lithographic_resolution"}, {"score": 0.004691684576246597, "phrase": "moore's_law"}, {"score": 0.004588531238691602, "phrase": "microelectronics_development"}, {"score": 0.0044052452943364314, "phrase": "critical_dimensions"}, {"score": 0.00418247778205288, "phrase": "chip-level_integration"}, {"score": 0.00407533728096378, "phrase": "concurrent_improvement"}, {"score": 0.00388356203453764, "phrase": "ultraviolet_spectrum"}, {"score": 0.0037421829222825964, "phrase": "optical_source"}, {"score": 0.003474624627033273, "phrase": "diffraction_effects"}, {"score": 0.0033981387193790353, "phrase": "optical_proximity_correction"}, {"score": 0.0032141856243404618, "phrase": "immersion_lithography"}, {"score": 0.0031086137705026483, "phrase": "resolution_enhancement_techniques"}, {"score": 0.002929394386754424, "phrase": "sub-wavelength_lithography_viz"}, {"score": 0.002822652835367827, "phrase": "future_designs"}, {"score": 0.0027810502577708105, "phrase": "forbidden_pitches"}, {"score": 0.00267969955652659, "phrase": "aerial_imaging_simulation"}, {"score": 0.002572463625403536, "phrase": "entire_layout_structures"}, {"score": 0.002497172413754263, "phrase": "selected_patterns"}, {"score": 0.002370663905320869, "phrase": "current_layout_patterns"}, {"score": 0.0021049977753042253, "phrase": "even_structured_gate_array_based_designs"}], "paper_keywords": ["sub-wavelength lithography", " diffraction", " aerial imaging simulation", " binary mask", " photo-resist"], "paper_abstract": "Moore's Law has been the most important benchmark for microelectronics development over the past four decades. It has been interpreted to mean that critical dimensions (CD) of a design must shrink geometrically over time. The chip-level integration of devices has been possible through concurrent improvement in lithographic resolution. The lithographic resolution was primarily improved by moving deeper into ultraviolet spectrum of light. However, the wavelength of the optical source used for lithography has not improved for nearly a decade. This has lead to the development of sub-wavelength lithography. The diffraction effects of sub-wavelength lithography were offset by optical proximity correction (OPC), phase shift masking (PSM) and impending move to immersion lithography. Unfortunately, one time benefits from each of these resolution enhancement techniques (RET) have nearly exhausted. In this paper, we explore one important diffraction aspect of sub-wavelength lithography viz. the forbidden pitch phenomenon and its implication on future designs. We studied Forbidden pitches in context of 65 and 45 nm technologies using aerial imaging simulation. Aerial imaging simulation is computationally expensive and is not possible to perform on entire layout structures. Based on results from our simulations on selected patterns, we observe that in absence of any other resolution enhancement technique, many of the current layout patterns will be disallowed in 45 nm technology. Such restrictions significantly mitigate the benefit of migration to 45 nm technology in terms of area, power and performance of a design. We further show that even structured gate array based designs are not immune to this problem.", "paper_title": "Forbidden pitches in sub-wavelength lithography and their implications on design", "paper_id": "WOS:000244983100010"}