{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "snomed_ct"}, {"score": 0.0047006879240764935, "phrase": "large_description_logic-based_biomedical_terminologies"}, {"score": 0.004168618849008299, "phrase": "controlled_vocabularies"}, {"score": 0.004108942392772092, "phrase": "sound_ontological_principles"}, {"score": 0.0034558655164987134, "phrase": "seven_ontological_principles"}, {"score": 0.0030938932434437178, "phrase": "snomed_ct_classes"}, {"score": 0.002850875630787708, "phrase": "single_child"}, {"score": 0.0027965187255008647, "phrase": "multiple_parents"}, {"score": 0.002443890721386284, "phrase": "quality_assurance"}, {"score": 0.002273605493468005, "phrase": "multiple_inheritance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["biomedical ontologies", " SNOMED CT", " description logics", " ontological analysis"], "paper_abstract": "Objective: Formalisms based on one or other flavor of description logic (DL) are sometimes put forward as helping to ensure that terminologies and controlled vocabularies comply with sound ontological principles. The objective of this paper is to study the degree to which one DL-based biomedical terminology (SNOMED CT) does indeed comply with such principles. Materials and methods: We defined seven ontological principles (for example: each class must have at least one parent, each class must differ from its parent) and examined the properties of SNOMED CT classes with respect to these principles. Results: Our major results are 31% of these classes have a single child; 27% have multiple parents; 51 % do not exhibit any differentiae between the description of the parent and that of the child. Conclusions: The applications of this principles to quality assurance for ontologies are discussed and suggestions are made for dealing with the phenomenon of multiple inheritance. The advantages and limitations of our approach are also discussed. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Investigating subsumption in SNOMED CT: An exploration into large description logic-based biomedical terminologies", "paper_id": "WOS:000246657200002"}