{"auto_keywords": [{"score": 0.04955228514169987, "phrase": "recognition_accuracy"}, {"score": 0.020619589020472312, "phrase": "asr_system"}, {"score": 0.013833897658256725, "phrase": "dysarthric_speech"}, {"score": 0.006199178481645233, "phrase": "asr"}, {"score": 0.00481495049065317, "phrase": "general_and_specific_factors"}, {"score": 0.004674952036988355, "phrase": "dysarthric_speaker"}, {"score": 0.004640590144749795, "phrase": "automatic_speech_recognition"}, {"score": 0.004522291357556591, "phrase": "important_assistive_tool"}, {"score": 0.004310501708408856, "phrase": "existing_asr_systems"}, {"score": 0.004185108816866677, "phrase": "acceptable_degree"}, {"score": 0.0034231035978508875, "phrase": "significant_influence"}, {"score": 0.003390886284555397, "phrase": "speech_mode"}, {"score": 0.003365930631436696, "phrase": "speaker_mode"}, {"score": 0.0033411580268394732, "phrase": "vocabulary_size"}, {"score": 0.0031146967095233586, "phrase": "speech_intelligibility"}, {"score": 0.0028293966058473476, "phrase": "existing_researches"}, {"score": 0.0027673496368158545, "phrase": "general_factors"}, {"score": 0.002176235362654451, "phrase": "specific_factors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Dysarthric speech", " ASR system", " Recognition accuracy"], "paper_abstract": "Automatic speech recognition (ASR) is becoming an important assistive tool among the speech impaired individuals such as dysarthria. Currently, the existing ASR systems were unable to recognise dysarthric speech at an acceptable degree. Little research was carried out to identify factors that influence the performance of ASR system in recognising dysarthric speech. This article aims to identify factors that potentially influence the recognition accuracy of ASR system in recognising dysarthric speech. Some of the factors that influence the recognition accuracy of ASR, which have been confirmed in existing researches for ASR system are speech mode, speaker mode, vocabulary size and speaking styles. We have also focused at factors that are more specific to dysarthric speech such as speech intelligibility, severity and intra-speaker variability that potentially influence the recognition accuracy. We have evaluated the influence of these factors on recognition accuracy using data published in existing researches. It was found that general factors considered in this review have little influence on the recognition accuracy. However, factors more specific to dysarthric speech were found to have a significant influence on the recognition accuracy of the ASR system. From the findings, it can be concluded that intelligibility and severity have significant influence on the recognition accuracy. To improve the recognition accuracy of ASR system, methods and techniques that reduces the influence of these specific factors should be identified. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Exploring the influence of general and specific factors on the recognition accuracy of an ASR system for dysarthric speaker", "paper_id": "WOS:000356904100010"}