{"auto_keywords": [{"score": 0.00450456611645112, "phrase": "large_group"}, {"score": 0.004327981760540394, "phrase": "essential_function"}, {"score": 0.004242291530697285, "phrase": "different_exogenous_and_endogenous_compounds"}, {"score": 0.004075946554498088, "phrase": "cyp_enzymes"}, {"score": 0.003359119985242403, "phrase": "vivo_human_data"}, {"score": 0.0031422859551159506, "phrase": "qsar_models"}, {"score": 0.00255488432062653, "phrase": "discrete_organic_european_inventory"}, {"score": 0.002520990102833368, "phrase": "existing_commercial_chemical_substances"}, {"score": 0.00235813005446246, "phrase": "approximate_percentage"}, {"score": 0.0021476098263617954, "phrase": "biological_importance"}], "paper_keywords": ["quantitative structure-activity relationship (QSAR)", " Cytochrome P450", " CYP 2D6", " MultiCASE", " MDL QSAR", " Leadscope"], "paper_abstract": "Human Cytochrome P450 (CYP) is a large group of enzymes that possess an essential function in metabolising different exogenous and endogenous compounds. Humans have more than 50 different genes encoding CYP enzymes, among these a gene encoding for the CYP isoenzyme 2D6, a CYP able to metabolise drugs and other chemicals. A training set of 747 chemicals primarily based on in vivo human data for the CYP isoenzyme 2D6 was collected from the literature. QSAR models focusing on substrate/non-substrate activity were constructed by the use of MultiCASE, Leadscope and MDL quantitative structure-activity relationship (QSAR) modelling systems. They cross validated (leave-groups-out) with concordances of 71%, 81% and 82%, respectively. Discrete organic European Inventory of Existing Commercial Chemical Substances (EINECS) chemicals were screened to predict an approximate percentage of CYP 2D6 substrates. These chemicals are potentially present in the environment. The biological importance of the CYP 2D6 and the use of the software mentioned above were discussed.", "paper_title": "QSAR models for P450 (2D6) substrate activity", "paper_id": "WOS:000267202800007"}