{"auto_keywords": [{"score": 0.03644451033122438, "phrase": "relevant_arguments"}, {"score": 0.029151726122745265, "phrase": "partial_semantics"}, {"score": 0.0041144374213500715, "phrase": "efficient_method"}, {"score": 0.003920049436883885, "phrase": "abstract_argumentation_framework"}, {"score": 0.0038112953522929606, "phrase": "af"}, {"score": 0.003660226272906374, "phrase": "minimal_set"}, {"score": 0.003282383509542342, "phrase": "directionality_criterion"}, {"score": 0.0025761937402886954, "phrase": "efficient_algorithms"}, {"score": 0.002545165985686468, "phrase": "status_evaluation"}, {"score": 0.0024052270356036743, "phrase": "empirical_investigation"}, {"score": 0.002300681752315682, "phrase": "answer-set_programming"}, {"score": 0.002272964710550345, "phrase": "average_results"}, {"score": 0.0022365262201954643, "phrase": "computational_benefits"}, {"score": 0.0021566565951738658, "phrase": "edge_density"}, {"score": 0.0021306709646058295, "phrase": "defeat_graph"}], "paper_keywords": ["Argumentation semantics", " local computation", " abstract argumentation frameworks", " computational complexity"], "paper_abstract": "In various argumentation systems, under most of situations, only the status of some arguments of the systems should be evaluated, while that of others is not necessary to be figured out. Based on this observation, we first introduce an efficient method to evaluate the status of a part of arguments in an abstract argumentation framework (AF). Given an AF and a subset of arguments within it, the minimal set of arguments that are relevant to this subset (called the set of relevant arguments of the subset) is identified. Under a semantics satisfying the directionality criterion, the set of extensions of the sub-framework induced by the set of relevant arguments of the given subset (called a partial semantics of the AF with respect to this subset) can be evaluated locally. Then, we introduce three basic properties of the partial semantics of argumentation: monotonicity, extensibility and combinability, which lay a foundation for developing efficient algorithms for the status evaluation of a part of arguments in an AF. Finally, we conduct an empirical investigation on the properties of computing the partial semantics of argumentation using answer-set programming. The average results show that the computational benefits of this method is closely related to the edge density of the defeat graph of a given AF.", "paper_title": "Partial semantics of argumentation: basic properties and empirical(dagger)", "paper_id": "WOS:000319474400006"}