{"auto_keywords": [{"score": 0.04939422255606209, "phrase": "ischools_movement"}, {"score": 0.008508033731202302, "phrase": "china"}, {"score": 0.00429057323623293, "phrase": "information_science"}, {"score": 0.004208881856146758, "phrase": "chinese_universities"}, {"score": 0.0038415095105632157, "phrase": "open-ended_questionnaire"}, {"score": 0.0035229930971258316, "phrase": "ischools_values"}, {"score": 0.0029627701619228527, "phrase": "main_risks"}, {"score": 0.0025892330566358503, "phrase": "ischools'_values"}, {"score": 0.0025155150482635688, "phrase": "information_profession_area"}, {"score": 0.0024088451312725924, "phrase": "lis_chairs"}, {"score": 0.002198242191529979, "phrase": "keywords_ischools"}, {"score": 0.0021049977753042253, "phrase": "institutional"}], "paper_keywords": ["iSchools", " Attitudes", " Grounded theory", " China", " Library and information science program", " Institutional libraries", " Information operations"], "paper_abstract": "Purpose The goal of this paper is to identify the attitudes of the chairs of library and information science (LIS) programs in Chinese universities toward the iSchools movement. Design/methodology/approach - The authors collected data from 36 deans or other chairs of US by using open-ended questionnaire and utilized grounded theory to analyze the results. Findings The result shows that most chairpersons approve the iSchools values of relationship between people, information and technology, nevertheless, they expressed uncertainty regarding the future of iSchools. For the process of adopting the values of iSchools and joining the iSchools movement, the main risks to progress come from within the US schools or departments. The consensus among the chairpersons is that the US education should reserve its traditional core values, as well as adopt iSchools' values and widely expand in the information profession area. Originality/value This study unveiled the attitudes of LIS chairs toward the iSchools movement in China. Its results can help the iSchools movement to develop and promote US education innovation globally. Keywords iSchools, Attitudes, Grounded theory, China, Library and information science program, Institutional libraries, Information operations", "paper_title": "The attitudes of US chairs toward the iSchools movement in China", "paper_id": "WOS:000313384200003"}