{"auto_keywords": [{"score": 0.04647778853118897, "phrase": "oppnets"}, {"score": 0.015319136719822405, "phrase": "condis"}, {"score": 0.00481495049065317, "phrase": "selfish_opportunistic_mobile_networks"}, {"score": 0.004494570360108983, "phrase": "opportunistic_mobile_networks"}, {"score": 0.0039522429946090174, "phrase": "selfish_oppnets"}, {"score": 0.0037060428445111694, "phrase": "key_challenges"}, {"score": 0.0035072146967082083, "phrase": "big_problem"}, {"score": 0.0034751259234824913, "phrase": "content_dissemination"}, {"score": 0.002799810685137358, "phrase": "novel_content_exchange_protocol"}, {"score": 0.0026011706232569316, "phrase": "exchange_order"}, {"score": 0.0025420267431501367, "phrase": "content_utility"}, {"score": 0.00226583335721762, "phrase": "content_inventory"}, {"score": 0.002214297250267208, "phrase": "extensive_realistic_trace-driven_simulation_results"}, {"score": 0.0021049977753042253, "phrase": "total_freshness_value"}], "paper_keywords": ["Publish/subscribe", " content dissemination", " opportunistic mobile networks", " selfish behavior", " freshness"], "paper_abstract": "Recently, the content-based publish/subscribe (pub/sub) paradigm has been gaining popularity in opportunistic mobile networks (OppNets) for its flexibility and adaptability. Since nodes in OppNets are controlled by humans, they often behave selfishly. Therefore, stimulating nodes in selfish OppNets to collect, store, and share contents efficiently is one of the key challenges. Meanwhile, guaranteeing the freshness of contents is also a big problem for content dissemination in OppNets. In this paper, in order to solve these problems, we propose an incentive-driven and freshness-aware pub/sub Content Dissemination scheme, called ConDis, for selfish OppNets. In ConDis, the Tit-For-Tat (TFT) scheme is employed to deal with selfish behaviors of nodes in OppNets. Moreover, a novel content exchange protocol is proposed when nodes are in contact. Specifically, during each contact, the exchange order is determined by the content utility, which represents the usefulness of a content for a certain node, and the objective of nodes is to maximize the utility of the content inventory stored in their buffer. Extensive realistic trace-driven simulation results show that ConDis is superior to other existing schemes in terms of total freshness value, total delivered contents, and total transmission cost.", "paper_title": "Incentive-Driven and Freshness-Aware Content Dissemination in Selfish Opportunistic Mobile Networks", "paper_id": "WOS:000361640800011"}