{"auto_keywords": [{"score": 0.0446746644314423, "phrase": "preferred_path"}, {"score": 0.041210035444321655, "phrase": "shorter_path"}, {"score": 0.00481495049065317, "phrase": "higher_concentration"}, {"score": 0.004446823283475876, "phrase": "pheromone-following_behavior"}, {"score": 0.004330450801016359, "phrase": "initially_discovered_path"}, {"score": 0.004161553532799662, "phrase": "long_path"}, {"score": 0.0036445446531633368, "phrase": "initially_discovered_longer_path"}, {"score": 0.003502305158321511, "phrase": "trail_formation_behavior"}, {"score": 0.003456132182564149, "phrase": "generalized_polya_urn_process"}, {"score": 0.003410565849262162, "phrase": "k_equal_length_paths"}, {"score": 0.0031774686451753477, "phrase": "initial_pheromone_concentrations"}, {"score": 0.002934166052954463, "phrase": "urn_process"}, {"score": 0.0028699415886017468, "phrase": "pheromone_distribution"}, {"score": 0.0026267609106294817, "phrase": "initial_bias"}, {"score": 0.002382936364692606, "phrase": "plasticity-stability_dilemma"}], "paper_keywords": ["Ant trail formation", " Polya process", " Positive reinforcement", " Delayed urn model", " Plasticity-Stability dilemma"], "paper_abstract": "Faced with a choice of paths, an ant chooses a path with a higher concentration of pheromone. Subsequently, it drops pheromone on the path chosen. The reinforcement of the pheromone-following behavior favors the selection of an initially discovered path as the preferred path. This may cause a long path to emerge as the preferred path, were it discovered earlier than a shorter path. However, the shortness of the shorter path offsets some of the pheromone accumulated on the initially discovered longer path. In this paper, we model the trail formation behavior as a generalized Polya urn process. For k equal length paths, we give the distribution of pheromone at any time and highlight its sole dependence on the initial pheromone concentrations on paths. Additionally, we propose a method to incorporate the lengths of paths in the urn process and derive how the pheromone distribution alters on its inclusion. Analytically, we show that it is possible, under certain conditions, to reverse the initial bias that may be present in favor of paths that were discovered prior to the discovery of more efficient (shorter) paths. This addresses the Plasticity-Stability dilemma for ants, by laying out the conditions under which the system will remain stable or become plastic and change the path. Finally, we validate our analysis and results using simulations.", "paper_title": "Trail formation in ants. A generalized Polya urn process", "paper_id": "WOS:000286335600003"}