{"auto_keywords": [{"score": 0.04948948915272366, "phrase": "cryogenic_temperature"}, {"score": 0.02322730111336097, "phrase": "induction_motor"}, {"score": 0.007605362821138099, "phrase": "skewed_slots"}, {"score": 0.006860890131798858, "phrase": "high_voltage_squirrel-cage"}, {"score": 0.00418387341007444, "phrase": "performance_characteristics"}, {"score": 0.004149429072483132, "phrase": "three-phase_high_voltage_squirrel-cage"}, {"score": 0.003916098498242888, "phrase": "liquefied_natural_gas"}, {"score": 0.003883850635481933, "phrase": "lng"}, {"score": 0.003820144626025562, "phrase": "time-stepping_finite_element_method"}, {"score": 0.003560807940070886, "phrase": "magnetic_circuit"}, {"score": 0.0032510690712452147, "phrase": "elaborated_software"}, {"score": 0.003171358146412577, "phrase": "steady_state"}, {"score": 0.0031452231581533814, "phrase": "dynamic_performance"}, {"score": 0.002968192753809507, "phrase": "constructed_model_motor"}, {"score": 0.002621590601574503, "phrase": "multi-slice_finite_element_method"}, {"score": 0.0025678829712650437, "phrase": "practical_implications_-_investigation"}, {"score": 0.0023834640793589435, "phrase": "motor_characteristics"}, {"score": 0.002344311033783139, "phrase": "design_calculations"}, {"score": 0.002315367926547472, "phrase": "-load_current"}, {"score": 0.0022399174232611853, "phrase": "short-circuit_test"}, {"score": 0.0021049977753042253, "phrase": "good_concordance"}], "paper_keywords": ["cryogenic equipment", " inductance", " temperature", " finite element analysis"], "paper_abstract": "Purpose - The paper aims to elaborate the method and algorithm of analysis of induction motor working in cryogenic temperature. Design/methodology/approach - This paper presents the design and investigation of performance characteristics of three-phase high voltage squirrel-cage submerged motor. The motor is intended to work at cryogenic temperature -161 degrees C in liquefied natural gas (LNG). The time-stepping finite element method of transients analysis in induction motor working in cryogenic temperature has been presented. The nonlinearity of the magnetic circuit, the movement of the rotor and skewed slots have been taken into account. Findings - The study finds that presented method and elaborated software are used to determine the steady state and dynamic performance of the high voltage squirrel-cage submerged motor. The results of simulations and measurements of constructed model motor have been presented. Research limitations/implications - The problem has been considered as the 2D one. In order to take into account the skewed slots of the rotor the multi-slice finite element method has been used. Practical implications - Investigation presented in the paper has been performed in order to study the influence of the temperature on motor characteristics and to verify design calculations. No-load current, starting torque and short-circuit current during short-circuit test, obtained on the basis of measurements and received from calculations, are in good concordance. Originality/value - The paper proposes a method to determine the steady state and dynamic performance of the high voltage squirrel-cage submerged motor working in cryogenic temperature.", "paper_title": "FE analysis of induction motor working in cryogenic temperature", "paper_id": "WOS:000249232200004"}