{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "lexical_units"}, {"score": 0.004644146045859622, "phrase": "specialized_dictionaries"}, {"score": 0.0045404698551856125, "phrase": "terminological_units"}, {"score": 0.0043793594257092805, "phrase": "different_fields"}, {"score": 0.004092463367307375, "phrase": "specialized_usages"}, {"score": 0.0038764861784138117, "phrase": "often_large_ones"}, {"score": 0.0032061793819537633, "phrase": "domain_ontology"}, {"score": 0.0030644247579222333, "phrase": "specialized_dictionary"}, {"score": 0.0029689311901364797, "phrase": "linguistic_functioning"}, {"score": 0.002712131567923321, "phrase": "better_understanding"}, {"score": 0.0022940375532231145, "phrase": "input_devices"}], "paper_keywords": ["Term", " concept", " lexical unit", " ontology", " terminological dictionary"], "paper_abstract": "Terms (or terminological units) are objects that are manipulated by different fields and that are at the core of several applications, e.g. representing knowledge, describing specialized usages, classifying documents. This inevitably leads to discrepancies (and often large ones) between resources in which terms are described and encoded (e. g., ontologies, terminologies, dictionaries, thesauri). This paper attempts to characterize these differences by analyzing two different applications: (1) the elaboration of a domain ontology; and (2) the compilation of a specialized dictionary whose aim is to account for the linguistic functioning of terms. We deliberately chose two very different resources that rely on opposing methodologies hoping that this would lead to a better understanding of some of the facets terms may have and what can be expected of resources that describe them. Examples are taken from the fields of computing and the Internet. We focus more specifically on input devices. The analysis reveals that resources manipulate terms in very different ways and questions the possibility of exchanging data from one resource to the other without jeopardizing some of the principles on which they are based.", "paper_title": "Terms as labels for concepts, terms as lexical units: A comparative analysis in ontologies and specialized dictionaries", "paper_id": "WOS:000312382000002"}