{"auto_keywords": [{"score": 0.03786990417643334, "phrase": "original_t-s_fuzzy_plant"}, {"score": 0.00481495049065317, "phrase": "takagi-sugeno_fuzzy_system"}, {"score": 0.004081385289516914, "phrase": "three-step_procedure"}, {"score": 0.00400119808662365, "phrase": "linear_matrix_inequalities"}, {"score": 0.0037699306119313154, "phrase": "new_t-s_fuzzy_model_structure"}, {"score": 0.0035519826240477444, "phrase": "stable_pre-_and_post_filters"}, {"score": 0.003368816076401138, "phrase": "original_plant"}, {"score": 0.003050376875258722, "phrase": "standard_lmis_formulation"}, {"score": 0.0023096222276192194, "phrase": "t-s_controller"}, {"score": 0.0021049977753042253, "phrase": "numerical_examples"}], "paper_keywords": ["Controller structure", " controller synthesis", " L2 gain performance", " linear matrix inequalities (LMIs)", " Takagi-Sugeno (T-S) fuzzy system"], "paper_abstract": "In this paper, an improved L2 gain performance controller synthesis is proposed for Takagi-Sugeno (T-S) fuzzy system. The T-S fuzzy controller can be easily derived by a three-step procedure with the linear matrix inequalities (LMIs) technique. First, a new T-S fuzzy model structure is presented, which includes the original T-S fuzzy plant with stable pre- and post filters on the input and output of the original plant. Second, by using this structure the L2 gain performance controller design problem can be easily transformed into standard LMIs formulation. Compared with the previous results, it not only gives us a simple structure of the T-S fuzzy controller, but also provides us effective LMIs-based conditions, which include a small number of unknown matrix variables; consequently, less value of L2 gain performance of the closed-loop system can be obtained. Third, an augmented T-S fuzzy controller which guarantees L2 gain performance is obtained for the original T-S fuzzy plant, which is composed of the T-S controller derived from step two and two stable pre- and post filters. Finally, some numerical examples are demonstrated to show the effectiveness of the proposals.", "paper_title": "Improved L2 Gain Performance Controller Synthesis for Takagi-Sugeno Fuzzy System", "paper_id": "WOS:000260046700003"}