{"auto_keywords": [{"score": 0.026819728056451227, "phrase": "loss_probability"}, {"score": 0.00481495049065317, "phrase": "misaligned_objectives"}, {"score": 0.004579316323166273, "phrase": "profit-maximizing_network"}, {"score": 0.004443482801729777, "phrase": "finite_bandwidth"}, {"score": 0.004046020290832207, "phrase": "network's_profit"}, {"score": 0.003978866233891427, "phrase": "aggregate_utility"}, {"score": 0.003659389341948856, "phrase": "first_contribution"}, {"score": 0.0035865983700531278, "phrase": "iterative_procedure"}, {"score": 0.0035507457285983268, "phrase": "single-link_model"}, {"score": 0.003503497128638099, "phrase": "provably_convergent_scheme"}, {"score": 0.003399466007862412, "phrase": "profit_maximization"}, {"score": 0.003354223660940168, "phrase": "individual_user"}, {"score": 0.003013237619840709, "phrase": "individual_users"}, {"score": 0.002644050667977234, "phrase": "iteration_scheme"}, {"score": 0.00242335068996852, "phrase": "end-users'_supply"}, {"score": 0.0023122257999320527, "phrase": "bayesian_approach"}, {"score": 0.002213596068643924, "phrase": "practically_relevant_context"}, {"score": 0.0021987994275190314, "phrase": "gaussian_input_traffic"}, {"score": 0.0021767893059191795, "phrase": "resulting_estimator"}, {"score": 0.0021262835396323623, "phrase": "risk-averse_isps"}], "paper_keywords": ["profit maximization", " bandwidth trading", " quality of service", " measurement-based control", " Gaussian queues"], "paper_abstract": "This paper studies the interplay between a profit-maximizing network and a number of users competing for the finite bandwidth on each link. In our setting, the objectives of the network and the users are 'misaligned', in that the prices that optimize the network's profit do not maximize the aggregate utility of the users. The links set the prices for bandwidth and the users react to them by revealing their preferred amounts of bandwidth. A first contribution of this work is an iterative procedure for a single-link model. In this provably convergent scheme, the link adapts the price to achieve profit maximization, and each individual user adapts its demand for bandwidth so as to maximize its 'compensated utility', where utility is a function of its allocated bandwidth. Importantly, the scheme relies on communication between the link and the individual users, but not between users. In practice, the utility of the users (ISPs) strongly depends on the level of satisfaction experienced by their clients (the end-users). We show how the iteration scheme can be adapted to the more natural situation of utility being a function of the loss probability, rather than a function of the bandwidth. Since the end-users' supply of traffic is not fully known to the ISPs, we develop a Bayesian approach for estimating the loss probability from measurements; we do so in the practically relevant context of Gaussian input traffic. The resulting estimator proves to be particularly useful for risk-averse ISPs. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Bandwidth trading under misaligned objectives: Decentralized measurement-based control", "paper_id": "WOS:000253707600002"}