{"auto_keywords": [{"score": 0.043139235906996455, "phrase": "synchronized_regime"}, {"score": 0.014920562183728614, "phrase": "different_reynolds_numbers"}, {"score": 0.013676656111526327, "phrase": "flip-flop_regime"}, {"score": 0.01357492045402226, "phrase": "small_space_ratios"}, {"score": 0.011545224997783675, "phrase": "space_ratios"}, {"score": 0.010847103824429917, "phrase": "time-averaged_drag"}, {"score": 0.00481495049065317, "phrase": "flow_effect"}, {"score": 0.0047668291774478795, "phrase": "side_by_side_using_lattice_boltzmann_method."}, {"score": 0.004590598900125397, "phrase": "lattice_boltzmann_method"}, {"score": 0.004443121295775668, "phrase": "separation_distance"}, {"score": 0.004365673873109856, "phrase": "characteristic_length"}, {"score": 0.004089598384268605, "phrase": "large_space_ratios"}, {"score": 0.004069096437466151, "phrase": "wide_and_narrow_wakes"}, {"score": 0.003821297056249902, "phrase": "vortex_shedding"}, {"score": 0.0037546476864907443, "phrase": "upper_frequency"}, {"score": 0.003707751244896586, "phrase": "lower_frequency"}, {"score": 0.0036066231834717545, "phrase": "time-averaged_drag_and_lift_coefficients"}, {"score": 0.0025811005461084404, "phrase": "nonlinear_interaction"}, {"score": 0.002479227226302506, "phrase": "reynolds_numbers"}, {"score": 0.002435928405329326, "phrase": "vortex_shedding_type"}, {"score": 0.002175037135861406, "phrase": "left_surfaces"}, {"score": 0.0021478278695820268, "phrase": "right_surfaces"}, {"score": 0.0021049977753042253, "phrase": "reynolds_number"}], "paper_keywords": ["Lattice Boltzmann", " square cylinder", " space ratios", " drag coefficient", " lift coefficient"], "paper_abstract": "The flow around two square cylinders arranged side by side has been investigated through lattice Boltzmann method under different Reynolds numbers and various spaceratios (s = d/D, d is the separation distance between two cylinders, D is the characteristic length) from 1.0, 1.1 to 2.7, including 18 space ratios. It is found that the flip-flop regime occurs at small space ratios and the synchronized regime occurs at large space ratios. Wide and narrow wakes at small spacing are formed and intermittently change behind the cylinders, and the biased flowing the gap is bistable. The frequency of vortex shedding is different in two wakes. The upper frequency is smaller than the lower frequency for small space ratios (s < 1.4), and the time-averaged drag and lift coefficients of cylinders are also different. When the space ratios increase, two distinct vortex streets occur behind the cylinders, and the frequency of vortex shedding is almost equal in two wakes. Also the difference of time-averaged drag and lift coefficients of the cylinders decreases with the increase in space ratios; in this case the flow shows synchronized regime. The transition between flip-flop and synchronized regimes occurs at s = 1.5.When s < 1.5, the flow shows flip-flop regime; otherwise, it shows synchronized regime. When s = 2.0 and 2.5, the curves for the time-averaged drag and lift coefficient with different Reynolds numbers are smooth. When s = 1.5 and 1.8, the curves are also smooth under Re <= 140, but that will be fluctuant under Re > 140 because of the nonlinear interaction between the wakes, and the instability of flow becomes stronger with the increase in Reynolds numbers. On the other hand, the vortex shedding type from the cylinder occurs in-phase when s < 2.5 and s = 2.5 for Re < 190, whereas that occurs anti-phase when s = 2.5 for Re <= 190. In addition, the pressure varies a little on the left surfaces and greatly on the right surfaces of both cylinders with the increase in Reynolds number at s = 2.5.", "paper_title": "FLOW EFFECT AROUND TWO SQUARE CYLINDERS ARRANGED SIDE BY SIDE USING LATTICE BOLTZMANN METHOD", "paper_id": "WOS:000261382900005"}