{"auto_keywords": [{"score": 0.047975388252729324, "phrase": "interaction_patterns"}, {"score": 0.04125677075824637, "phrase": "spatial_auto-correlation"}, {"score": 0.00481495049065317, "phrase": "spatial_domains"}, {"score": 0.004342430078306461, "phrase": "co-location_patterns"}, {"score": 0.004133055661437163, "phrase": "user_specified_thresholds"}, {"score": 0.004096082254543022, "phrase": "prevalence_measures"}, {"score": 0.003595552309967789, "phrase": "segregation_patterns"}, {"score": 0.0032132782979796895, "phrase": "statistical_test"}, {"score": 0.003141830113006653, "phrase": "new_definition"}, {"score": 0.003085813569061001, "phrase": "segregation_pattern"}, {"score": 0.0029767499830258754, "phrase": "null_distribution"}, {"score": 0.0026009105281485888, "phrase": "computational_cost"}, {"score": 0.0025545134727682716, "phrase": "naive_approach"}, {"score": 0.0024864612830452254, "phrase": "data_distribution"}, {"score": 0.0021723899772112423, "phrase": "synthetic_and_real_data_sets"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_co-location_mining_algorithm"}], "paper_keywords": ["Spatial data", " co-location", " segregation", " spatial interaction", " statistically significant pattern"], "paper_abstract": "In spatial domains, interaction between features gives rise to two types of interaction patterns: co-location and segregation patterns. Existing approaches to finding co-location patterns have several shortcomings: (1) They depend on user specified thresholds for prevalence measures; (2) they do not take spatial auto-correlation into account; and (3) they may report co-locations even if the features are randomly distributed. Segregation patterns have yet to receive much attention. In this paper, we propose a method for finding both types of interaction patterns, based on a statistical test. We introduce a new definition of co-location and segregation pattern, we propose a model for the null distribution of features so spatial auto-correlation is taken into account, and we design an algorithm for finding both co-location and segregation patterns. We also develop two strategies to reduce the computational cost compared to a naive approach based on simulations of the data distribution, and we propose an approach to reduce the runtime of our algorithm even further by using an approximation of the neighborhood of features. We evaluate our method empirically using synthetic and real data sets and demonstrate its advantages over a state-of-the-art co-location mining algorithm.", "paper_title": "Mining Statistically Significant Co-location and Segregation Patterns", "paper_id": "WOS:000337965900012"}