{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cybersecurity_awareness"}, {"score": 0.010506690423347894, "phrase": "retrieved_articles"}, {"score": 0.004414907432703781, "phrase": "previous_methodologies"}, {"score": 0.004354841111644036, "phrase": "target_audience"}, {"score": 0.004276016541197123, "phrase": "previous_assessment"}, {"score": 0.003814563533445401, "phrase": "cybersecurity_awareness_assessment_research"}, {"score": 0.0037454814403672697, "phrase": "future_work"}, {"score": 0.003611034322786669, "phrase": "systematic_literature_review_technique"}, {"score": 0.003545625043276134, "phrase": "relevant_online_databases"}, {"score": 0.00349734405943853, "phrase": "pre-defined_keywords"}, {"score": 0.0032805541677236325, "phrase": "relevant_information"}, {"score": 0.003021392767766593, "phrase": "research_questions"}, {"score": 0.0029396242707327986, "phrase": "online_searches"}, {"score": 0.0028600623410146796, "phrase": "search_criteria"}, {"score": 0.002634031703695684, "phrase": "assessment_method"}, {"score": 0.0023927516438886445, "phrase": "previous_research"}, {"score": 0.002275299774554847, "phrase": "programme_evaluation_technique"}, {"score": 0.0021049977753042253, "phrase": "personal_information"}], "paper_keywords": ["Cybernetics", " Adaptation"], "paper_abstract": "Purpose - The purpose of this paper is to survey, explore and inform researchers about the previous methodologies applied, target audience and coverage of previous assessment of cybersecurity awareness by capturing, summarizing, synthesizing and critically comment on it. It is also conducted to identify the gaps in the cybersecurity awareness assessment research which warrants the future work. Design/methodology/approach - The authors used a systematic literature review technique to search the relevant online databases by using pre-defined keywords. The authors limited the search to retrieve only English language academic articles published from 2000 to 2014. Relevant information was extracted from the retrieved articles, and the ensuing discussion centres on providing the answers to the research questions. Findings - From the online searches, 14 studies that matched the search criteria were retrieved, and the information extracted from each study includes the authors, publication year, assessment method used, target audiences, coverage of assessment and assessment goals. Originality/value - The review of the retrieved articles indicates that no previous research was conducted in the assessment of the cybersecurity awareness using a programme evaluation technique. It was also found that few studies focused on youngsters and on the issue of safeguarding personal information.", "paper_title": "A systematic review of approaches to assessing cybersecurity awareness", "paper_id": "WOS:000357420000008"}