{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "systematic_flow"}, {"score": 0.004770211811866158, "phrase": "developing_totally_self-checking_architectures"}, {"score": 0.004573953147933065, "phrase": "modern_hardware_cryptographic_systems"}, {"score": 0.004426882270402403, "phrase": "harsh_and_noisy_environments"}, {"score": 0.004304574865291508, "phrase": "erroneous_authentication_results"}, {"score": 0.004205226397573506, "phrase": "whole_authentication_procedure"}, {"score": 0.003604421041893448, "phrase": "novel_methods"}, {"score": 0.003472149546470424, "phrase": "appropriate_concurrent_error_detection_scheme"}, {"score": 0.0033919477901198716, "phrase": "gate-level_implementations"}, {"score": 0.003313592421224647, "phrase": "resulted_tsc_architectures"}, {"score": 0.0032522091171602557, "phrase": "odd_erroneous_bits"}, {"score": 0.0031475032122226, "phrase": "designer's_choice"}, {"score": 0.0031182092708983184, "phrase": "even_number"}, {"score": 0.0030891871245908665, "phrase": "erroneous_bits"}, {"score": 0.0028133741785871867, "phrase": "case_studies"}, {"score": 0.0025264171945423254, "phrase": "proposed_flow"}, {"score": 0.0022793032191981404, "phrase": "-checking_ones"}, {"score": 0.0021049977753042253, "phrase": "optimized_ones"}], "paper_keywords": ["Cryptography", " hash functions", " SHA-1", " SHA-2", " totally self-checking", " error detection"], "paper_abstract": "Hash functions are among the crucial modules of modern hardware cryptographic systems. These systems frequently operate in harsh and noisy environments where permanent and/or transient faults are often causing erroneous authentication results and collapsing of the whole authentication procedure. Hence, their on-time detection is an urgent feature. In this paper, a systematic development flow towards totally self-checking (TSC) architectures of the most widely-used cryptographic hash families, SHA-1 and SHA-2, is proposed. Novel methods and techniques are introduced to determine the appropriate concurrent error detection scheme at high level avoiding gate-level implementations and comparisons. The resulted TSC architectures achieve 100% fault detection of odd erroneous bits, while, depending on the designer's choice, even number of erroneous bits can also be detected. Two representative functions of the above families, namely the SHA-1 and SHA-256, are used as case studies. For each of them, two TSC architectures (one un-optimized and one optimized for throughput) were developed via the proposed flow and implemented in TSMC 0.18 mu m CMOS technology. The produced architectures are more efficient in terms of throughput/area than the corresponding duplicated-with-checking ones by 19.5% and 23.8% regarding the un-optimized TSC SHA-1 and SHA-256 and by 20.2% and 24.6% regarding the optimized ones.", "paper_title": "A SYSTEMATIC FLOW FOR DEVELOPING TOTALLY SELF-CHECKING ARCHITECTURES FOR SHA-1 AND SHA-2 CRYPTOGRAPHIC HASH FAMILIES", "paper_id": "WOS:000322396000011"}