{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "linear-nonlinear_networks"}, {"score": 0.004302791070310513, "phrase": "general_class"}, {"score": 0.003940122359770492, "phrase": "optimal_procedure"}, {"score": 0.003319830633865628, "phrase": "generally_applicable_statistical_test"}, {"score": 0.002966230968271199, "phrase": "open_questions"}, {"score": 0.002783250284824728, "phrase": "near-optimal_model_parameterizations"}, {"score": 0.0026115277372906805, "phrase": "decision_alternatives_exists"}, {"score": 0.002523481637809674, "phrase": "neurons'_broad_tuning_curves"}, {"score": 0.0024624103660827695, "phrase": "optimal-performance_theory"}, {"score": 0.0024028135317872, "phrase": "possible_answer"}, {"score": 0.0021678232353129472, "phrase": "multihypothesis_sequential_probability_ratio_test"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Synaptic weight learning", " Leaky accumulator", " Drift-diffusion model", " Neural network", " Multihypothesis sequential test", " Sequential ratio test"], "paper_abstract": "Optimal performance and physically plausible mechanisms for achieving it have been completely characterized for a general class of two-alternative, free response decision making tasks, and data suggest that humans can implement the optimal procedure. The situation is more complicated when the number of alternatives is greater than two and subjects are free to respond at any time, partly due to the fact that there is no generally applicable statistical test for deciding optimally in such cases. However, here, too, analytical approximations to optimality that are physically and psychologically plausible have been analyzed. These analyses leave open questions that have begun to be addressed: (1) How are near-optimal model parameterizations learned from experience? (2) What if a continuum of decision alternatives exists? (3) How can neurons' broad tuning curves be incorporated into an optimal-performance theory? We present a possible answer to all of these questions in the form of an extremely simple, reward-modulated Hebbian learning rule by which a neural network learns to approximate the multihypothesis sequential probability ratio test. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Hebbian learning in linear-nonlinear networks with tuning curves leads to near-optimal, multi-alternative decision making", "paper_id": "WOS:000290510000002"}