{"auto_keywords": [{"score": 0.04210030415693984, "phrase": "two-dimensional_structures"}, {"score": 0.03864281970406045, "phrase": "bioactive_conformations"}, {"score": 0.004814951205791257, "phrase": "grid-based"}, {"score": 0.004705278218845159, "phrase": "pharmbench"}, {"score": 0.00459809245936039, "phrase": "evaluating_pharmacophore_elucidation_methods"}, {"score": 0.004390958289481035, "phrase": "data_sets"}, {"score": 0.004248718518635191, "phrase": "data_set"}, {"score": 0.004070644790285917, "phrase": "experimental_\"gold_standard"}, {"score": 0.003938740137673181, "phrase": "conformational_bias"}, {"score": 0.00390000531646629, "phrase": "ideal_method"}, {"score": 0.0037364921305658395, "phrase": "common_features"}, {"score": 0.0035916263154651975, "phrase": "x-ray-determined_gold_standard_alignments"}, {"score": 0.0033625148111740984, "phrase": "bioactive_conformation"}, {"score": 0.003035847903759329, "phrase": "validation_methodology"}, {"score": 0.0029373757799982356, "phrase": "first_paper"}, {"score": 0.002804842518176471, "phrase": "success_criteria"}, {"score": 0.0027408292745619233, "phrase": "unbiased_models"}, {"score": 0.0025828350676150354, "phrase": "successful_models"}, {"score": 0.0025489778320184255, "phrase": "second_metric"}, {"score": 0.0025072781579598157, "phrase": "pharmbench_data_sets"}, {"score": 0.0024662589776071864, "phrase": "unsuccessful_models"}, {"score": 0.0023011632163055166, "phrase": "overall_success_rate"}, {"score": 0.002263508433567761, "phrase": "pharmbench_data"}, {"score": 0.0021900332274791827, "phrase": "web_service"}, {"score": 0.0021470954708827125, "phrase": "model_alignments"}, {"score": 0.002125942645854997, "phrase": "external_methods"}], "paper_keywords": [""], "paper_abstract": "To date, published pharmacophore elucidation approaches typically use a handful of data sets for validation: here, we have assembled a data set for 81 targets, containing 960 ligands aligned using their cocrystallized protein targets, to provide the experimental \"gold standard\". The two-dimensional structures are also assembled to remove conformational bias; an ideal method would be able to take these structures as input, find the common features, and reproduce the bioactive conformations and their alignments to correspond with the X-ray-determined gold standard alignments. Here we present this data set and describe three objective measures to evaluate performance: the ability to identify the bioactive conformation, the ability to identify and correctly align this conformation for 50% of the molecules in each data set, and the pharmacophoric field similarity. We have applied this validation methodology to our pharmacophore elucidation method FLAPpharm, that is published in the first paper of this series and discuss the limitations of the data set and objective success criteria. Starting from two-dimensional structures and producing unbiased models, FLAPpharm was able to identify the bioactive conformations for 67% of the ligands and also to produce successful models according to the second metric for 67% of the Pharmbench data sets. Inspection of the unsuccessful models highlighted the limitation of this root mean square (rms)-derived metric, since many were found to be pharmacophorically reasonable, increasing the overall success rate to 83%. The PharmBench data set is available at http://www.moldiscovery.com/PharmBench, along with a web service to enable users to score model alignments coming from external methods in the same way that we have presented here and, therefore, establishes a pharmacophore elucidation benchmark data set available to be used by the community.", "paper_title": "GRID-Based Three-Dimensional Pharmacophores II: PharmBench, a Benchmark Data Set for Evaluating Pharmacophore Elucidation Methods", "paper_id": "WOS:000310043800012"}