{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "possible_locations"}, {"score": 0.04964635174824772, "phrase": "mobile_cranes"}, {"score": 0.020499584744628176, "phrase": "possible_crane_locations"}, {"score": 0.0060285078677653784, "phrase": "search_space"}, {"score": 0.005028185086544782, "phrase": "potential_spatial_conflicts"}, {"score": 0.0047283116134926645, "phrase": "construction_sites"}, {"score": 0.004685575787741084, "phrase": "identifying_spatial-conflict_free_locations"}, {"score": 0.004477595431209663, "phrase": "crane_relocation"}, {"score": 0.004397000006837371, "phrase": "productivity_and_safety_improvements"}, {"score": 0.00429828390000229, "phrase": "existing_approaches"}, {"score": 0.003907212558276185, "phrase": "lift_capacities"}, {"score": 0.003767738552860633, "phrase": "spatial_conflicts"}, {"score": 0.003716724243777879, "phrase": "crane_operations"}, {"score": 0.0029209233709517634, "phrase": "discrete-event_simulation"}, {"score": 0.002855251306715901, "phrase": "dynamic_behaviors"}, {"score": 0.0026427848602443267, "phrase": "reachability_radius"}, {"score": 0.0025716240685409513, "phrase": "crane_characteristics"}, {"score": 0.0023694065215394593, "phrase": "boom-line_intersection_tests"}, {"score": 0.002326669201839705, "phrase": "remaining_locations"}, {"score": 0.0021436720821474973, "phrase": "validation_studies"}, {"score": 0.0021049977753042253, "phrase": "developed_approach"}], "paper_keywords": [""], "paper_abstract": "Identifying spatial-conflict free locations of mobile cranes that could minimize delays associated with crane relocation can result in productivity and safety improvements on construction sites. Existing approaches for identifying possible crane locations are based on two-dimensional (21)) work envelopes created by reasoning about the lift capacities of a crane during operations. Since spatial conflicts related to crane operations typically occur in three dimensions and during any period of operation, representing possible crane locations based on such 2D work envelopes can result in identifying some locations as good when in fact they might result in conflicts and missing possible locations that might be feasible. This paper presents an approach that determines possible locations of mobile cranes based on discrete-event simulation of crane operations incorporating dynamic behaviors of cranes. This approach starts with identifying a search space for possible crane locations by reasoning about a reachability radius of a crane determined by crane characteristics and the weight of the load to be carried. Later, it reduces the search space through boom-line intersection tests. For the remaining locations, it checks for potential spatial conflicts between building components and cranes moving in three dimensions and across time. Validation studies show that the developed approach can accurately identify possible locations for mobile cranes that minimize the relocation of mobile cranes and avoid potential spatial conflicts.", "paper_title": "Simulation-based identification of possible locations for mobile cranes on construction sites", "paper_id": "WOS:000251800400004"}