{"auto_keywords": [{"score": 0.00482129620070247, "phrase": "galaxy"}, {"score": 0.004544629724830453, "phrase": "sas_dagger_v"}, {"score": 0.004518442937844318, "phrase": "radius_r"}, {"score": 0.004143196873246147, "phrase": "k_sets"}, {"score": 0.004036796871316647, "phrase": "k-vertex_connectivity"}, {"score": 0.003978866233891427, "phrase": "special_case"}, {"score": 0.0038099959232779194, "phrase": "single_vertex"}, {"score": 0.003680055701720573, "phrase": "simple_model"}, {"score": 0.0036588323994343045, "phrase": "virus-like_malicious_attacks"}, {"score": 0.0035442655396704724, "phrase": "k_vertices"}, {"score": 0.0034233569308012982, "phrase": "distance_r"}, {"score": 0.0033741997276290356, "phrase": "initially_attacked_vertices"}, {"score": 0.003202987495080647, "phrase": "k_trees"}, {"score": 0.003022890602492506, "phrase": "particular_form"}, {"score": 0.0029967610945411593, "phrase": "main_results"}, {"score": 0.00267742927972868, "phrase": "np"}, {"score": 0.0024541975028954497, "phrase": "stark_contrast"}, {"score": 0.0023295585212850154, "phrase": "polynomial_time"}, {"score": 0.002309408211203032, "phrase": "standard_maxflow-mincut_type_results"}, {"score": 0.0022048406330100697, "phrase": "single_attack"}, {"score": 0.0021049977753042253, "phrase": "single_set"}], "paper_keywords": ["Graph connectivity", " Star-cutsets", " Complexity"], "paper_abstract": "Given a network G=(V,E), we say that a subset of vertices SaS dagger V has radius r if it is spanned by a tree of depth at most r. We are interested in determining whether G has a cutset that can be written as the union of k sets of radius r. This generalizes the notion of k-vertex connectivity, since in the special case r=0, a set spanned by a tree of depth at most r is a single vertex. Our motivation for considering this problem is that it constitutes a simple model for virus-like malicious attacks on G: An attack occurs at a subset of k vertices and begins to spread through the network. Any vertex within distance r of one of the initially attacked vertices may become infected. Thus an attack corresponds to a subset of vertices that is spanned by k trees of depth at most r. The question we focus on is whether a given network has a cutset of this particular form. The main results of this paper are the following. If r=1, an attack corresponds to a subset of vertices which is the union of at most k stars. We call such a set a galaxy of order k. We show that it is NP-hard to determine whether a given network contains a cutset which is a galaxy of order k, if k is part of the input. This is in stark contrast to the case r=0, since testing whether a graph is k-vertex connected can be done in polynomial time, using standard maxflow-mincut type results. On the positive side, testing whether a graph can be disconnected by a single attack (i.e. k=1) can be done efficiently for any r. Such an attack corresponds to a single set of vertices spanned by a tree of depth at most r. We present an O(rnm) algorithm that determines if a given network contains such a set as a cutset.", "paper_title": "Galaxy cutsets in graphs", "paper_id": "WOS:000275781900009"}