{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "process_parameters"}, {"score": 0.04572074988236007, "phrase": "minimum_value"}, {"score": 0.04534298842494794, "phrase": "machining_performance"}, {"score": 0.015519242499690103, "phrase": "abrasive_waterjet_machining"}, {"score": 0.012633954025741806, "phrase": "experimental_data"}, {"score": 0.012525979350953571, "phrase": "regression_modeling"}, {"score": 0.012312756069804358, "phrase": "ga_optimization"}, {"score": 0.009554353249037008, "phrase": "optimal_solution"}, {"score": 0.008360085817082056, "phrase": "real_experimental_data"}, {"score": 0.00471193241675062, "phrase": "integrated_sa-ga."}, {"score": 0.003928834302530914, "phrase": "six_modules"}, {"score": 0.003795086335272422, "phrase": "sa_optimization"}, {"score": 0.0033039560332995136, "phrase": "machining_performance_value"}, {"score": 0.003163878786694538, "phrase": "optimal_process_parameters_values"}, {"score": 0.003029722317983915, "phrase": "minimum_and_maximum_process_parameter_values"}, {"score": 0.0028513785049061767, "phrase": "small_number"}, {"score": 0.0025808284847319528, "phrase": "work_deal"}, {"score": 0.0023460397258997525, "phrase": "proposed_integration_systems"}, {"score": 0.0022957232752482196, "phrase": "optimal_process_parameters"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Optimization", " Optimal process parameters", " Minimum machining performance"], "paper_abstract": "In this study, Simulated Annealing (SA) and Genetic Algorithm (GA) soft computing techniques are integrated to estimate optimal process parameters that lead to a minimum value of machining performance. Two integration systems are proposed, labeled as integrated SA-GA-type1 and integrated SA-GA-type2. The approaches proposed in this study involve six modules, which are experimental data, regression modeling, SA optimization, GA optimization, integrated SA-GA-type1 optimization, and integrated SA-GA-type2 optimization. The objectives of the proposed integrated SA-GA-type1 and integrated SA-GA-type2 are to estimate the minimum value of the machining performance compared to the machining performance value of the experimental data and regression modeling, to estimate the optimal process parameters values that has to be within the range of the minimum and maximum process parameter values of experimental design, and to estimate the optimal solution of process parameters with a small number of iteration compared to the optimal solution of process parameters with SA and GA optimization. The process parameters and machining performance considered in this work deal with the real experimental data in the abrasive waterjet machining (AWJ) process. The results of this study showed that both of the proposed integration systems managed to estimate the optimal process parameters, leading to the minimum value of machining performance when compared to the result of real experimental data. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Optimization of process parameters in the abrasive waterjet machining using integrated SA-GA", "paper_id": "WOS:000296539700085"}