{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computer-mediated_exchange"}, {"score": 0.004591202593942391, "phrase": "knowledge_exchange"}, {"score": 0.004551647527068771, "phrase": "geographical_and_temporal_borders"}, {"score": 0.004084920064588169, "phrase": "tacit_knowledge"}, {"score": 0.003945879572348638, "phrase": "established_method"}, {"score": 0.003665874747419775, "phrase": "theoretical_basis"}, {"score": 0.0033909518548844047, "phrase": "external_representations"}, {"score": 0.0033039560332995136, "phrase": "people's_internal_knowledge_representation"}, {"score": 0.0026033013834547507, "phrase": "standard_learning_period"}, {"score": 0.002266051712795851, "phrase": "abstract_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge exchange", " Knowledge-in-use", " Computer-mediated", " Patterns", " Schema theory"], "paper_abstract": "In times of knowledge exchange across geographical and temporal borders, the question arises as to how not only explicit or factual knowledge can be exchanged over distance, but also knowledge-in-use, with its high amount of tacit knowledge. This article introduces patterns as an established method for supporting the exchange of this knowledge-in-use. We first provide a theoretical basis for our assumption that patterns facilitate the exchange of knowledge-in-use, because they are external representations that are highly analog to people's internal knowledge representation. We then present two experiments testing this assumption: A field study with practitioners (n = 46) who had accumulated experiential knowledge-in-use over a period of several years, and a laboratory study (n = 61) where the students acquired knowledge-in-use during a standard learning period. Both experiments support the hypothesis that patterns facilitate the externalization of knowledge-in-use. With patterns, users described more solution-relevant features of a problem and focused more on abstract features of a solution than participants who explained their experiences without a pattern. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "How patterns support computer-mediated exchange of knowledge-in-use", "paper_id": "WOS:000328801300013"}