{"auto_keywords": [{"score": 0.04947600830161959, "phrase": "health_care_organizations"}, {"score": 0.020850087178982343, "phrase": "patient_anonymity"}, {"score": 0.012604797436422188, "phrase": "dna_records"}, {"score": 0.010612387000973441, "phrase": "patient_data"}, {"score": 0.010240040083641513, "phrase": "patient_identity"}, {"score": 0.007611053493852815, "phrase": "health_care_administrators"}, {"score": 0.0047946464474645425, "phrase": "location-based_re-identification"}, {"score": 0.0047142788290253385, "phrase": "patient's_anonymity"}, {"score": 0.004684487856589639, "phrase": "personal_data"}, {"score": 0.004596234543422736, "phrase": "stripe_ping_identifiers"}, {"score": 0.0045768485563508704, "phrase": "sensitive_data"}, {"score": 0.0045191775930119435, "phrase": "simple_automated_methods"}, {"score": 0.004452808504817545, "phrase": "public_information"}, {"score": 0.004277515074890063, "phrase": "multiple_health_care_organizations"}, {"score": 0.004196896587414128, "phrase": "patient's_location_visit_pattern"}, {"score": 0.00410041491328836, "phrase": "seemingly_anonymous_dna"}, {"score": 0.003930618210667252, "phrase": "patient_information"}, {"score": 0.0037281887100271555, "phrase": "computational_methods"}, {"score": 0.003673393296800983, "phrase": "patient-specific_dna_records"}, {"score": 0.0035063491318435523, "phrase": "formal_model"}, {"score": 0.00342568771304873, "phrase": "different_degrees"}, {"score": 0.0033256968224723397, "phrase": "dna_record"}, {"score": 0.003055753392622163, "phrase": "patient_populations"}, {"score": 0.003036411176068502, "phrase": "publicly_available_hospital_discharge_databases"}, {"score": 0.0029728143826338502, "phrase": "real_world_applications"}, {"score": 0.00293529558587477, "phrase": "suppressed_records"}, {"score": 0.002623728720537739, "phrase": "cystic_fibrosis"}, {"score": 0.002563319215738094, "phrase": "naive_solution"}, {"score": 0.002395356999961208, "phrase": "similar_findings"}, {"score": 0.0023008719389461373, "phrase": "shared_databases"}, {"score": 0.002276631569262761, "phrase": "significant_quantities"}, {"score": 0.002262209824105154, "phrase": "specific_data"}, {"score": 0.002238375857460943, "phrase": "provable_protection"}, {"score": 0.0021591988517077484, "phrase": "different_levels"}, {"score": 0.002150069585503628, "phrase": "privacy_protection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["privacy", " confidentiality", " genomics", " databases", " electronic medical records", " distributed systems", " graphical models"], "paper_abstract": "Objective: Health care organizations must preserve a patient's anonymity when disclosing personal data. Traditionally, patient identity has been protected by stripe ping identifiers from sensitive data such as DNA. However, simple automated methods can re-identify patient data using public information. In this paper, we present a solution to prevent a threat to patient anonymity that arises when multiple health care organizations disclose data. In this setting, a patient's location visit pattern, or \"trail\", can re-identify seemingly anonymous DNA to patient identity. This threat exists because health care organizations (1) cannot prevent the disclosure of certain types of patient information and (2) do not know how to systematically avoid trait re-identification. In this paper, we develop and evaluate computational methods that health care organizations can apply to disclose patient-specific DNA records that are impregnable to trait re-identification. Methods and materials: To prevent trail re-identification, we introduce a formal model called k-unlinkability, which enables health care administrators to specify different degrees of patient anonymity. Specifically, k-unlinkability is satisfied when the trail of each DNA record is linkable to no less than k identified records. We present several. algorithms that enable health care organizations to coordinate their data disclosure, so that they can determine which DNA records can be shared without violating k-unlinkability. We evaluate the algorithms with the traits of patient populations derived from publicly available hospital discharge databases. Algorithm efficacy is evaluated using metrics based on real world applications, including the number of suppressed records and the number of organizations that disclose records. Results: Our experiments indicate that it is unnecessary to suppress all patient records that initially violate k-unlinkability. Rather, only portions of the traits need to be suppressed. For example, if each hospital discloses 100% of its data on patients diagnosed with cystic fibrosis, then 48% of the DNA records are 5-unlinkable. A naive solution would suppress the 52% of the DNA records that violate 5-unlinkability. However, by applying our protection algorithms, the hospitals can disclose 95% of the DNA records, all of which are 5-unlinkable. Similar findings hold for all populations studied. Conclusion: This research demonstrates that patient anonymity can be formally protected in shared databases. Our findings illustrate that significant quantities of patient- specific data can be disclosed with provable protection from trail re-identification. The configurability of our methods allows health care administrators to quantify the effects of different levels of privacy protection and formulate policy accordingly. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A computational model to protect patient data from location-based re-identification", "paper_id": "WOS:000248725700006"}