{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "discovery_of_new_selective_human_aldose_reductase"}, {"score": 0.004736563452994885, "phrase": "virtual_screening_multiple_binding_pocket_conformations"}, {"score": 0.004685012337701536, "phrase": "aldose_reductase"}, {"score": 0.004459857205489101, "phrase": "key_role"}, {"score": 0.0039322149318145845, "phrase": "therapeutic_agents"}, {"score": 0.003485824905231454, "phrase": "virtual_screening_protocol"}, {"score": 0.003228434077467506, "phrase": "novel_aris"}, {"score": 0.0027239390917424898, "phrase": "rather_substantial_hit_rate"}, {"score": 0.0024143815950383647, "phrase": "inhibition_assays"}, {"score": 0.002323446065342625, "phrase": "novel_inhibitors"}, {"score": 0.0022359278646792153, "phrase": "commercially_available_drug"}, {"score": 0.0021049977753042253, "phrase": "better_selectivity"}], "paper_keywords": [""], "paper_abstract": "Aldose reductase reduces glucose to sorbitol. It plays a key role in many of the complications arising from diabetes. Thus, aldose reductase inhibitors (ARI) have been identified as promising therapeutic agents for treating such complications of diabetes, as neuropathy, nephropathy, retinopathy, and cataracts. In this paper, a virtual screening protocol applied to a library of compounds in house has been utilized to discover novel ARIs. IC50's were determined for 15 hits that inhibited ALR2 to greater than 50% at 50 mu M, and ten of these have an IC50 of 10 mu M or less, corresponding to a rather substantial hit rate of 14% at this level. The specificity of these compounds relative to their cross-reactivity with human ALR1 was also assessed by inhibition assays. This resulted in identification of novel inhibitors with IC50's comparable to the commercially available drug, epalrestat, and greater than an order of magnitude better selectivity.", "paper_title": "Discovery of New Selective Human Aldose Reductase Inhibitors through Virtual Screening Multiple Binding Pocket Conformations", "paper_id": "WOS:000330097200020"}