{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "analytical_hierarchy_process"}, {"score": 0.015463615321300136, "phrase": "pairwise_comparison_matrix"}, {"score": 0.014539303776329027, "phrase": "priority_vectors"}, {"score": 0.004619134710069517, "phrase": "new_parametric_prioritization_methods"}, {"score": 0.00435824746642263, "phrase": "ahp"}, {"score": 0.0042157995925335544, "phrase": "logical_relation"}, {"score": 0.004129138311177554, "phrase": "comparative_matrix"}, {"score": 0.003615016816532732, "phrase": "mathematical_programming_models"}, {"score": 0.003048449231088915, "phrase": "proposed_priority_method"}, {"score": 0.00292426293067148, "phrase": "false_cognitions"}, {"score": 0.002690820958068933, "phrase": "judgment_matrix"}, {"score": 0.0024452510143564057, "phrase": "practical_applications"}, {"score": 0.0021944684609599245, "phrase": "new_approach"}, {"score": 0.002167235986623239, "phrase": "ahp._crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Parametric prioritization method (PPM)", " Analytic hierarchy process (AHP)", " Judgment matrix", " Consistency", " Priority"], "paper_abstract": "In this paper, new parametric prioritization methods (PPMs) to determine a family of priority vectors in an analytical hierarchy process (AHP) are proposed, pointing out the logical relation of elements in the comparative matrix. The scales and consistency cannot determine the priorities, but only the order of the alternatives. To derive the priorities of alternatives, a series of theorems and mathematical programming models is given based on a pairwise comparison matrix. This refers to parameters theta, alpha, beta, by which there exists a family of priorities for the same judgment matrix. The discrimination of alternatives can be easily improved when using the proposed priority method by modifying the values of the parameters. Some false cognitions about how to determine the priority of an analytical hierarchy process are rectified. One should not elicit priority vectors from the judgment matrix; the information is incomplete, and the parameters must be considered. Finally, the meanings of parameters are explained in practical applications and an approach for determining the values of the parameters is proposed. Examples are also used to illustrate the features and applicability of the new approach in an AHP. Crown Copyright (C) 2011 Published by Elsevier Ltd. All rights reserved.", "paper_title": "New parametric prioritization methods for an analytical hierarchy process based on a pairwise comparison matrix", "paper_id": "WOS:000295716700019"}