{"auto_keywords": [{"score": 0.04720912624670318, "phrase": "sapte"}, {"score": 0.010612387000973441, "phrase": "discourse_analysis"}, {"score": 0.010512667468117895, "phrase": "information_retrieval"}, {"score": 0.01041387508945056, "phrase": "television_programs"}, {"score": 0.007768021401556023, "phrase": "tv_researchers"}, {"score": 0.00459165923324494, "phrase": "novel_multimedia_information_system"}, {"score": 0.004116440453049531, "phrase": "independent_and_dependent_metadata"}, {"score": 0.003944112858235306, "phrase": "discourse_analysis_techniques"}, {"score": 0.0038332390893263844, "phrase": "audio_analysis"}, {"score": 0.0037610536973798113, "phrase": "proposed_system"}, {"score": 0.0036379729015583975, "phrase": "free-to-air_brazilian_tv_channel"}, {"score": 0.0036207206487324506, "phrase": "rede_minas"}, {"score": 0.003485605409687907, "phrase": "computational_tools"}, {"score": 0.0033875770020590796, "phrase": "media_universe"}, {"score": 0.003261133560558666, "phrase": "matterhorn_framework"}, {"score": 0.0032149396890830575, "phrase": "video_libraries"}, {"score": 0.003094920033010818, "phrase": "analysis_techniques"}, {"score": 0.0023485549678832628, "phrase": "k-d_tree_methods"}, {"score": 0.0021049977753042253, "phrase": "promising_computational_tool"}], "paper_keywords": ["Content-based video retrieval", " Video indexing", " Television", " Discourse analysis"], "paper_abstract": "This paper presents a novel multimedia information system, called SAPTE, for supporting the discourse analysis and information retrieval of television programs from their corresponding video recordings. Unlike most common systems, SAPTE uses both content independent and dependent metadata, which are determined by the application of discourse analysis techniques as well as image and audio analysis methods. The proposed system was developed in partnership with the free-to-air Brazilian TV channel Rede Minas in an attempt to provide TV researchers with computational tools to assist their studies about this media universe. The system is based on the Matterhorn framework for managing video libraries, combining: (1) discourse analysis techniques for describing and indexing the videos, by considering aspects, such as, definitions of the subject of analysis, the nature of the speaker and the corpus of data resulting from the discourse; (2) a state of the art decoder software for large vocabulary continuous speech recognition, called Julius; (3) image and frequency domain techniques to compute visual signatures for the video recordings, containing color, shape and texture information; and (4) hashing and k-d tree methods for data indexing. The capabilities of SAPTE were successfully validated, as demonstrated by our experimental results, indicating that SAPTE is a promising computational tool for TV researchers.", "paper_title": "SAPTE: A multimedia information system to support the discourse analysis and information retrieval of television programs", "paper_id": "WOS:000364493700035"}