{"auto_keywords": [{"score": 0.049347793578485837, "phrase": "preferred_semantics"}, {"score": 0.04675404263653011, "phrase": "argumentation_frameworks"}, {"score": 0.015719716506582538, "phrase": "emptiness_problem"}, {"score": 0.015017617147121425, "phrase": "stable_semantics"}, {"score": 0.01384489291499031, "phrase": "s-preferred_semantics"}, {"score": 0.013704802060224456, "phrase": "s-stable_semantics"}, {"score": 0.01276256001330712, "phrase": "stable_extensions"}, {"score": 0.004668957916795845, "phrase": "non-existence_problem"}, {"score": 0.004023120753104693, "phrase": "preferred_extensions"}, {"score": 0.003361069456060196, "phrase": "similar_way"}, {"score": 0.0033096502887394233, "phrase": "original_semantics"}, {"score": 0.0031116963435584982, "phrase": "argumentation_framework"}, {"score": 0.002895620643297197, "phrase": "second_element"}, {"score": 0.0024311346712789553, "phrase": "nonempty_preferred_extensions"}], "paper_keywords": ["Argumentation", " Preferred semantics", " Stable semantics", " Extension", " Minimality"], "paper_abstract": "The emptiness problem of the preferred semantics and the non-existence problem of the stable semantics are well recognized for argumentation frameworks. In this paper, we introduce two strong semantics, named s-preferred semantics and s-stable semantics, to guarantee the non-emptiness of the preferred extensions and the existence of the stable extensions respectively. Our semantics are defined by two concepts of extensions of argumentation frameworks, namely s-preferred extension and s-stable extension. Each is constructed in a similar way to the original semantics. The novelty of our semantics is that an extension of an argumentation framework is considered as a pair of sets of arguments, in which the second element of an extension is viewed as a kind of hypotheses that should be minimized. The s-preferred semantics not only solves the emptiness problem of the preferred semantics, but also coincides with the preferred semantics when nonempty preferred extensions exist. Meanwhile, the s-stable semantics ensures the existence of extensions, and coincides with the stable semantics when the stable extensions exist as well. The relations among various semantics for argumentation frameworks are discussed.", "paper_title": "Minimal hypotheses: extension-based semantics to argumentation", "paper_id": "WOS:000309867200007"}