{"auto_keywords": [{"score": 0.004664352260912174, "phrase": "three-dimensional_shape_matching"}, {"score": 0.004554488671294504, "phrase": "computer_vision"}, {"score": 0.00446490613141384, "phrase": "shape_registration"}, {"score": 0.004123781267600542, "phrase": "challenging_problem"}, {"score": 0.003947358102140903, "phrase": "quasi-conformal_maps"}, {"score": 0.0038696708318671446, "phrase": "conformal_maps"}, {"score": 0.003573859492987647, "phrase": "computationally_efficient_shape"}, {"score": 0.0034208822062692127, "phrase": "conformal_geometry_theory"}, {"score": 0.003353521531649663, "phrase": "disk_topology"}, {"score": 0.0032355864829403413, "phrase": "global_optimization"}, {"score": 0.003197200793408836, "phrase": "resulting_map"}, {"score": 0.0023439376937579204, "phrase": "resolution_variation"}, {"score": 0.0021218313648947926, "phrase": "face_recognition"}], "paper_keywords": ["shape representations", " shape matching", " conformal geometry", " 3D face recognition"], "paper_abstract": "Three-dimensional shape matching is a fundamental issue in computer vision with many applications such as shape registration, 3D object recognition, and classification. However, shape matching with noise, occlusion, and clutter is a challenging problem. In this paper, we analyze a family of quasi-conformal maps including harmonic maps, conformal maps, and least-squares conformal maps with regards to 3D shape matching. As a result, we propose a novel and computationally efficient shape matching framework by using least-squares conformal maps. According to conformal geometry theory, each 3D surface with disk topology can be mapped to a 2D domain through a global optimization and the resulting map is a diffeomorphism, i.e., one-to-one and onto. This allows us to simplify the 3D shape-matching problem to a 2D image-matching problem, by comparing the resulting 2D parametric maps, which are stable, insensitive to resolution changes and robust to occlusion, and noise. Therefore, highly accurate and efficient 3D shape matching algorithms can be achieved by using the above three parametric maps. Finally, the robustness of least-squares conformal maps is evaluated and analyzed comprehensively in 3D shape matching with occlusion, noise, and resolution variation. In order to further demonstrate the performance of our proposed method, we also conduct a series of experiments on two computer vision applications, i.e., 3D face recognition and 3D nonrigid surface alignment and stitching.", "paper_title": "Conformal geometry and its applications on 3D shape matching, recognition, and stitching", "paper_id": "WOS:000246395300008"}