{"auto_keywords": [{"score": 0.04966229511350135, "phrase": "time_windows"}, {"score": 0.00481495049065317, "phrase": "vehicle_routing_problem"}, {"score": 0.004731492618963217, "phrase": "related_problems"}, {"score": 0.00450933377534525, "phrase": "numerous_vehicle_routing_problems"}, {"score": 0.004373398434399966, "phrase": "well-known_vehicle"}, {"score": 0.003752550907120244, "phrase": "lp_relaxation"}, {"score": 0.0033197446406648626, "phrase": "pseudo-polynomial_number"}, {"score": 0.0027620516806198354, "phrase": "bound_trees"}, {"score": 0.002486402077525374, "phrase": "arcs-states_model"}, {"score": 0.0022579036318895753, "phrase": "global_resolution_time"}, {"score": 0.0021610874773389096, "phrase": "solomon's_benchmark"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["branch and bound method", " column and row generation", " vehicle routing problems"], "paper_abstract": "This paper presents several Arcs-States models that can be applied to numerous vehicle routing problems, one of which is the well-known vehicle routing problem with capacities and time windows. In these models, the variables correspond to the states (i.e. the resource quantities) of the vehicles when they travel through an arc. The LP relaxation of the problem provides a lower bound that can be embedded in a branch and bound algorithm that solves the problem exactly. However, for the pseudo-polynomial number of variables and constraints of our models, column and row generations have to be used. Generally, in a branch and bound algorithm, the lower bound needs to be very efficient to minimize the size of the branch and bound trees as far as possible. One of the models we present, the time-only, relies on a relaxation of the Arcs-States model where a resource is removed from the states in the variables. Although the quality of the bounds decreases, the global resolution time is greatly improved, as illustrated on instances of Solomon's benchmark. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Arcs-states models for the vehicle routing problem with time windows and related problems", "paper_id": "WOS:000242117400011"}