{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "product_attributes"}, {"score": 0.034902004555957454, "phrase": "product_information"}, {"score": 0.029970178858875544, "phrase": "information_rent"}, {"score": 0.004399525320473839, "phrase": "internet-based_markets"}, {"score": 0.004195418010131832, "phrase": "information_deficit"}, {"score": 0.003925414526537783, "phrase": "equilibrium_strategies"}, {"score": 0.003815064377019477, "phrase": "electronic_markets"}, {"score": 0.0036207206487324506, "phrase": "differentiated_product"}, {"score": 0.003436242862104006, "phrase": "market_outcomes"}, {"score": 0.0031693980719538317, "phrase": "imperfect_information"}, {"score": 0.0028006988338192375, "phrase": "fine-grained_information"}, {"score": 0.002683304054823427, "phrase": "dual_pricing_mechanism"}, {"score": 0.002337403139264533, "phrase": "welfare_gains"}, {"score": 0.002304263635960015, "phrase": "key_finding"}, {"score": 0.0021971473452127126, "phrase": "dual_rents"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Electronic markets", " Product information", " Shopbots", " Product search engines"], "paper_abstract": "We model the availability of information about product attributes in Internet-based markets, focusing on a phenomenon that we term as information deficit (availability of less than perfect information about product attributes) and its impact on the equilibrium strategies of sellers and buyers in electronic markets. We create a model of a market for a differentiated product and investigate how buyer uncertainty regarding the attributes of the product drives market outcomes. We show that a market for product information can partly correct the inefficiencies that arise from imperfect information and predict that product information will begin to be traded once appropriate micro-transaction payment schemes become available. We formulate a mechanism by which sellers can charge an information rent for fine-grained information about product attributes which we term as a dual pricing mechanism wherein sellers extract an information rent in addition to the price of the product from buyers. We analyze the equilibrium that results and comment on the nature of welfare gains. A key finding of the paper is that allowing sellers to charge dual rents leads to more efficient markets. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Information markets for product attributes: A game theoretic, dual pricing mechanism", "paper_id": "WOS:000278194200007"}