{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "social_media"}, {"score": 0.00481495049065317, "phrase": "academic_staff_members"}, {"score": 0.004563028873351776, "phrase": "traditional_scholarly_information_sources"}, {"score": 0.004368037394395782, "phrase": "six_higher_learning_institutions"}, {"score": 0.004266501496765747, "phrase": "web-based_survey"}, {"score": 0.00418134346679498, "phrase": "critical_incident"}, {"score": 0.00415333528095237, "phrase": "last_reading"}, {"score": 0.003949144559926685, "phrase": "scholarly_readings"}, {"score": 0.0038964032225585117, "phrase": "library_collections"}, {"score": 0.0036064757492752703, "phrase": "six_categories"}, {"score": 0.0035823043879169153, "phrase": "social_media_-_blogs"}, {"score": 0.0035716181071040114, "phrase": "traditional_scholarly_material"}, {"score": 0.0035344515467076545, "phrase": "rss"}, {"score": 0.0034990131917319277, "phrase": "twitter"}, {"score": 0.0034638476252104706, "phrase": "user_comments"}, {"score": 0.003260377175139591, "phrase": "scholarly_reading_patterns"}, {"score": 0.0031419449938286663, "phrase": "work-related_purposes"}, {"score": 0.0027187231747900814, "phrase": "demographic_factors"}, {"score": 0.00251620434048784, "phrase": "high_frequency_users"}, {"score": 0.002344468886431959, "phrase": "traditional_materials"}, {"score": 0.002259231376607264, "phrase": "higher_degree"}, {"score": 0.002206606452557159, "phrase": "social_media_tools"}, {"score": 0.0021770860717929192, "phrase": "good_addition"}, {"score": 0.0021624739899833868, "phrase": "traditional_forms"}, {"score": 0.0021479597698614373, "phrase": "scholarly_content"}, {"score": 0.0021049977753042253, "phrase": "academic_growth"}], "paper_keywords": ["Information media", " Social media", " Reading", " Information retrieval", " User studies"], "paper_abstract": "Purpose The purpose of this paper is to examine how often university academic staff members use and create various forms of social media for their work and how that use influences their use of traditional scholarly information sources. Design/methodology/approach - This article is based on a 2011 academic reading study conducted at six higher learning institutions in the United Kingdom. Approximately 2000 respondents completed the web-based survey. The study used the critical incident of last reading by academics to gather information on the purpose, outcomes, and values of scholarly readings and access to library collections. In addition, academics were asked about their use and creation of social media as part of their work activities. The authors looked at six categories of social media - blogs, videos/YouTube, RSS feeds, Twitter feeds, user comments in articles, podcasts, and other. This article focuses on the influence of social media on scholarly reading patterns. Findings - Most UK academics use one or more forms of social media for work-related purposes, but creation is less common. Frequency of use and creation is not as high as might be expected, with academics using or creating social media occasionally rather than regularly. There are some differences in use or creation based on demographic factors, including discipline and age. The use and creation of social media does not adversely affect the use of traditional scholarly material, and high frequency users or creators of social media read more scholarly material than others. Originality/value - This paper illustrates that academics who are engaged with traditional materials for their scholarly work are also embracing various forms of social media to a higher degree than their colleagues. This suggests that social media tools could be a good addition to traditional forms of scholarly content as a way to promote academic growth. Social media is not replacing traditional scholarly material, but rather is enhancing their use.", "paper_title": "Social media and scholarly reading", "paper_id": "WOS:000320636600003"}