{"auto_keywords": [{"score": 0.033075462967634923, "phrase": "drm"}, {"score": 0.010612375857833733, "phrase": "virtual_force_approach"}, {"score": 0.006560955624359585, "phrase": "securevf"}, {"score": 0.0047732596509542135, "phrase": "mobile_sensor_deployment"}, {"score": 0.0045108906244892165, "phrase": "mobile_sensors"}, {"score": 0.0038737214010638745, "phrase": "network_coverage_goals"}, {"score": 0.003644714340300824, "phrase": "analytical_study"}, {"score": 0.003504670673093149, "phrase": "typical_scenario"}, {"score": 0.0031023662967184216, "phrase": "securevf._drm"}, {"score": 0.003062091606343783, "phrase": "light-weight_algorithm"}, {"score": 0.0030223381739019894, "phrase": "repositions_sensors"}, {"score": 0.0029961221584602405, "phrase": "overcrowded_areas"}, {"score": 0.0027581067089091434, "phrase": "malicious_sensors"}, {"score": 0.0023782753249846794, "phrase": "energy_consumption"}, {"score": 0.002347378595930709, "phrase": "additional_movements"}, {"score": 0.0021892345747666977, "phrase": "coverage_goals"}, {"score": 0.0021049977753042253, "phrase": "localization_inaccuracies"}], "paper_keywords": ["Mobile sensors", " self-deployment", " virtual force approach"], "paper_abstract": "The virtual force approach is at the basis of many solutions proposed for deploying mobile sensors. In this paper we study the vulnerabilities of this approach. We show that by compromising a few mobile sensors, an attacker can influence the movement of other sensors and prevent the achievement of the network coverage goals. We introduce an attack, called opportunistic movement, and give an analytical study of its efficacy. We show that in a typical scenario this attack can reduce coverage by more than 50 percent, by only compromising a 7 percent of the nodes. We propose two algorithms to counteract the above mentioned attack, DRM and SecureVF. DRM is a light-weight algorithm which randomly repositions sensors from overcrowded areas. SecureVF requires a more complex coordination among sensors but, unlike DRM, it enables detection and identification of malicious sensors. We investigate the performance of DRM and SecureVF through simulations. We show that DRM can significantly reduce the effects of the attack, at the expense of an increase in the energy consumption due to additional movements. By contrast, SecureVF completely neutralizes the attack and allows the achievement of the coverage goals of the network even in the presence of localization inaccuracies.", "paper_title": "On the Vulnerabilities of the Virtual Force Approach to Mobile Sensor Deployment", "paper_id": "WOS:000343317500012"}