{"auto_keywords": [{"score": 0.037459531374115645, "phrase": "training_images"}, {"score": 0.01670228738256498, "phrase": "target_image"}, {"score": 0.00481495049065317, "phrase": "distribution_similarity"}, {"score": 0.004780030485538593, "phrase": "supervised_segmentation"}, {"score": 0.004642852977065663, "phrase": "supervised_machine_learning"}, {"score": 0.0037725685596495355, "phrase": "transfer-learning_approach"}, {"score": 0.003717989314966981, "phrase": "multi-feature_voxelwise_classification"}, {"score": 0.0035849585026689573, "phrase": "heterogeneous_set"}, {"score": 0.003481957226813911, "phrase": "different_scanners"}, {"score": 0.003381905288924267, "phrase": "training_image"}, {"score": 0.0032253960472377356, "phrase": "feature_space"}, {"score": 0.0031903162513050804, "phrase": "image_weights"}, {"score": 0.0030761074505030184, "phrase": "weighted_probability_density_function"}, {"score": 0.003053927440511425, "phrase": "pdf"}, {"score": 0.002727362288104989, "phrase": "weighted_classifier"}, {"score": 0.0024004805502253427, "phrase": "unweighted_classifier"}, {"score": 0.0023485057246680854, "phrase": "classification_errors"}, {"score": 0.002306052064028863, "phrase": "brain-tissue_segmentation"}, {"score": 0.0022315557620621205, "phrase": "traditional_approach"}, {"score": 0.0021992217442375157, "phrase": "representative_training_images"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Brain", " Domain adaptation", " Machine learning", " MRI", " Transfer learning"], "paper_abstract": "Many automatic segmentation methods are based on supervised machine learning. Such methods have proven to perform well, on the condition that they are trained on a sufficiently large manually labeled training set that is representative of the images to segment. However, due to differences between scanners, scanning parameters, and patients such a training set may be difficult to obtain. We present a transfer-learning approach to segmentation by multi-feature voxelwise classification. The presented method can be trained using a heterogeneous set of training images that may be obtained with different scanners than the target image. In our approach each training image is given a weight based on the distribution of its voxels in the feature space. These image weights are chosen as to minimize the difference between the weighted probability density function (PDF) of the voxels of the training images and the PDF of the voxels of the target image. The voxels and weights of the training images are then used to train a weighted classifier. We tested our method on three segmentation tasks: brain-tissue segmentation, skull stripping, and white-matter-lesion segmentation. For all three applications, the proposed weighted classifier significantly outperformed an unweighted classifier on all training images, reducing classification errors by up to 42%. For brain-tissue segmentation and skull stripping our method even significantly outperformed the traditional approach of training on representative training images from the same study as the target image. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Weighting training images by maximizing distribution similarity for supervised segmentation across scanners", "paper_id": "WOS:000360252700018"}