{"auto_keywords": [{"score": 0.008713766275018558, "phrase": "jcr_journals"}, {"score": 0.005074213867411292, "phrase": "cumulative_number"}, {"score": 0.004603525341738782, "phrase": "scientometrics_studies"}, {"score": 0.0041703614123283165, "phrase": "new_approach"}, {"score": 0.004133055661437163, "phrase": "journal_impact_factor"}, {"score": 0.004096082254543022, "phrase": "wider_scale"}, {"score": 0.003526227908351347, "phrase": "spain"}, {"score": 0.0034841647157189985, "phrase": "citing_journal_matrix"}, {"score": 0.00247529638625566, "phrase": "rank-order_distribution"}, {"score": 0.002366361492754389, "phrase": "previously_described_empirical_two-exponent_equation"}, {"score": 0.0021821915946356168, "phrase": "greatest_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Journal impact factor", " Citations", " References", " Journal distribution"], "paper_abstract": "In general, scientometrics studies tend to focus on citations received from journals (incoming citations) and usually neglect references to journals (outgoing citations). The aim of this study is to suggest a new approach to the journal impact factor on a wider scale, i.e., from the viewpoint of citing journals. I studied how citations (references) given by JCR journals contribute to the 2-year and 5-year journal impact factors (JIF). To do so, data were obtained from the 2011 edition of JCR (Science Edition) available for universities in Spain, and the citing journal matrix for each journal was used. This matrix records the number of times articles published in other journals (cited journals) were cited in a given journal (citing journal) in 2011. The results showed that a set of 50 journals produced about 15% of all references that contributed to the 2-year JIF. Similarly, a set of 50 journals produced about 13% of all references that contributed to the 5-year JIF. A Bradford-like plot was obtained by plotting the cumulative number of references that contributed to the 2-year and 5-year JIF against the cumulative number of citing journals. The distribution of journals according to the number and percentage of references they contributed to the 2-year and 5-year JIF showed peaks. A rank-order distribution of references that contributed to the 2-year and 5 year JIF was obtained with a previously described empirical two-exponent equation. Based on the maximum contribution to the 2-year JIF of different 2-year rolling reference windows, the second rolling window (references to articles published 2 and 3 years before 2011) made the greatest contribution to impact in 41% of journals. (c) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Providing impact: The distribution of JCR journals according to references they contribute to the 2-year and 5-year journal impact factors", "paper_id": "WOS:000351640700012"}