{"auto_keywords": [{"score": 0.049593242225692294, "phrase": "execution_comparison"}, {"score": 0.00437021209960886, "phrase": "existing_comparison_techniques"}, {"score": 0.004152818376630929, "phrase": "system_event_level"}, {"score": 0.003906116922372891, "phrase": "instruction_traces"}, {"score": 0.003509006038574667, "phrase": "novel_dual_execution_technique"}, {"score": 0.003334309053314909, "phrase": "instruction_level"}, {"score": 0.0030726480920918097, "phrase": "coupled_mode"}, {"score": 0.0027459678326877744, "phrase": "decoupled_mode"}, {"score": 0.0025826247025542235, "phrase": "decoupled_executions"}, {"score": 0.0023079225317714815, "phrase": "functional_components"}, {"score": 0.002261204313587616, "phrase": "comparative_debugging"}, {"score": 0.0022382002476510573, "phrase": "new_gdb_primitives"}, {"score": 0.0022041312401435346, "phrase": "understanding_real_world_regression_failures"}, {"score": 0.002137537770621167, "phrase": "dual_execution"}, {"score": 0.0021049977753042253, "phrase": "critical_enabling_technique"}], "paper_keywords": ["Algorithms", " Execution Comparison", " Dynamic Analysis"], "paper_abstract": "Execution comparison has many applications in debugging, malware analysis, software feature identification, and intrusion detection. Existing comparison techniques have various limitations. Some can only compare at the system event level and require executions to take the same input. Some require storing instruction traces that are very space-consuming and have difficulty dealing with non-determinism. In this paper, we propose a novel dual execution technique that allows on-the-fly comparison at the instruction level. Only differences between the executions are recorded. It allows executions to proceed in a coupled mode such that they share the same input sequence with the same timing, reducing nondeterminism. It also allows them to proceed in a decoupled mode such that the user can interact with each one differently. Decoupled executions can be recoupled to share the same future inputs and facilitate further comparison. We have implemented a prototype and applied it to identifying functional components for reuse, comparative debugging with new GDB primitives, and understanding real world regression failures. Our results show that dual execution is a critical enabling technique for execution comparison.", "paper_title": "Dual Execution for On the Fly Fine Grained Execution Comparison", "paper_id": "WOS:000370874900023"}