{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "information-retrieval_systems"}, {"score": 0.004706305193222972, "phrase": "important_idea"}, {"score": 0.00429558848734449, "phrase": "common_assumptions"}, {"score": 0.0037798652680135106, "phrase": "information_search"}, {"score": 0.003433987036569199, "phrase": "complex_phenomenon"}, {"score": 0.003371773890338284, "phrase": "complicated_relationship"}, {"score": 0.003119659433566212, "phrase": "genetic_risk"}, {"score": 0.003091262582401731, "phrase": "different_illnesses"}, {"score": 0.002610043728801011, "phrase": "uncertainty_management"}, {"score": 0.0025744696954056404, "phrase": "nine_principles"}, {"score": 0.002527788827701828, "phrase": "theoretical_work"}, {"score": 0.0024481198073210567, "phrase": "ir_system_design"}, {"score": 0.002327956449278255, "phrase": "multi-faceted_and_dynamic_experience"}, {"score": 0.002275299774554847, "phrase": "ongoing_appraisal_and_management_efforts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Uncertainty", " Information retrieval", " Appraisal", " Anxiety", " Hope"], "paper_abstract": "Uncertainty is an important idea in information-retrieval (IR) research, but the concept has yet to be fully elaborated and explored. Common assumptions about uncertainty are (a) that it is a negative (anxiety-producing) state and (b) that it will be reduced through information search and retrieval. Research in the domain of uncertainty in illness, however, has demonstrated that uncertainty is a complex phenomenon that shares a complicated relationship with information. Past research on people living with HIV and individuals who have tested positive for genetic risk for different illnesses has revealed that information and the reduction of uncertainty can, in fact, produce anxiety, and that maintaining uncertainty can be associated with optimism and hope. We review the theory of communication and uncertainty management and offer nine principles based on that theoretical work that can be used to influence IR system design. The principles reflect a view of uncertainty as a multi-faceted and dynamic experience, one subject to ongoing appraisal and management efforts that include interaction with and use of information in a variety of forms. Published by Elsevier Ltd.", "paper_title": "The appraisal and management of uncertainty: Implications for information-retrieval systems", "paper_id": "WOS:000324354600004"}