{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gait_patterns"}, {"score": 0.041577008053686304, "phrase": "younger_and_older_adults"}, {"score": 0.029420333683948755, "phrase": "younger_and_older_subjects"}, {"score": 0.025795577091037147, "phrase": "correlation-based_feature_selection"}, {"score": 0.004784909348794283, "phrase": "healthy_adults_climbing_stairs_employing_machine_learning_techniques"}, {"score": 0.004710620078577185, "phrase": "stair_climbing"}, {"score": 0.004315324272986853, "phrase": "acceleration_data"}, {"score": 0.004078829832634839, "phrase": "lumbo-sacral_joint"}, {"score": 0.0039038519189781135, "phrase": "machine_learning_approach"}, {"score": 0.0037363522297378777, "phrase": "six_representative_classification_models"}, {"score": 0.0036438763031922975, "phrase": "kstar"}, {"score": 0.0031845067058084583, "phrase": "highest_accuracy"}, {"score": 0.0028268629720802772, "phrase": "individual_features"}, {"score": 0.0028091907694771613, "phrase": "poor_performance"}, {"score": 0.0025730425700096365, "phrase": "triaxial_accelerometer"}, {"score": 0.0025330067698575527, "phrase": "performance_differences"}, {"score": 0.0025014259919355453, "phrase": "older_adults"}, {"score": 0.002439437869554093, "phrase": "sequential_feature_selection"}, {"score": 0.0022064376000055764, "phrase": "seven_features"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "So far, stair climbing has not been studied as extensively as gait has, although the significance of the prevention of falling on stairs has been well recognized. Based on acceleration data taken from 25 healthy subjects climbing up and down a set of 13 stairs with an accelerometer placed on the lumbo-sacral joint, this paper aims to assess gait patterns of younger and older adults climbing stairs using a machine learning approach. A total of 14 gait features were extracted and analyzed. The performance of six representative classification models: Multilayer Perceptron (MLP), KStar, Support Vector Machine (SVM), Naive Bayesian (NB), C4.5 Decision Trees, and Random Forests were evaluated in terms of their ability to discriminate between younger and older adults climbing up- and downstairs. MLP was found to provide the highest accuracy for classification. Accuracy of 95.7% was found for classifying a subject walking either up or down the stairs and an accuracy of 80.6% for classifying whether the subject was younger or older. An evaluation of individual features showed poor performance of classification for younger and older subjects climbing up- and downstairs, and in most cases failed to distinguish between the two classes. To access which set of features derived from a triaxial accelerometer can better describe the performance differences between younger and older adults climbing up- and downstairs, two feature selection algorithms, sequential feature selection and correlation-based feature selection, were implemented. Results show that 10 features derived from correlation-based feature selection were able to produce a 96.8% accuracy for classification between subjects climbing up and down. A subset of seven features achieved a performance of 84.9% accuracy for classification between younger and older subjects. (C) 2012 Wiley Periodicals. Inc.", "paper_title": "Assessing Gait Patterns of Healthy Adults Climbing Stairs Employing Machine Learning Techniques", "paper_id": "WOS:000313992600005"}