{"auto_keywords": [{"score": 0.03733910960741977, "phrase": "total_cost"}, {"score": 0.004740126725341152, "phrase": "retail_sector"}, {"score": 0.0044002186469797476, "phrase": "common_business_model"}, {"score": 0.003806395038279074, "phrase": "online_demand"}, {"score": 0.0036315039559860654, "phrase": "firm's_capacitated_locations"}, {"score": 0.003589046900483573, "phrase": "online_sales"}, {"score": 0.0030680392468327147, "phrase": "critical_role"}, {"score": 0.002881403688962202, "phrase": "backorder_costs"}, {"score": 0.0027167292419065514, "phrase": "standard_deviation"}, {"score": 0.0026327757304477665, "phrase": "online_inventory"}, {"score": 0.002424506147893058, "phrase": "unit_shipping_costs"}, {"score": 0.002358801930248239, "phrase": "online_fulfillment_locations"}, {"score": 0.002285883886723896, "phrase": "computational_study"}, {"score": 0.002232675154416128, "phrase": "good_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Inventory", " E-business", " Dual sales channel"], "paper_abstract": "In the retail sector many traditional bricks-and-mortar companies have added online sales channels to their supply chains. Unfortunately, even though the combined retailer/e-taiter is becoming a common business model, there is very limited research addressing retail/e-tail operations. To address this gap, this research considers where and how much inventory should be allocated and held at each site for a company that satisfies both in-store and online demand. Specifically, we determine how many and which of a firm's capacitated locations should handle online sales to minimize total cost (holding, backorder, fixed operating, transportation, and handling costs). Our primary findings include the following: (i) when all costs are considered the percentage of sales occurring online plays a critical role in determining the number of sites providing e-fulfillment; (ii) when holding and backorder costs are the only consideration (i.e., the customer pays for shipping), the standard deviation of in-store demand controls where online inventory should be located, regardless of the percentage of demand occurring online; and (iii) an increase in unit shipping costs does not necessarily imply that adding online fulfillment locations will decrease total cost. Results from a computational study illustrate that the model provides good solutions even when demand is correlated or not normally distributed. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Inventory and distribution strategies for retail/e-tail organizations", "paper_id": "WOS:000274767500014"}