{"auto_keywords": [{"score": 0.04533113884840749, "phrase": "mobile_agents"}, {"score": 0.04179262389200996, "phrase": "mobile_agent"}, {"score": 0.00481495049065317, "phrase": "mobile_agent_computing"}, {"score": 0.004721893473387288, "phrase": "mobile_agent_system"}, {"score": 0.004630626571109149, "phrase": "multiple_mobile_agents"}, {"score": 0.004145649381700967, "phrase": "single_or_multiple_computers"}, {"score": 0.003454687811707182, "phrase": "large-scale_mobile_software"}, {"score": 0.003236802914194731, "phrase": "deployable_software_components"}, {"score": 0.0026969099161088398, "phrase": "different_computers"}, {"score": 0.0026274936167233515, "phrase": "distributed_system"}, {"score": 0.0025102759256260703, "phrase": "distributed_applications"}, {"score": 0.0023672002840029517, "phrase": "mobile_or_stationary_computers"}, {"score": 0.0021747784376752776, "phrase": "prototype_implementation"}], "paper_keywords": [""], "paper_abstract": "A mobile agent system for organizing multiple mobile agents is presented. It provides two unique two mechanisms for dynamically organizing mobile agents, which may be running on single or multiple computers. The first enables a mobile agent to contain other mobile agents inside it and migrate to another mobile agent or computer with its inner agents. It provides an approach to composing large-scale mobile software from a collection of mobile agents and using mobile agents as deployable software components. The second enables a mobile agent to be deployed at computers according to the movements of other mobile agents. It can move a federation of agents running on different computers, over a distributed system. It can build and aggregate distributed applications from one or more mobile components that can be dynamically deployed at mobile or stationary computers during the execution of the application. This paper also presents a prototype implementation of the system and its application.", "paper_title": "Organization and mobility in mobile agent computing", "paper_id": "WOS:000236893200012"}