{"auto_keywords": [{"score": 0.04755960042077038, "phrase": "older_adults"}, {"score": 0.015719716506582538, "phrase": "mobile_phones"}, {"score": 0.015062047579087261, "phrase": "younger_adults"}, {"score": 0.00436890075128947, "phrase": "new_functions"}, {"score": 0.004116865870227898, "phrase": "china"}, {"score": 0.003603655538901435, "phrase": "smart_phones"}, {"score": 0.003074495313651187, "phrase": "visible_attributes"}, {"score": 0.002992456421856034, "phrase": "biggest_age-related_difference"}, {"score": 0.002865710140187219, "phrase": "internet_access"}, {"score": 0.0025440911575156755, "phrase": "soft_keys"}, {"score": 0.0023970487263732737, "phrase": "changing_button_labels"}, {"score": 0.0021049977753042253, "phrase": "feature_phones"}], "paper_keywords": ["Age", " Mobile phones", " Smart phones", " Acceptance", " Usability", " Attributes"], "paper_abstract": "This study examined the difference between younger adults and older adults in requirements for mobile phones and acceptance of new functions. A survey was conducted among 351 older adults and 140 younger adults in China. Four major findings were derived. Firstly, older adults perceived ease to understand manuals, font size, icon size, and feedback of the operation as more important compared with younger adults. Secondly, younger adults placed more emphasis on most non-visual aspects of mobile phones than older adults, while older adults placed more emphasis on visible attributes. Thirdly, the biggest age-related difference lays in connectivity. Younger adults perceived Internet access and the connection between mobile phones and other devices as much more important compared with older adults. Fourthly, older adults had more difficulties using soft keys and multi-tap than younger adults, which implied that smart phones with changing button labels and the touch & hold operation would be confusing for older adults. These results were interpreted in the context of the transition from feature phones to smart phones.", "paper_title": "Age-related difference in the use of mobile phones", "paper_id": "WOS:000344169700004"}