{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "set_intersection"}, {"score": 0.00418247778205288, "phrase": "third_parties"}, {"score": 0.00406026352268407, "phrase": "cassandra"}, {"score": 0.0037560869590718966, "phrase": "pre-determined_set"}, {"score": 0.0032987614613108345, "phrase": "c-set"}, {"score": 0.0028017745468000587, "phrase": "communication_cost"}, {"score": 0.002650018880406324, "phrase": "competing_solution"}, {"score": 0.0025251455169484557, "phrase": "common_features"}, {"score": 0.002250549946875429, "phrase": "portable_devices"}, {"score": 0.0021927897271015657, "phrase": "satellite_communications"}, {"score": 0.002152440300818582, "phrase": "wireless_sensor_networks"}, {"score": 0.0021365087453258263, "phrase": "thorough_analysis"}, {"score": 0.0021206948586186903, "phrase": "extensive_simulations"}], "paper_keywords": ["Sets disjointness test", " Set intersection size", " Set intersection elements", " Communication complexity", " Privacy", " Security", " Probabilistic assurance"], "paper_abstract": "Enforcing security often requires the two legitimate parties of a communication to determine if they share a secret, without disclosing information (e.g., the shared secret itself, or just the existence of such a secret) to third parties. In this paper, we propose CASSANDRA, a toolbox composed of three probabilistic protocols that allows two parties, each one having a subset of elements drawn by a pre-determined set, to compute information about the intersection of such two sets. In particular, C-void decides whether the two sets are disjoint; C-size allows to compute how many elements the intersection is composed of; and, C-set returns the identity of the elements of the intersection (if any). These protocols differ, other than in functionality, also in the degree of assurance they can provide and the degree of interactions required by the two parties. The communication cost also differs, but in any case, it is below the cost of competing solution representing the state of the art. These protocols also share some common features: that is, they are completely tunable and specifically suited for devices having constraints on energy, communication, storage, and bandwidth. Examples of these devices are portable devices (e.g., phones) handling satellite communications, or nodes of wireless sensor networks. Thorough analysis and extensive simulations support our findings.", "paper_title": "CASSANDRA: a probabilistic, efficient, and privacy-preserving solution to compute set intersection", "paper_id": "WOS:000295087900004"}