{"auto_keywords": [{"score": 0.04021347852184451, "phrase": "stereomouse"}, {"score": 0.006439161761112343, "phrase": "normal_mouse"}, {"score": 0.004814968511183252, "phrase": "mouse"}, {"score": 0.004618893461411858, "phrase": "skilled_strokes"}, {"score": 0.004547438494330851, "phrase": "computer_mouse"}, {"score": 0.004141238989360548, "phrase": "user's_original_hand_movement"}, {"score": 0.003870541730075597, "phrase": "new_mouse"}, {"score": 0.0037321585095070483, "phrase": "rotational_disturbance"}, {"score": 0.0036743708250589484, "phrase": "coordinate_system"}, {"score": 0.003542976343910816, "phrase": "special_mouse"}, {"score": 0.003143341238802547, "phrase": "angular_deviation"}, {"score": 0.0030308784612749647, "phrase": "drawing_performance"}, {"score": 0.0027741761880779535, "phrase": "basic_shape"}, {"score": 0.0026061419474030633, "phrase": "horizontal_drift"}, {"score": 0.0021049977753042253, "phrase": "incorrect_gesture_input"}], "paper_keywords": [""], "paper_abstract": "The computer mouse is rarely used for drawing due to its body-fixed coordinate system, which creates a stroke that differs from the user's original hand movement. In this study, we resolve this problem by implementing a new mouse called StereoMouse, which eliminates the rotational disturbance of the coordinate system in real-time. StereoMouse is a special mouse with two optical sensors, and its coordinate orientation at the beginning of a stroke is maintained throughout the movement by measuring and compensating for the angular deviation estimated from those sensors. The drawing performance of StereoMouse was measured by means of having users perform the task of repeatedly drawing a basic shape. The results of this experiment showed that StereoMouse eliminated the horizontal drift typically observed in a stroke drawn by a normal mouse. Consequently, StereoMouse allowed the users to draw shapes at a 10.6% faster mean speed with a 10.4% shorter travel time than a normal mouse would. Furthermore, StereoMouse showed 37.1% lower chance of making incorrect gesture input than the normal mouse.", "paper_title": "A Mouse With Two Optical Sensors That Eliminates Coordinate Disturbance During Skilled Strokes", "paper_id": "WOS:000345228500002"}