{"auto_keywords": [{"score": 0.03872634689794812, "phrase": "experimental_procedure"}, {"score": 0.01022766756840994, "phrase": "different_results"}, {"score": 0.006190630680729057, "phrase": "legitimate_differences"}, {"score": 0.00481495049065317, "phrase": "single-company_effort_models"}, {"score": 0.0047289803397368236, "phrase": "isbsg_database"}, {"score": 0.004680542234803855, "phrase": "jeffery_et_al"}, {"score": 0.004632597963417253, "phrase": "public_domain_metrics"}, {"score": 0.004596960835906736, "phrase": "software_development_effort"}, {"score": 0.004549912056270139, "phrase": "london"}, {"score": 0.004434229146194447, "phrase": "effort_prediction_accuracy"}, {"score": 0.0044114547518956625, "phrase": "cross-_and_single-company_effort_models"}, {"score": 0.004274078461815405, "phrase": "data_set"}, {"score": 0.004244318303507975, "phrase": "mendes_et_al"}, {"score": 0.004179242907084957, "phrase": "within-company_effort_estimation_models"}, {"score": 0.0036085162483496117, "phrase": "exactly_the_same_experimental_procedure"}, {"score": 0.0034449570204954094, "phrase": "isbsg_database_version"}, {"score": 0.003196964931319924, "phrase": "proceedings"}, {"score": 0.002913483929932102, "phrase": "set_patterns"}, {"score": 0.0027457055568702975, "phrase": "also_another_study"}, {"score": 0.0022627174473816374, "phrase": "data_preparation"}, {"score": 0.0022510708139135928, "phrase": "analysis_procedures"}, {"score": 0.0021213575697367148, "phrase": "fundamental_differences"}, {"score": 0.0021049977753042253, "phrase": "data_sets"}], "paper_keywords": ["effort estimation", " software projects", " cross-company estimation models", " single-company estimation model", " regression-based estimation models", " replication study", " experimental procedure"], "paper_abstract": "In 2001 the ISBSG database was used by Jeffery et al. (Using public domain metrics to estimate software development effort. Proceedings Metrics'01, London, pp 16-27, 2001; S1) to compare the effort prediction accuracy between cross- and single-company effort models. Given that more than 2,000 projects were later volunteered to this database, in 2005 Mendes et al. (A replicated comparison of cross-company and within-company effort estimation models using the ISBSG Database, in Proceedings of Metrics'05, Como, 2005; S2) replicated S1 but obtained different results. The difference in results could have occurred due to legitimate differences in data set patterns; however, they could also have occurred due to differences in experimental procedure given that S2 was unable to employ exactly the same experimental procedure used in S1 because S1's procedure was not fully documented. Recently, we applied S2's experimental procedure to the ISBSG database version used in S1 (release 6) to assess if differences in experimental procedure would have contributed towards different results (Lokan and Mendes, Cross-company and single-company effort models using the ISBSG Database: a further replicated study, Proceedings of the ISESE'06, pp 75-84, 2006; S3). Our results corroborated those from S1, suggesting that differences in the results obtained by S2 were likely caused by legitimate differences in data set patterns. We have since been able to reconstruct the experimental procedure of S1 and therefore in this paper we present both S3 and also another study (S4), which applied the experimental procedure of S1 to the data set used in S2. By applying the experimental procedure of S2 to the data set used in S1 (study S3), and the experimental procedure of S1 to the data set used in S2 (study S4), we investigate the effect of all the variations between S1 and S2. Our results for S4 support those of S3, suggesting that differences in data preparation and analysis procedures did not affect the outcome of the analysis. Thus, the different results of S1 and S2 are very likely due to fundamental differences in the data sets.", "paper_title": "Replicating studies on cross- vs single-company effort models using the ISBSG Database", "paper_id": "WOS:000251970200002"}