{"auto_keywords": [{"score": 0.0328058024765297, "phrase": "non-personalizing_firm"}, {"score": 0.012934994236257819, "phrase": "personalizing_firm"}, {"score": 0.00789049171823698, "phrase": "recommender_system"}, {"score": 0.00481495049065317, "phrase": "impact_of_recommender_system"}, {"score": 0.004722613498487908, "phrase": "non-personalizing_firms"}, {"score": 0.004662036750452837, "phrase": "recommender_systems"}, {"score": 0.004398872331144531, "phrase": "strategic_behavior"}, {"score": 0.004328432545135587, "phrase": "repeated_purchases"}, {"score": 0.004231699728933577, "phrase": "personalized_recommendations"}, {"score": 0.0035543706594585076, "phrase": "customer_purchases"}, {"score": 0.002927780883930371, "phrase": "increased_cost"}, {"score": 0.002880829737447174, "phrase": "reduced_quality"}, {"score": 0.0026570998719084153, "phrase": "planning_horizon"}, {"score": 0.00250682585023182, "phrase": "equilibrium_prices"}, {"score": 0.002380381895973937, "phrase": "profile_deterioration_rate"}, {"score": 0.0023346234464901978, "phrase": "interesting_variants"}, {"score": 0.0023120743774800176, "phrase": "base_model"}, {"score": 0.0022096849931961247, "phrase": "key_takeaways"}], "paper_keywords": ["recommender systems", " duopoly", " pricing", " dynamic optimization", " online competition", " Nash equilibrium"], "paper_abstract": "How do recommender systems affect prices and profits of firms under competition? To explore this question, we model the strategic behavior of customers who make repeated purchases at two competing firms: one that provides personalized recommendations and another that does not. When a customer intends to purchase a product, she obtains recommendations from the personalizing firm and uses this recommendation to eventually purchase from one of the firms. The personalizing firm profiles the customer (based on past purchases) to recommend products. Hence, if a customer purchases less frequently from the personalizing firm, the recommendations made to her become less relevant. While considering the impact on the quality of recommendations received, a customer must balance two opposing forces: (1) the lower price charged by the non-personalizing firm, and (2) an additional fit cost incurred when purchasing from the non-personalizing firm and the increased cost due to recommendations of reduced quality in the future. An outcome of the analysis is that the customers should distribute their purchases across both firms to maximize surplus over a planning horizon. Anticipating this response, the firms simultaneously choose prices. We study the sensitivity of the equilibrium prices and profits of the firms with respect to the effectiveness of the recommender system and the profile deterioration rate. We also analyze some interesting variants of the base model in order to study how its key results could be influenced. One of the key takeaways of this research is that the recommender system can influence the price and profit of not only the personalizing firm but also the non-personalizing firm.", "paper_title": "Impact of Recommender System on Competition Between Personalizing and Non-Personalizing Firms", "paper_id": "WOS:000353145800010"}