{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_explanations"}, {"score": 0.01964543910957462, "phrase": "structured_argumentation_scaffold"}, {"score": 0.012180109527240968, "phrase": "scientific_inquiry"}, {"score": 0.0040300463421312225, "phrase": "proposed_approach"}, {"score": 0.0038584250641318057, "phrase": "argumentation_process"}, {"score": 0.0033860360186761533, "phrase": "electronic_dialogues"}, {"score": 0.0033460624879847667, "phrase": "web-based_collaborative_synchronous_inquiry_system"}, {"score": 0.003115908199991072, "phrase": "inquiry_tasks"}, {"score": 0.002901538841589158, "phrase": "asis"}, {"score": 0.0023990982005125763, "phrase": "critical_variable"}, {"score": 0.002370748155770563, "phrase": "students'_competence"}, {"score": 0.0021901023885734, "phrase": "students'_construction"}, {"score": 0.002172811149894415, "phrase": "scientific_argumentation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-mediated communication", " Cooperative/collaborative learning", " Elementary education", " Interactive learning environments"], "paper_abstract": "Constructing scientific explanations is necessary for students to engage in scientific inquiry. The purpose of this study is to investigate the influence of using a structured argumentation scaffold to enhance skill in constructing scientific explanations in the process of scientific inquiry. The proposed approach is designed to scaffold the following aspects of argumentation: the argumentation process, the explanation structuring, explanation construction, and explanation evaluation. A quasi-experiment was conducted to examine the effectiveness of the structured argumentation scaffold in developing skill in constructing scientific explanations and engaging in electronic dialogues. A web-based collaborative synchronous inquiry system, ASIS (Argumentative Scientific Inquiry System), was utilized to support students as they worked in groups to carry out inquiry tasks. Two intact sixth grade classes (n = 50) participated in the study. The data show that the ASIS with the structured argumentation scaffold helped students significantly improve their skills in constructing scientific explanations, make more dialogue moves for explanation and query, and use more of all four argument components. In addition, the use of warrants, one of the components of an argument, was found to be a critical variable in predicting students' competence with regard to constructing scientific explanations. The results provide references for further research and system development with regard to facilitating students' construction of scientific argumentation and explanations. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Enhancing skill in constructing scientific explanations using a structured argumentation scaffold in scientific inquiry", "paper_id": "WOS:000366067400004"}