{"auto_keywords": [{"score": 0.0246757548159874, "phrase": "revocation_data"}, {"score": 0.00481495049065317, "phrase": "certificate_revocation_list_distribution_system"}, {"score": 0.0047464608267006395, "phrase": "kad_network"}, {"score": 0.004313996835376177, "phrase": "public_key_infrastructure"}, {"score": 0.00409310463335204, "phrase": "revocation_system"}, {"score": 0.00401560412621627, "phrase": "certificate_revocation_lists"}, {"score": 0.0036845490951857617, "phrase": "central_server"}, {"score": 0.0035632774896594524, "phrase": "common_problems"}, {"score": 0.0035125292519354724, "phrase": "single_point"}, {"score": 0.003348513474852869, "phrase": "whole_crl"}, {"score": 0.003146652729098066, "phrase": "bottleneck_problem"}, {"score": 0.002712931606243439, "phrase": "crl"}, {"score": 0.0025861368747446324, "phrase": "list_size"}, {"score": 0.002500927169609655, "phrase": "network_users"}, {"score": 0.0021560018573288666, "phrase": "new_distributed_revocation_system"}, {"score": 0.0021252533072727707, "phrase": "kademlia_network"}], "paper_keywords": ["Certificate Revocation List (CRL)", " structured peer-to-peer (P2P) overlay", " KAD network"], "paper_abstract": "Many peer-to-peer (p2p) overlays require certain security services which could be provided through a Public Key Infrastructure. However, these infrastructures are bound up with a revocation system, such as Certificate Revocation Lists (CRLs). A system with a client/server structure, where a Certificate Authority plays a role of a central server, is prone to suffer from common problems of a single point of failure. If only one Authority has to distribute the whole CRL to all users, perhaps several millions in a structured p2p overlay, a bottleneck problem appears. Moreover, in these networks, users often have a set of pseudonyms that are bound to a certificate, which gives rise to two additional issues: issuing the CRL and assuring its freshness. On the one hand, the list size grows exponentially with the number of network users. On the other hand, these lists must be updated more frequently; otherwise the revocation data will not be fresh enough. To solve these problems, we propose a new distributed revocation system for the Kademlia network. Our system distributes CRLs using the overlay itself and, to not compromise the storage of nodes, lists are divided into segments. This mechanism improves the accessibility, increases the availability and guarantees the freshness of the revocation data.", "paper_title": "Certificate Revocation List Distribution System for the KAD Network", "paper_id": "WOS:000331097900011"}