{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stock_sharing"}, {"score": 0.007645905253908181, "phrase": "supply_chain"}, {"score": 0.005941083402554558, "phrase": "traditional_mode"}, {"score": 0.005188053784992255, "phrase": "dominant_position"}, {"score": 0.003976978140059542, "phrase": "analysis_model"}, {"score": 0.0039040344230094164, "phrase": "simulation_method"}, {"score": 0.0037854112749311844, "phrase": "stock_sharing_mode"}, {"score": 0.0034935290662899488, "phrase": "whole_supply_chain's_performance"}, {"score": 0.0033873366086549735, "phrase": "research_results"}, {"score": 0.0029753513692467315, "phrase": "order_volume"}, {"score": 0.002849442549612025, "phrase": "better_profit"}, {"score": 0.0021845387990972543, "phrase": "whole_supply_chain"}, {"score": 0.0021049977753042253, "phrase": "traditional_mode_situation"}], "paper_keywords": ["Stock sharing", " Supply chain", " Two part-two period SC", " Trade promotion", " Supply chain coordination"], "paper_abstract": "Considering a two-period, two-part supply chain consisting of one supplier and multi-retailers, this paper studies the effects of stock sharing among retailers on the supply chain. By establishing analysis model and using simulation method, the effects of stock sharing mode and also the traditional mode without stock sharing on retailer, supplier and the whole supply chain's performance are analyzed. The research results show that when supplier is in a dominant position, although only under certain conditions the stock sharing can stimulate retailer to increase order volume and make supplier to gain a better profit, it always make the profitability of retailer and supplier better than in the traditional mode. When supplier is in a dominant position, stock sharing can always stimulate retailer to increase their order volume, and the profitability of the retailer, supplier and the whole supply chain is always better than the traditional mode situation without stock sharing. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis on the effects of stock sharing on supply chain", "paper_id": "WOS:000288182100008"}