{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "reduced_variants"}, {"score": 0.004691684576246597, "phrase": "block_cipher"}, {"score": 0.0046398246548600575, "phrase": "matsui"}, {"score": 0.00448771697381723, "phrase": "japan"}, {"score": 0.0044052452943364314, "phrase": "e-government_candidate"}, {"score": 0.004244955499652296, "phrase": "nessie-recommended_cipher"}, {"score": 0.003912470259465439, "phrase": "kasumi"}, {"score": 0.0036059320136308808, "phrase": "extensive_cryptanalytic_efforts"}, {"score": 0.003539671663910004, "phrase": "numerous_attacks"}, {"score": 0.003360527337581911, "phrase": "attacked_rounds"}, {"score": 0.0030628094110419697, "phrase": "practical_time_complexity"}, {"score": 0.003006499028632742, "phrase": "first_practical-time_attack"}, {"score": 0.0028331500847209984, "phrase": "non-linear_functions"}, {"score": 0.0022091400304857043, "phrase": "future_designs"}, {"score": 0.0021049977753042253, "phrase": "close_consideration"}], "paper_keywords": ["MISTY1", " Cryptanalysis", " Practical-time", " Slide attacks", " Related-key attacks"], "paper_abstract": "MISTY1 is a block cipher designed by Matsui in 1997. It is widely deployed in Japan where it is an e-government candidate recommended cipher, and is recognized internationally as a NESSIE-recommended cipher as well as an ISO/IEC standard and an RFC. Moreover, MISTY1 was selected to be the blueprint on top of which KASUMI, the GSM/3G block cipher, was based. Since its introduction, and especially in recent years, MISTY1 was subjected to extensive cryptanalytic efforts, which resulted in numerous attacks on its reduced variants. Most of these attacks aimed at maximizing the number of attacked rounds, and as a result, their complexities are highly impractical. In this paper we pursue another direction, by focusing on attacks of practical time complexity. We present the first practical-time attack on 5-round MISTY1 which exploits only the linear functions, and thus, remains valid even if the non-linear functions are replaced. On the other extreme, we show the importance of the layers, by presenting a devastating (and experimentally verified) related-key attack that can break MISTY1 with no layers, requiring only data and time. While our attacks clearly do not compromise the security of the full MISTY1, they expose several weaknesses in the components used in MISTY1, and improve our understanding of its security. These insights are also applicable to future designs which rely on MISTY1 as their base, and should be taken into close consideration by designers.", "paper_title": "Practical-time attacks against reduced variants of MISTY1", "paper_id": "WOS:000358798400013"}