{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "surgical_complexity"}, {"score": 0.04603595581241765, "phrase": "similarity_function"}, {"score": 0.004768104290288521, "phrase": "cleft_lip"}, {"score": 0.004323886831151445, "phrase": "medical_environment"}, {"score": 0.004260906498835763, "phrase": "logical-combinatorial_approach"}, {"score": 0.004219427915728972, "phrase": "pattern_recognition_theory"}, {"score": 0.004017989546119125, "phrase": "congenital_malformations"}, {"score": 0.003503497128638099, "phrase": "comparison_criteria"}, {"score": 0.003024909947609294, "phrase": "six_different_comparison_criteria"}, {"score": 0.0021678232353129472, "phrase": "mexico_city"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Cleft palate", " Surgical complexity", " Similarity function", " Mathematical modeling"], "paper_abstract": "The objective of this work is to show the modeling of a similarity function adapted to the medical environment using the logical-combinatorial approach of pattern recognition theory, and its application comparing the condition of patients with congenital malformations in the lip and/or palate, which are called cleft-primary palate and/or cleft-secondary palate, respectively. The similarity function is defined by the comparison criteria determined for each variable, taking into account their type (qualitative or quantitative), their domain and their initial space representation. in all, we defined 18 variables, with their domains and six different comparison criteria (fuzzy and absolute difference type). The model includes, further, the importance of every variable as well as a weight which reflects the surgical complexity of the cleft. Likewise, the usefulness of this function is shown by calculating the similarity among three patients. This work was developed jointly with the Cleft Palate Team at the Reconstructive Surgery Service of the Pediatric Hospital of Tacubaya, which belongs to the Health institute of the Federal District in Mexico City. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A mathematical function to evaluate surgical complexity of cleft lip and palate", "paper_id": "WOS:000265718500003"}