{"auto_keywords": [{"score": 0.03408270699077352, "phrase": "regularization_parameter"}, {"score": 0.00481495049065317, "phrase": "single_hidden_layer_neural_networks"}, {"score": 0.004440277230269978, "phrase": "numerical_instability_issues"}, {"score": 0.00439403045549761, "phrase": "regularization"}, {"score": 0.003985487777785535, "phrase": "tikhonov_regularization"}, {"score": 0.0036950408193035284, "phrase": "condition_number"}, {"score": 0.003635600104609725, "phrase": "diagnostic_tool"}, {"score": 0.0034817084307034955, "phrase": "well-conditioning_requirements"}, {"score": 0.00342568771304873, "phrase": "relevant_matrices"}, {"score": 0.0032806521851034766, "phrase": "optimal_value"}, {"score": 0.002865710140187219, "phrase": "generalization_performance"}, {"score": 0.0026710653215026685, "phrase": "proposed_method"}, {"score": 0.002410058288617039, "phrase": "reference_cases"}, {"score": 0.0023079225317714815, "phrase": "analytical_determination"}, {"score": 0.0022101055924375725, "phrase": "computational_load"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Regularization parameter", " Condition number", " Pseudoinversion", " Numerical instability"], "paper_abstract": "In this paper we consider the training of single hidden layer neural networks by pseudoinversion, which, in spite of its popularity, is sometimes affected by numerical instability issues. Regularization is known to be effective in such cases, so that we introduce, in the framework of Tikhonov regularization, a matricial reformulation of the problem which allows us to use the condition number as a diagnostic tool for identification of instability. By imposing well-conditioning requirements on the relevant matrices, our theoretical analysis allows the identification of an optimal value for the regularization parameter from the standpoint of stability. We compare with the value derived by cross-validation for overfitting control and optimization of the generalization performance. We test our method for both regression and classification tasks. The proposed method is quite effective in terms of predictivity, often with some improvement on performance with respect to the reference cases considered. This approach, due to analytical determination of the regularization parameter, dramatically reduces the computational load required by many other techniques. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "OCReP: An Optimally Conditioned Regularization for pseudoinversion based neural training", "paper_id": "WOS:000364160900008"}