{"auto_keywords": [{"score": 0.04777654308122868, "phrase": "different_sources"}, {"score": 0.040274242229001785, "phrase": "ficsr"}, {"score": 0.038812828217972155, "phrase": "expert's_feedback"}, {"score": 0.03566120722174859, "phrase": "ranked_interpretation"}, {"score": 0.00481495049065317, "phrase": "exploration_and_expert_feedback"}, {"score": 0.004685012337701536, "phrase": "critical_reality"}, {"score": 0.004435514622798228, "phrase": "design_phase"}, {"score": 0.004268780663872836, "phrase": "proper_understanding"}, {"score": 0.0042338720545681855, "phrase": "usage_context"}, {"score": 0.003857565803059891, "phrase": "purely_automated_conflict-resolution_mechanisms"}, {"score": 0.00380511089035825, "phrase": "domain_expert"}, {"score": 0.0037739796405555975, "phrase": "conflict-resolution_process"}, {"score": 0.003602302241898501, "phrase": "traditional_model"}, {"score": 0.0034572968057822633, "phrase": "possible_world"}, {"score": 0.00294122712771669, "phrase": "new_opportunities"}, {"score": 0.002925149105307855, "phrase": "exploratory_feedback"}, {"score": 0.0027843339377323878, "phrase": "different_resolutions"}, {"score": 0.002709045632654716, "phrase": "alternative_interpretations"}, {"score": 0.002564505790176378, "phrase": "expert's_relevant_domain_knowledge"}, {"score": 0.00239460114991662, "phrase": "initial_matching_phase"}, {"score": 0.0022298039221908712, "phrase": "on-line_query_processing"}, {"score": 0.002193410120879393, "phrase": "validity_analysis"}], "paper_keywords": ["Metadata integration", " Feedback-based conflict-resolution", " Taxonomy", " User feedback", " System feedback", " Exploration of alternatives"], "paper_abstract": "A critical reality in integration is that knowledge obtained from different sources may often be conflicting. Conflict-resolution, whether performed during the design phase or during run-time, can be costly and, if done without a proper understanding of the usage context, can be ineffective. In this paper, we propose a novel exploration and feedback-based approach [FICSR (Pronounced as \"fixer\")] to conflict-resolution when integrating metadata from different sources. Rather than relying on purely automated conflict-resolution mechanisms, FICSR brings the domain expert in the conflict-resolution process and informs the integration based on the expert's feedback. In particular, instead of relying on traditional model based definition of consistency (which, whenever there are conflicts, picks a possible world among many), we introduce a ranked interpretation of the metadata and statements about the metadata. This not only enables FICSR to avoid committing to an interpretation too early, but also helps in achieving a more direct correspondence between the experts' (subjective) interpretation of the data and the system's (objective) treatment of the available alternatives. Consequently, the ranked interpretation leads to new opportunities for exploratory feedback for conflict-resolution: within the context of a given statement of interest, (a) a preliminary ranking of candidate matches, representing different resolutions of the conflicts, informs the user about the alternative interpretations of the metadata, while (b) user feedback regarding the preferences among alternatives is exploited to inform the system about the expert's relevant domain knowledge. The expert's feedback, then, is used for resolving not only the conflicts among different sources, but also possible mis-alignments due to the initial matching phase. To enable this (system <->(informs) user) feedback process, we develop data structures and algorithms for efficient off-line conflict/agreement analysis of the integrated metadata. We also develop algorithms for efficient on-line query processing, candidate result enumeration, validity analysis, and system feedback. The results are brought together and evaluated in the Feedback-based InConSistency Resolution (FICSR) system.", "paper_title": "System support for exploration and expert feedback in resolving conflicts during integration of metadata", "paper_id": "WOS:000259961800005"}