{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "feature_selection"}, {"score": 0.02322730111336099, "phrase": "disease_outbreak_reports"}, {"score": 0.01048770468606463, "phrase": "semantic_features"}, {"score": 0.008425939571190106, "phrase": "experimental_data"}, {"score": 0.0057477459064806755, "phrase": "previous_work"}, {"score": 0.004417301047282113, "phrase": "biocaster_disease_outbreak_report_text_mining_system"}, {"score": 0.004249825947483216, "phrase": "general_purpose"}, {"score": 0.004187109346012277, "phrase": "usas"}, {"score": 0.004040324509631854, "phrase": "application_context"}, {"score": 0.00368442237104581, "phrase": "feature_sets"}, {"score": 0.0035446342985010434, "phrase": "based_features"}, {"score": 0.0035236026196355783, "phrase": "n-gram_features"}, {"score": 0.003450966222451678, "phrase": "usas_semantic_tagger"}, {"score": 0.003118838635447237, "phrase": "feature_selection_algorithm"}, {"score": 0.0031003255054939524, "phrase": "standard_text_classification_performance_metrics_-_accuracy"}, {"score": 0.003082776053268305, "phrase": "precision"}, {"score": 0.0029561107046138136, "phrase": "feature_representation"}, {"score": 0.0028438761181085077, "phrase": "semantic_tagger"}, {"score": 0.002793518637161653, "phrase": "naive_bayes_algorithm"}, {"score": 0.0027522340188241446, "phrase": "highest_classification_accuracy"}, {"score": 0.0026241684260044414, "phrase": "baseline_unigram_representation"}, {"score": 0.0024577274522206436, "phrase": "improved_performance"}, {"score": 0.0022012144080075114, "phrase": "classification_accuracy"}, {"score": 0.002181626277903721, "phrase": "statistically_significant_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Text classification", " Feature selection", " Text mining", " Information extraction", " Disease tracking"], "paper_abstract": "Introduction: This paper explores the benefits of using n-grams and semantic features for the classification of disease outbreak reports, in the context of the BioCaster disease outbreak report text mining system. A novel feature of this work is the use of a general purpose semantic tagger - the USAS tagger - to generate features. Background: We outline the application context for this work (the BioCaster epidemiological text mining system), before going on to describe the experimental data used in our classification experiments (the 1000 document BioCaster corpus). Feature sets: Three broad groups of features are used in this work: Named Entity based features, n-gram features, and features derived from the USAS semantic tagger. Methodology: Three standard machine learning algorithms - Naive Bayes, the Support Vector Machine algorithm, and the C4.5 decision tree algorithm - were used for classifying experimental data (that is, the BioCaster corpus). Feature selection was performed using the chi(2) feature selection algorithm. Standard text classification performance metrics - Accuracy, Precision, Recall, Specificity and F-score - are reported. Results: A feature representation composed of unigrams, bigrams, trigrams and features derived from a semantic tagger, in conjunction with the Naive Bayes algorithm and feature selection yielded the highest classification accuracy (and F-score). This result was statistically significant compared to a baseline unigram representation and to previous work on the same task. However, it was feature selection rather than semantic tagging that contributed most to the improved performance. Conclusion: This study has shown that for the classification of disease outbreak reports, a combination of bag-of-words, n-grams and semantic features, in conjunction with feature selection, increases classification accuracy at a statistically significant level compared to previous work in this domain. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Classifying disease outbreak reports using n-grams and semantic features", "paper_id": "WOS:000272036200016"}