{"auto_keywords": [{"score": 0.03737634241271663, "phrase": "odl_collection"}, {"score": 0.034904119106680745, "phrase": "odl_data"}, {"score": 0.015385260603799238, "phrase": "daily_living"}, {"score": 0.00481495049065317, "phrase": "patient_collection"}, {"score": 0.004318881178805575, "phrase": "five_different_studies"}, {"score": 0.004135010810625326, "phrase": "new_technologies"}, {"score": 0.003648683020392928, "phrase": "user_motivation"}, {"score": 0.003399466007862412, "phrase": "six_factors"}, {"score": 0.003344407169522133, "phrase": "patients'_collection"}, {"score": 0.0031500215477331048, "phrase": "odl"}, {"score": 0.0026175952455594277, "phrase": "care_professionals"}, {"score": 0.0024923577071656014, "phrase": "health-related_awareness"}, {"score": 0.0024519545383399773, "phrase": "behavior_change"}], "paper_keywords": ["Observations of daily living (ODL)", " Mobile health tracking", " Behavior change", " Patient/provider communication", " Smartphones", " User burden", " User motivation"], "paper_abstract": "We conducted a meta-synthesis of five different studies that developed, tested, and implemented new technologies for the purpose of collecting observations of daily living (ODL). From this synthesis, we developed a model to explain user motivation as it relates to ODL collection. We describe this model that includes six factors that motivate patients' collection of ODL data: usability, illness experience, relevance of ODL, information technology infrastructure, degree of burden, and emotional activation. We show how these factors can act as barriers or facilitators to the collection of ODL data and how interacting with care professionals and sharing ODL data may also influence ODL collection, health-related awareness, and behavior change. The model we developed and used to explain ODL collection can be helpful to researchers and designers who study and develop new, personal health technologies to empower people to improve their health.", "paper_title": "Developing a model for understanding patient collection of observations of daily living: a qualitative meta-synthesis of the Project HealthDesign program", "paper_id": "WOS:000347292500010"}