{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "integrated_time-series_data_mining_environment"}, {"score": 0.036750811833384966, "phrase": "time-series_data_mining_process"}, {"score": 0.004523455475492876, "phrase": "interferon_therapy_risk_mining"}, {"score": 0.004011366422179016, "phrase": "key_issues"}, {"score": 0.003953932197201054, "phrase": "useful_knowledge"}, {"score": 0.0038600230206554792, "phrase": "mined_time-series_patterns"}, {"score": 0.003714368305523811, "phrase": "negative_result"}, {"score": 0.003199864072042816, "phrase": "data_mining_process"}, {"score": 0.0030058503645435455, "phrase": "time-series_data_mining_environment"}, {"score": 0.0028235667474151714, "phrase": "domain_experts"}, {"score": 0.00266510562382701, "phrase": "time-series_pattern_extraction_methods"}, {"score": 0.0025892330566358503, "phrase": "rule_evaluation_methods"}, {"score": 0.0025644240336018045, "phrase": "active_human-system_interaction"}, {"score": 0.002432152706473349, "phrase": "case_study"}, {"score": 0.00236289633510808, "phrase": "urine_biochemical_test_database"}, {"score": 0.002340250894008014, "phrase": "chronic_hepatitis_patients"}, {"score": 0.0021049977753042253, "phrase": "interesting_knowledge"}], "paper_keywords": [""], "paper_abstract": "In this paper, we present the implementation of an integrated time-series data mining environment. Time-series data mining is one of key issues to get useful knowledge from databases. With mined time-series patterns, users can aware not only positive results but also negative result called risk after their observation period. However, users often face difficulties during time-series data mining process for data preprocessing method selection/construction, mining algorithm selection, and post-processing to refine the data mining process as other data mining processes. It is needed to develop a time-series data mining environment based on systematic analysis of the process. To get more valuable rules for domain experts from a time-series data mining process, we have designed an environment which integrates time-series pattern extraction methods, rule induction methods and rule evaluation methods with active human-system interaction. After implementing this environment, we have done a case study to mine time-series rules from blood and urine biochemical test database on chronic hepatitis patients. Then a physician has evaluated and refined his hypothesis on this environment. We discuss the availability of how much support to mine interesting knowledge for an expert.", "paper_title": "Implementing an integrated time-series data mining environment based on temporal pattern extraction methods: A case study of an interferon therapy risk mining for chronic hepatitis", "paper_id": "WOS:000239588900046"}