{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unreliable_networks"}, {"score": 0.013024286937128125, "phrase": "routing_protocols"}, {"score": 0.010939771722356134, "phrase": "dff"}, {"score": 0.00452670409375785, "phrase": "depth-first_forwarding"}, {"score": 0.004275904315753662, "phrase": "sensor_networks"}, {"score": 0.0042354707960660706, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.004195418010131832, "phrase": "limited_computational_power"}, {"score": 0.004116440453049531, "phrase": "low-capacity_channels"}, {"score": 0.0038515000499988673, "phrase": "conflicting_requirements"}, {"score": 0.0036727235025069828, "phrase": "resource_requirements"}, {"score": 0.0035864603175592854, "phrase": "underlying_topology_changes"}, {"score": 0.0034037221513153566, "phrase": "data_delivery_failure"}, {"score": 0.003154360892955196, "phrase": "local_data_delivery_failures"}, {"score": 0.0030078460113945136, "phrase": "routing_protocol_time"}, {"score": 0.0022824314760583834, "phrase": "on-demand_ad_hoc_distance-vector"}, {"score": 0.0022715929119140194, "phrase": "routing_protocol-next_generation"}, {"score": 0.0022076314894741394, "phrase": "optimized_link_state_routing_protocol_version"}, {"score": 0.0021049977753042253, "phrase": "low-power_and_lossy_networks"}], "paper_keywords": ["Depth first search", " lossy network", " routing protocol"], "paper_abstract": "This paper introduces extensions and applications of depth-first forwarding (DFF)-a data forwarding mechanism for use in unreliable networks such as sensor networks and Mobile Ad hoc NETworks with limited computational power and storage, low-capacity channels, device mobility, etc. Routing protocols for these networks try to balance conflicting requirements of being reactive to topology and channel variation while also being frugal in resource requirements-but when the underlying topology changes, routing protocols require time to re converge, during which data delivery failure may occur. DFF was developed to alleviate this situation: it reacts rapidly to local data delivery failures and attempts to successfully deliver data while giving a routing protocol time to recover from such a failure. An extension of DFF, denoted as DFF++, is proposed in this paper, in order to optimize the performance of DFF by way of introducing a more efficient search ordering. This paper also studies the applicability of DFF to three major routing protocols for the Internet of Things (IoT), including the Lightweight On-demand Ad hoc Distance-vector Routing Protocol-Next Generation (LOADng), the optimized link state routing protocol version 2 (OLSRv2), and the IPv6 routing protocol for low-power and lossy networks (RPL), and presents the performance of these protocols, with and without DFF, in lossy and unreliable networks.", "paper_title": "Depth-First Forwarding for Unreliable Networks: Extensions and Applications", "paper_id": "WOS:000373098500003"}