{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_media"}, {"score": 0.037903879741232924, "phrase": "social_media_sites"}, {"score": 0.004350308086118336, "phrase": "complementary_information"}, {"score": 0.004246428036409373, "phrase": "better_profile"}, {"score": 0.003987755561492638, "phrase": "online_services"}, {"score": 0.00346589179059467, "phrase": "cross-media_user_identification_problem"}, {"score": 0.002869793011316547, "phrase": "effective_approaches"}, {"score": 0.0028284184438992282, "phrase": "information_redundancies"}, {"score": 0.0027876387169652717, "phrase": "users'_unique_behavioral_patterns"}, {"score": 0.0025549840900344596, "phrase": "social_networking_sites"}, {"score": 0.002469830206270585, "phrase": "novel_online_services"}, {"score": 0.0022967713922705, "phrase": "information_diffusion"}, {"score": 0.002230984431056064, "phrase": "specific_user_behavior"}, {"score": 0.0021987994275190314, "phrase": "user_migration"}], "paper_keywords": ["Theory", " Measurement", " Social network analysis", " user identification", " cross-media analysis", " behavioral modeling"], "paper_abstract": "People use various social media sites for different purposes. The information on each site is often partial. When sources of complementary information are integrated, a better profile of a user can be built. This profile can help improve online services such as advertising across sites. To integrate these sources of information, it is necessary to identify individuals across social media sites. This paper aims to address the cross-media user identification problem. We provide evidence on the existence of a mapping among identities of individuals across social media sites, study the feasibility of finding this mapping, and illustrate and develop means for finding this mapping. Our studies show that effective approaches that exploit information redundancies due to users' unique behavioral patterns can be utilized to find such a mapping. This study paves the way for analysis and mining across social networking sites, and facilitates the creation of novel online services across sites. In particular, recommending friends and advertising across networks, analyzing information diffusion across sites, and studying specific user behavior such as user migration across sites in social media are one of the many areas that can benefit from the results of this study.", "paper_title": "User Identification Across Social Media", "paper_id": "WOS:000363675500006"}