{"auto_keywords": [{"score": 0.044859605310452834, "phrase": "articulation_work"}, {"score": 0.010391314068338278, "phrase": "instant_messaging"}, {"score": 0.00481495049065317, "phrase": "clinical_work"}, {"score": 0.004693476992528682, "phrase": "extensive_articulation"}, {"score": 0.0046141941030386525, "phrase": "computer_systems"}, {"score": 0.00402610372759447, "phrase": "instant_messaging_communication"}, {"score": 0.003468053168607071, "phrase": "message_content"}, {"score": 0.0033517342967390065, "phrase": "instant_messages"}, {"score": 0.0032950412841674026, "phrase": "perioperative_coordination"}, {"score": 0.003267054216881229, "phrase": "communication_system"}, {"score": 0.0032255172568437965, "phrase": "danish_hospital"}, {"score": 0.0027662954811372175, "phrase": "patient_care"}, {"score": 0.002639440558428147, "phrase": "perioperative_domain"}, {"score": 0.002475755804232436, "phrase": "real_clinical_setting"}, {"score": 0.0024547103576350233, "phrase": "predefined_messages"}, {"score": 0.002433843373780471, "phrase": "strict_workflow_design"}, {"score": 0.0023221983158528163, "phrase": "collaborative_clinical_work"}, {"score": 0.0022731540640627307, "phrase": "vital_importance"}, {"score": 0.002159623311924437, "phrase": "supportive_communication_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Instant messaging", " Healthcare", " Articulation work", " Hospital information systems"], "paper_abstract": "Introduction: Clinical work is increasingly fragmented and requires extensive articulation and coordination. Computer systems may support such work. In this study, we investigate how instant messaging functions as a tool for supporting articulation work at the hospital. Purpose: This paper aims to describe the characteristics of instant messaging communication in terms of number and length of messages, distribution over time, and the number of participants included in conversations. We also aim to determine what kind of articulation work is supported by analysing message content. Methods: Analysis of one month's worth of instant messages sent through the perioperative coordination and communication system at a Danish hospital. Results: Instant messaging was found to be used extensively for articulation work, mostly through short, simple conversational exchanges. It is used particularly often for communication concerning the patient, specifically, the coordination and logistics of patient care. Instant messaging is used by all actors involved in the perioperative domain. Conclusion: Articulation work and clinical work are hard to separate in a real clinical setting. Predefined messages and strict workflow design do not suffice when supporting communication in the context of collaborative clinical work. Flexibility is of vital importance, and this needs to be reflected in the design of supportive communication systems. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Instant messaging at the hospital: Supporting articulation work?", "paper_id": "WOS:000323584700002"}