{"auto_keywords": [{"score": 0.049107323038630336, "phrase": "rbac"}, {"score": 0.040789560085812374, "phrase": "ascribed_status"}, {"score": 0.03779084669711562, "phrase": "sbac_model"}, {"score": 0.027705412322779836, "phrase": "sbac_policies"}, {"score": 0.00474493382693875, "phrase": "access_control"}, {"score": 0.004396858397567621, "phrase": "distributed_case"}, {"score": 0.004371160978838441, "phrase": "standard_rbac_assumptions"}, {"score": 0.004294962474996283, "phrase": "relatively_static_access_policies"}, {"score": 0.004244899702076962, "phrase": "human_users"}, {"score": 0.004207734323806386, "phrase": "complete_information"}, {"score": 0.004146510711518748, "phrase": "job_functions"}, {"score": 0.0036876111170996936, "phrase": "status-based_access_control"}, {"score": 0.0036232849574569953, "phrase": "distributed_access_control"}, {"score": 0.0034268702387746106, "phrase": "action_status"}, {"score": 0.0033473779327638322, "phrase": "user's_action_status"}, {"score": 0.003138124398958758, "phrase": "access_policy_requirements"}, {"score": 0.0030206579994328975, "phrase": "autonomous_agent"}, {"score": 0.0025254115243261875, "phrase": "sbac_policy_representation"}, {"score": 0.002430824291238387, "phrase": "rbac_models"}, {"score": 0.0022854384756395116, "phrase": "monotonic_languages"}, {"score": 0.0022323643840655646, "phrase": "distributed_access_control_requirements"}, {"score": 0.0021998194157393353, "phrase": "existing_algebras"}, {"score": 0.0021613897794439227, "phrase": "access_policy_composition"}, {"score": 0.0021049977753042253, "phrase": "efficient_implementation"}], "paper_keywords": ["Security", " status-based access control", " logic", " distributed security", " algebras"], "paper_abstract": "Despite their widespread adoption, Role-based Access Control (RBAC) models exhibit certain shortcomings that make them less than ideal for deployment in, for example, distributed access control. In the distributed case, standard RBAC assumptions (e. g., of relatively static access policies, managed by human users, with complete information available about users and job functions) do not necessarily apply. Moreover, RBAC is restricted in the sense that it is based on one type of ascribed status, an assignment of a user to a role. In this article, we introduce the status-based access control (SBAC) model for distributed access control. The SBAC model (or family of models) is based on the notion of users having an action status as well as an ascribed status. A user's action status is established, in part, from a history of events that relate to the user; this history enables changing access policy requirements to be naturally accommodated. The approach can be implemented as an autonomous agent that reasons about the events, actions, and a history (of events and actions), which relates to a requester for access to resources, in order to decide whether the requester is permitted the access sought. We define a number of algebras for composing SBAC policies, algebras that exploit the language that we introduce for SBAC policy representation: identification-based logic programs. The SBAC model is richer than RBAC models and the policies that can be represented in our approach are more expressive than the policies admitted by a number of monotonic languages that have been hitherto described for representing distributed access control requirements. Our algebras generalize existing algebras that have been defined for access policy composition. We also describe an approach for the efficient implementation of SBAC policies.", "paper_title": "Status-Based Access Control", "paper_id": "WOS:000263099900001"}