{"auto_keywords": [{"score": 0.0464485993141056, "phrase": "underground_music_file_sharing_communities"}, {"score": 0.00481495049065317, "phrase": "online_music_communities"}, {"score": 0.004684157900507474, "phrase": "purpose_-_this_paper"}, {"score": 0.004363846362238565, "phrase": "members'_motivations"}, {"score": 0.004278807087784626, "phrase": "-_actor-network_theory"}, {"score": 0.004195418010131832, "phrase": "ethnographic_methodology"}, {"score": 0.0037133478610481994, "phrase": "online_community"}, {"score": 0.0035981701736904495, "phrase": "increased_understanding"}, {"score": 0.003555902292752528, "phrase": "structured_and_orderly_nature"}, {"score": 0.003445591238183763, "phrase": "strong_rules"}, {"score": 0.003097865379563127, "phrase": "rich_insights"}, {"score": 0.0030614565460256897, "phrase": "under-researched_topic"}, {"score": 0.0029547698888028697, "phrase": "sophisticated_underground_file_sharing_communities"}, {"score": 0.0028857130140890787, "phrase": "legitimate_online_music_systems"}, {"score": 0.0028293966058473476, "phrase": "large_number"}, {"score": 0.0027741761880779535, "phrase": "music_file_sharing_communities"}, {"score": 0.002455009746748708, "phrase": "policy_formulation"}, {"score": 0.0024357240356443653, "phrase": "file_sharing"}, {"score": 0.0021896891011033105, "phrase": "research_literature"}, {"score": 0.0021049977753042253, "phrase": "actor-network_theory"}], "paper_keywords": ["Ethnography", " Actor-network theory", " File sharing", " Subculture", " Music"], "paper_abstract": "Purpose - This paper aims to investigate the rules and rituals for joining and operating within underground music file sharing communities as well as the members' motivations for joining. Design/methodology/approach - Actor-network theory is combined with an ethnographic methodology to explore the structure, technology and rules of these communities from an actor-oriented, member perspective. Empirical data include in-depth interviews with three file sharers, and participant-observations for 120 days within an online community. Findings - The paper provides an increased understanding of the structured and orderly nature of underground music file sharing communities and the perceived importance of strong rules and rituals for membership. Many communities use the same open-source software. Research limitations/implications - Only a small number of file sharers (three) were interviewed. However they provide rich insights into this under-researched topic. Practical implications - An understanding of these sophisticated underground file sharing communities assists the further development of legitimate online music systems to appeal to the large number of individuals involved in music file sharing communities. Social implications - This paper provides an understanding of the practices within a subculture that is currently regarded as deviant and illegal, and contributes to the discussion and policy formulation on file sharing. Originality/value - This study is the only known ethnography investigating underground music File sharing communities. These communities have not been systematically studied previously and the paper addresses this lack of research literature. This study is also novel as it applies actor-network theory to a context to which it has not previously been applied.", "paper_title": "Underground online music communities: exploring rules for membership", "paper_id": "WOS:000296928700002"}