{"auto_keywords": [{"score": 0.04718561448870172, "phrase": "image_segmentation"}, {"score": 0.022716862537673292, "phrase": "cloud_model"}, {"score": 0.00481495049065317, "phrase": "image_thresholding"}, {"score": 0.004575854901681043, "phrase": "inherent_part"}, {"score": 0.00447341965028879, "phrase": "real_world_applications"}, {"score": 0.004348580182733617, "phrase": "new_methods"}, {"score": 0.004275347843870176, "phrase": "incomplete_information"}, {"score": 0.004203343568960231, "phrase": "fundamental_importance"}, {"score": 0.004086010164600727, "phrase": "conventional_image_segmentation"}, {"score": 0.0037320255482878365, "phrase": "better_way"}, {"score": 0.003026127736667187, "phrase": "theoretical_foundations"}, {"score": 0.002671263324230699, "phrase": "histogram_analysis"}, {"score": 0.0026411384812121503, "phrase": "optimum_threshold_selection"}, {"score": 0.002279011030331704, "phrase": "noisy_images"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Type-2 fuzzy sets", " cloud model", " image thresholding", " image segmentation", " uncertainty"], "paper_abstract": "Uncertainty is an inherent part of image segmentation in real world applications. The use of new methods for handling incomplete information is of fundamental importance. Type-1 fuzzy sets used in conventional image segmentation cannot fully handle the uncertainties. Type-2 fuzzy sets and cloud model can handle such uncertainties in a better way because they provide us with more design degrees of freedom. The paper presents a comparison on the two approaches for image segmentation with uncertainty, that is, image thresholding based on type-2 fuzzy sets and cloud model. Firstly, the theoretical foundations of two methods are analyzed. Secondly, the processing of image segmentation with uncertainty is compared through two stages respectively, which is histogram analysis and optimum threshold selection. Finally, the experiments are divided in three groups, both synthetic and real images are used to investigate the performance of handling uncertainty in image segmentation, and some noisy images are also involved in to validate the performance of suppressing noise. The experimental results suggest that the conclusion of comparisons is effective.", "paper_title": "Comparative Study of Image Thresholding Using Type-2 Fuzzy Sets and Cloud Model", "paper_id": "WOS:000285930600006"}