{"auto_keywords": [{"score": 0.023845126098612876, "phrase": "canada"}, {"score": 0.0051038281303404445, "phrase": "alberta"}, {"score": 0.00481495049065317, "phrase": "complete_continuum"}, {"score": 0.00471003041684707, "phrase": "system_dynamics"}, {"score": 0.00379914165379475, "phrase": "sustainable_health-care_system"}, {"score": 0.0031845067058084583, "phrase": "preliminary_long-term"}, {"score": 0.0030470127429039497, "phrase": "policy_development"}, {"score": 0.002996992362027833, "phrase": "osteoarthritis_care"}, {"score": 0.002947790697936243, "phrase": "simulation_models"}, {"score": 0.002758907973783665, "phrase": "disease_onset"}, {"score": 0.0027286224888843956, "phrase": "end-stage_care"}, {"score": 0.0025537472239953807, "phrase": "patient_population"}, {"score": 0.002286781334850213, "phrase": "osteoarthritis_care_system"}, {"score": 0.0022122603123901114, "phrase": "similar_methods"}], "paper_keywords": ["system dynamics", " simulation", " strategic planning", " health systems"], "paper_abstract": "Estimating how many patients will require care, the nature of the care they require, and when and where they will require it, is critical when planning resources for a sustainable health-care system. Resource planning must consider how quickly patients move among stages of care, the various different pathways they may take and the resources required at each stage. This research presents a preliminary long-term, population-driven system dynamics simulation developed to support resource planning and policy development relating to osteoarthritis care. The simulation models osteoarthritis patients as they transition through the continuum of care from disease onset through end-stage care, and provides insight into the size and characteristics of the patient population, their resource requirements and associated health-care costs. Although the model presented is specific to the osteoarthritis care system in the Province of Alberta, Canada, similar methods could be applied to develop simulations relating to other chronic conditions.", "paper_title": "Modelling the complete continuum of care using system dynamics: the case of osteoarthritis in Alberta", "paper_id": "WOS:000354506000008"}