{"auto_keywords": [{"score": 0.046588866765139535, "phrase": "ith_vertices"}, {"score": 0.029375216410904997, "phrase": "n-dimensional_hypercube"}, {"score": 0.004822403377936439, "phrase": "hamiltonian"}, {"score": 0.0047026237903774895, "phrase": "faulty_edges"}, {"score": 0.003967314311312148, "phrase": "hamiltonian_paths"}, {"score": 0.0033465923623290034, "phrase": "common_vertex_v"}, {"score": 0.0031174595932694036, "phrase": "n._hamiltonian_cycles"}, {"score": 0.00266693888510356, "phrase": "parallel_machines"}, {"score": 0.0024146842687658467, "phrase": "fault-free_mutually_fully_independent_hamiltonian_paths"}, {"score": 0.002281376328251423, "phrase": "fault-free_mutually_independent_hamiltonian_cycles"}, {"score": 0.002175913488493802, "phrase": "tolerable_faulty_edges"}, {"score": 0.0021049977753042253, "phrase": "worst_case"}], "paper_keywords": ["fault-tolerant embedding", " graph-theoretic interconnection networks", " Hamiltonian", " hypercubes", " mutually independent Hamiltonian cycles"], "paper_abstract": "Two Hamiltonian paths are said to be fully independent if the ith vertices of both paths are distinct for all i between 1 and n, where n is the number of vertices of the given graph. Hamiltonian paths in a set are said to be mutually fully independent if two arbitrary Hamiltonian paths in the set are fully independent. On the other hand, two Hamiltonian cycles are independent starting at v if both cycles start at a common vertex v and the ith vertices of both cycles are distinct for all i between 2 and n. Hamiltonian cycles in a set are said to be mutually independent starting at v if any two different cycles in the set are independent starting at v. The n-dimensional hypercube is widely used as the architecture for parallel machines. In this paper, we study its fault-tolerant property and show that an n-dimensional hypercube with at most n-2 faulty edges can embed a set of fault-free mutually fully independent Hamiltonian paths between two adjacent vertices, and can embed a set of fault-free mutually independent Hamiltonian cycles starting at a given vertex. The number of tolerable faulty edges is optimal with respect to a worst case.", "paper_title": "Fault-free mutually independent Hamiltonian cycles in hypercubes with faulty edges", "paper_id": "WOS:000243140800004"}