{"auto_keywords": [{"score": 0.048451073513520106, "phrase": "systemic_thinking"}, {"score": 0.02322730111336097, "phrase": "environmental_innovation"}, {"score": 0.01053161194671422, "phrase": "sustainable_development"}, {"score": 0.009003564184418136, "phrase": "dialectal_systems_theory"}, {"score": 0.008698762490393384, "phrase": "ems"}, {"score": 0.008468784748001997, "phrase": "lca"}, {"score": 0.0047415081747150065, "phrase": "purpose_-_research"}, {"score": 0.004475893575036647, "phrase": "construction_sector"}, {"score": 0.004112894218792621, "phrase": "quantitative_and_qualitative_data"}, {"score": 0.0037215192436590772, "phrase": "research_results"}, {"score": 0.003636605792981828, "phrase": "environmental_innovations"}, {"score": 0.0034326732528567826, "phrase": "novel_changes"}, {"score": 0.0030232568024943455, "phrase": "long-run_sustainable_development"}, {"score": 0.002842655426951218, "phrase": "environmental_innovation_efficiency"}, {"score": 0.0026421139329830755, "phrase": "new_ground"}, {"score": 0.002427473263013356, "phrase": "hard_polyurethane"}, {"score": 0.0024088451312725924, "phrase": "lightweight_concrete"}, {"score": 0.002372015603684862, "phrase": "expanded_glass"}, {"score": 0.0022388390432214415, "phrase": "first_attempt"}, {"score": 0.0021876814398268775, "phrase": "one's_knowledge"}, {"score": 0.002145942273032774, "phrase": "new_synergy"}, {"score": 0.0021049977753042253, "phrase": "environmental_management_system"}], "paper_keywords": ["Cybernetics", " Systems theory", " Environmental management", " Innovation", " Sustainable development"], "paper_abstract": "Purpose - Research deals with aspects of systemic thinking that explain environmental innovation in organizations, especially in the construction sector. The paper aims to address the issues. Design/methodology/approach - The research for this paper is based on the collection and analysis of quantitative and qualitative data, dialectal systems theory (DST), environmental management systems (EMS), life cycle analysis (LCA) and recycling. Findings - The research results show that systemic thinking (and environmental innovations) are still a novelty; it can be regarded as an engine for novel changes in social, economic and political arrangements in companies and other organizations as well as for society as a whole. Research is aimed at finding an answer to the question: what dialectal system approach can bring in the long-run sustainable development? Research limitations/implications - Research was limited to management of construction. Practical implications - Environmental innovation efficiency and processes in organizations with a systemic thinking can be innovated more easily. Originality/value - This paper breaks new ground in using systemic thinking to explain environmental innovation. In research, a model is proposed for recycling isolating materials, made of hard polyurethane and lightweight concrete with aggregates containing expanded glass, based on DST, EMS, LCA and recycling. This is the first attempt, to the best of one's knowledge, to make a new synergy of the dialectal systems theory, environmental management system and innovations supporting sustainable development, decision making and action.", "paper_title": "Dialectal system approach supporting environmental innovation for sustainable development", "paper_id": "WOS:000261315700040"}