{"auto_keywords": [{"score": 0.04963820943592888, "phrase": "parallel_discrete_event_simulation"}, {"score": 0.02893863895447082, "phrase": "bt"}, {"score": 0.004390312150344245, "phrase": "physical_computers"}, {"score": 0.004002972723329302, "phrase": "novel_parallel_simulator"}, {"score": 0.003966162568548304, "phrase": "aegeansim"}, {"score": 0.0038046452381676967, "phrase": "high_performance_server_clusters"}, {"score": 0.0036328561748082138, "phrase": "specific_event_model"}, {"score": 0.003389557201018519, "phrase": "simulation_scale"}, {"score": 0.0033274664434575136, "phrase": "simulation_process"}, {"score": 0.0031333949463567554, "phrase": "event_callback_interface"}, {"score": 0.002991823455621222, "phrase": "simulator_application-independent"}, {"score": 0.0027528751037412128, "phrase": "simulation_behavior"}, {"score": 0.0026775328564629577, "phrase": "related_bt_studies"}, {"score": 0.0024865237976623286, "phrase": "bt_system"}, {"score": 0.002418453525649304, "phrase": "different_man-made_system_attacks"}, {"score": 0.00229844995872581, "phrase": "tracker_isolation"}, {"score": 0.0021049977753042253, "phrase": "efficient_way"}], "paper_keywords": ["P2P", " simulation", " parallel"], "paper_abstract": "P2P systems are becoming the dominator of Internet. Such systems are typically composed of thousands to millions of physical computers, which make it difficult to predict their behaviors without a large scale distributed system simulator. This paper is an attempt to predict the behavior of large scale P2P systems by building a novel parallel simulator: AegeanSim, which provides parallel discrete event simulation of such systems on high performance server clusters. We abstract the execution of P2P applications with a specific event model, and parallel the simulation of events in a cluster, thus expanding the simulation scale and boosting the simulation process dramatically. A 1-stage synchronization method is proposed to improve the performance. An event callback interface is designed to implement their application logic easily while keeping the simulator application-independent. We use AegeanSim to predict the behavior of a typical P2P system: BitTorrent. By comparing the simulation behavior of BT with that of related BT studies and verifying its efficiency, scalability and accuracy, we make predictions about the behavior of BT system assuming they are assaulted by different man-made system attacks. Some reasonable results are found: (1) Tracker isolation can hardly work because of its short attacking time window. (2) Limiting the bandwidth of BT may be an efficient way to control it.", "paper_title": "Predicting the behavior of large scale P2P systems by parallel discrete event simulation", "paper_id": "WOS:000278159000002"}