{"auto_keywords": [{"score": 0.03672075932638577, "phrase": "teaching_style"}, {"score": 0.01560984472994894, "phrase": "teachers'_pedagogical_characteristics"}, {"score": 0.015500728800089328, "phrase": "teachers'_perceptions"}, {"score": 0.015392363685779106, "phrase": "transactional_distance"}, {"score": 0.015284760110830898, "phrase": "ttd"}, {"score": 0.014399398561744568, "phrase": "teaching_goals"}, {"score": 0.013234938485627894, "phrase": "teaching_environment"}, {"score": 0.00481495049065317, "phrase": "structural_relations"}, {"score": 0.004630755876583033, "phrase": "different_teaching_environments"}, {"score": 0.004192937957960497, "phrase": "pedagogical_decision-making_process"}, {"score": 0.004090083576606688, "phrase": "independent_variable"}, {"score": 0.0035740424892197155, "phrase": "dependent_variables"}, {"score": 0.0031451673059794236, "phrase": "distance_environments"}, {"score": 0.0030679359570782595, "phrase": "traditional_environment"}, {"score": 0.0030354183220734064, "phrase": "five-part_study_questionnaire"}, {"score": 0.0028881548838751705, "phrase": "significant_predictors"}, {"score": 0.0027873491386063913, "phrase": "mediator_variable_connecting_teaching_autonomy"}, {"score": 0.0027188802510720775, "phrase": "ttd."}, {"score": 0.00265208877121581, "phrase": "structural_and_measurement_models"}, {"score": 0.0024613749081680474, "phrase": "teachers'_pedagogical_decision-making_process"}, {"score": 0.0022520931135078404, "phrase": "important_component"}, {"score": 0.002204566591599102, "phrase": "technological_change"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distance education", " Pedagogical change", " Transactional distance", " Teaching style"], "paper_abstract": "In this study we examined how the variables: teaching autonomy, teaching goals teaching style and teachers' perceptions of transactional distance (TTD) work together within the pedagogical decision-making process in different teaching environments. The independent variable was the teaching environment, which was divided into three: entirely distance environment (Distance-E); blended distance environment (Distance-B); and the traditional environment (Traditional). The dependent variables were teaching autonomy, teaching goals, teaching style and TTD, i.e. teachers' evaluation of their ability to communicate with the students, explain the content and their satisfaction from the teaching environment. One hundred and sixty faculty members who teach in distance environments and one hundred and sixty faculty members who teach in a traditional environment answered a five-part study questionnaire. The finding indicated that teaching autonomy, teaching goal and teaching style are significant predictors of TTD. Furthermore, teaching style serves as a mediator variable connecting teaching autonomy and the teaching goal to the TTD. This pattern was repeated in both structural and measurement models in all three teaching environments, indicating the centrality of the teaching style as well as teaching goal and teaching autonomy in the teachers' pedagogical decision-making process and teaching outputs. We concluded that affecting the teachers' pedagogical characteristics, which serve as mechanisms that influence the results of teaching, is an important component in the process of the technological change in 21st century education. (C) 2014 The Authors. Published by Elsevier Ltd.", "paper_title": "Teachers' pedagogical change mechanism - Pattern of structural relations between teachers' pedagogical characteristics and teachers' perceptions of transactional distance (TTD) in different teaching environments", "paper_id": "WOS:000336820700016"}