{"auto_keywords": [{"score": 0.03826261711617252, "phrase": "prior_knowledge"}, {"score": 0.036713517235485056, "phrase": "geometric_similarity"}, {"score": 0.00481495049065317, "phrase": "classical_approaches"}, {"score": 0.004548253531664032, "phrase": "particular_geometric_similarity"}, {"score": 0.004116440453049531, "phrase": "corresponding_shape_parts"}, {"score": 0.00398177607914381, "phrase": "even_topology"}, {"score": 0.0036727235025069828, "phrase": "shape_parts"}, {"score": 0.0032456625605347417, "phrase": "training_set"}, {"score": 0.0031244995579170435, "phrase": "content-driven_analysis"}, {"score": 0.003036595866130994, "phrase": "matched_shapes"}, {"score": 0.0028140548269469934, "phrase": "per-label_classifiers"}, {"score": 0.0025954008219792337, "phrase": "probabilistic_label"}, {"score": 0.0024513404432665153, "phrase": "joint_labeling_scheme"}, {"score": 0.00241658945942583, "phrase": "probabilistic_labels"}, {"score": 0.002359759876402679, "phrase": "pairwise_assignments"}, {"score": 0.0022824314760583834, "phrase": "resulting_part_correspondence"}, {"score": 0.0021049977753042253, "phrase": "large_intra-class_variations"}], "paper_keywords": [""], "paper_abstract": "Classical approaches to shape correspondence base their computation purely on the properties, in particular geometric similarity, of the shapes in question. Their performance still falls far short of that of humans in challenging cases where corresponding shape parts may differ significantly in geometry or even topology. We stipulate that in these cases, shape correspondence by humans involves recognition of the shape parts where prior knowledge on the parts would play a more dominant role than geometric similarity. We introduce an approach to part correspondence which incorporates prior knowledge imparted by a training set of pre-segmented, labeled models and combines the knowledge with content-driven analysis based on geometric similarity between the matched shapes. First, the prior knowledge is learned from the training set in the form of per-label classifiers. Next, given two query shapes to be matched, we apply the classifiers to assign a probabilistic label to each shape face. Finally, by means of a joint labeling scheme, the probabilistic labels are used synergistically with pairwise assignments derived from geometric similarity to provide the resulting part correspondence. We show that the incorporation of knowledge is especially effective in dealing with shapes exhibiting large intra-class variations. We also show that combining knowledge and content analyses outperforms approaches guided by either attribute alone.", "paper_title": "Prior Knowledge for Part Correspondence", "paper_id": "WOS:000289996100033"}