{"auto_keywords": [{"score": 0.04685104062438761, "phrase": "pipeline_depth"}, {"score": 0.01572003977540277, "phrase": "smt"}, {"score": 0.015063017382292765, "phrase": "optimal_pipeline_depth"}, {"score": 0.010418209498431202, "phrase": "scaling_trends"}, {"score": 0.010349691461591707, "phrase": "optimal_smt_pipeline_depths"}, {"score": 0.009281453966024845, "phrase": "smt_pipelines"}, {"score": 0.007461962261590503, "phrase": "technology_generations"}, {"score": 0.004783105609960904, "phrase": "scaled_technologies"}, {"score": 0.004446349752828045, "phrase": "performance_improvement"}, {"score": 0.004402295697276237, "phrase": "higher_clock_speed"}, {"score": 0.004344232223147987, "phrase": "deeper_pipeline"}, {"score": 0.004286931271697226, "phrase": "power_dissipation"}, {"score": 0.004258563634666145, "phrase": "previous_papers"}, {"score": 0.003880498041409292, "phrase": "simultaneous_multithreading"}, {"score": 0.003778755692995768, "phrase": "modern_high-end_processors"}, {"score": 0.003667468902144262, "phrase": "optimal_power-performance_pipeline_depth"}, {"score": 0.0036431875627320628, "phrase": "smt."}, {"score": 0.003524150055503105, "phrase": "performance-optimal_pipeline_depth"}, {"score": 0.003500812175550438, "phrase": "near-future_technologies"}, {"score": 0.0033639840192975835, "phrase": "intricate_interplay"}, {"score": 0.0033306180744375616, "phrase": "relative_impacts"}, {"score": 0.0029846653187175012, "phrase": "well-known_power-performance"}, {"score": 0.002357055030818803, "phrase": "smt_designs"}, {"score": 0.00234142781099973, "phrase": "future_technologies"}, {"score": 0.0021049977753042253, "phrase": "constant_power_dissipation"}], "paper_keywords": ["multithreaded processors", " pipeline", " performance", " power"], "paper_abstract": "Performance and power act as opposing constraints for the optimal pipeline depth of a processor. Although increasing the pipeline depth may enable performance improvement, the higher clock speed associated with a deeper pipeline also increases the power dissipation. Previous papers have shown that the optimal pipeline depth for superscalars considering both power and performance is 18 to 20 fan-out-of-four ( FO4) inverter delays. As simultaneous multithreading ( SMT) becomes increasingly important for modern high-end processors, there is a need to quantify the optimal power-performance pipeline depth for SMT. Although previous work has shown that SMT retains the performance-optimal pipeline depth in near-future technologies, this result does not take power into account. The intricate interplay between the relative impacts of changing pipeline depth on power and performance makes it difficult to predict the scaling trends for optimal SMT pipeline depths considering both power and performance. Using simulations, we quantify the optimal SMT pipeline depths based on the well-known power-performance metric PD3. Our analysis is novel and provides the following key results about the scaling trends for SMT pipelines considering both power and performance: 1) SMT has a deeper PD3-optimal pipeline as compared to superscalar. 2) The PD3-optimal SMT pipeline depth increases with an increase in the number of programs. 3) The PD3-optimal SMT pipeline becomes shallower with technology for a given number of programs. Based on these results, we provide the following insights into SMT designs for future technologies: 1) To retain the PD3-optimal pipeline depth across technology generations while being energy-efficient, the number of programs running on an SMT must increase. 2) To maintain a constant power dissipation across technology generations, SMT pipelines must become shallower.", "paper_title": "Optimal power/performance pipeline depth for SMT in scaled technologies", "paper_id": "WOS:000251048500006"}