{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "politeness_strategies"}, {"score": 0.004765788394931875, "phrase": "signed_open_peer_review"}, {"score": 0.004717125879761534, "phrase": "scholarly_peer_review"}, {"score": 0.004645057834614705, "phrase": "complex_collaborative_activity"}, {"score": 0.004504193207111593, "phrase": "web-based_systems"}, {"score": 0.003413284742632989, "phrase": "reviewers'_comments"}, {"score": 0.0030798711656591948, "phrase": "open_peer-review_process"}, {"score": 0.002971016979295967, "phrase": "human-computer_interaction_conference"}, {"score": 0.0028807718824400697, "phrase": "frequent_use"}, {"score": 0.0028076592725295646, "phrase": "open_peer-review_processes"}, {"score": 0.0025726416100664853, "phrase": "unmitigated_criticism"}, {"score": 0.002193447487477984, "phrase": "research_communities"}, {"score": 0.0021377414429251647, "phrase": "peer-reviewing_processes"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["scholars", " human computer interaction", " feedback"], "paper_abstract": "Scholarly peer review is a complex collaborative activity that is increasingly supported by web-based systems, yet little is known about how reviewers and authors interact in such environments, how criticisms are conveyed, or how the systems may affect the interactions and use of language of reviewers and authors. We looked at one aspect of the interactions between reviewers and authors, the use of politeness in reviewers' comments. Drawing on Brown and Levinson's (1987) politeness theory, we analyzed how politeness strategies were employed by reviewers to mitigate their criticisms in an open peer-review process of a special track of a human-computer interaction conference. We found evidence of frequent use of politeness strategies and that open peer-review processes hold unique challenges and opportunities for using politeness strategies. Our findings revealed that less experienced researchers tended to express unmitigated criticism more often than did experienced researchers, and that reviewers tended to use more positive politeness strategies (e.g., compliments) toward less experienced authors. Based on our findings, we discuss implications for research communities and the design of peer-reviewing processes and the information systems that support them.", "paper_title": "Use of Politeness Strategies in Signed Open Peer Review", "paper_id": "WOS:000353654600013"}