{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "joint_image_segmentation"}, {"score": 0.004413846562278824, "phrase": "variational_model"}, {"score": 0.004318881178805575, "phrase": "based_image_segmentation"}, {"score": 0.004090274535243564, "phrase": "surface_model"}, {"score": 0.003668591097652231, "phrase": "object_contour"}, {"score": 0.003589602322126282, "phrase": "segmentation_method"}, {"score": 0.003201890266327127, "phrase": "image_plane"}, {"score": 0.0031329184724341592, "phrase": "top-down_manner"}, {"score": 0.002966900048034132, "phrase": "common_alternative_segmentation_approaches"}, {"score": 0.002284290601837099, "phrase": "object's_pose"}, {"score": 0.00217496508306238, "phrase": "numerous_experiments"}, {"score": 0.0021049977753042253, "phrase": "stereo_camera_system"}], "paper_keywords": ["pose estimation", " segmentation", " variational methods", " shape priors"], "paper_abstract": "In this article we present the integration of 3-D shape knowledge into a variational model for level set based image segmentation and contour based 3-D pose tracking. Given the surface model of an object that is visible in the image of one or multiple cameras calibrated to the same world coordinate system, the object contour extracted by the segmentation method is applied to estimate the 3-D pose parameters of the object. Vice-versa, the surface model projected to the image plane helps in a top-down manner to improve the extraction of the contour. While common alternative segmentation approaches, which integrate 2-D shape knowledge, face the problem that an object can look very differently from various viewpoints, a 3-D free form model ensures that for each view the model can fit the data in the image very well. Moreover, one additionally solves the problem of determining the object's pose in 3-D space. The performance is demonstrated by numerous experiments with a monocular and a stereo camera system.", "paper_title": "Three-dimensional shape knowledge for joint image segmentation and pose tracking", "paper_id": "WOS:000245567400001"}