{"auto_keywords": [{"score": 0.04701209021022985, "phrase": "higher-level_needs"}, {"score": 0.00481495049065317, "phrase": "informational_mainstream"}, {"score": 0.0044514440242754815, "phrase": "identity_formation"}, {"score": 0.004414806639101985, "phrase": "social_interaction"}, {"score": 0.004360412703519539, "phrase": "-_a_multi-disciplinary_literature_review"}, {"score": 0.004218602458288531, "phrase": "structured_interviews"}, {"score": 0.004098291340525772, "phrase": "interview_data"}, {"score": 0.00389994107619882, "phrase": "perceived_gap"}, {"score": 0.0038518661517315533, "phrase": "information_and_library_science_literature"}, {"score": 0.003184511206421333, "phrase": "glasgow"}, {"score": 0.0031452231581533814, "phrase": "relatively_good_provision"}, {"score": 0.003042812778470762, "phrase": "different_locale"}, {"score": 0.002789528662623221, "phrase": "fundamental_research_assumption"}, {"score": 0.0027665315772006575, "phrase": "homeless_individuals"}, {"score": 0.002665362204725326, "phrase": "practical_implications"}, {"score": 0.002643386043540555, "phrase": "public_libraries'_service_provision"}, {"score": 0.0025361866386341796, "phrase": "greater_room"}, {"score": 0.002473959963690124, "phrase": "homeless_service_agencies"}, {"score": 0.0021940118003312397, "phrase": "public_libraries"}, {"score": 0.0021049977753042253, "phrase": "widespread_assumptions"}], "paper_keywords": ["Homelessness", " Social interaction", " Identity formation", " Information provision", " Personal needs", " Information services", " United Kingdom", " Libraries"], "paper_abstract": "Purpose - This paper aims to explore how homelessness affects access to information serving higher-level needs such as identity formation and social interaction. Design/methodology/approach - A multi-disciplinary literature review informed the design of 18 semi-structured interviews as well as their subsequent analysis. The interview data were intended to be qualitative and exploratory since they addressed a perceived gap in the information and library science literature. Findings - Findings present the ways in which interviewees managed to access information and the way such information helps socialisation and well-being. Research limitations/implications - The study focused on individuals who were potentially more confident and resourceful. The study is also limited to Glasgow which has relatively good provision for the homeless. Further research in a different locale and among less confident individuals would be necessary to corroborate findings in this regard. Practical implications - The findings confirmed a fundamental research assumption that homeless individuals would pursue higher-level needs alongside more basic physiological needs. This has practical implications for public libraries' service provision to homeless populations, and also suggests there is greater room for collaboration between libraries and homeless service agencies. Originality/value - The paper addresses a gap in the literature concerning homelessness and higher-level needs. This has implications for the provision of information and services within both public libraries and organisations serving the homeless. Findings also challenge widespread assumptions regarding the \"otherness\" or distinctiveness of people who are homeless.", "paper_title": "Homelessness and access to the informational mainstream", "paper_id": "WOS:000302496500006"}