{"auto_keywords": [{"score": 0.034869878582789324, "phrase": "belfiore"}, {"score": 0.00481495049065317, "phrase": "first_part"}, {"score": 0.004548253531664032, "phrase": "kissing_number"}, {"score": 0.00447115003744675, "phrase": "secrecy_gain"}, {"score": 0.003683213029483699, "phrase": "similar_result"}, {"score": 0.003641433168173135, "phrase": "general_unimodular_lattices"}, {"score": 0.003459191419478298, "phrase": "shorter_vectors"}, {"score": 0.00308610073274614, "phrase": "secrecy_gains"}, {"score": 0.0026152363154073707, "phrase": "different_secrecy_gains"}, {"score": 0.002442037790000397, "phrase": "elkies"}, {"score": 0.0023463203637929466, "phrase": "special_class"}, {"score": 0.0021413855297794946, "phrase": "conditional_improvement"}, {"score": 0.0021049977753042253, "phrase": "gaulter's_results"}], "paper_keywords": ["Secrecy gain", " wiretap coding", " unimodular lattices", " theta functions", " kissing number"], "paper_abstract": "In the first part of this paper, we consider the relation between kissing number and the secrecy gain. We show that on an n = 24m + 8k-dimensional even unimodular lattice, if the shortest vector length is at least 2m, then as the number of vectors of length 2m decreases, the secrecy gain increases. We will also prove a similar result on general unimodular lattices. We will also consider the situations with shorter vectors. Furthermore, assuming the conjecture by Belfiore and Sole, we will calculate the difference between inverses of secrecy gains as the number of vectors varies. We will show by an example that there exist two lattices in the same dimension with the same shortest vector length and the same kissing number, but different secrecy gains. Finally, we consider some cases of a question by Elkies by providing an answer for a special class of lattices assuming the conjecture by Belfiore and Sole. We will also get a conditional improvement on some Gaulter's results concerning the conjecture.", "paper_title": "Some Results Related to the Conjecture by Belfiore and Sole", "paper_id": "WOS:000335151900024"}