{"auto_keywords": [{"score": 0.03127924457063613, "phrase": "computerized_system"}, {"score": 0.025853505474266906, "phrase": "better_workflow_support"}, {"score": 0.004410068751933955, "phrase": "computerized_physician_order_entry"}, {"score": 0.0042274171144583966, "phrase": "dutch"}, {"score": 0.003973887756331297, "phrase": "cpoe_system"}, {"score": 0.0035923719610602245, "phrase": "nursing_medication_work"}, {"score": 0.0034999880739789257, "phrase": "cpoe_implementation"}, {"score": 0.0033658327434624457, "phrase": "adaptive_structuration_theory'"}, {"score": 0.0033439861340900812, "phrase": "ast"}, {"score": 0.0032157824854214313, "phrase": "response_rates"}, {"score": 0.002777191653403706, "phrase": "timed_group"}, {"score": 0.0027501697136375555, "phrase": "overall_mean_score"}, {"score": 0.002723409977992608, "phrase": "computerized_process"}, {"score": 0.002644678812707061, "phrase": "paper-based_process"}, {"score": 0.0025349467677077803, "phrase": "post-implementation_process"}, {"score": 0.0025021056497407765, "phrase": "pre-implementation_process"}, {"score": 0.002351813899450668, "phrase": "paper-based_systems"}, {"score": 0.0022763657774198184, "phrase": "large_differences"}, {"score": 0.0022468671200629024, "phrase": "post-implementation_work_structure"}, {"score": 0.0021049977753042253, "phrase": "greater_satisfaction"}], "paper_keywords": ["Evaluation Studies", " Prescriptions, Drug", " Medication systems, Hospital", " Medical Order Entry Systems", " Computer Communication", " Networks", " Questionnaires"], "paper_abstract": "Objective: To compare how nurses in two different paper-based systems perceive the impact of a computerized physician order entry (CPOE) system on their medication-related activities. Setting: 13 non-surgical, adult inpatient wards in a Dutch academic hospital. Methods: Questionnaire survey of 295 nurses before and 304 nurses after the implementation of a CPOE system. These nurses worked with two different paper-based medication systems before the implementation: 'Kardex-system' and 'TIMED-system'. In the Kardex-system, the structure of the nursing medication work was similar to that of after the CPOE implementation, while in the TIMED-system, it was different. 'Adaptive Structuration Theory' (AST) was used to interpret the results. Results: The response rates were 52.2% (154/295) before and 44.7% (136/304) after the implementation. Kardex-nurses reported more positive effects than TIMED-nurses. TIMED-nurses reported that the computerized system was more inflexible, more difficult to work with, and slower than the TIMED-system. In the TIMED group, the overall mean score of the computerized process was not significantly different from that of the paper-based process. Moreover, nurses in both groups were more satisfied with the post-implementation process than with the pre-implementation process. Nevertheless, none of groups reported a better workflow support in the computerized system when compared to that of the paper-based systems. Conclusions: Our findings suggest that not only the technology but also large differences between pre- and post-implementation work structure influence the perceptions of users, and probably make the transition more difficult. This study also suggests that greater satisfaction with a system may not necessarily be a reflection of better workflow support. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Same system, different outcomes: Comparing the transitions from two paper-based systems to the same computerized physician order entry system", "paper_id": "WOS:000264089400003"}