{"auto_keywords": [{"score": 0.03753970440536791, "phrase": "parameter_uncertainties"}, {"score": 0.03067465352044953, "phrase": "stability_analysis"}, {"score": 0.0037921662574137535, "phrase": "t-s_fuzzy_models"}, {"score": 0.0036329805216306576, "phrase": "nonlinear_plant"}, {"score": 0.0034804536625952565, "phrase": "lower_and_upper_membership_functions"}, {"score": 0.002985988377995789, "phrase": "feedback_loop"}, {"score": 0.0026576091519087065, "phrase": "membership_function_conditions"}, {"score": 0.0025459275963373496, "phrase": "slack_matrices"}, {"score": 0.002409188797323273, "phrase": "stability_conditions"}, {"score": 0.0023507916951658455, "phrase": "linear_matrix_inequalities"}, {"score": 0.0022797772939670063, "phrase": "lyapunov-based_approach"}, {"score": 0.0021179540310789446, "phrase": "proposed_interval"}], "paper_keywords": ["fuzzy control", " interval type-2 fuzzy model", " stability analysis"], "paper_abstract": "This paper presents the stability analysis of interval type-2 fuzzy-model-based (FMB) control systems. To investigate the system stability, an interval type-2 Takagi-Sugeno (T-S) fuzzy model, which can be regarded as a collection of a number of type-1 T-S fuzzy models, is proposed to represent the nonlinear plant subject to parameter uncertainties. With the lower and upper membership functions, the parameter uncertainties can be effectively captured. Based on the interval type-2 T-S fuzzy model, an interval type-2 fuzzy controller is proposed to close the feedback loop. To facilitate the stability analysis, the information of the footprint of uncertainty is used to develop some membership function conditions, which allow the introduction of slack matrices to handle the parameter uncertainties in the stability analysis. Stability conditions in terms of linear matrix inequalities are derived using a Lyapunov-based approach. Simulation examples are given to illustrate the effectiveness of the proposed interval type-2 FMB control approach.", "paper_title": "Stability analysis of interval type-2 fuzzy-model-based control systems", "paper_id": "WOS:000258763600003"}