{"auto_keywords": [{"score": 0.04745804949919058, "phrase": "food_preparation"}, {"score": 0.03681258361949463, "phrase": "proposed_system"}, {"score": 0.0045124316982387315, "phrase": "quite_important_information"}, {"score": 0.004473552224535518, "phrase": "modern_people"}, {"score": 0.004358903464536199, "phrase": "delicious_dishes"}, {"score": 0.003634262647873338, "phrase": "seasoning_bottles"}, {"score": 0.0035410467987580484, "phrase": "electronic_scales"}, {"score": 0.0033762956164519286, "phrase": "total_weight"}, {"score": 0.0027304365438083874, "phrase": "chef's_picking"}, {"score": 0.0027068691342344545, "phrase": "returning_actions"}, {"score": 0.0026146109167103655, "phrase": "consumed_amount"}, {"score": 0.0022857899334246946, "phrase": "actual_food_preparation"}, {"score": 0.0022562464662197867, "phrase": "seven_participants"}], "paper_keywords": ["seasonings", " consumption measurement", " real-time system", " cooking support", " successive computation"], "paper_abstract": "The amount of seasonings used during food preparation is quite important information for modern people to enable them to cook delicious dishes as well as to take care for their health. In this paper, we propose a near real-time automated system for measuring and recording the amount of seasonings used during food preparation. Our proposed system is equipped with two devices: electronic scales and a camera. Seasoning bottles are basically placed on the electronic scales in the proposed system, and the scales continually measure the total weight of the bottles placed on them. When a chef uses a certain seasoning, he/she first picks up the bottle containing it from the scales, then adds the seasoning to a dish, and then returns the bottle to the scales. In this process, the chef's picking and returning actions are monitored by the camera. The consumed amount of each seasoning is calculated as the difference in weight between before and after it is used. We evaluated the performance of the proposed system with experiments in 301 trials in actual food preparation performed by seven participants. The results revealed that our system successfully measured the consumption of seasonings in 60.1% of all the trials.", "paper_title": "Development and Evaluation of Near Real-Time Automated System for Measuring Consumption of Seasonings", "paper_id": "WOS:000368904200022"}