{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_impact"}, {"score": 0.004767826806287385, "phrase": "individual_articles"}, {"score": 0.003858697684681798, "phrase": "clear_correlation"}, {"score": 0.0035141291835319682, "phrase": "higher_level"}, {"score": 0.0033950634506367235, "phrase": "higher_citation_rates"}, {"score": 0.0031070348334684356, "phrase": "highly_disciplinary_and_highly_interdisciplinary_articles"}, {"score": 0.0026020254041372723, "phrase": "high_impact"}, {"score": 0.00241658945942583, "phrase": "citation_characteristics"}, {"score": 0.002323142666222693, "phrase": "citation-intensive_disciplines"}, {"score": 0.002157538586313944, "phrase": "higher_citation_scores"}, {"score": 0.0021049977753042253, "phrase": "non-citation-intensive_disciplines"}], "paper_keywords": [""], "paper_abstract": "This article analyzes the effect of interdisciplinarity on the scientific impact of individual articles. Using all the articles published in Web of Science in 2000, we define the degree of interdisciplinarity of a given article as the percentage of its cited references made to journals of other disciplines. We show that although for all disciplines combined there is no clear correlation between the level of interdisciplinarity of articles and their citation rates, there are nonetheless some disciplines in which a higher level of interdisciplinarity is related to a higher citation rates. For other disciplines, citations decline as interdisciplinarity grows. One characteristic is visible in all disciplines: Highly disciplinary and highly interdisciplinary articles have a low scientific impact. This suggests that there might be an optimum of interdisciplinarity beyond which the research is too dispersed to find its niche and under which it is too mainstream to have high impact. Finally, the relationship between interdisciplinarity and scientific impact is highly determined by the citation characteristics of the disciplines involved: Articles citing citation-intensive disciplines are more likely to be cited by those disciplines and, hence, obtain higher citation scores than would articles citing non-citation-intensive disciplines.", "paper_title": "On the Relationship Between Interdisciplinarity and Scientific Impact", "paper_id": "WOS:000273155100009"}