{"auto_keywords": [{"score": 0.04454153022265076, "phrase": "rubber_hand_illusion"}, {"score": 0.043730864161056676, "phrase": "mediated_conditions"}, {"score": 0.03915514201946942, "phrase": "fake_hand"}, {"score": 0.004392565073466714, "phrase": "first_study"}, {"score": 0.0043258453436258405, "phrase": "recently_reported_intermodal_perceptual_illusion"}, {"score": 0.0041316803676012155, "phrase": "one's_own_hand"}, {"score": 0.004007083686875716, "phrase": "visible_fake_hand"}, {"score": 0.00385658790017119, "phrase": "unseen_hand"}, {"score": 0.0037834649508375544, "phrase": "strong_sense"}, {"score": 0.003372844338742438, "phrase": "original_paradigm"}, {"score": 0.002784828661426853, "phrase": "dependent_measures"}, {"score": 0.0027635643494432365, "phrase": "self-_report"}, {"score": 0.002579326836642461, "phrase": "felt_position"}, {"score": 0.0025498344202551223, "phrase": "hidden_hand"}, {"score": 0.002472822097373027, "phrase": "unmediated_condition"}, {"score": 0.002444544487772349, "phrase": "strongest_illusion"}, {"score": 0.0023435920614377306, "phrase": "rubber_hand"}, {"score": 0.002316788811533867, "phrase": "vr_condition"}, {"score": 0.0022640963589007457, "phrase": "mr_condition"}, {"score": 0.0021049977753042253, "phrase": "perceptual_mechanisms"}], "paper_keywords": [""], "paper_abstract": "This paper presents a first study in which a recently reported intermodal perceptual illusion known as the rubber hand illusion is experimentally investigated under mediated conditions. When one's own hand is placed out of view and a visible fake hand is repeatedly stroked and tapped in synchrony with the unseen hand, subjects report a strong sense in which the fake hand is experienced as part of their own body. In our experiment, we investigated this illusion under three conditions: ( i) unmediated condition, replicating the original paradigm, ( ii) virtual reality ( VR) condition, where both the fake hand and its stimulation were projected on the table in front of the participant, and ( iii) mixed reality ( MR) condition, where the fake hand was projected, but its stimulation was unmediated. Dependent measures included self- report ( open- ended and questionnaire- based) and drift, that is, the offset between the felt position of the hidden hand and its actual position. As expected, the unmediated condition produced the strongest illusion, as indicated both by self-report and drift towards the rubber hand. The VR condition produced a more convincing subjective illusion than the MR condition, although no difference in drift was found between the mediated conditions. Results are discussed in terms of perceptual mechanisms underlying the rubber hand illusion, and the illusion's relevance to understanding telepresence.", "paper_title": "Is this my hand I see before me? The rubber hand illusion in reality, virtual reality, and mixed reality", "paper_id": "WOS:000240909800009"}