{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "opinion_share"}, {"score": 0.0496630250315639, "phrase": "anti-majority_opinionists"}, {"score": 0.040167383707474476, "phrase": "anti-majoritarian_tendency"}, {"score": 0.004310949776826717, "phrase": "higher_value"}, {"score": 0.003973523379376352, "phrase": "basic_voter_model"}, {"score": 0.003770633265791941, "phrase": "new_parameters"}, {"score": 0.003662410853488772, "phrase": "observed_opinion_data"}, {"score": 0.003630551710200058, "phrase": "social_network"}, {"score": 0.0034551632687788857, "phrase": "short_observed_opinion_propagation_data"}, {"score": 0.0031476068430779367, "phrase": "longer_observation_data"}, {"score": 0.003084054767389711, "phrase": "learned_model"}, {"score": 0.003048315312818542, "phrase": "future_opinion_share"}, {"score": 0.002995478860085004, "phrase": "simple_polynomial_extrapolation"}, {"score": 0.0028925295982470418, "phrase": "share_prediction"}, {"score": 0.00278497898719426, "phrase": "local_opinion_share"}, {"score": 0.002736694413701639, "phrase": "average_opinion_share"}, {"score": 0.0026272523687965615, "phrase": "highest_value"}, {"score": 0.0024283623243160357, "phrase": "highest_value_prevails"}, {"score": 0.002324433454350402, "phrase": "opinion_values"}, {"score": 0.002290786209279345, "phrase": "opinion_share_prediction_problem"}, {"score": 0.0021672995161145276, "phrase": "typical_real_world_social_networks"}, {"score": 0.0021173134817110994, "phrase": "long_term_behavior"}, {"score": 0.0021049977753042253, "phrase": "opinion_propagation"}], "paper_keywords": ["Social networks", " Opinion dynamics", " Parameter learning"], "paper_abstract": "We address the problem of detecting anti-majority opinionists using the value-weighted mixture voter (VwMV) model. This problem is motivated by the fact that 1) each opinion has its own value and an opinion with a higher value propagates more easily/rapidly and 2) there are always people who have a tendency to disagree with any opinion expressed by the majority. We extend the basic voter model to include these two factors with the value of each opinion and the anti-majoritarian tendency of each node as new parameters, and learn these parameters from a sequence of observed opinion data over a social network. We experimentally show that it is possible to learn the opinion values correctly using a short observed opinion propagation data and to predict the opinion share in the near future correctly even in the presence of anti-majoritarians, and also show that it is possible to learn the anti-majoritarian tendency of each node if longer observation data is available. Indeed, the learned model can predict the future opinion share much more accurately than a simple polynomial extrapolation can do. Ignoring these two factors substantially degrade the performance of share prediction. We also show theoretically that, in a situation where the local opinion share can be approximated by the average opinion share, 1) when there are no anti-majoritarians, the opinion with the highest value eventually takes over, but 2) when there are a certain fraction of anti-majoritarians, it is not necessarily the case that the opinion with the highest value prevails and wins, and further, 3) in both cases, when the opinion values are uniform, the opinion share prediction problem becomes ill-defined and any opinion can win. The simulation results support that this holds for typical real world social networks. These theoretical results help understand the long term behavior of opinion propagation.", "paper_title": "Learning to predict opinion share and detect anti-majority opinionists in social networks", "paper_id": "WOS:000322922100002"}