{"auto_keywords": [{"score": 0.02880582080932757, "phrase": "self-adaptive_components"}, {"score": 0.00481495049065317, "phrase": "high-available_decentralized_systems_via_self-adaptive_components."}, {"score": 0.004304144138805271, "phrase": "different_third-party_providers"}, {"score": 0.00405735420159564, "phrase": "distributed_sites"}, {"score": 0.0038930368103015467, "phrase": "system_developers"}, {"score": 0.003459191419478298, "phrase": "unstable_network"}, {"score": 0.003260690513595527, "phrase": "great_challenge"}, {"score": 0.00320338467974835, "phrase": "high-available_decentralized_systems"}, {"score": 0.0030735451757603555, "phrase": "self-adaptive_component_model"}, {"score": 0.002846175473457555, "phrase": "running_framework"}, {"score": 0.0025436978068459565, "phrase": "required_services"}, {"score": 0.0024405312482831646, "phrase": "historical_invocations"}, {"score": 0.002130056082139311, "phrase": "high_availabilities"}, {"score": 0.0021049977753042253, "phrase": "dynamic_decentralized_environments"}], "paper_keywords": ["Self-adaptive component", " decentralized system", " availability"], "paper_abstract": "In decentralized computing environments, systems are built mainly from components that are developed and maintained independently by different third-party providers. The executions and evolutions of components located on distributed sites are beyond the control of the system developers, and the availabilities of those components are, to some extent, unpredictable because of their own tendencies and the unstable network. As a result, it is still a great challenge to construct high-available decentralized systems. In this paper, a self-adaptive component model is proposed to model those components distributed on the Internet and a running framework is described for constructing systems composed of self-adaptive components. Self-adaptive components can adjust their knowledge about the availabilities of the required services via learning from the feedback of historical invocations. Based on the knowledge, components can find the most appropriate service providers effectively and automatically. Experiments show that systems can always gain high availabilities under dynamic decentralized environments by using the approach.", "paper_title": "AN APPROACH TO CONSTRUCTING HIGH-AVAILABLE DECENTRALIZED SYSTEMS VIA SELF-ADAPTIVE COMPONENTS", "paper_id": "WOS:000269249400005"}