{"auto_keywords": [{"score": 0.04522176534199055, "phrase": "direct_matching"}, {"score": 0.00481495049065317, "phrase": "state-of-the-art_instance_matching_approaches"}, {"score": 0.004540734419151103, "phrase": "heterogeneous_datasets"}, {"score": 0.00421410521089045, "phrase": "direct_comparison"}, {"score": 0.003995226376780718, "phrase": "target_dataset"}, {"score": 0.0035150223642728437, "phrase": "new_paradigm"}, {"score": 0.003261934055562238, "phrase": "source_dataset"}, {"score": 0.0030595112110658675, "phrase": "candidate_matches"}, {"score": 0.0023675986784123656, "phrase": "extensive_experiments"}, {"score": 0.0023424328921363585, "phrase": "public_benchmarks"}, {"score": 0.0021049977753042253, "phrase": "difficult_matching_tasks"}], "paper_keywords": ["Data integration", " class-based matching", " direct matching", " instance matching", " semantic web"], "paper_abstract": "State-of-the-art instance matching approaches do not perform well when used for matching instances across heterogeneous datasets. This shortcoming derives from their core operation depending on direct matching, which involves a direct comparison of instances in the source with instances in the target dataset. Direct matching is not suitable when the overlap between the datasets is small. Aiming at resolving this problem, we propose a new paradigm called class-based matching. Given a class of instances from the source dataset, called the class of interest, and a set of candidate matches retrieved from the target, class-based matching refines the candidates by filtering out those that do not belong to the class of interest. For this refinement, only data in the target is used, i.e., no direct comparison between source and target is involved. Based on extensive experiments using public benchmarks, we show our approach greatly improves the quality of state-of-the-art systems; especially on difficult matching tasks.", "paper_title": "SERIMI: Class-Based Matching for Instance Matching Across Heterogeneous Datasets", "paper_id": "WOS:000352608000018"}