{"auto_keywords": [{"score": 0.04925653227018551, "phrase": "pairwise_comparisons_method"}, {"score": 0.041480729810386266, "phrase": "eigenvector_method"}, {"score": 0.02488171244877888, "phrase": "koczkodaj's_inconsistency_index"}, {"score": 0.00481495049065317, "phrase": "priority_deriving_procedure"}, {"score": 0.004492406361795448, "phrase": "relative_order"}, {"score": 0.004389745162172933, "phrase": "different_concepts"}, {"score": 0.0033450437338616596, "phrase": "input_guarantees"}, {"score": 0.003287482882222731, "phrase": "reliable_output"}, {"score": 0.0031937337757356526, "phrase": "optimal_decision"}, {"score": 0.0028119023819663472, "phrase": "obtained_results"}, {"score": 0.0027475383418803724, "phrase": "single_expert's_assessments"}, {"score": 0.0022305310659333864, "phrase": "principal_eigenvalue"}, {"score": 0.0022048412896732645, "phrase": "saaty"}, {"score": 0.0021049977753042253, "phrase": "order_preservation"}], "paper_keywords": [""], "paper_abstract": "The pairwise comparisons method can be used when the relative order of preferences among different concepts (alternatives) needs to be determined. There are several popular implementations of this method, including the Eigenvector Method, the Least Squares Method, the Chi Squares Method and others. Each of the above methods comes with one or more inconsistency indices that help to decide whether the consistency of input guarantees obtaining a reliable output, thus taking the optimal decision. This article explores the relationship between inconsistency of input and error of output. An error describes to what extent the obtained results correspond to the single expert's assessments. On the basis of the inconsistency and the error, two properties of the weight deriving procedure are formulated. These properties are proven for eigenvector method and Koczkodaj's inconsistency index. Several estimates using Koczkodaj's inconsistency index for a principal eigenvalue, Saaty's inconsistency index and the Condition of Order Preservation are also provided.", "paper_title": "On the Properties of the Priority Deriving Procedure in the Pairwise Comparisons Method", "paper_id": "WOS:000358735200004"}