{"auto_keywords": [{"score": 0.046406428866983235, "phrase": "rc-ica"}, {"score": 0.02075603574643398, "phrase": "traditional_ica"}, {"score": 0.010612387000973441, "phrase": "face_recognition"}, {"score": 0.00923857305098694, "phrase": "face_image"}, {"score": 0.004673290248999786, "phrase": "novel_subspace_method"}, {"score": 0.0040048667115255, "phrase": "independent_components"}, {"score": 0.0035891316580885665, "phrase": "image-to-vector_transformation"}, {"score": 0.0031372369299648203, "phrase": "face_recognition_error"}, {"score": 0.002955050521440921, "phrase": "available_training_samples"}, {"score": 0.0028113140998735366, "phrase": "training_vector"}, {"score": 0.0026217213613095322, "phrase": "recognition_subspace"}, {"score": 0.0024327171018928458, "phrase": "extensive_experiments"}, {"score": 0.0022799458141165587, "phrase": "experimental_results"}, {"score": 0.0022127018991294047, "phrase": "higher_recognition_accuracy"}, {"score": 0.0021049977753042253, "phrase": "smaller_dimensionality"}], "paper_keywords": ["Independent component analysis (ICA)", " Face recognition", " Feature extraction"], "paper_abstract": "This paper presents a novel subspace method called sequential row-column independent component analysis (RC-ICA) for face recognition. Unlike the traditional ICA, in which the face image is transformed into a vector before calculating the independent components (ICs), RC-ICA consists of two sequential stages-an image row-ICA followed by a column-ICA. There is no image-to-vector transformation in both the stages and the ICs; are computed directly in the subspace spanned by the row or column vectors. RC-ICA can reduce the face recognition error caused by the dilemma in traditional ICA, i.e. the number of available training samples is greatly less than that of the dimension of training vector. Another advantage of RC-ICA over traditional ICA is that the dimensionality of the recognition subspace is much smaller, which means that the face image can have a more condensed representation. Extensive experiments are performed on the well-known Yale-B, AR and FERET databases to validate the proposed method and the experimental results show that the RC-ICA achieves higher recognition accuracy than ICA and other existing subspace methods while using a subspace of smaller dimensionality. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Sequential row-column independent component analysis for face recognition", "paper_id": "WOS:000263372000051"}