{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "situ_grounded_representations"}, {"score": 0.03469246557285302, "phrase": "compositional_structure"}, {"score": 0.02588691123885682, "phrase": "situ_representations"}, {"score": 0.004440780432053927, "phrase": "specific_architectures"}, {"score": 0.004167218012926657, "phrase": "specific_neuronal_assembly_structures"}, {"score": 0.004001938457469328, "phrase": "different_brain_areas"}, {"score": 0.003887894704361635, "phrase": "grounded_conceptual_representations"}, {"score": 0.0036482665232275583, "phrase": "compositional_structures"}, {"score": 0.0035442655396704724, "phrase": "conceptual_representations"}, {"score": 0.002911278281894321, "phrase": "compositional_connectionist_structures"}, {"score": 0.002548331088496964, "phrase": "different_cognitive_processes"}, {"score": 0.0022565201625076876, "phrase": "compositional_architectures"}, {"score": 0.0021049977753042253, "phrase": "specific_processes"}], "paper_keywords": ["architecture", " cognition", " compositionality", " connectionism", " grounding", " representation"], "paper_abstract": "The combination of productivity, dynamics and grounding imposes constraints that require specific architectures for their combined implementation. Grounding of representations can be achieved with specific neuronal assembly structures, which can be distributed over different brain areas. This entails that grounded conceptual representations cannot be copied, transported and pasted to form compositional structures. Instead, grounded conceptual representations have to remain in situ when they are a part of a compositional structure. Thus, each representation of a concept used in a compositional structure is always the same grounded representation of that concept. Compositional connectionist structures based on in situ grounded representations can be formed temporarily by embedding these representations in specific compositional (neural) architectures. Different compositional architectures will be needed for different cognitive processes. They are integrated by the in situ representations embedded in them. Grounded in situ representations could be partly distributed. Compositional architectures could be more distributed or more localist, depending on the specific processes they implement. We will discuss examples of each.", "paper_title": "Compositional connectionist structures based on in situ grounded representations", "paper_id": "WOS:000291093700003"}