{"auto_keywords": [{"score": 0.04392292221959627, "phrase": "asgo"}, {"score": 0.015719716506582538, "phrase": "square_container"}, {"score": 0.004106725110985659, "phrase": "basin-hopping_strategy"}, {"score": 0.003964007795174772, "phrase": "local_minimum_potential_energy"}, {"score": 0.003911771812701971, "phrase": "limited-memory_bfgs"}, {"score": 0.003759142310009214, "phrase": "circular_items"}, {"score": 0.0036124465071873998, "phrase": "large_vacant_space"}, {"score": 0.003456132182564149, "phrase": "action_space"}, {"score": 0.0033955105098235345, "phrase": "rectangular_packing_problem"}, {"score": 0.0033212215487678854, "phrase": "circular_item"}, {"score": 0.0032774280543222843, "phrase": "rectangular_item"}, {"score": 0.003149471116658739, "phrase": "comparatively_larger_vacant_spaces"}, {"score": 0.003066945490483524, "phrase": "tabu_strategy"}, {"score": 0.002908306074124806, "phrase": "search_procedure"}, {"score": 0.0027578496677536373, "phrase": "different_quadrants"}, {"score": 0.0024688710065898646, "phrase": "packomania_website"}, {"score": 0.0023101951336207955, "phrase": "smaller_square_containers"}, {"score": 0.0021906130276146325, "phrase": "current_best_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Global optimization", " Circle packing", " Action space", " Basin-hopping"], "paper_abstract": "This paper proposes an action-space-based global optimization (ASGO) approach for the problem of packing unequal circles into a square container such that the size of the square is minimized. Starting from several random configurations, ASGO runs the following potential descent method and basin-hopping strategy iteratively. It finds configurations with the local minimum potential energy by the limited-memory BFGS (LBFGS) algorithm, then selects the circular items having the most deformations and moves them to some large vacant space or randomly chosen vacant space. By adapting the action space defined for the rectangular packing problem, we approximate each circular item as a rectangular item, thus making it much easier to find comparatively larger vacant spaces for any given configuration. The tabu strategy is used to prevent cycling and enhance the diversification during the search procedure. Several other strategies, such as swapping two similar circles or swapping two circles in different quadrants in the container, are combined to increase the diversity of the configurations. We compare the performance of ASGO on 68 benchmark instances at the Packomania website with the state-of-the-art results. ASGO obtains configurations with smaller square containers on 63 instances; at the same time it matches or approaches the current best results on the other five instances. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An action-space-based global optimization algorithm for packing circles into a square container", "paper_id": "WOS:000351967100007"}