{"auto_keywords": [{"score": 0.049571431541439746, "phrase": "current_accumulator"}, {"score": 0.0064075249234117225, "phrase": "sample_capacitance"}, {"score": 0.00481495049065317, "phrase": "noise_analysis_and_design"}, {"score": 0.004081385289516914, "phrase": "noise_performance"}, {"score": 0.003952828685048176, "phrase": "input_signals"}, {"score": 0.003668333531296882, "phrase": "digital_signals"}, {"score": 0.0032793933580835574, "phrase": "switch_charge_injection"}, {"score": 0.003244567402785763, "phrase": "sample_noise"}, {"score": 0.0030595112110658675, "phrase": "major_source"}, {"score": 0.002824005136794786, "phrase": "model_simulation"}, {"score": 0.002720376476146181, "phrase": "total_noise"}, {"score": 0.002578880352208335, "phrase": "input_signal"}, {"score": 0.0022324489895237504, "phrase": "output_signal"}, {"score": 0.0021049977753042253, "phrase": "ideal_result"}], "paper_keywords": ["Accumulation noise", " current accumulator", " model", " time-delay-integration (TDI)"], "paper_abstract": "The noise of the current accumulator is analyzed. A model of time-delay-integration (TDI) CMOS image sensor is presented, which is used to analyze the noise performance. In this model, input signals are accumulated four times by the type of current and then converted to digital signals to accomplish the other accumulation by 32 times, i.e., 4 x 32 accumulation mode. The noise, which includes switch charge injection, sample noise and kT/C noise, is considered in this model. The major source of the noise and the relationship between noise and sample capacitance are evaluated through the model simulation. The results indicate that the total noise can be restrained by increasing sample capacitance. When the input signal is arranging from 0 mu A to 100 mu A, the accuracy of the current accumulator can be 11 bits by using 1 pF sample capacitor. The SNR of the output signal can be increased by 20.38 dB which is close to the ideal result. The circuit of the current accumulator based on the model is also proposed.", "paper_title": "NOISE ANALYSIS AND DESIGN OF CURRENT ACCUMULATOR FOR TDI-CMOS IMAGE SENSOR", "paper_id": "WOS:000209245200012"}