{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "regular_expressions"}, {"score": 0.011965321767357219, "phrase": "certainty_semantics"}, {"score": 0.009422405777987586, "phrase": "main_computational_problems"}, {"score": 0.004399905285945236, "phrase": "alphabet_letters"}, {"score": 0.004122490120202936, "phrase": "possibility_semantics"}, {"score": 0.0038431888954930083, "phrase": "regular_expression"}, {"score": 0.0031925019616678217, "phrase": "graph_databases"}, {"score": 0.0031606404966938568, "phrase": "program_analysis"}, {"score": 0.0029611289031152856, "phrase": "complete_characterization"}, {"score": 0.002398464540102246, "phrase": "arbitrary_regular_languages"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Regular expressions with variables", " Possibility semantics", " Certainty semantics", " Graph databases"], "paper_abstract": "We study regular expressions that use variables, or parameters, which are interpreted as alphabet letters. We consider two classes of languages denoted by such expressions: under the possibility semantics, a word belongs to the language if it is denoted by some regular expression obtained by replacing variables with letters; under the certainty semantics, the word must be denoted by every such expression. Such languages are regular, and we show that they naturally arise in several applications such as querying graph databases and program analysis. As the main contribution of the paper, we provide a complete characterization of the complexity of the main computational problems related to such languages: nonemptiness, universality, containment, membership, as well as the problem of constructing NFAs capturing such languages. We also look at the extension when domains of variables could be arbitrary regular languages, and show that under the certainty semantics, languages remain regular and the complexity of the main computational problems does not change. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Parameterized regular expressions and their languages", "paper_id": "WOS:000316584300002"}