{"auto_keywords": [{"score": 0.038576082979587416, "phrase": "hoea"}, {"score": 0.004606023493393774, "phrase": "overall_pareto_front"}, {"score": 0.004555217356295278, "phrase": "multi-objective_optimizations"}, {"score": 0.00396530196547293, "phrase": "high-dimensional_objective_optimizations"}, {"score": 0.00370981613076245, "phrase": "evolutionary_algorithm"}, {"score": 0.0033384259516301223, "phrase": "nonlinear_definition"}, {"score": 0.002810373366887749, "phrase": "nonlinear_dynamic_properties"}, {"score": 0.0027031706928674092, "phrase": "martingale_theoretical_framework"}, {"score": 0.0026584843838039166, "phrase": "theoretical_results"}, {"score": 0.0026000466400112974, "phrase": "new_algorithm"}, {"score": 0.0023525345110929326, "phrase": "experimental_results"}, {"score": 0.0022502133699402018, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["High-dimensional", " Optimization", " Evolutionary algorithm", " Martingale", " Convergence"], "paper_abstract": "Last few years have witnessed the development of various multi-objective evolutionary algorithms since they allow the generation of the overall Pareto front for multi-objective optimizations. With the problems in the real-world becoming more and more complex, however, no reported work in the literature focuses on the high-dimensional objective optimizations (HOPs). In this paper, we propose an evolutionary algorithm named HOEA (high-dimensional objective evolutionary algorithm) for HOPs. By adopting the concept of nonlinear definition for optimizing object, HOPs can be solved by HOEA, while the well-known multi-objective evolutionary algorithms work poorly on HOPs. We further analyze the nonlinear dynamic properties of HOEA on the basis of martingale theoretical framework. The theoretical results indicate that this new algorithm is indeed capable of achieving convergence. We also conduct experiments on HOEA with two representative test instances. The experimental results either confirm our theoretical results or show that the proposed algorithm is efficient and effective for HOPs. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "High-dimensional objective optimizer: An evolutionary algorithm and its nonlinear analysis", "paper_id": "WOS:000289047700110"}