{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "event_coreference_resolution"}, {"score": 0.04104980858076334, "phrase": "rich_set"}, {"score": 0.004772966298144304, "phrase": "critical_role"}, {"score": 0.004662781189062896, "phrase": "question_answering"}, {"score": 0.004622117681584228, "phrase": "topic_detection"}, {"score": 0.00447601516255334, "phrase": "new_class"}, {"score": 0.004359903343872771, "phrase": "coreference_clusters"}, {"score": 0.004259213086199962, "phrase": "unlabeled_documents"}, {"score": 0.004041046382656947, "phrase": "semantic_features"}, {"score": 0.003959241745942114, "phrase": "document_collection"}, {"score": 0.0033224160240327236, "phrase": "unsupervised_way_stem"}, {"score": 0.003097261512064381, "phrase": "multiple_documents"}, {"score": 0.002990455094600558, "phrase": "hierarchical_dirichlet_process"}, {"score": 0.002964332290433157, "phrase": "new_extension"}, {"score": 0.0029384370067165183, "phrase": "hierarchical_dirichlet_process's_ability"}, {"score": 0.0027795914404096754, "phrase": "finite_number"}, {"score": 0.0025911275961924486, "phrase": "new_hybrid_model"}, {"score": 0.0025534981748358008, "phrase": "infinite_latent_class_model"}, {"score": 0.0025311826711421556, "phrase": "discrete_time_series_model"}, {"score": 0.0025090616962891773, "phrase": "main_advantage"}, {"score": 0.002487133563066256, "phrase": "hybrid_model"}, {"score": 0.0022981869222589058, "phrase": "automatic_selection"}, {"score": 0.0021675228942726675, "phrase": "cross-document_event_coreference"}], "paper_keywords": [""], "paper_abstract": "The task of event coreference resolution plays a critical role in many natural language processing applications such as information extraction, question answering, and topic detection and tracking. In this article, we describe a new class of unsupervised, nonparametric Bayesian models with the purpose of probabilistically inferring coreference clusters of event mentions from a collection of unlabeled documents. In order to infer these clusters, we automatically extract various lexical, syntactic, and semantic features for each event mention from the document collection. Extracting a rich set of features for each event mention allows us to cast event coreference resolution as the task of grouping together the mentions that share the same features (they have the same participating entities, share the same location, happen at the same time, etc.). Some of the most important challenges posed by the resolution of event coreference in an unsupervised way stem from (a) the choice of representing event mentions through a rich set of features and (b) the ability of modeling events described both within the same document and across multiple documents. Our first unsupervised model that addresses these challenges is a generalization of the hierarchical Dirichlet process. This new extension presents the hierarchical Dirichlet process's ability to capture the uncertainty regarding the number of clustering components and, additionally, takes into account any finite number of features associated with each event mention. Furthermore, to overcome some of the limitations of this extension, we devised a new hybrid model, which combines an infinite latent class model with a discrete time series model. The main advantage of this hybrid model stands in its capability to automatically infer the number of features associated with each event mention from data and, at the same time, to perform an automatic selection of the most informative features for the task of event coreference. The evaluation performed for solving both within-and cross-document event coreference shows significant improvements of these models when compared against two baselines for this task.", "paper_title": "Unsupervised Event Coreference Resolution", "paper_id": "WOS:000338196000004"}