{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_information_systems"}, {"score": 0.03663103907138758, "phrase": "navigation_model"}, {"score": 0.034072257390555645, "phrase": "main_menu"}, {"score": 0.004547564208690591, "phrase": "domain_model"}, {"score": 0.004487989502479992, "phrase": "informal_guidelines"}, {"score": 0.0037311260623089436, "phrase": "controlled_experiment"}, {"score": 0.003372019835750424, "phrase": "starting_point"}, {"score": 0.002790511479398411, "phrase": "empirical_study"}, {"score": 0.0026352496813713292, "phrase": "identical_interface_styles"}], "paper_keywords": [""], "paper_abstract": "The design of web information systems (WISs) often relies on a domain model and some informal guidelines, signifying that many design decisions which may directly affect usability are left to the designers. The study presented here has been carried out to analyse whether it is possible to limit this arbitrariness. The authors have therefore carried out a controlled experiment and its replica to test whether it is effectively possible to obtain more easily navigable WISs by using a navigation model, including certain design characteristics, as a starting point. These characteristics are: the use of a main menu which only contains the services required by the user, and the signposting of the sequence of steps necessary to carry out each service correctly, denominated as a route. The empirical study carried out has demonstrated that, given two WISs with the same functionality and identical interface styles, users prefer a WIS with routes and a main menu including the beginning of each route, and perceive it to be more easily navigable. In addition, the use of routes in the navigation model improves the navigability of the WIS built from it, particularly for subjects with less experience.", "paper_title": "Empirical study to assess whether the use of routes facilitates the navigability of web information systems", "paper_id": "WOS:000298291100004"}