{"auto_keywords": [{"score": 0.038840076428792135, "phrase": "oss"}, {"score": 0.03416975058110829, "phrase": "oss_concept"}, {"score": 0.015719650696396813, "phrase": "open_source_software"}, {"score": 0.012770381294336365, "phrase": "oss."}, {"score": 0.012171462724915205, "phrase": "public_discourse"}, {"score": 0.01156318682653629, "phrase": "organizing_vision_theory"}, {"score": 0.0045726187330434025, "phrase": "important_trend"}, {"score": 0.004528551999851654, "phrase": "information_technology_adoption_landscape"}, {"score": 0.004456044928556639, "phrase": "considerable_attention"}, {"score": 0.004413096646892175, "phrase": "scientific_literature"}, {"score": 0.004328432545135587, "phrase": "professional_press"}, {"score": 0.004057728601458481, "phrase": "adoption_decisions"}, {"score": 0.003588991941539972, "phrase": "socio-cognitive_perspective"}, {"score": 0.0026657070241024963, "phrase": "lesser_extent"}, {"score": 0.0026060359255636444, "phrase": "organizational_policy"}, {"score": 0.0025808721879758243, "phrase": "oss_adoption"}, {"score": 0.0025312694615202786, "phrase": "strong_support"}, {"score": 0.0023880948210628933, "phrase": "material_it_innovation"}, {"score": 0.0023346234464901978, "phrase": "preliminary_test"}, {"score": 0.0023120743774800176, "phrase": "nomological_network"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Open source software", " Organizing vision", " Socio-cognitive perspective", " Information technology specialists", " Cross-sectional survey"], "paper_abstract": "Open source software (OSS) is an important trend in the information technology adoption landscape. It has received considerable attention in the scientific literature, but mostly in the professional press. In fact, there is much debate over its actual commercial and organizational value. Since the public discourse accompanying an IT may influence adoption decisions, it is important to consider IT specialists' perceptions of the discourse on OSS. In this study, we investigated the relationship between IT specialists' profiles, IT specialists' reception of the public discourse on OSS, and their organizations' receptivity to OSS. Drawing on the socio-cognitive perspective of IT innovation adoption and the organizing vision theory, a survey of 271 IT specialists was conducted to examine these issues. Our results indicate that a majority of IT specialists in our sample are rather neutral about the OSS concept conveyed in the public discourse. However, our sample also comprises respondents with more extreme perceptions who can be classified as either supporters or detractors. Our results indicate that detractors have more years of experience but have been less exposed to OSS than supporters, and that IT specialists' perceptions of the OSS concept are positively associated with their organizations' openness to OSS adoption and, to a lesser extent, with the existence of an organizational policy that favors OSS adoption. Altogether, our findings provide strong support for the organizing vision theory and the idea that the popularity of an IT innovation concept favors the adoption of the material IT innovation in organizations. By providing a preliminary test of a nomological network of IT specialists' perceptions of the OSS concept, our study offers insights as to why organizations may or may not take OSS into account in their software procurement decisions. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Adoption of open source software in organizations: A socio-cognitive perspective", "paper_id": "WOS:000312920900002"}