{"auto_keywords": [{"score": 0.04838919478929022, "phrase": "sus"}, {"score": 0.01490347002180948, "phrase": "umux-lite"}, {"score": 0.008713718338561318, "phrase": "user_satisfaction"}, {"score": 0.00834745623506361, "phrase": "umux"}, {"score": 0.0047292449487169345, "phrase": "user_experience"}, {"score": 0.004513450434595191, "phrase": "function_of_product_experience"}, {"score": 0.004401342842183475, "phrase": "quick_and_reliable_scales"}, {"score": 0.004230749292148046, "phrase": "well-founded_measures"}, {"score": 0.004125634486868786, "phrase": "budget_constraints"}, {"score": 0.004037608759610068, "phrase": "human-computer_interaction_literature"}, {"score": 0.003937273640906994, "phrase": "standardized_satisfaction_scales"}, {"score": 0.0038671299350540554, "phrase": "product_usage"}, {"score": 0.003509317669345521, "phrase": "higher_satisfaction"}, {"score": 0.0030941521409613417, "phrase": "different_amounts"}, {"score": 0.0026986685585382347, "phrase": "interaction_time"}, {"score": 0.002612640527241776, "phrase": "unidimensional_scale"}, {"score": 0.0024223970976460173, "phrase": "similar_magnitudes"}, {"score": 0.0022785613865764923, "phrase": "previously_reported_similarities"}, {"score": 0.0022138542785562444, "phrase": "umux._results"}, {"score": 0.0021049977753042253, "phrase": "product_exposure"}], "paper_keywords": [""], "paper_abstract": "Nowadays, practitioners extensively apply quick and reliable scales of user satisfaction as part of their user experience analyses to obtain well-founded measures of user satisfaction within time and budget constraints. However, in the human-computer interaction literature the relationship between the outcomes of standardized satisfaction scales and the amount of product usage has been only marginally explored. The few studies that have investigated this relationship have typically shown that users who have interacted more with a product have higher satisfaction. The purpose of this article was to systematically analyze the variation in outcomes of three standardized user satisfaction scales (SUS, UMUX, UMUX-LITE) when completed by users who had spent different amounts of time with a website. In two studies, the amount of interaction was manipulated to assess its effect on user satisfaction. Measurements of the three scales were strongly correlated and their outcomes were significantly affected by the amount of interaction time. Notably, the SUS acted as a unidimensional scale when administered to people who had less product experience but was bidimensional when administered to users with more experience. Previous findings of similar magnitudes for the SUS and UMUX-LITE (after adjustment) were replicated but did not show the previously reported similarities of magnitude for the SUS and the UMUX. Results strongly encourage further research to analyze the relationships of the three scales with levels of product exposure. Recommendations for practitioners and researchers in the use of the questionnaires are also provided.", "paper_title": "Assessing User Satisfaction in the Era of User Experience: Comparison of the SUS, UMUX, and UMUX-LITE as a Function of Product Experience", "paper_id": "WOS:000359008400002"}