{"auto_keywords": [{"score": 0.03282260491043682, "phrase": "e-dual_match"}, {"score": 0.019876248858286226, "phrase": "time-series_data"}, {"score": 0.019467867129586515, "phrase": "green_computing"}, {"score": 0.011558021462507381, "phrase": "dual_match"}, {"score": 0.006246156989313787, "phrase": "subsequence_matches"}, {"score": 0.004539005582217309, "phrase": "computers_resources"}, {"score": 0.004481954307639453, "phrase": "main_purpose"}, {"score": 0.004351595642056769, "phrase": "algorithmic_efficiency"}, {"score": 0.003999578057088828, "phrase": "main_tasks"}, {"score": 0.0033218213825698417, "phrase": "subsequence_matching_method"}, {"score": 0.0031577303835881964, "phrase": "subsequence_matching"}, {"score": 0.003027178161479457, "phrase": "possible_query_windows"}, {"score": 0.0028775998963807324, "phrase": "false_alarms"}, {"score": 0.0026782279715171866, "phrase": "main_requirements"}, {"score": 0.002556625752785268, "phrase": "limited_computer_resources"}, {"score": 0.002471661547432869, "phrase": "experiment_results"}, {"score": 0.0022713722522505592, "phrase": "subsequence_matching_time"}, {"score": 0.0021049977753042253, "phrase": "data_page_accesses"}], "paper_keywords": ["Green computing", " Time-series data", " Subsequence matching", " Dual match"], "paper_abstract": "Green computing is the study and practice of efficiently using computers resources. The main purpose of green computing is to achieve an algorithmic efficiency by designing resource-efficient, accurate and energy-efficient algorithms. It is important to achieve the algorithmic efficiency in handling time-series data. One of the main tasks in handling time-series data is to find subsequence matches similar to a given query sequence. The state-of-the-art methods to find subsequence matches in time-series data produce many false alarms by filtering points through comparing only one query window with its corresponding data window. In this paper, we propose a subsequence matching method for green computing, which is called the Efficient Duality-based Subsequence Matching (simply, E-Dual Match). E-Dual Match handles all possible query windows for determining candidates. Hence, E-Dual Match not only reduces the false alarms, and improves the performance compared to Dual Match, but also does so by considering the main requirements of the green computing. In other words, E-Dual Match efficiently uses limited computer resources, accurate and energy-efficient. Experiment results show that E-Dual Match reduces the number of candidates by up to 4.90 times over Dual Match, and improves the subsequence matching time by up to 2.35 times over Dual Match. We also show that E-Dual Match reduces the number of data page accesses by up to 3.04 times over Dual Match.", "paper_title": "Efficient duality-based subsequent matching on time-series data in green computing", "paper_id": "WOS:000342454300004"}