{"auto_keywords": [{"score": 0.049668773491620556, "phrase": "artificial_potential_functions"}, {"score": 0.026822469433683126, "phrase": "group_formation"}, {"score": 0.00481495049065317, "phrase": "autonomous_swarm_systems"}, {"score": 0.004732785510739708, "phrase": "analytical_design_guidelines"}, {"score": 0.0045726187330434025, "phrase": "decentralized_control"}, {"score": 0.004533427352547707, "phrase": "self-organizing_swarm_systems"}, {"score": 0.004286708921931472, "phrase": "multiple_agents"}, {"score": 0.004088421020408183, "phrase": "formation_control"}, {"score": 0.004053362743156545, "phrase": "attractive_and_repulsive_forces"}, {"score": 0.003799796252156605, "phrase": "analytical_guidelines"}, {"score": 0.003751011827704279, "phrase": "potential_functions"}, {"score": 0.0037028514035425037, "phrase": "local_minima"}, {"score": 0.003623949225126944, "phrase": "representative_scenarios"}, {"score": 0.0021883400011393564, "phrase": "simulation_results"}, {"score": 0.002150900082318562, "phrase": "proposed_scheme"}, {"score": 0.0021049977753042253, "phrase": "self-organized_swarm_system"}], "paper_keywords": ["group behavior", " potential functions", " swarm systems"], "paper_abstract": "This paper presents a framework for decentralized control of self-organizing swarm systems based on the artificial potential functions (APFs). In this scheme, multiple agents in a swarm self-organize to flock and achieve formation control through attractive and repulsive forces among themselves using APFs. In particular, this paper presents a set of analytical guidelines for designing potential functions to avoid local minima for a number of representative scenarios. Specifically the following cases are addressed: 1) A non-reachable goal problem (a case that the potential of the goal is overwhelmed by the potential of an obstacle, 2) an obstacle collision problem (a case that the potential of the obstacle is overwhelmed by the potential of the goal), 3) an obstacle collision problem in swarm (a case that the potential of the obstacle is overwhelmed by potential of other robots in a group formation) and 4) an inter-robot collision problem (a case that the potential of the robot in a formation is overwhelmed by potential of the goal). The simulation results showed that the proposed scheme can effectively construct a self-organized swarm system with the capability of group formation, navigation and migration in the presence of obstacles.", "paper_title": "Decentralized control of autonomous swarm systems using artificial potential functions: Analytical design guidelines", "paper_id": "WOS:000239022000005"}