{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "public_key_encryption"}, {"score": 0.037146276869402715, "phrase": "pre-kem_seeding"}, {"score": 0.004778594263962987, "phrase": "sender_recovery"}, {"score": 0.004618342952383313, "phrase": "desirable_feature"}, {"score": 0.004429727701202369, "phrase": "original_plaintext"}, {"score": 0.004264923517966271, "phrase": "recipient's_private_decryption_key"}, {"score": 0.00393844255111604, "phrase": "pke-sr."}, {"score": 0.003908678575537341, "phrase": "first_method"}, {"score": 0.003720600007408015, "phrase": "large_class"}, {"score": 0.0036093693971289754, "phrase": "discrete_logarithm_problem"}, {"score": 0.0034618177773967015, "phrase": "efficient_pke-sr"}, {"score": 0.003435643372146385, "phrase": "dhies"}, {"score": 0.0032578629307203097, "phrase": "original_mites."}, {"score": 0.0031845067058084583, "phrase": "pke-sr"}, {"score": 0.0031246358910995316, "phrase": "identity_based_encryptions"}, {"score": 0.0030311679447397725, "phrase": "second_method"}, {"score": 0.0026741832921475667, "phrase": "interesting_property"}, {"score": 0.002497470177389344, "phrase": "ciphertext_length"}, {"score": 0.0021049977753042253, "phrase": "one-bit_encryptions"}], "paper_keywords": ["Public key encryption", " backward recovery", " recovery by sender", " KEM", " DEM"], "paper_abstract": "This paper investigates public key encryption that has a desirable feature of allowing the sender of a ciphertext to recover the original plaintext from the ciphertext without:, relying on a recipient's private decryption key (PKE-SR). We propose two efficient methods for converting KEM/DEM (key encapsulation mechanisms/data encapsulation mechanisms) to PKE-SR. The first method, called pre-KEM seeding, can be applied to a large class of KEM/DEM constructions including those based on the discrete logarithm problem. Following the idea of pre-KEM seeding, we propose an efficient PKE-SR using DHIES, which has only one more additional element of length 160-bit in ciphertext than that of the original MITES. Furthermore, we show that PKE-SR can be constructed from identity based encryptions using the method of pre-KEM seeding. The second method, called post-KEM converging, is more powerful and can be employed to convert any secure KEM/DEM into a secure PEE-SR. Post-KEM converging takes advantages of an interesting property, called collision accessibility, of sibling intractable hashing. For both methods, added costs in ciphertext length and computation are minimal, making them a particularly attractive \"drop-in\" replacement in applications where plaintexts need to be recovered efficiently by the sender alone. We further explore the problem of constructing PEE-SR without redundancy and show such a construction for one-bit encryptions.", "paper_title": "On the Construction of Public Key Encryption with Sender Recovery", "paper_id": "WOS:000352725400001"}