{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_bases"}, {"score": 0.004605917942709477, "phrase": "semantic_web_applications"}, {"score": 0.00448179813172021, "phrase": "smaller_ontologies"}, {"score": 0.0044512920090463105, "phrase": "existing_larger_ontologies"}, {"score": 0.0037523473563976246, "phrase": "remaining_terms"}, {"score": 0.0037267877774290374, "phrase": "complex_ways"}, {"score": 0.003663645143713398, "phrase": "first_solution"}, {"score": 0.003516417950483685, "phrase": "description_logics"}, {"score": 0.0032616462517547477, "phrase": "model-theoretic_definition"}, {"score": 0.003066945490483524, "phrase": "non-trivial_adaption"}, {"score": 0.0030356410934402503, "phrase": "standard_definition"}, {"score": 0.003014948673771347, "phrase": "classical_logic"}, {"score": 0.0028937142757436683, "phrase": "rational_forgetting_operator"}, {"score": 0.0026656357767832267, "phrase": "dl-lite_knowledge_bases"}, {"score": 0.002549672862868133, "phrase": "semantic_definition"}, {"score": 0.0024893297856666808, "phrase": "general_framework"}, {"score": 0.002447101794397243, "phrase": "different_definitions"}, {"score": 0.0023973704289918726, "phrase": "parameterized_family"}, {"score": 0.002148677187261496, "phrase": "model-based_forgetting"}, {"score": 0.0021049977753042253, "phrase": "query-based_forgetting_operators"}], "paper_keywords": ["Description logics", " Forgetting", " Ontology"], "paper_abstract": "To support the reuse and combination of ontologies in Semantic Web applications, it is often necessary to obtain smaller ontologies from existing larger ontologies. In particular, applications may require the omission of certain terms, e. g., concept names and role names, from an ontology. However, the task of omitting terms from an ontology is challenging because the omission of some terms may affect the relationships between the remaining terms in complex ways. We present the first solution to the problem of omitting concepts and roles from knowledge bases of description logics (DLs) by adapting the technique of forgetting, previously used in other domains. Specifically, we first introduce a model-theoretic definition of forgetting for knowledge bases (both TBoxes and ABoxes) in DL-Lite(bool)(N), which is a non-trivial adaption of the standard definition for classical logic, and show that our model-based forgetting satisfies all major criteria of a rational forgetting operator, which in turn verifies the suitability of our model-based forgetting. We then introduce algorithms that implement forgetting operations in DL-Lite knowledge bases. We prove that the algorithms are correct with respect to the semantic definition of forgetting. We establish a general framework for defining and comparing different definitions of forgetting by introducing a parameterized family of forgetting operators called query-based forgetting operators. In this framework we identify three specific query-based forgetting operators and show that they form a hierarchy. In particular, we show that the model-based forgetting coincides with one of these query-based forgetting operators.", "paper_title": "Forgetting for knowledge bases in DL-Lite", "paper_id": "WOS:000283245000004"}