{"auto_keywords": [{"score": 0.041269222832803924, "phrase": "interdisciplinary_topic"}, {"score": 0.00481495049065317, "phrase": "requisitely_holistic_thinking"}, {"score": 0.0047689174754929195, "phrase": "human_values"}, {"score": 0.004089239912167375, "phrase": "-_mulej's_dialectical_systems_theory"}, {"score": 0.003992129945230457, "phrase": "findings_-_values"}, {"score": 0.0038600230206554792, "phrase": "older_times"}, {"score": 0.0035229930971258316, "phrase": "contemporary_innovative_society"}, {"score": 0.0034725269588525534, "phrase": "extrinsic_motivation"}, {"score": 0.0033094525227603012, "phrase": "manager's_empathy"}, {"score": 0.0030642636185693054, "phrase": "managerial_viewpoints"}, {"score": 0.0027830917623582903, "phrase": "practical_implications"}, {"score": 0.0025767987652419054, "phrase": "first_sight"}, {"score": 0.002527654365712841, "phrase": "implicit_systemic_thinking"}, {"score": 0.0023972750359328235, "phrase": "first_case"}, {"score": 0.0023066880707738736, "phrase": "dialectical_systems_theory"}, {"score": 0.0021049977753042253, "phrase": "innovative_society"}], "paper_keywords": ["motivation (psychology)", " organizations", " system theory", " value analysis"], "paper_abstract": "Purpose - To provide a link between psychology and management in order to promote a requisitely holistic thinking about human values. Managers need co-workers rather than employees. Hence, they must holistically see their own, their co-workers' and their organization's values. Design/methodology/approach - Mulej's dialectical systems theory is applied implicitly. Findings - Values are an interdisciplinary topic, belonging in older times to philosophers, later to psychologists, and needed by managers. It is especially important in the contemporary innovative society in which extrinsic motivation works less effectively than the intrinsic one and the manager's empathy in impact over it. Research limitations/implications - Research was limited to company setting and managerial viewpoints. Results imply the need for managers to be requisitely holistic in order to understand and influence co-workers. Practical implications - Values of employees and bosses are much more interdependent than one observes at the first sight. All need implicit systemic thinking. Originality/value - This is to best of our knowledge the first case of dealing with values based on the dialectical systems theory and defining them as an interdisciplinary topic, which is much more crucial and difficult to handle in the innovative society than earlier.", "paper_title": "Manager's requisite holism between personal and organisational", "paper_id": "WOS:000241260500007"}