{"auto_keywords": [{"score": 0.02548088964837701, "phrase": "tracking_patterns"}, {"score": 0.00481495049065317, "phrase": "color_laser_print-outs"}, {"score": 0.004458189822972851, "phrase": "printing_device"}, {"score": 0.004256895619944631, "phrase": "color_laser_printers"}, {"score": 0.004023120753104693, "phrase": "unique_tracking_pattern"}, {"score": 0.003782655283668953, "phrase": "exact_device"}, {"score": 0.0035382855372646164, "phrase": "important_extension"}, {"score": 0.003160049822855747, "phrase": "namely_automatic_methods"}, {"score": 0.002836679611901583, "phrase": "automatic_decoding"}, {"score": 0.002793260314529583, "phrase": "base_pattern"}, {"score": 0.0027363971333961967, "phrase": "serial_number"}, {"score": 0.0024186620196958867, "phrase": "first_public_dataset"}, {"score": 0.0021049977753042253, "phrase": "printer_class"}], "paper_keywords": ["Machine identification code", " Counterfeit protection", " Document authentication", " Color laser printer identification"], "paper_abstract": "Authentication of documents can be done by detecting the printing device used to generate the print-out. Many manufacturers of color laser printers and copiers designed their devices in a way to integrate a unique tracking pattern in each print-out. This pattern is used to identify the exact device the print-out originates from. In this paper, we present an important extension of our previous work for (a) detecting the class of printer that was used to generate a print-out, namely automatic methods for (b) comparing two base patterns from two different print-outs to verify if two print-outs come from the same printer and for (c) automatic decoding of the base pattern to extract the serial number and, if available, the time and the date the document was printed. Finally, we present (d) the first public dataset on tracking patterns (also called machine identification codes) containing 1,264 images from 132 different printers. Evaluation on this dataset resulted in accuracies of up to 93.0 % for detecting the printer class. Comparison and decoding of the tracking patterns achieved accuracies of 91.3 and 98.3 %, respectively.", "paper_title": "Automatic authentication of color laser print-outs using machine identification codes", "paper_id": "WOS:000325777300014"}