{"auto_keywords": [{"score": 0.046920155627789596, "phrase": "tor_network"}, {"score": 0.005356960426971208, "phrase": "proposed_technique"}, {"score": 0.00481495049065317, "phrase": "tor_anonymity_network"}, {"score": 0.00475382761232911, "phrase": "tor_anonymous_network"}, {"score": 0.004633888966463624, "phrase": "regular_users"}, {"score": 0.004440648141548589, "phrase": "anonymous_path"}, {"score": 0.004095323392273661, "phrase": "tor_users"}, {"score": 0.003468053168607071, "phrase": "lower_anonymity"}, {"score": 0.003394891095032025, "phrase": "lower_security"}, {"score": 0.003025597247856977, "phrase": "different_metrics"}, {"score": 0.0029491324941225356, "phrase": "path_selection"}, {"score": 0.002742787059497186, "phrase": "node_conditions"}, {"score": 0.0026507289852980512, "phrase": "path_condition"}, {"score": 0.002465210678474529, "phrase": "end_users"}, {"score": 0.002372298201966367, "phrase": "current_tor_path_selection_algorithm"}, {"score": 0.0022731540640627307, "phrase": "software_upgrade"}, {"score": 0.0022442249871042026, "phrase": "client_side"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Tor network", " Path selection", " Geographical location"], "paper_abstract": "The Tor anonymous network has become quite popular with regular users on the Internet. In the Tor network, an anonymous path is created by selecting three relays through which the connection is redirected. Nevertheless, as the number of Tor users has increased substantially in recent years, the algorithm with which the relays are selected affects the performance provided by the Tor network. More importantly as the performance suffers, users will leave the network, resulting in a lower anonymity set and in turn lower security provided by Tor network. In this paper, we proposed an algorithm for improving performance and security of the Tor network, by employing a combination of different metrics in the process of the path selection between the source and destination node. These metrics are bandwidth and uptime of relays as node conditions and delays between the relays as a path condition. Through a number of experiments we show that we could double the performance observed by end users when using the proposed technique as opposed to the current Tor path selection algorithm. More importantly, the proposed technique only requires a software upgrade on the client side, and other Tor nodes do not need to be modified. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A composite-metric based path selection technique for the Tor anonymity network", "paper_id": "WOS:000351971500004"}