{"auto_keywords": [{"score": 0.03504539381871914, "phrase": "proper_coloring"}, {"score": 0.00481495049065317, "phrase": "colorful_problems"}, {"score": 0.004411744930153217, "phrase": "list_coloring_problem"}, {"score": 0.0038749521906474593, "phrase": "permitted_colors"}, {"score": 0.0037484181615819318, "phrase": "obtained_coloring"}, {"score": 0.0035181731203867456, "phrase": "closely_related_precoloring_extension_problem"}, {"score": 0.0028650312174624635, "phrase": "list_equitable_coloring"}, {"score": 0.002593148116433219, "phrase": "smallest_positive_integer_r"}, {"score": 0.0023118013999542594, "phrase": "vertex_list"}, {"score": 0.0022633993976138387, "phrase": "g._we"}, {"score": 0.002163058716517137, "phrase": "list_chromatic_number_problem"}, {"score": 0.0021306081217770173, "phrase": "linear_time"}, {"score": 0.0021049977753042253, "phrase": "constant_treewidth"}], "paper_keywords": ["Parameterized complexity", " Bounded treewidth", " Graph coloring"], "paper_abstract": "In this paper, we study the complexity of several coloring problems on graphs, parameterized by the treewidth of the graph. 1. The LIST COLORING problem takes as input a graph G. together with an assignment to each vertex v of a set of colors C(v). The problem is to determine whether it is possible to choose a color for vertex v from the set of permitted colors C(v), for each vertex, so that the obtained coloring of G is proper. We show that this problem is W[1]-hard, parameterized by the treewidth of G. The closely related PRECOLORING EXTENSION problem is also shown to be W[1]-hard, parameterized by treewidth. 2. An equitable coloring of a graph G is a proper coloring of the vertices where the numbers of vertices having any two distinct colors differs by at most one. We show that the problem is hard for W[1], parameterized by the treewidth plus the number of colors. We also show that a list-based variation, LIST EQUITABLE COLORING is W[1]-hard for forests, parameterized by the number of colors on the lists. 3. The list chromatic number chi(l)(G) of a graph G is defined to be the smallest positive integer r, such that for every assignment to the vertices v of C. of a list L(v) of colors, where each list has length at least r, there is a choice of one color from each vertex list L(v) yielding a proper coloring of G. We show that the problem of determining whether chi(l)(G) <= r, the LIST CHROMATIC NUMBER problem, is solvable in linear time on graphs of constant treewidth. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "On the complexity of some colorful problems parameterized by treewidth", "paper_id": "WOS:000286479900004"}