{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "curvilinear_structured_patterns"}, {"score": 0.004720606036240263, "phrase": "computer_graphics"}, {"score": 0.004339744430169516, "phrase": "line_stylization"}, {"score": 0.004212759658511567, "phrase": "elaborate_patterns"}, {"score": 0.003969784439380027, "phrase": "curvilinear_features"}, {"score": 0.003911253966141701, "phrase": "mountain_ridges"}, {"score": 0.0037407704200033607, "phrase": "simple_yet_effective_method"}, {"score": 0.0035954555250614197, "phrase": "main_challenge"}, {"score": 0.0032724821705972357, "phrase": "synthesized_pattern"}, {"score": 0.0029490571526071016, "phrase": "pattern_escape_areas"}, {"score": 0.002454835845644037, "phrase": "shortest_path_search"}, {"score": 0.002418587525752333, "phrase": "dynamic_programming"}, {"score": 0.0023130151703068444, "phrase": "efficient_parallel_implementation"}, {"score": 0.0021049977753042253, "phrase": "neighboring_pieces"}], "paper_keywords": [""], "paper_abstract": "Many algorithms in Computer Graphics require to synthesize a pattern along a curve. This is for instance the case with line stylization, to decorate objects with elaborate patterns (chains, laces, scratches), or to synthesize curvilinear features such as mountain ridges, rivers or roads. We describe a simple yet effective method for this problem. Our method addresses the main challenge of maintaining the continuity of the pattern while following the curve. It allows some freedom to the synthesized pattern: It may locally diverge from the curve so as to allow for a more natural global result. This also lets the pattern escape areas of overlaps or fold-overs. This makes our method particularly well suited to structured, detailed patterns following complex curves. Our synthesizer copies tilted pieces of the exemplar along the curve, following its orientation. The result is optimized through a shortest path search, with dynamic programming. We speed up the process by an efficient parallel implementation. Finally, since discontinuities may always remain we propose an optional post-processing step optimally deforming neighboring pieces to smooth the transitions.", "paper_title": "By-example synthesis of curvilinear structured patterns", "paper_id": "WOS:000318546300010"}