{"auto_keywords": [{"score": 0.048992899974696226, "phrase": "humanoid_robot"}, {"score": 0.00481495049065317, "phrase": "distributed_representation"}, {"score": 0.004620093797504386, "phrase": "target_object"}, {"score": 0.004556901872357751, "phrase": "unknown_and_unstructured_environment"}, {"score": 0.004453488286477661, "phrase": "human_beings"}, {"score": 0.004157058883925715, "phrase": "complex_abilities"}, {"score": 0.003988719758707836, "phrase": "visual_field"}, {"score": 0.0033961782274326948, "phrase": "computational_models"}, {"score": 0.003349670229755675, "phrase": "unified_framework"}, {"score": 0.0032585499655442404, "phrase": "humanoid_torso"}, {"score": 0.0031845067058084583, "phrase": "integrated_working_representation"}, {"score": 0.0030135741897058844, "phrase": "cognitive_architecture"}, {"score": 0.002931569771634119, "phrase": "neural_circuits"}, {"score": 0.0027741761880779535, "phrase": "integration_process"}, {"score": 0.0025892330566358503, "phrase": "surrounding_space"}, {"score": 0.002472822097373027, "phrase": "mutual_adaptation"}, {"score": 0.0022041312401435346, "phrase": "target_objects"}], "paper_keywords": ["Humanoid robot", " implicit distributed representation", " object recognition", " sensorimotor learning", " visual cortex"], "paper_abstract": "Reaching a target object in an unknown and unstructured environment is easily performed by human beings. However, designing a humanoid robot that executes the same task requires the implementation of complex abilities, such as identifying the target in the visual field, estimating its spatial location, and precisely driving the motors of the arm to reach it. While research usually tackles the development of such abilities singularly, in this work we integrate a number of computational models into a unified framework, and demonstrate in a humanoid torso the feasibility of an integrated working representation of its peripersonal space. To achieve this goal, we propose a cognitive architecture that connects several models inspired by neural circuits of the visual, frontal and posterior parietal cortices of the brain. The outcome of the integration process is a system that allows the robot to create its internal model and its representation of the surrounding space by interacting with the environment directly, through a mutual adaptation of perception and action. The robot is eventually capable of executing a set of tasks, such as recognizing, gazing and reaching target objects, which can work separately or cooperate for supporting more structured and effective behaviors.", "paper_title": "A Hierarchical System for a Distributed Representation of the Peripersonal Space of a Humanoid Robot", "paper_id": "WOS:000346729100004"}