{"auto_keywords": [{"score": 0.032163580018029235, "phrase": "enora"}, {"score": 0.013334865846824322, "phrase": "patient's_data_set"}, {"score": 0.01095043263006615, "phrase": "decision_maker"}, {"score": 0.008663947132282569, "phrase": "classification_rate"}, {"score": 0.00481495049065317, "phrase": "fuzzy_classification"}, {"score": 0.004792779140352901, "phrase": "survival_prediction"}, {"score": 0.0047051051659828275, "phrase": "novel_rule-based_fuzzy_classification_methodology"}, {"score": 0.00465112142785941, "phrase": "severe_burnt_patients"}, {"score": 0.004597754207658615, "phrase": "ethical_aspects"}, {"score": 0.004555499634179394, "phrase": "medical_scenario"}, {"score": 0.004472146692254812, "phrase": "computer-based_evaluation"}, {"score": 0.004329916183121203, "phrase": "fuzzy_classifier_model"}, {"score": 0.004201881312320611, "phrase": "proposed_methodology"}, {"score": 0.004172874316207784, "phrase": "three-step_process"}, {"score": 0.004049464259907096, "phrase": "pareto-based_elitist_multi-objective_evolutionary_algorithms"}, {"score": 0.003884567795946283, "phrase": "interpretability_constraints"}, {"score": 0.003683565150278339, "phrase": "linguistic_label"}, {"score": 0.003658123120088715, "phrase": "fuzzy_set"}, {"score": 0.00309023627455429, "phrase": "niched_pre-selection_multi-objective_algorithm"}, {"score": 0.0030759821501544224, "phrase": "elitist_pareto-based_multi-objective_evolutionary_algorithm"}, {"score": 0.0030126454230895647, "phrase": "non-dominated_sorting_genetic_algorithm"}, {"score": 0.0029987510204914332, "phrase": "nsga"}, {"score": 0.0029166963619404723, "phrase": "intensive_care_burn_unit"}, {"score": 0.002850032622120692, "phrase": "standard_machine_learning_repository"}, {"score": 0.0026775328564629577, "phrase": "multi-objective_cross-validation_technique"}, {"score": 0.0025922289692173997, "phrase": "artificial_neural_networks"}, {"score": 0.0025802660239538353, "phrase": "naive_bayes"}, {"score": 0.0022878396720586044, "phrase": "niched_pre-selection"}, {"score": 0.0022772782536385717, "phrase": "nsga-ii_algorithms"}, {"score": 0.0022098048205976355, "phrase": "real_parameter_optimization"}, {"score": 0.0021945194903838132, "phrase": "time_cost"}, {"score": 0.0021344259291927914, "phrase": "combinational_optimization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fuzzy classification", " Multi-objective evolutionary computation", " Severity scores", " Intensive care burns unit"], "paper_abstract": "Objective: This paper presents a novel rule-based fuzzy classification methodology for survival/mortality prediction in severe burnt patients. Due to the ethical aspects involved in this medical scenario, physicians tend not to accept a computer-based evaluation unless they understand why and how such a recommendation is given. Therefore, any fuzzy classifier model must be both accurate and interpretable. Methods and materials: The proposed methodology is a three-step process: (1) multi-objective constrained optimization of a patient's data set, using Pareto-based elitist multi-objective evolutionary algorithms to maximize accuracy and minimize the complexity (number of rules) of classifiers, subject to interpretability constraints; this step produces a set of alternative (Pareto) classifiers; (2) linguistic labeling, which assigns a linguistic label to each fuzzy set of the classifiers; this step is essential to the interpretability of the classifiers; (3) decision making, whereby a classifier is chosen, if it is satisfactory, according to the preferences of the decision maker. If no classifier is satisfactory for the decision maker, the process starts again in step (1) with a different input parameter set. Results: The performance of three multi-objective evolutionary algorithms, niched pre-selection multi-objective algorithm, elitist Pareto-based multi-objective evolutionary algorithm for diversity reinforcement (ENORA) and the non-dominated sorting genetic algorithm (NSGA-II), was tested using a patient's data set from an intensive care burn unit and a standard machine learning data set from an standard machine learning repository. The results are compared using the hypervolume multi-objective metric. Besides, the results have been compared with other non-evolutionary techniques and validated with a multi-objective cross-validation technique. Our proposal improves the classification rate obtained by other non-evolutionary techniques (decision trees, artificial neural networks, Naive Bayes, and case-based reasoning) obtaining with ENORA a classification rate of 0.9298, specificity of 0.9385, and sensitivity of 0.9364, with 14.2 interpretable fuzzy rules on average. Conclusions: Our proposal improves the accuracy and interpretability of the classifiers, compared with other non-evolutionary techniques. We also conclude that ENORA outperforms niched pre-selection and NSGA-II algorithms. Moreover, given that our multi-objective evolutionary methodology is non-combinational based on real parameter optimization, the time cost is significantly reduced compared with other evolutionary approaches existing in literature based on combinational optimization. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Multi-objective evolutionary algorithms for fuzzy classification in survival prediction", "paper_id": "WOS:000335109400006"}