{"auto_keywords": [{"score": 0.02834704608430153, "phrase": "information_behaviour"}, {"score": 0.004448705308279165, "phrase": "recently_developed_model"}, {"score": 0.004146510711518748, "phrase": "model's_validity"}, {"score": 0.0038818006513785977, "phrase": "model's_application"}, {"score": 0.003847802030433298, "phrase": "information_users"}, {"score": 0.00376409764683147, "phrase": "published_literature"}, {"score": 0.0037311260623089436, "phrase": "physicians'_information_behaviour"}, {"score": 0.0036020923276404403, "phrase": "information_providers"}, {"score": 0.003372019835750424, "phrase": "pharmaceutical_companies"}, {"score": 0.0032697235411641695, "phrase": "deductive_content_analysis"}, {"score": 0.00307431840409833, "phrase": "minor_modifications"}, {"score": 0.003007389443770562, "phrase": "practical_insights"}, {"score": 0.002555247330102505, "phrase": "healthcare_information"}, {"score": 0.0024667783849055634, "phrase": "practical_value"}, {"score": 0.002434396049547248, "phrase": "new_model"}, {"score": 0.002339771435910601, "phrase": "earlier_models"}, {"score": 0.0022095328812245852, "phrase": "information_science"}, {"score": 0.0021518875024104244, "phrase": "previous_research"}], "paper_keywords": ["Information behaviour", " Healthcare", " Models", " Communication", " Content analysis", " Information seeking"], "paper_abstract": "Purpose - This study investigated the application in the field of healthcare of a recently developed model of information seeking and communication. The purpose of this paper is to test the model's validity and to identify insights that it may provide. Design/methodology/approach - To investigate the model's application to information users, the findings from published literature on physicians' information behaviour were studied. To investigate its application to information providers, interviews were carried out with staff working for the National Institute for Health and Care Excellence and with employees of pharmaceutical companies. The findings were examined using deductive content analysis. Findings - The findings endorse the validity of the model, with minor modifications. The model provides practical insights into the behaviour of both users and providers of information and the factors that influence them. It can be used to identify ways in which information behaviour may be positively modified in both finding and communicating healthcare information. Originality/value - This research demonstrates the practical value of a new model of information behaviour which was developed using insights from earlier models. In doing so it answers criticisms that research in library and information science often fails to build on previous research and that it has little practical usefulness.", "paper_title": "The Information Seeking and Communication Model A study of its practical application in healthcare", "paper_id": "WOS:000369171000010"}