{"auto_keywords": [{"score": 0.04994921305783945, "phrase": "process_models"}, {"score": 0.010612387000973441, "phrase": "design_methods"}, {"score": 0.008599964899226141, "phrase": "new_methods"}, {"score": 0.006135084135805769, "phrase": "web_site"}, {"score": 0.004648341749682947, "phrase": "high_quality_systems"}, {"score": 0.004415105721885594, "phrase": "users'_needs"}, {"score": 0.004262273304740847, "phrase": "important_number"}, {"score": 0.004239232828870618, "phrase": "existing_approaches"}, {"score": 0.003834672885739794, "phrase": "already_known_methods"}, {"score": 0.003583331341515525, "phrase": "design_methods_process_models"}, {"score": 0.0032411618757602068, "phrase": "six_main_axes"}, {"score": 0.0031802690348940454, "phrase": "artifacts"}, {"score": 0.002987789545341185, "phrase": "deep_theorical_insight"}, {"score": 0.002931569771634119, "phrase": "relevant_literature"}, {"score": 0.0025181767240440417, "phrase": "first_evaluation"}, {"score": 0.0024774888010414206, "phrase": "designers'_adhesion"}, {"score": 0.0023211909152089606, "phrase": "evaluation_results"}, {"score": 0.00222249726328354, "phrase": "suitable_methods"}, {"score": 0.002139581380750111, "phrase": "high_quality_projects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Process models", " Taxonomy", " Design methods", " Characterization"], "paper_abstract": "Context: Designers and developers are increasingly expected to deliver high quality systems, i.e. systems that are usable, robust, consistent as well as evolutionary, and that fulfill users' needs. To produce such systems, Design Methods suggest many approaches. However, the important number of existing approaches makes the choice of a method among the others particularly difficult. In addition to this, and because of the time required for understanding (and then operationalizing) new methods, designers tend to use already known methods, even though those which sometimes may not really be adapted to their needs. Objective: This paper proposes a classification of characteristics of design methods process models. In other terms, it proposes a taxonomy that aims to facilitate the discovery and the choice of methods for designers and developers. Method: From a study of process models of several design methods, we identify six main axes, namely Cycle, Collaboration, Artifacts, Recommended Use, Maturity and Flexibility, which are in turn divided into 34 characteristics. Results: This paper provides a deep theorical insight. For each characteristic identified from relevant literature, a definition and a gradation, illustrated using examples, are given. Moreover, it presents a web site that offers various tools for exploring the axes of our taxonomy. This web site provides an overview of process models as well as means for comparing them, textually or graphically. Finally, the paper relates the first evaluation conducted in order to estimate designers' adhesion to the taxonomy in terms of easiness of learning, completeness and intention to use. Conclusion: We show, based on evaluation results, that our taxonomy of process models facilitates the discovery of new methods and helps designers in choosing suitable methods, really adapted to their needs. Therefore, it enhances chances to conduct high quality projects. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A taxonomy of design methods process models", "paper_id": "WOS:000317327000002"}