{"auto_keywords": [{"score": 0.04977091365029326, "phrase": "cultural_heritage_information_retrieval"}, {"score": 0.047667240890459914, "phrase": "time_intervals"}, {"score": 0.03290884795191839, "phrase": "combined_measure"}, {"score": 0.03149426401360443, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "imprecise_temporal_intervals"}, {"score": 0.004707396263523012, "phrase": "essential_concept"}, {"score": 0.004677108044285109, "phrase": "cultural_heritage_applications"}, {"score": 0.004617112284856892, "phrase": "temporal_concepts"}, {"score": 0.00447045328907701, "phrase": "cultural_objects"}, {"score": 0.004218057615518714, "phrase": "query_and_annotation_intervals"}, {"score": 0.0038783340581919797, "phrase": "\"pre-roman_age"}, {"score": 0.0038285451859508815, "phrase": "\"roman_age"}, {"score": 0.0036592457471262894, "phrase": "clear-cut_intervals"}, {"score": 0.0035658739518719907, "phrase": "fuzzy_set_theory"}, {"score": 0.003289117944111902, "phrase": "annotation_intervals"}, {"score": 0.003004494701922268, "phrase": "human_evaluators"}, {"score": 0.0029089095588612007, "phrase": "archaeological_temporal_information"}, {"score": 0.0027891678712374975, "phrase": "particularly_complex_and_challenging_scenario"}, {"score": 0.002709161672473817, "phrase": "different_weighted_measures"}, {"score": 0.0025394700487126414, "phrase": "ranking_annotation_intervals"}, {"score": 0.0024191966390855048, "phrase": "overlapping_and_closeness"}, {"score": 0.0023497779149212737, "phrase": "presented_procedure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy sets", " Time", " Information retrieval", " Cultural heritage"], "paper_abstract": "Time is an essential concept in cultural heritage applications. Instances of temporal concepts such as time intervals are used for the annotation of cultural objects and also for querying datasets containing information about these objects. Hence it is important to match query and annotation intervals by examining their similarity or closeness. One of the problems is that in many cases time intervals are imprecise. For example, the boundaries of the \"Pre-Roman age\" and the \"Roman age\" are inherently imprecise and it may be difficult to distinguish them with clear-cut intervals. In this paper we apply the fuzzy set theory to model imprecise time intervals in order to determine relevance of the relationship between two time intervals. We present a method for matching query and annotation intervals based on their weighted mutual overlapping and closeness. We present (1) methods for calculating these eights to produce a combined measure and (2) results of comparing the combined measure with human evaluators as a case study. The case study takes into consideration archaeological temporal information, which is in most cases inherently fuzzy, and therefore offers a particularly complex and challenging scenario. The results show that our new combined measure that utilizes different weighted measures together in rankings, performs the best in terms of precision and recall. It should be used when ranking annotation intervals according to a given query interval in cultural heritage information retrieval. Our approach intends to be generalizable: overlapping and closeness may be calculated between any two fuzzy temporal intervals. The presented procedure of using user evaluation results as a basis for assigning weights for overlapping and closeness could potentially be used to reveal weights in other domains and purposes as well. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Determining relevance of imprecise temporal intervals for cultural heritage information retrieval", "paper_id": "WOS:000279564300001"}