{"auto_keywords": [{"score": 0.049763552914073285, "phrase": "terror_attacks"}, {"score": 0.022485755538289118, "phrase": "terror_attack"}, {"score": 0.007738072627475444, "phrase": "news_stories"}, {"score": 0.00481495049065317, "phrase": "event_evolution"}, {"score": 0.0047517225918491226, "phrase": "on-line_news"}, {"score": 0.00462773520532301, "phrase": "new_york"}, {"score": 0.004260730490158385, "phrase": "cnn"}, {"score": 0.004218602458288531, "phrase": "al_qaeda_leader_osama_bin_laden"}, {"score": 0.003820144626025562, "phrase": "intelligence_officer"}, {"score": 0.0034706569037527774, "phrase": "terror_attack_incidents"}, {"score": 0.0032376465741070274, "phrase": "information_retrieval_techniques"}, {"score": 0.003205657519784272, "phrase": "topic_detection"}, {"score": 0.002951045605925464, "phrase": "complex_evolution_relationships"}, {"score": 0.002476009439388887, "phrase": "temporal_relationship"}, {"score": 0.002363806685815014, "phrase": "event_evolution_relationships"}, {"score": 0.0023249757987087055, "phrase": "terror_attack_incident"}, {"score": 0.0023019834179097607, "phrase": "event_evolution_graph"}, {"score": 0.002256677005409071, "phrase": "underlying_structure"}, {"score": 0.002226968099778524, "phrase": "efficient_browsing"}, {"score": 0.0021903801614787423, "phrase": "case_study"}], "paper_keywords": ["security informatics", " topic detection and tracking", " event evolution"], "paper_abstract": "Since the September 11(th) terror attack at New York in 2001, the frequency of terror attacks around the world has been increasing and it draws more attention of the public. On January 20 of 2006, CNN reported that al Qaeda leader Osama bin Laden had released a tape claiming that a series of terror attacks were planned in US. These attacks and messages from terrorists are threatening everyone in the world. As an intelligence officer or a citizen in any countries. we are interested in the development of the terror attacks around us. We can easily extract hundreds or thousands of news stories of any terror attack incidents from newswires Such as CNN.com but the volume of information is too large to capture the information we need. Information retrieval techniques such as Topic Detection and Tracking are able to organize the news stories as events within a topic of terror attack. However. they are incapable to present the complex evolution relationships between the events. We are interested to learn what the major events but also how they develop within the topic of a terror attack. It is beneficial to identify the starting and ending events, the seminal events and the evolution of these events. In this work, we propose to Utilize the temporal relationship, event similarity. temporal proximity and document distributional proximity to identify the event evolution relationships between events in a terror attack incident. An event evolution graph is utilized to present the Underlying structure of events for efficient browsing and extracting information. Case study and experiment are presented to illustrate and show the performance of our proposing technique.", "paper_title": "Tracing the event evolution of terror attacks from on-line news", "paper_id": "WOS:000238207800030"}