{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "decision_trees"}, {"score": 0.004780030485538593, "phrase": "medical_application"}, {"score": 0.004609175313390942, "phrase": "data_classifiers"}, {"score": 0.003870009704443373, "phrase": "first_step"}, {"score": 0.0037725685596495355, "phrase": "supervised_learning"}, {"score": 0.0037315599283579593, "phrase": "second_step"}, {"score": 0.0036775717816768133, "phrase": "induced_classifier"}, {"score": 0.0035719191251314918, "phrase": "prior_to_the_first_step_several_steps"}, {"score": 0.0030426463790590445, "phrase": "exploratory_knowledge_discovery"}, {"score": 0.0030205408413942272, "phrase": "comprehensible_knowledge_representation"}, {"score": 0.00296597499768551, "phrase": "main_attraction"}, {"score": 0.002901791790730922, "phrase": "intuitive_representation"}, {"score": 0.002727362288104989, "phrase": "learning_data"}, {"score": 0.0025170626402362633, "phrase": "evolutionary_algorithms"}, {"score": 0.002453602802736223, "phrase": "classic_deterministic_approach"}, {"score": 0.002306052064028863, "phrase": "obtained_classifier"}, {"score": 0.0022397131088479514, "phrase": "different_evolutionary_dt_induction_approaches"}, {"score": 0.0021912115487610286, "phrase": "multiple_examples"}, {"score": 0.0021752783872387173, "phrase": "evolutionary_dt_applications"}, {"score": 0.0021515951441422082, "phrase": "medical_domain"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Decision trees (DT) are a type of data classifiers. A typical classifier works in two phases. In the first, the learning phase, the classifier is built according to a preexisting data (training) set. Because decision trees are being induced from a known training set, and the labels on each example are known the first step can also be referred to as supervised learning. The second step is when the induced classifier is used for classification. Usually, prior to the first step several steps should be performed to improve the accuracy and efficiency of the classification: data cleaning, redundancy elimination, and data normalization. Classifiers are evaluated for accuracy, speed, robustness, scalability, and interpretability. DTs are widely used for exploratory knowledge discovery where comprehensible knowledge representation is preferred. The main attraction of DTs lies in the intuitive representation that is easy to understand and comprehend. Accuracy, however, is dependent on the learning data. One of the methods to improve the induction and other phases in the creation of a classifier is the use of evolutionary algorithms. They are used because the classic deterministic approach is not necessarily optimal with regard to the quality, accuracy, and complexity of the obtained classifier. In addition to the description of different evolutionary DT induction approaches, this paper also presents multiple examples of evolutionary DT applications in the medical domain. (c) 2012 Wiley Periodicals, Inc.", "paper_title": "Evolutionary design of decision trees for medical application", "paper_id": "WOS:000304261600004"}