{"auto_keywords": [{"score": 0.03227538934261932, "phrase": "usability_evaluation"}, {"score": 0.015522323374647252, "phrase": "software_developers"}, {"score": 0.015327370318149151, "phrase": "usability_problems"}, {"score": 0.014944667959812807, "phrase": "usability_evaluations"}, {"score": 0.003394891095032025, "phrase": "development_process"}, {"score": 0.0026507289852980512, "phrase": "severity_ratings"}, {"score": 0.0024547103576350233, "phrase": "developers'_description"}], "paper_keywords": ["usability evaluation", " human computer interaction"], "paper_abstract": "The purpose of usability evaluations is typically to discover which areas of a system that perform satisfactory to the end-user and which areas that need redesigning or improving. However, such evaluations can be costly both in time and funds and when developers say that many of the results from the usability evaluations are issues already known to them, then why bother? This article discusses the result of three case studies in which the participants of a development process were asked to describe the usability problems of the system they had helped develop. These descriptions were then compared with the results of a usability evaluation involving end-users to uncover if software developers can describe which usability problems exist in their software. To some extent they can. However, they do not always agree on the problems, and the severity ratings were often different from the ones based on the experiences from the users. Furthermore, the developers' description of the problems was typically more abstract and less detailed than the descriptions from the usability evaluation. The tendency was that the most critical problems and the problems most often experienced were listed by the participants and thus the amount of problems known by the developers was a lot less than the amount of problems discovered by the usability evaluation.", "paper_title": "A case study of three software projects: can software developers anticipate the usability problems in their software?", "paper_id": "WOS:000257840400006"}