{"auto_keywords": [{"score": 0.05007140411178275, "phrase": "participatory_design"}, {"score": 0.04920547630637111, "phrase": "pd"}, {"score": 0.02847489040354334, "phrase": "pd_work"}, {"score": 0.0046164478775379105, "phrase": "broad_spectrum"}, {"score": 0.004449452743965974, "phrase": "future_interactive_technologies"}, {"score": 0.004199101289890982, "phrase": "related_fields"}, {"score": 0.004166067358313907, "phrase": "design_research_and_action_research"}, {"score": 0.004047141845635495, "phrase": "pd's_own_belief_system"}, {"score": 0.003910945599518327, "phrase": "nuanced_concepts"}, {"score": 0.003789282090309032, "phrase": "key_prerequisite"}, {"score": 0.0036043137580229873, "phrase": "solid_arguments"}, {"score": 0.003330406613112555, "phrase": "guiding_designers"}, {"score": 0.003252354374549961, "phrase": "systematic_reflection"}, {"score": 0.003235258563557806, "phrase": "critical_analysis"}, {"score": 0.0031180699859857026, "phrase": "pd_effort"}, {"score": 0.003020996813139564, "phrase": "subsequent_step"}, {"score": 0.0029735960759537813, "phrase": "revealed_features"}, {"score": 0.002697245874076643, "phrase": "internal_rigour"}, {"score": 0.002472459829179653, "phrase": "planning_phase"}, {"score": 0.0024336448634918227, "phrase": "reflective_practice"}, {"score": 0.0022783523466965187, "phrase": "specific_pd_experience"}, {"score": 0.0022603944655015095, "phrase": "echoes_project"}, {"score": 0.002144231454317139, "phrase": "elsevier_ltd."}, {"score": 0.0021217237206326914, "phrase": "open_access_article"}, {"score": 0.0021049977753042253, "phrase": "cc_by_license"}], "paper_keywords": ["Participatory design", " Reflective design", " Rigour", " Accountability"], "paper_abstract": "The field of Participatory Design (PD) has greatly diversified and we see a broad spectrum of approaches and methodologies emerging. However, to foster its role in designing future interactive technologies, a discussion about accountability and rigour across this spectrum is needed. Rejecting the traditional, positivistic framework, we take inspiration from related fields such as Design Research and Action Research to develop interpretations of these concepts that are rooted in PD's own belief system. We argue that unlike in other fields, accountability and rigour are nuanced concepts that are delivered through debate, critique and reflection. A key prerequisite for having such debates is the availability of a language that allows designers, researchers and practitioners to construct solid arguments about the appropriateness of their stances, choices and judgements. To this end, we propose a \"tool-to-think-with\" that provides such a language by guiding designers, researchers and practitioners through a process of systematic reflection and critical analysis. The tool proposes four lenses to critically reflect on the nature of a PD effort: epistemology, values, stakeholders and outcomes. In a subsequent step, the coherence between the revealed features is analysed and shows whether they pull the project in the same direction or work against each other. Regardless of the flavour of PD, we argue that this coherence of features indicates the level of internal rigour of PD work and that the process of reflection and analysis provides the language to argue for it. We envision our tool to be useful at all stages of PD work: in the planning phase, as part of a reflective practice during the work, and as a means to construct knowledge and advance the field after the fact. We ground our theoretical discussions in a specific PD experience, the ECHOES project, to motivate the tool and to illustrate its workings. (C) 2014 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/3.0/).", "paper_title": "In pursuit of rigour and accountability in participatory design", "paper_id": "WOS:000347765000008"}