{"auto_keywords": [{"score": 0.029544044557666654, "phrase": "gold"}, {"score": 0.00481495049065317, "phrase": "protein-ligand_docking"}, {"score": 0.004652016085325825, "phrase": "preliminary_protein-ligand_docking"}, {"score": 0.004533427352547707, "phrase": "intensive_high-throughput_virtual_screening"}, {"score": 0.004398872331144531, "phrase": "surface-complementarity_filter"}, {"score": 0.004141575435071002, "phrase": "spherical_harmonics_description"}, {"score": 0.004088421020408183, "phrase": "associated_molecular_surfaces"}, {"score": 0.003767203575060969, "phrase": "protein_cavities"}, {"score": 0.0031506808326454377, "phrase": "fred"}, {"score": 0.0031166151196841308, "phrase": "conformational_samples"}, {"score": 0.0029980260560551982, "phrase": "protein_cavity_surface"}, {"score": 0.0029467742734417255, "phrase": "traditional_docking_procedures"}, {"score": 0.0025449518236394103, "phrase": "right_x-ray_conformation"}, {"score": 0.0022168460543913787, "phrase": "indirectly_flexibility"}, {"score": 0.002197801146305747, "phrase": "protein-ligand_docking_calculations"}], "paper_keywords": ["spherical harmonics", " fingerprints", " surface matching", " docking"], "paper_abstract": "A very simple, fast, and efficient scheme is proposed for performing preliminary protein-ligand docking as the first step of intensive high-throughput virtual screening. The procedure acts as a surface-complementarity filter that first calculates the 2D-contour maps of both the protein cavity and of the ligands using a spherical harmonics description of the associated molecular surfaces. Next, the obtained 2D-fingerprint images are compared to detect their complementarity. This scheme was tested on three typical cases of protein cavities, namely, a well-closed pocket, a small open pocket, and a large open one. For that purpose, for each case, a sample of 101 ligand conformers was generated (the X-ray one and 100 different conformers generated using simulated annealing), and these conformational samples were ranked according to the complementarity with the protein cavity surface. Compared to traditional docking procedures such as FRED (considered as typical of a very fast rigid body docking algorithms) and GOLD (considered as typical of the more accurate flexible docking algorithms), our procedure was much faster and more successful in detecting the right X-ray conformation. We did, however, identify a certain weakness in the case of the very large pocket where results were not as expected. In general, our method could be used for incorporating indirectly flexibility in protein-ligand docking calculations as such a scheme can easily handle several conformational states of both the protein and the ligand.", "paper_title": "A fast surface-matching procedure for protein-ligand docking", "paper_id": "WOS:000240900700025"}