{"auto_keywords": [{"score": 0.048636009815037955, "phrase": "williams"}, {"score": 0.019897358083696366, "phrase": "tsang"}, {"score": 0.00481495049065317, "phrase": "conceptualizing_generalizability"}, {"score": 0.004773040022691547, "phrase": "new_contributions"}, {"score": 0.004710854091689325, "phrase": "reply._tsang"}, {"score": 0.004608997772926119, "phrase": "good_and_provocative_ideas"}, {"score": 0.004260134699483774, "phrase": "new_ideas"}, {"score": 0.004007189684582379, "phrase": "lee"}, {"score": 0.00397217701571219, "phrase": "baskerville"}, {"score": 0.0038355531523269217, "phrase": "pluralist_scientific_discipline"}, {"score": 0.0035605741849764187, "phrase": "viable_term"}, {"score": 0.003453140302583322, "phrase": "research_paradigm"}, {"score": 0.0029886047149545025, "phrase": "new_language"}, {"score": 0.0026321198895843173, "phrase": "different_types"}, {"score": 0.0024864020775253767, "phrase": "ethical_questions"}, {"score": 0.0022678201262721323, "phrase": "new_setting"}, {"score": 0.0021049977753042253, "phrase": "common_ground"}], "paper_keywords": ["Research approach", " philosophical approach", " philosophy", " reference theory", " type of theory"], "paper_abstract": "Tsang and Williams offer some good and provocative ideas in their critique of our earlier article on generalizing and generalizability. In this essay we will advance some new ideas by building on those collected in both Tsang and Williams and our original article (Lee and Baskerville 2003). Because IS is a pluralist scientific discipline, one in which both qualitative and quantitative (and both interpretive and positivist) research approaches are valued, \"generalize\" is unlikely to be a viable term or concept if only one IS research paradigm may lay claim to it and excludes others from using it. Both papers agree on this point, but approach the problem differently. Where we originally generalized generalizability by offering new language, Tsang and Williams conceptualize generalizability by framing it more closely to its older, more statistically oriented form. We agree about the importance of induction and about the classification or taxonomy of different types of induction. We build further in this essay, advancing the ethical questions raised by generalization: A formulation of judgment calls that need to be made when generalizing a theory to a new setting. We further demonstrate how the process of generalizing may actually proceed, based on the common ground between Tsang and Williams and our original article.", "paper_title": "CONCEPTUALIZING GENERALIZABILITY: NEW CONTRIBUTIONS AND A REPLY", "paper_id": "WOS:000307606300006"}