{"auto_keywords": [{"score": 0.031637447951930985, "phrase": "mpi"}, {"score": 0.00481495049065317, "phrase": "dynamics_simulations"}, {"score": 0.004678785623021003, "phrase": "pgas_programming_models"}, {"score": 0.0045464538515249085, "phrase": "particle_dynamics"}, {"score": 0.004171402455813099, "phrase": "specific_conditions"}, {"score": 0.003372844338742438, "phrase": "parallel_simulation_code"}, {"score": 0.0033152062780180073, "phrase": "brownian_motion"}, {"score": 0.0030239842475439814, "phrase": "traditional_distributed_memory_message-passing_programming"}, {"score": 0.0026191799769765063, "phrase": "domain_decomposition"}, {"score": 0.0025892330566358503, "phrase": "work_distribution"}, {"score": 0.0023480892503414596, "phrase": "performance_results"}, {"score": 0.0021789194955896102, "phrase": "mpi_and_upc_codes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Brownian dynamics", " Parallel simulation", " MPI", " PGAS", " UPC"], "paper_abstract": "The simulation of particle dynamics is among the most important mechanisms to study the behavior of molecules in a medium under specific conditions of temperature and density. Several models can be used to compute efficiently the forces that act on each particle, and also the interactions between them. This work presents the design and implementation of a parallel simulation code for the Brownian motion of particles in a fluid. Two different parallelization approaches have been followed: (1) using traditional distributed memory message-passing programming with MPI, and (2) using the Partitioned Global Address Space (PGAS) programming model, oriented towards hybrid shared/distributed memory systems, with the Unified Parallel C (UPC) language. Different techniques for domain decomposition and work distribution are analyzed in terms of efficiency and programmability, in order to select the most suitable strategy. Performance results on a supercomputer using up to 2048 cores are also presented for both MPI and UPC codes. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Parallel Brownian dynamics simulations with the message-passing and PGAS programming models", "paper_id": "WOS:000315974100013"}