{"auto_keywords": [{"score": 0.04155109152996587, "phrase": "traditional_bullying"}, {"score": 0.00481495049065317, "phrase": "adverse_consequences"}, {"score": 0.0038698476651328898, "phrase": "cyberbullies'_beliefs"}, {"score": 0.0035189057079817285, "phrase": "emotional_reactions"}, {"score": 0.0032456625605347417, "phrase": "traditional_bullying_behaviours"}, {"score": 0.0026452734009203764, "phrase": "greater_negative_impact"}, {"score": 0.002522344964242888, "phrase": "cyber_contexts"}, {"score": 0.0022076314894741394, "phrase": "technologically_delivered_aggression"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cyberbullying", " Bullying", " Emotions", " Primary education", " Secondary education"], "paper_abstract": "Research is accumulating to confirm adverse consequences of cyberbullying. Less is known about the perceptions, expectations and reactions of those involved as a function of their different roles (e.g., as bullies, victims, bully-victims) and how this relates to their experiences of traditional bullying. We examined whether cyberbullies' beliefs about the impact of their actions reflects the impact as reported by cybervictims themselves. We tested also whether the emotional reactions to cyberbullying differed depending upon whether the victim was or was not also a victim of traditional bullying behaviours. Participants were 1353 Spanish adolescents. Approximately 8% reported experiences of cyberbullying (compared to 12% reporting experiences of traditional bullying). Cyberbullies believed that their victims would experience more discomfort than cybervictims actually reported experiencing. Those who had experienced victimization in both traditional and cyber contexts evaluated cyberbullying as having greater negative impact than did those who had experienced victimization only in cyber contexts. Perceptions differed according to role and the context(s) in which bullying has been experienced. Findings are discussed in relation to the ways in which technologically delivered aggression may differ from traditional bullying. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "The emotional impact of cyberbullying: Differences in perceptions and experiences as a function of role", "paper_id": "WOS:000349723200019"}