{"auto_keywords": [{"score": 0.029622570943755304, "phrase": "user_anonymity"}, {"score": 0.00481495049065317, "phrase": "privacy-preserving_extension"}, {"score": 0.004734448316824488, "phrase": "secure_roaming_scenario"}, {"score": 0.004577440795549049, "phrase": "foreign_network"}, {"score": 0.004481954307639453, "phrase": "foreign_server_v"}, {"score": 0.003660452313567116, "phrase": "secure_roaming"}, {"score": 0.0036144035798673967, "phrase": "typical_application"}, {"score": 0.0035240305920962766, "phrase": "mobile_roaming_service"}, {"score": 0.003144426503333397, "phrase": "formal_security_treatment"}, {"score": 0.003027178161479457, "phrase": "formal_key_exchange_definition"}, {"score": 0.0028654728453890426, "phrase": "formal_model"}, {"score": 0.0027123819773059127, "phrase": "modular_approach"}, {"score": 0.0026112013707473938, "phrase": "efficient_key_exchange_protocol"}, {"score": 0.0022238834225283594, "phrase": "one-pass_counter"}, {"score": 0.0021228663458966813, "phrase": "conventional_mac_secure"}, {"score": 0.0021049977753042253, "phrase": "chosen_message_attack"}], "paper_keywords": ["authenticated key exchange", " anonymous roaming"], "paper_abstract": "In a secure roaming scenario, a user U travels to a foreign network and communicates with a foreign server V securely so that no one other than U and V can obtain the messages exchanged between them. U may also want to travel anonymously so that no one including V can find out its identity or trace its whereabouts except its home server H. There have been many key establishment protocols proposed for secure roaming. A typical application of these protocols is the mobile roaming service which may be deployed to interconnected WLAN and 3G networks. Despite the importance of these protocols, most of the protocols are analyzed heuristically. They are lack of formal security treatment. In this paper, we propose a formal key exchange definition and formalize secure roaming under the Canetti-Krawczyk (CK) model. We also propose a formal model for capturing the notions of user anonymity and untraceability. By using the modular approach supported by the CK-model, we construct an efficient key exchange protocol for roaming and then extend it to support user anonymity and untraceability. The protocols are efficient and each of them requires only four message flows among the three parties U, H and V. For building our protocols, we construct a one-pass counter based MT-authenticator and show its security under the assumption of a conventional MAC secure against chosen message attack.", "paper_title": "Formal security definition and efficient construction for roaming with a privacy-preserving extension", "paper_id": "WOS:000254398900007"}