{"auto_keywords": [{"score": 0.04403031187889063, "phrase": "information_solutions"}, {"score": 0.015366886500072011, "phrase": "people's_information_behaviour"}, {"score": 0.013986395475240136, "phrase": "phenomenological_approach"}, {"score": 0.00481495049065317, "phrase": "critical_reflection"}, {"score": 0.00450933377534525, "phrase": "critical_discussion"}, {"score": 0.00406001734835979, "phrase": "conceptual_analysis"}, {"score": 0.004007083686875716, "phrase": "research_literature"}, {"score": 0.003980875186335867, "phrase": "personal_research_experience"}, {"score": 0.0038397509389856625, "phrase": "relative_value"}, {"score": 0.003814632693659797, "phrase": "different_conceptual_approaches"}, {"score": 0.0034342984674830533, "phrase": "key_issues"}, {"score": 0.0031532895341013297, "phrase": "conceptual_framework"}, {"score": 0.0030614565460256897, "phrase": "epistemic_spectrum"}, {"score": 0.0030414140732789186, "phrase": "information_behaviour_studies"}, {"score": 0.0029918783504666894, "phrase": "action_research"}, {"score": 0.0029722900280316216, "phrase": "participative_design"}, {"score": 0.002472822097373027, "phrase": "underlying_philosophical_assumptions"}, {"score": 0.002330790244117364, "phrase": "cartesian_dualism"}], "paper_keywords": ["Information behaviour", " Phenomenology", " Epistemology", " Methodology", " Social constructivism", " Action research", " Participative design"], "paper_abstract": "Purpose - The purpose of this paper is to provide a critical discussion on the nature of research into people's information behaviour, and in particular the contribution of the phenomenological approach for the development of information solutions. Design/methodology/approach - The approach takes the form of a conceptual analysis drawing on the research literature and personal research experience. Findings - The paper brings to the foreground the relative value of different conceptual approaches and how these underpin and relate to the development of information solutions. Research limitations/implications - The paper, due to the breadth and complexity of the subject, serves to highlight key issues and bringing together ideas. Some topics deserve further explanation. However, this was beyond the scope of this paper. Practical implications - A conceptual framework is provided that indicates the value of the epistemic spectrum for information behaviour studies and provides support for action research and participative design. Social implications - Taking a phenomenological approach, and consequently either a first person approach and/or a highly participative approach to research, challenges the relationship between researcher and respondent. It also raises questions about why the authors conduct research and for whom it is intended. Originality/value - The paper makes explicit the underlying philosophical assumptions and how these ideas influence the way the authors conduct research; it highlights the significance of Cartesian dualism and indicates the significance of these assumptions for the development of information solutions. It supports the view that researchers and developers should be open to respondents leading the exploration of their needs.", "paper_title": "Research and practice A critical reflection on approaches that underpin research into people's information behaviour", "paper_id": "WOS:000345148600006"}