{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "triangular_systems"}, {"score": 0.04942172741005563, "phrase": "cellular_networks"}, {"score": 0.010346120178682758, "phrase": "constant_time"}, {"score": 0.004619295212985837, "phrase": "regular_triangular_grid"}, {"score": 0.004524455848517757, "phrase": "simple_circuit"}, {"score": 0.0042809216371527785, "phrase": "model_cellular_networks"}, {"score": 0.004222105714769577, "phrase": "base_stations"}, {"score": 0.004092695445765521, "phrase": "addressing_scheme"}, {"score": 0.003980984488865867, "phrase": "cartesian_product"}, {"score": 0.003872310849448784, "phrase": "simple_representation"}, {"score": 0.0038323244983352587, "phrase": "triangular_system"}, {"score": 0.0036891952845575036, "phrase": "compact_labeling_schemes"}, {"score": 0.0036384794303356413, "phrase": "distance_queries"}, {"score": 0.0033834012029672423, "phrase": "bit_labels"}, {"score": 0.002701474449898187, "phrase": "source_vertex"}, {"score": 0.00258251424573557, "phrase": "port_number"}, {"score": 0.0023275553629639395, "phrase": "distance_labeling_schemes"}, {"score": 0.0023114798074455453, "phrase": "efficient_implementation_of_distance_and_movement_based_tracking_protocols"}, {"score": 0.002164180792169302, "phrase": "accurate_cell_distance_determination"}, {"score": 0.0021269997368140066, "phrase": "distance_labeling"}, {"score": 0.0021049977753042253, "phrase": "elegant_and_efficient_routing"}], "paper_keywords": ["triangular systems", " cellular networks", " cell identification code", " cell distance", " routing", " location management"], "paper_abstract": "Triangular systems are the subgraphs of the regular triangular grid which are formed by a simple circuit of the grid and the region bounded by this circuit. They are used to model cellular networks where nodes are base stations. In this paper, we propose an addressing scheme for triangular systems by employing their isometric embeddings into the Cartesian product of three trees. This embedding provides a simple representation of any triangular system with only three small integers per vertex, and allows to employ the compact labeling schemes for trees for distance queries and routing. We show that each such system with n vertices admits a labeling that assigns O(log(2) n) bit labels to vertices of the system such that the distance between any two vertices u and v can be determined in constant time by merely inspecting the labels of u and v, without using any other information about the system. Furthermore, there is a labeling, assigning labels of size O(log n) bits to vertices, which allows, given the label of a source vertex and the label of a destination, to compute in constant time the port number of the edge from the source that heads in the direction of the destination. These results are used in solving some problems in cellular networks. Our addressing and distance labeling schemes allow efficient implementation of distance and movement based tracking protocols in cellular networks, by providing information, generally not available to the user, and means for accurate cell distance determination. Our routing and distance labeling schemes provide elegant and efficient routing and connection rerouting protocols for cellular networks.", "paper_title": "Addressing, distances and routing in triangular systems with applications in cellular networks", "paper_id": "WOS:000241137900002"}