{"auto_keywords": [{"score": 0.049212993617288335, "phrase": "retailer_sales"}, {"score": 0.015719716506582538, "phrase": "wom_sources"}, {"score": 0.01429695651213973, "phrase": "wom_valences"}, {"score": 0.01045911616213515, "phrase": "interaction_effect"}, {"score": 0.009044445026404344, "phrase": "amazon"}, {"score": 0.004455415120614789, "phrase": "wom"}, {"score": 0.00429558848734449, "phrase": "multiple_sources"}, {"score": 0.004122604238556912, "phrase": "consumer_opinions"}, {"score": 0.004029517895918228, "phrase": "product_recommendations"}, {"score": 0.003974673997871831, "phrase": "online_wom_sites"}, {"score": 0.0039027036493682887, "phrase": "major_information_source"}, {"score": 0.003867206750827, "phrase": "consumer_purchase_decisions"}, {"score": 0.003832031470970347, "phrase": "previous_literature"}, {"score": 0.0037798652680135106, "phrase": "wom_information"}, {"score": 0.003356396922662246, "phrase": "multiple_wom_sources"}, {"score": 0.0024706232839499546, "phrase": "wom_valence"}, {"score": 0.0023173287402646577, "phrase": "retailer-hosted_wom_valence"}, {"score": 0.0022649119108225564, "phrase": "third_party-hosted_wom_volume"}], "paper_keywords": ["Online Word-of-Mouth", " Multiple information sources", " Interaction effect", " Third-party hosted WOM sources"], "paper_abstract": "This study analyzes the value of retailer-and third-party hosted WOM by investigating how WOM valences and volumes of multiple sources interact with one other to influence retailer sales. Consumer opinions, experiences, and product recommendations posted on online WOM sites have become a major information source for consumer purchase decisions. Previous literature shows that WOM information can influence retailer sales in two ways - volume and valence, but most researchers investigate these two WOM effects separately. In reality, consumers evaluate volumes and valences jointly from multiple WOM sources for their purchase decisions. That is, there would be an interaction effect between them. Therefore, this study investigates how WOM valences and volumes at both retailer and third-party review web sites interact with one other to influence retailer sales. We collect sales rank data for 145 camera products from Amazon for a period of four months, and the corresponding online review data from Amazon and CNet for the same period. Our analysis shows that WOM valence is positively interacted with its own volume at both sources. We also find that retailer-hosted WOM valence is negatively interacted with third party-hosted WOM volume. Our findings indicate the importance of considering interaction effect between WOM sources. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "The relationship between retailer-hosted and third-party hosted WOM sources and their influence on retailer sales", "paper_id": "WOS:000305758100005"}