{"auto_keywords": [{"score": 0.04796412935568654, "phrase": "neural_networks"}, {"score": 0.015719716506582538, "phrase": "radial_basis_function_neural_networks"}, {"score": 0.01457003677371027, "phrase": "knowledge-driven_experience"}, {"score": 0.004707479285061122, "phrase": "new_approach"}, {"score": 0.004499647408293102, "phrase": "collaborative_framework"}, {"score": 0.004339979174946844, "phrase": "\"standard\"_way"}, {"score": 0.00418595288276353, "phrase": "experimental_data"}, {"score": 0.003929391999210588, "phrase": "proposed_scheme"}, {"score": 0.003191714656606822, "phrase": "currently_available_data"}, {"score": 0.0031203609829058587, "phrase": "conceptual_and_algorithmic_framework"}, {"score": 0.002687702958515561, "phrase": "detailed_quanti"}, {"score": 0.002627587221594597, "phrase": "resulting_architecture"}, {"score": 0.0025572160146590623, "phrase": "experience-based_design"}, {"score": 0.0022427071130840647, "phrase": "optimal_level"}, {"score": 0.002202469129781332, "phrase": "experimental_results"}, {"score": 0.002162951519368368, "phrase": "low-dimensional_synthetic_data"}], "paper_keywords": ["experience-consistent neural network", " knowledge transfer", " data quality"], "paper_abstract": "We develop a new approach to the design of neural networks, which utilizes a collaborative framework of knowledge-driven experience. In contrast to the \"standard\" way of developing neural networks, which explicitly exploits experimental data, this approach incorporates a mechanism of knowledge-driven experience. The essence of the proposed scheme of learning is to take advantage of the parameters (connections) of neural networks built in the past for the same phenomenon (which might also exhibit some variability over time or space) for which are interested to construct the network on a basis of currently available data. We establish a conceptual and algorithmic framework to reconcile these two essential sources of information (data and knowledge) in the process of the development of the network. To make a presentation more focused and come up with a detailed quanti. cation of the resulting architecture, we concentrate on the experience-based design of radial basis function neural networks (RBFNNs). We introduce several performance indexes to quantify an effect of utilization of the knowledge residing within the connections of the networks and establish an optimal level of their use. Experimental results are presented for low-dimensional synthetic data and selected datasets available at the Machine Learning Repository.", "paper_title": "Experience-consistent modeling for radial basis function neural networks", "paper_id": "WOS:000258879800002"}