{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "competence_model"}, {"score": 0.013749298469488028, "phrase": "software_products"}, {"score": 0.010561483367261, "phrase": "software_testing_activities"}, {"score": 0.00863023679003318, "phrase": "software_testing"}, {"score": 0.00450000390667755, "phrase": "software_testing_process"}, {"score": 0.004007083686875716, "phrase": "testing_activities"}, {"score": 0.0038737214010638745, "phrase": "appropriate_competences"}, {"score": 0.0036730297909962142, "phrase": "low_performance"}, {"score": 0.003146212656743413, "phrase": "general_and_technical_competences"}, {"score": 0.002855934865505357, "phrase": "appropriate_profiles"}, {"score": 0.0026817365934071486, "phrase": "published_competence_model"}, {"score": 0.002446024708601971, "phrase": "testing_jobs"}, {"score": 0.0023644936731468252, "phrase": "software_testing_field"}, {"score": 0.0022967713922705, "phrase": "validation_method"}, {"score": 0.0021049977753042253, "phrase": "software_industry"}], "paper_keywords": [""], "paper_abstract": "More and more software development organisations are paying attention to the improvement of the software testing process, because it is considered a key factor to ensure the quality of software products. However, the staff usually has problems developing testing activities because they do not have the appropriate competences to carry out these activities effectively; this results in low performance in organisations and increased costs of software products. A way to reduce this gap is developing a competence model that defines the roles who participate in the software testing activities as well as the general and technical competences required for them. Therefore this model could be applied to train staff in software testing activities and to recruit the appropriate profiles, which contribute to improving their performance. Considering that there is no published competence model specifically addressed to software testing, this study presents one that has been developed, analysing the literature and testing jobs and validated by experts in the software testing field using a survey as a validation method. So, as a result of this work, a competence model for software testing close to the software industry has been obtained.", "paper_title": "Design of a competence model for testing teams", "paper_id": "WOS:000309958700002"}