{"auto_keywords": [{"score": 0.036480295477136625, "phrase": "pso"}, {"score": 0.00481495049065317, "phrase": "unit-accelerated_particle_swarm_optimization"}, {"score": 0.004623608221548592, "phrase": "real-time_tracking"}, {"score": 0.004530794611704416, "phrase": "multiview_images_and_graphics_processing_unit"}, {"score": 0.0036614948691735105, "phrase": "fitness_values"}, {"score": 0.003551694229680741, "phrase": "processed_columns"}, {"score": 0.0032251796659158696, "phrase": "gpu_resources"}, {"score": 0.0031926001871260524, "phrase": "image_acquisition"}, {"score": 0.0031603487697867538, "phrase": "image_processing"}, {"score": 0.0029137604783116065, "phrase": "best_pose"}, {"score": 0.002769483748975581, "phrase": "full_human_body"}, {"score": 0.002476757985482104, "phrase": "gpu"}, {"score": 0.0024392031587145728, "phrase": "average_speedup"}, {"score": 0.002378029803713761, "phrase": "cpu."}, {"score": 0.0023539789234610763, "phrase": "marker-less_motion_capture_system"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["GPGPU", " CUDA", " GPU-accelerated PSO", " model-based 3D tracking and pose recovery"], "paper_abstract": "This paper describes how to achieve real-time tracking of 3D human motion using multiview images and graphics processing unit (GPU)-accelerated particle swarm optimization. The tracking involves configuring the 3D human model in the pose described by each particle and then rasterizing it in each 2D plane. The Compute Unified Device Architecture threads rasterize the columns of the triangles and perform the summing of the fitness values of pixels belonging to the processed columns. Such a parallel particle swarm optimization (PSO) exhibits the level of parallelism that allows us to effectively utilize the GPU resources. Image acquisition and image processing are multithreaded and run on CPU in parallel with PSO-based searching for the best pose. Owing to such task decomposition, the tracking of the full human body can be performed at rates of 12 frames per second. For a PSO consisting of 1000 particles and executing 10 iterations, the GPU achieves an average speedup of 12 over the CPU. Using marker-less motion capture system consisting of four calibrated and synchronized cameras, the efficiency comparisons were conducted on four CPU cores and four GTX GPUs on two cards. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Real-time multiview human pose tracking using graphics processing unit-accelerated particle swarm optimization", "paper_id": "WOS:000351683600014"}