{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "polymorphic_scenarios"}, {"score": 0.0045726187330434025, "phrase": "damm_and_harel's_live_sequence_charts"}, {"score": 0.004513978471055727, "phrase": "lsc"}, {"score": 0.00409723267214392, "phrase": "sequence_diagrams"}, {"score": 0.0038409323908446297, "phrase": "concrete_objects"}, {"score": 0.003004494701922268, "phrase": "scenario-based_testing"}, {"score": 0.002709161672473817, "phrase": "advanced_semantic_issues"}, {"score": 0.002555950807368337, "phrase": "polymorphic_setting"}, {"score": 0.00250682585023182, "phrase": "possible_extensions"}, {"score": 0.00244278788608393, "phrase": "uml_profile"}, {"score": 0.0022897425998475362, "phrase": "polymorphic_semantics"}, {"score": 0.0022312377180023282, "phrase": "scenario-based_specification_languages"}, {"score": 0.002132420504803564, "phrase": "broader_context"}, {"score": 0.0021049977753042253, "phrase": "behavioral_subtyping"}], "paper_keywords": ["Live sequence charts", " UML interactions", " Sequence diagrams", " Polymorphism", " Scenario-based modeling", " Behavioral subtyping"], "paper_abstract": "We present polymorphic scenarios, a generalization of a UML2-compliant variant of Damm and Harel's live sequence charts (LSC) in the context of object-orientation. Polymorphic scenarios are visualized using (modal) sequence diagrams where lifelines may represent classes and interfaces rather than concrete objects. Their semantics takes advantage of inheritance and interface realization to allow the specification of most expressive, succinct, and reusable universal and existential inter-object scenarios for object-oriented system models. We motivate the use of polymorphic scenarios, formally define their trace-based semantics, and present their application for scenario-based testing and execution, as implemented in the S2A compiler developed at the Weizmann Institute of Science. We further discuss advanced semantic issues arising from the use of scenarios in a polymorphic setting, suggest possible extensions, present a UML profile to support polymorphic scenarios, consider the application of the polymorphic semantics to other variants of scenario-based specification languages, and position our work in the broader context of behavioral subtyping.", "paper_title": "Polymorphic scenario-based specification models: semantics and applications", "paper_id": "WOS:000305750600005"}