{"auto_keywords": [{"score": 0.03720707411991549, "phrase": "web_accessibility"}, {"score": 0.00481495049065317, "phrase": "enriching_information_retrieval_results_with_web_accessibility_measurement._search_engines"}, {"score": 0.004456872931482395, "phrase": "information_retrieval"}, {"score": 0.004249825947483216, "phrase": "web_accessibility_issues"}, {"score": 0.0038870860864224656, "phrase": "mobile_devices'_users"}, {"score": 0.003450966222451678, "phrase": "content_relevance"}, {"score": 0.0032130703855586685, "phrase": "accessibility_analysis_module"}, {"score": 0.0022209780222461587, "phrase": "case_studies"}, {"score": 0.0021049977753042253, "phrase": "search_engines"}], "paper_keywords": ["Web accessibility", " Measurement", " Information Retrieval", " Quality Assurance", " search engines"], "paper_abstract": "Search engines are the most common gateway to search information in the WWW. Since Information Retrieval (IR) systems do not take Web accessibility issues into account, displayed results might not tailor to certain users' needs such as people with disabilities or mobile devices' users, In order to overcome this situation, we present a model aiming at considering Web accessibility as well as content relevance. The model consists of three components (Content Analysis Module, Accessibility Analysis Module and Results Collector Module) that carry out the following tasks: content analysis, automatic Web accessibility evaluation and accessibility measurement of results for re-ranking. Since criteria for ranking results provided by IR systems are necessary, quantitative metrics for accessibility have also been defined. Two prototypes that follow the specifications of the model have been developed in order to demonstrate the feasibility of this proposal. Finally, some case studies have been conducted aiming at discovering how traditional search engines deal with Web accessibility.", "paper_title": "ENRICHING INFORMATION RETRIEVAL RESULTS WITH WEB ACCESSIBILITY MEASUREMENT", "paper_id": "WOS:000264939300002"}