{"auto_keywords": [{"score": 0.0362171976400345, "phrase": "edf-vd"}, {"score": 0.00481495049065317, "phrase": "mixed-criticality_sporadic_task_systems"}, {"score": 0.0036665842836420223, "phrase": "lower_levels"}, {"score": 0.0035828427627676075, "phrase": "certification-cognizant_runtime_scheduling"}, {"score": 0.003389557201018519, "phrase": "earliest_deadline_first"}, {"score": 0.003358368814209542, "phrase": "virtual_deadlines"}, {"score": 0.0031333949463567554, "phrase": "criticality_levels"}, {"score": 0.0030759821501544224, "phrase": "efficient_implementations"}, {"score": 0.0029780219173522115, "phrase": "associated_schedulability_tests"}, {"score": 0.002909960617042717, "phrase": "task_system"}, {"score": 0.0026163210719740847, "phrase": "processor_speedup_factor"}, {"score": 0.0025922289692173997, "phrase": "utilization_bounds"}, {"score": 0.002174303033371867, "phrase": "wider_range"}, {"score": 0.002154272413276506, "phrase": "task_sets"}, {"score": 0.0021049977753042253, "phrase": "favorable_worst-case_resource_usage_guarantees"}], "paper_keywords": ["Algorithms", " Mixed criticality", " sporadic task system", " preemptive scheduling"], "paper_abstract": "Systems in many safety-critical application domains are subject to certification requirements. For any given system, however, it may be the case that only a subset of its functionality is safety-critical and hence subject to certification; the rest of the functionality is non-safety-critical and does not need to be certified, or is certified to lower levels of assurance. The certification-cognizant runtime scheduling of such mixed-criticality systems is considered. An algorithm called EDF-VD (for Earliest Deadline First with Virtual Deadlines) is presented: this algorithm can schedule systems for which any number of criticality levels are defined. Efficient implementations of EDF-VD, as well as associated schedulability tests for determining whether a task system can be correctly scheduled using EDF-VD, are presented. For up to 13 criticality levels, analyses of EDF-VD, based on metrics such as processor speedup factor and utilization bounds, are derived, and conditions under which EDF-VD is optimal with respect to these metrics are identified. Finally, two extensions of EDF-VD are discussed that enhance its applicability. The extensions are aimed at scheduling a wider range of task sets, while preserving the favorable worst-case resource usage guarantees of the basic algorithm.", "paper_title": "Preemptive Uniprocessor Scheduling of Mixed-Criticality Sporadic Task Systems", "paper_id": "WOS:000354799200005"}