{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "leakage_power"}, {"score": 0.022617745878568615, "phrase": "performance_penalties"}, {"score": 0.013655390428390035, "phrase": "instruction_caches"}, {"score": 0.013160746498399415, "phrase": "ssa"}, {"score": 0.005626232147522522, "phrase": "execution_times"}, {"score": 0.004576491793324233, "phrase": "on-chip_caches"}, {"score": 0.004364550313102054, "phrase": "increasing_fraction"}, {"score": 0.004335081499311714, "phrase": "total_power"}, {"score": 0.004120289747942224, "phrase": "unused_cache_lines"}, {"score": 0.003956113993518042, "phrase": "performance_degradation"}, {"score": 0.0038764861784138117, "phrase": "cache_architecture"}, {"score": 0.003671865026158296, "phrase": "static_power_dissipation"}, {"score": 0.00357362651129581, "phrase": "ssa_cache"}, {"score": 0.0035016702571862165, "phrase": "minimum_set-associative_scheme"}, {"score": 0.0034311578789991363, "phrase": "minimal_numbers"}, {"score": 0.0033167679667625667, "phrase": "performance_losses"}, {"score": 0.00304715054446383, "phrase": "cache_blocks"}, {"score": 0.0030163012350270025, "phrase": "current_working_set"}, {"score": 0.0028764048059439205, "phrase": "ssa_cache_architecture"}, {"score": 0.0027336881691956186, "phrase": "experimental_results"}, {"score": 0.002678598911294797, "phrase": "static_power_consumption"}, {"score": 0.002452392552332778, "phrase": "leakage_dissipation"}, {"score": 0.0022300545742463262, "phrase": "normalized_leakage"}], "paper_keywords": ["algorithms", " performance", " design", " experimentation", " caches", " cache decay", " drowsy caches", " leakage power"], "paper_abstract": "As transistors keep shrinking and on-chip caches keep growing, static power dissipation resulting from leakage of caches takes an increasing fraction of total power in processors. Several techniques have already been proposed to reduce leakage power by turning off unused cache lines. However, they all have to pay the price of performance degradation. This paper presents a cache architecture, the snug set-associative (SSA) cache, that cuts most of static power dissipation of caches without incuring performance penalties. The SSA cache reduces leakage power by implementing the minimum set-associative scheme, which only activates the minimal numbers of ways in each cache set, while the performance losses caused by this scheme are compensated by the base-offset load/store queues. The rationale of combining these two techniques is locality: as the contents of the cache blocks in the current working set are repeatedly accessed, same addresses would be computed again and again. The SSA cache architecture can be applied to data and instruction caches to reduce leakage power without incurring performance penalties. Experimental results show that SSA can cut static power consumption of the L1 data cache by 93%, on average, for SPECint2000 benchmarks, while the execution times are reduced by 5%. Similarly, SSA can cut leakage dissipation of the L1 instruction cache by 92%, on average, and improve performance over 3%. Furthermore, when SSA is adopted for both L1 data and instruction caches, the normalized leakage of L1 data and instruction caches is lowered to 8%, on average, while still accomplishing a 2% reduction in execution times.", "paper_title": "Snug set-associative caches: Reducing leakage power of instruction and data caches with no performance penalties", "paper_id": "WOS:000250597000006"}