{"auto_keywords": [{"score": 0.04958720442967606, "phrase": "hierarchical_video_segmentation"}, {"score": 0.015719716506582538, "phrase": "simple_dissimilarity_measure"}, {"score": 0.004716520738331953, "phrase": "region-oriented_scale-space"}, {"score": 0.004549063619065006, "phrase": "video_segmentations"}, {"score": 0.00450231514359539, "phrase": "different_detail_levels"}, {"score": 0.004364919932563366, "phrase": "finer_levels"}, {"score": 0.004188198923320451, "phrase": "coarser_levels"}, {"score": 0.0035866734383189396, "phrase": "new_methodology"}, {"score": 0.003336225354214798, "phrase": "original_graph"}, {"score": 0.0030554300179552415, "phrase": "extensive_comparative_analysis"}, {"score": 0.0030083825666563898, "phrase": "quantitative_assessments"}, {"score": 0.0024842242921857705, "phrase": "good_quantitative_results"}, {"score": 0.0024333239726872604, "phrase": "video_segmentation"}, {"score": 0.002310578855290687, "phrase": "time_cost"}], "paper_keywords": ["Hierarchical video segmentation", " Graph-based segmentation", " Hierarchical observation scale"], "paper_abstract": "Hierarchical video segmentation provides region-oriented scale-space, i.e., a set of video segmentations at different detail levels in which the segmentations at finer levels are nested with respect to those at coarser levels. In this work, the hierarchical video segmentation is transformed into a graph partitioning problem in which each part corresponds to one supervoxel of the video, and we present a new methodology for hierarchical video segmentation which computes a hierarchy of partitions by a reweighting of the original graph using a simple dissimilarity measure in which a not too coarse segmentation can be easily inferred. We also provide an extensive comparative analysis, considering quantitative assessments showing accuracy, ease of use, and temporal coherence of our methods - p-HOScale, cp-HOScale and 2cp-HOScale. According to the experiments, the hierarchy inferred by ourmethods produces good quantitative results when applied to video segmentation. Moreover, unlike to other tested methods, space and time cost of our methods are not influenced by the number of supervoxels to be computed. (C) 2014 Elsevier B. V. All rights reserved.", "paper_title": "Graph-based hierarchical video segmentation based on a simple dissimilarity measure", "paper_id": "WOS:000339999200010"}