{"auto_keywords": [{"score": 0.0493653882313026, "phrase": "life_sciences"}, {"score": 0.008713768692145006, "phrase": "massive_parallel_data_generation"}, {"score": 0.004511485198940203, "phrase": "important_and_rapidly_developing_research_field"}, {"score": 0.004227064760262924, "phrase": "full_analytical_systems"}, {"score": 0.0038431888954930083, "phrase": "tremendous_momentum"}, {"score": 0.0036921366375716005, "phrase": "analytical_processes"}, {"score": 0.0035827424231607784, "phrase": "enormous_advantages"}, {"score": 0.00354700018079049, "phrase": "existing_technologies"}, {"score": 0.003424677513304057, "phrase": "novel_opportunities"}, {"score": 0.0032085525502105836, "phrase": "significant_increases"}, {"score": 0.0031765314093444956, "phrase": "analysis_throughput"}, {"score": 0.003113441660343867, "phrase": "increased_separation_efficiency"}, {"score": 0.0026516890043911836, "phrase": "different_disciplines"}, {"score": 0.0026252106881752067, "phrase": "loc_technology"}, {"score": 0.0024842242921857705, "phrase": "unique_benefits"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Micro total analysis systems", " Microfluidics", " Chemometrics", " Tutorial", " Massively parallel"], "paper_abstract": "Lab-on-a-chip (LOC) technology is an important and rapidly developing research field focused on improving experimentation and analysis in the life sciences through miniaturization of full analytical systems into (monolithic) chip substrates. Since its emergence in the 1970s [1], the field has matured, gaining tremendous momentum in the last two decades. Miniaturization and integration of analytical processes on a chip can offer enormous advantages over existing technologies and can create a range of novel opportunities in the life sciences. The developments in the field have led to significant increases in analysis throughput, more than billion-fold sample volume reductions and increased separation efficiency. Despite its potential for the life sciences, the existence and the implications of LOCs are not widely known outside its community. The aim of this review is to introduce scientists from different disciplines to LOC technology. We will discuss the most important LOCs, their physical operating principles and the unique benefits that can be gained through miniaturization. We will conclude this review with a discussion of the potential of LOCs for massive parallel data generation and their potential implications for the life sciences. (c) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Lab-on-a-chip technologies for massive parallel data generation in the life sciences: A review", "paper_id": "WOS:000293430300007"}