{"auto_keywords": [{"score": 0.04602828261294556, "phrase": "hypertextual_navigation"}, {"score": 0.044329968218823915, "phrase": "students'_navigation"}, {"score": 0.03946204087052139, "phrase": "students'_prior_knowledge"}, {"score": 0.03379932930511647, "phrase": "pre_test"}, {"score": 0.00481495049065317, "phrase": "mechanics_hypermedia_program"}, {"score": 0.004584769330512473, "phrase": "pre_service_physics_teacher_training_course"}, {"score": 0.004197703302809062, "phrase": "hypermedia_program"}, {"score": 0.003970872207239332, "phrase": "sequence_analysis"}, {"score": 0.0038810583785936505, "phrase": "log_files"}, {"score": 0.0037808893362191887, "phrase": "mechanics_test"}, {"score": 0.003695356628334569, "phrase": "students'_navigation_graphs"}, {"score": 0.0035648266669315943, "phrase": "prior_knowledge"}, {"score": 0.0034388914613623857, "phrase": "different_levels"}, {"score": 0.0033831234599419435, "phrase": "different_roles"}, {"score": 0.003295763459241421, "phrase": "organized_navigation"}, {"score": 0.003007337114346301, "phrase": "conceptual_navigation"}, {"score": 0.002826092315294647, "phrase": "conceptual_difficulties"}, {"score": 0.0026297965957221554, "phrase": "disoriented_navigation"}, {"score": 0.002570237158808816, "phrase": "adequate_time"}, {"score": 0.00245512454195783, "phrase": "mechanics_plays"}, {"score": 0.002360559092734843, "phrase": "ausubel's_subsumers"}, {"score": 0.0022548160498101558, "phrase": "students'_conditions"}, {"score": 0.002225481283887324, "phrase": "meaningful_learning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["hypermedia systems", " navigation", " navigation patterns", " prior knowledge"], "paper_abstract": "This study investigates the interaction of a group of freshmen enrolled in a Pre Service Physics Teacher Training Course with a mechanics hypermedia program. Data were obtained to discuss hypertextual navigation guided by the following questions: (i) How can the students' navigation in this hypermedia program be characterized? (ii) How does this relate to their prior knowledge in mechanics? The sequence analysis of the events collected from the log files was used to characterize students' navigation and a mechanics test assessed students' prior knowledge. The inspection of students' navigation graphs made it possible to associate the structure of navigation to prior knowledge in mechanics. Three patterns of navigation are proposed associated to different levels of students' prior knowledge and to different roles performed by the program. In the organized navigation, the student who best performed in the pre test seemed to be reviewing content he already knew, using the system as a database. In the conceptual navigation the students who presented difficulties in the pre test spent different times in the pages as they were addressing conceptual difficulties, using the system as a support for learning. The students who scored the lowest in the test performed a disoriented navigation, spending much less than the adequate time to interact meaningfully with the content. The role that previous knowledge in mechanics plays in these patterns of navigation was related to the function that Ausubel's subsumers perform in learning. The results indicate that hypertextual navigation can provide information about students' conditions to engage in meaningful learning, which could be used to help the teacher personalize instruction. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Students' navigation patterns in the interaction with a mechanics hypermedia program", "paper_id": "WOS:000255798500019"}