{"auto_keywords": [{"score": 0.03370752732713766, "phrase": "normal_cones"}, {"score": 0.00481495049065317, "phrase": "robust_solutions"}, {"score": 0.004734853555630616, "phrase": "non-linear_multivariate_constraints"}, {"score": 0.004597861947580946, "phrase": "subdivision-based_multivariate_constraint"}, {"score": 0.00444612502361583, "phrase": "convex_hull"}, {"score": 0.004192484908247302, "phrase": "feasible_solution"}, {"score": 0.00403709306806495, "phrase": "numerical_improvement_method"}, {"score": 0.003838791650587681, "phrase": "termination_criteria"}, {"score": 0.003398714712611042, "phrase": "first_theoretical_criterion"}, {"score": 0.00267495669519805, "phrase": "dual_representation"}, {"score": 0.0026193328696791306, "phrase": "parallel_hyper-planes"}, {"score": 0.0024904974828343033, "phrase": "second_termination_criterion"}, {"score": 0.0024081387633065206, "phrase": "parallel_hyper-plane_pairs"}, {"score": 0.0022326306658609365, "phrase": "multivariate_solver"}], "paper_keywords": [""], "paper_abstract": "The need for robust solutions for sets of non-linear multivariate constraints or equations needs no motivation. Subdivision-based multivariate constraint solvers [1,2,3] typically employ the convex hull and subdivision/domain clipping properties of the Bezier/B-spline representation to detect all regions that may contain a feasible solution. Once such a region has been identified, a numerical improvement method is usually applied, which quickly converges to the root. Termination criteria for this subdivision/domain clipping approach are necessary so that, for example, no two roots reside in the same sub-domain (root isolation). This work presents two such termination criteria. The first theoretical criterion identifies sub-domains with at most a single solution. This criterion is based on the analysis of the normal cones of the multiviarates and has been known for some time [1]. Yet, a computationally tractable algorithm to examine this criterion has never been proposed. In this paper, we present such an algorithm for identifying sub-domains with at most a single solution that is based on a dual representation of the normal cones as parallel hyper-planes over the unit hyper-sphere. Further, we also offer a second termination criterion, based on the representation of bounding parallel hyper-plane pairs, to identify and reject sub-domains that contain no solution. We implemented both algorithms in the multivariate solver of the IRIT [4] solid modeling system and present examples using our implementation.", "paper_title": "Subdivision termination criteria in subdivision multivariate solvers", "paper_id": "WOS:000239567900009"}