{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wide_adoption"}, {"score": 0.0047385702897315436, "phrase": "cloud_computing_paradigm"}, {"score": 0.00451659023910662, "phrase": "available_offerings"}, {"score": 0.004374385639298755, "phrase": "database-as-"}, {"score": 0.0035527409334589317, "phrase": "design_support"}, {"score": 0.0035150223642728437, "phrase": "application_developers"}, {"score": 0.0030758904011907533, "phrase": "persistence_layer"}, {"score": 0.002931569771634119, "phrase": "different_deployment_scenarios"}, {"score": 0.002418742283474052, "phrase": "well-known_application"}, {"score": 0.0021620042653528846, "phrase": "clear_path"}], "paper_keywords": ["Synthetic workload", " benchmark", " cloud application distribution", " application deployment", " relational database", " cloud services selection", " TPC", " MediaWiki"], "paper_abstract": "The wide adoption of the cloud computing paradigm by many different domains has increased both the number and type of available offerings as a service, e.g. Database-as-a-service (DBaaS) or Platform-as-a-Service (PaaS), and with them the possibilities to deploy and operate an application partially or completely in the cloud. The need for providing design support to application developers in this environment is the focus of this work. Toward this goal, in the following we first scope the discussion on the persistence layer of applications and we investigate the effect of different deployment scenarios on the performance of the application over time. Based on the results of this analyses we then propose an application (re-)distribution design support process, which we evaluate empirically by means of a well-known application. The results of this evaluation both highlight the strengths of our proposal, and at the same time, provide a clear path for the following steps in our work.", "paper_title": "Design Support for Performance Aware Dynamic Application (Re-)Distribution in the Cloud", "paper_id": "WOS:000352789300006"}