{"auto_keywords": [{"score": 0.04594846582703764, "phrase": "environmental_requirements"}, {"score": 0.045411026539702984, "phrase": "supplier_selection_process"}, {"score": 0.009823109552095505, "phrase": "brazilian_companies"}, {"score": 0.0089087270421119, "phrase": "environmental_management_maturity"}, {"score": 0.008729121860088822, "phrase": "environmental_criteria"}, {"score": 0.00481495049065317, "phrase": "supplier_selection_criteria"}, {"score": 0.0046409647436353, "phrase": "brazil"}, {"score": 0.004603115982404017, "phrase": "purpose_-_the_purpose"}, {"score": 0.003908091457759849, "phrase": "companies'_selection"}, {"score": 0.0037667216301666196, "phrase": "mainstream_literature"}, {"score": 0.003736004578001584, "phrase": "environmental_management"}, {"score": 0.0034847851398628546, "phrase": "empirical_study's_strategy"}, {"score": 0.003428164458163043, "phrase": "five_brazilian_case_studies"}, {"score": 0.0032637448078885016, "phrase": "informal_conversations"}, {"score": 0.002933973181012572, "phrase": "company_documents"}, {"score": 0.0027141975147496264, "phrase": "traditional_criteria"}, {"score": 0.0024903420152789135, "phrase": "uniform_manner"}, {"score": 0.002184137736856711, "phrase": "environmentally_appropriate_suppliers"}, {"score": 0.0021049977753042253, "phrase": "first_known_study"}], "paper_keywords": ["Brazil", " Supplier evaluation", " Selection", " Environmental management", " Supply chain management"], "paper_abstract": "Purpose - The purpose of this paper is to verify if Brazilian companies are adopting environmental requirements in the supplier selection process. Further, this paper intends to analyze whether there is a relation between the level of environmental management maturity and the inclusion of environmental criteria in the companies' selection of suppliers. Design/methodology/approach - A review of mainstream literature on environmental management, traditional criteria in the supplier selection process and the incorporation of environmental requirements in this context. The empirical study's strategy is based on five Brazilian case studies with industrial companies. Face-to-face interviews and informal conversations are to be held, explanations made by e-mail with representatives from the purchasing, environmental management, logistics and other areas, and observation and the collection of company documents are also employed. Findings - Based on the cases, it is concluded that companies still use traditional criteria to select suppliers, such as quality and cost, and do not adopt environmental requirements in the supplier selection process in a uniform manner. Evidence found shows that the level of environmental management maturity influences the depth with which companies adopt environmental criteria when selecting suppliers. Thus, a company with more advanced environmental management adopts more formal procedures for selecting environmentally appropriate suppliers than others. Originality/value - This is the first known study to verify if Brazilian companies are adopting environmental requirements in the supplier selection process.", "paper_title": "Are supplier selection criteria going green? Case studies of companies in Brazil", "paper_id": "WOS:000266141200011"}