{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "ehealth_literacy"}, {"score": 0.023023463813006767, "phrase": "cancer_information"}, {"score": 0.006900573614706038, "phrase": "cancer_screening"}, {"score": 0.004541918674719973, "phrase": "critical_disease"}, {"score": 0.004481132747216135, "phrase": "high_mortality_rate"}, {"score": 0.004425782109293438, "phrase": "low_ehealth_literacy"}, {"score": 0.00438161736774803, "phrase": "useful_information"}, {"score": 0.00415166680936294, "phrase": "cancer_prevention"}, {"score": 0.00374399358035391, "phrase": "prior_experience"}, {"score": 0.0037104876694493815, "phrase": "cancer_screening_tests"}, {"score": 0.0032132782979796895, "phrase": "previous_cancer_screening_tests"}, {"score": 0.0031559919178954644, "phrase": "study_findings"}, {"score": 0.0027452053065200152, "phrase": "low_level"}, {"score": 0.0025892330566358503, "phrase": "higher_level"}, {"score": 0.0024864612830452254, "phrase": "significant_relationship"}, {"score": 0.002282667669149476, "phrase": "good_health"}], "paper_keywords": ["Cancer information seeking", " Cancer screening test", " eHealth literacy", " Internet"], "paper_abstract": "Cancer is a critical disease with a high mortality rate in the US. Although useful information exists on the Internet, many people experience difficulty finding information about cancer prevention because they have limited eHealth literacy. This study aimed to identify relationships between the level of eHealth literacy and cancer information seeking experience or prior experience with cancer screening tests. A total of 108 adults participated in this study through questionnaires. Data covering demographics, eHealth literacy, cancer information seeking experience, educational needs for cancer information searching, and previous cancer screening tests were obtained. Study findings show that the level of eHealth literacy influences cancer information seeking. Individuals with low eHealth literacy are likely to be less confident about finding cancer information. In addition, people who have a low level of eHealth literacy need more education about seeking information than do those with a higher level of eHealth literacy. However, there is no significant relationship between eHealth literacy and cancer screening tests. More people today are using the Internet for access to information to maintain good health. It is therefore critical to educate those with low eHealth literacy so they can better self-manage their health.", "paper_title": "Association of eHealth Literacy With Cancer Information Seeking and Prior Experience With Cancer Screening", "paper_id": "WOS:000348186900007"}