{"auto_keywords": [{"score": 0.03059341740032241, "phrase": "significant_negative_relations"}, {"score": 0.02992216316213032, "phrase": "established_fhcs"}, {"score": 0.029638871966991193, "phrase": "business_diversification"}, {"score": 0.015719716506582538, "phrase": "financial_holding_company_act"}, {"score": 0.015618899885582963, "phrase": "bank_efficiency"}, {"score": 0.013381549919333366, "phrase": "commercial_banks"}, {"score": 0.010334645219851451, "phrase": "technical_efficiency"}, {"score": 0.010135997330685802, "phrase": "fhcs'_banks"}, {"score": 0.009531548953886651, "phrase": "overdue_ratio"}, {"score": 0.008265436541285939, "phrase": "productivity_growth"}, {"score": 0.004721914865038196, "phrase": "taiwan"}, {"score": 0.004691273968935458, "phrase": "taiwan's_banking_industry"}, {"score": 0.004630626571109149, "phrase": "structural_changes"}, {"score": 0.004438861041839594, "phrase": "taiwan's_commercial_banks"}, {"score": 0.004367228576339114, "phrase": "financial_holding_companies"}, {"score": 0.004118751115632515, "phrase": "productivity_changes"}, {"score": 0.004012885020428863, "phrase": "data_envelopment_analysis_approach"}, {"score": 0.003935267970727093, "phrase": "malmquist_total_factor_productivity_index"}, {"score": 0.0037599278182081056, "phrase": "pure_technical_efficiency"}, {"score": 0.0030624066849965817, "phrase": "equity-to-total_asset_ratio"}, {"score": 0.002973904674745238, "phrase": "significant_positive_relations"}, {"score": 0.002576603426735759, "phrase": "bank_productivity_changes"}, {"score": 0.0025349467677077803, "phrase": "significant_negative_relation"}, {"score": 0.0024061070225431525, "phrase": "technological_growth"}, {"score": 0.0022542058337152913, "phrase": "slightly_significant_negative_relations"}, {"score": 0.002239552244442444, "phrase": "technical_efficiency_growth"}, {"score": 0.002160640052461594, "phrase": "slightly_significant_positive_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Efficiency", " Productivity change", " Financial holding companies"], "paper_abstract": "Taiwan's banking industry has experienced greatly structural changes since the implementing of Financial Holding Company Act in July 2001. The paper investigates whether Taiwan's commercial banks establishing or joining in financial holding companies (FHCs) could promote their efficiency and productivity, as well as the determinants of efficiency and productivity changes of commercial banks. The paper applies a data envelopment analysis approach for calculating bank efficiency and a Malmquist total factor productivity index for measuring productivity change of banks. The results show that except for pure technical efficiency, other efficiencies and productivity of commercial banks do not improved because of their establishment of or joining in FHCs: on the contrary, it is just because of their better efficiency that they can firstly establish or join in FHCs. The results also reveal that, in the aspect of determinants of bank efficiency, bank size and overdue ratio have significant negative relations to technical efficiency of establishing or joining in FHCs' banks, while equity-to-total asset ratio and loan-to-deposit ratio have significant positive relations to their technical efficiency; moreover, bank size and overdue ratio have significant negative relations to technical efficiency of banks with no established FHCs, while business diversification and loan-to-deposit ratio have significant negative relations to scale efficiency for these banks. Finally, in the aspect of determinants of bank productivity changes, overdue ratio has a significant negative relation to productivity growth of establishing or joining in FHCs' banks, while business diversification has significant negative relations to both technological growth and productivity growth for banks with established and no established FHCs; furthermore, equity-to-total asset ratio and loan-to-deposit ratio have slightly significant negative relations to technical efficiency growth of banks with no established FHCs, while business diversification has a slightly significant positive contribution to their technical efficiency growth. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Effects of Financial Holding Company Act on bank efficiency and productivity in Taiwan", "paper_id": "WOS:000270336100009"}