{"auto_keywords": [{"score": 0.04579719782409401, "phrase": "health_professionals"}, {"score": 0.01553919962802094, "phrase": "neurological_origin"}, {"score": 0.012765085404611255, "phrase": "circles_of_health"}, {"score": 0.009090500896943568, "phrase": "graphical_representations"}, {"score": 0.00481495049065317, "phrase": "advanced_social_network"}, {"score": 0.004581807162841004, "phrase": "new_social-network_platform"}, {"score": 0.004271671633291574, "phrase": "interoperable_platform"}, {"score": 0.0042344044308802445, "phrase": "standard_indicators"}, {"score": 0.00416083851254335, "phrase": "knowledge_democratization"}, {"score": 0.00413660047956989, "phrase": "user_empowerment"}, {"score": 0.003701893378341912, "phrase": "people's_health_status"}, {"score": 0.0035431066088977025, "phrase": "comprehensive_and_multidimensional_medical_evaluations"}, {"score": 0.0034109924073788215, "phrase": "international_classification"}, {"score": 0.00330304583388904, "phrase": "corresponding_medical_health_records"}, {"score": 0.0032078703296827436, "phrase": "multidimensional_indicators"}, {"score": 0.0031337020830262954, "phrase": "circles_of_health's"}, {"score": 0.003124552067168583, "phrase": "social_environment"}, {"score": 0.002929855464610305, "phrase": "bio-psycho-social_information"}, {"score": 0.00261397020353106, "phrase": "excessive_amount"}, {"score": 0.0024295886469293962, "phrase": "comprehensive_profile"}, {"score": 0.0023733719821584275, "phrase": "patient's_diseases"}, {"score": 0.00231167794364843, "phrase": "personal_knowledge"}, {"score": 0.002193048767151329, "phrase": "graphical_interface"}, {"score": 0.00216118788395907, "phrase": "future_versions"}, {"score": 0.0021422934905256956, "phrase": "social-network_platform"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Knowledge-based systems", " Biomedical ontologies", " ICF", " Medical health records", " Decision-support systems"], "paper_abstract": "Objectives: This research is concerned with the study of a new social-network platform, which (1) provides people with disabilities of neurological origin, their relatives, health professionals, therapists, carers and institutions with an interoperable platform that supports standard indicators, (2) promotes knowledge democratization and user empowerment, and (3) allows making decisions with a more informed opinion. Methods: A new social network, Circles of Health, has been designed, developed and tested by end-users. To allow monitoring the evolution of people's health status and comparing it with other users and with their cohort, anonymized data of 2675 people from comprehensive and multidimensional medical evaluations, carried out yearly from 2006 to 2010, have been standardized to the International Classification of Functioning, Disability and Health, integrated into the corresponding medical health records and then used to automatically generate and graphically represent multidimensional indicators. These indicators have been integrated into Circles of Health's social environment, which has been then evaluated via expert and user-experience analyses. Results: Patients used Circles of Health to exchange bio-psycho-social information (medical and otherwise) about their everyday lives. Health professionals remarked that the use of color-coding in graphical representations is useful to quickly diagnose deficiencies, difficulties or barriers in rehabilitation. Most people with disabilities complained about the excessive amount of information and the difficulty in interpreting graphical representations. Conclusions: Health professionals found Circles of Health useful to generate a more integrative understanding of health based on a comprehensive profile of individuals instead of being focused on patient's diseases and injuries. People with disabilities found enriching personal knowledge with the experiences of other users helpful. The number of descriptors used at the same time in the graphical interface should be reduced in future versions of the social-network platform. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Circles of Health: Towards an advanced social network about disabilities of neurological origin", "paper_id": "WOS:000328012900007"}