{"auto_keywords": [{"score": 0.04929460594219635, "phrase": "biomedical_knowledge"}, {"score": 0.037329211685609744, "phrase": "clinical_trials"}, {"score": 0.00907439702690375, "phrase": "logical_language"}, {"score": 0.00481495049065317, "phrase": "clinical_knowledge"}, {"score": 0.004775335634705251, "phrase": "better_use"}, {"score": 0.004677711903652145, "phrase": "increasingly_pressing_concern"}, {"score": 0.004620093797504386, "phrase": "challenging_diseases"}, {"score": 0.003835972725191194, "phrase": "timely_and_potentially_valuable_goal"}, {"score": 0.003680587852807675, "phrase": "important_and_common_type"}, {"score": 0.0034024277222012597, "phrase": "simple_language"}, {"score": 0.002847858807513713, "phrase": "viable_implementations"}, {"score": 0.0024434201175883674, "phrase": "relative_merits"}, {"score": 0.002184943946549964, "phrase": "logical_and_argumentation_aspects"}, {"score": 0.0021049977753042253, "phrase": "computational_complexity_results"}], "paper_keywords": ["Knowledge representation", " Argumentation", " Inconsistency", " Clinical knowledge", " Biomedical knowledge"], "paper_abstract": "Better use of biomedical knowledge is an increasingly pressing concern for tackling challenging diseases and for generally improving the quality of healthcare. The quantity of biomedical knowledge is enormous and it is rapidly increasing. Furthermore, in many areas it is incomplete and inconsistent. The development of techniques for representing and reasoning with biomedical knowledge is therefore a timely and potentially valuable goal. In this paper, we focus on an important and common type of biomedical knowledge that has been obtained from clinical trials and studies. We aim for (I) a simple language for representing the results of clinical trials and studies: (2) transparent reasoning with that knowledge that is intuitive and understandable to users; and (3) simple computation mechanisms with this knowledge in order to facilitate the development of viable implementations. Our approach is to propose a logical language that is tailored to the needs of representing and reasoning with the results of clinical trials and studies. Using this logical language, we generate arguments and counterarguments for the relative merits of treatments. In this way, the incompleteness and inconsistency in the knowledge is analysed via argumentation. In addition to motivating and formalising the logical and argumentation aspects of the framework, we provide algorithms and computational complexity results. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "An argument-based approach to reasoning with clinical knowledge", "paper_id": "WOS:000272601000001"}