{"auto_keywords": [{"score": 0.03344944850682606, "phrase": "user_co-comments"}, {"score": 0.015719716506582538, "phrase": "k-pop_video_community"}, {"score": 0.01559981682469958, "phrase": "youtube"}, {"score": 0.013481176373976889, "phrase": "user_interests"}, {"score": 0.0047043688962005925, "phrase": "co"}, {"score": 0.004542780650208743, "phrase": "successful_social_network"}, {"score": 0.003904713104101532, "phrase": "specific_video_community"}, {"score": 0.003627028894710926, "phrase": "co-commenting_behavior"}, {"score": 0.003516079377293321, "phrase": "traditional_author_cocitation_analysis"}, {"score": 0.0033559647822437298, "phrase": "co-comment_analysis"}, {"score": 0.0026374845514245547, "phrase": "user_opinions"}, {"score": 0.0025172781808293827, "phrase": "specific_k-pop_videos"}, {"score": 0.0024592402228499105, "phrase": "topically_similar_youtube_videos"}, {"score": 0.0021970000365512227, "phrase": "k-pop_videos"}, {"score": 0.0021463304704817873, "phrase": "specific_user_groups"}], "paper_keywords": ["co-citation analysis"], "paper_abstract": "YouTube is a successful social network that people use to upload, watch, and comment on videos. We believe comments left on these videos can provide insight into user interests, but to this point have not been used to map out a specific video community. Our study investigates whether and how user commenting behavior impacts the topology of the K-pop video community through analysis of co-commenting behavior on these videos. We apply a traditional author cocitation analysis to this behavior, in a process we refer to as co-comment analysis, to detect the topology of this community. This involves: a) an analysis of user co-comments to elicit the inclination of user homophily within the community; b) an analysis of user co-comments, weighted frequency of co-comments, to detect user interests in the community; and c) an analysis of user co-comments, weighted sentiment scores, to capture user opinions by polarity. The results indicate that users who comment on specific K-pop videos also tend to comment on topically similar YouTube videos. We also find that the number of comments made by users correlates with the degree of positivity of their comments. Conversely, users who comment negatively on K-pop videos are not inclined to form specific user groups, but rather present only their opinions individually.", "paper_title": "Identifying the topology of the K-pop video community on YouTube: A combined Co-comment analysis approach", "paper_id": "WOS:000368338400014"}