{"auto_keywords": [{"score": 0.03308886440974064, "phrase": "rigid_clusters"}, {"score": 0.004680624753255133, "phrase": "new_constructive_solving_approach"}, {"score": 0.00417961150804265, "phrase": "large_systems"}, {"score": 0.003648411055689428, "phrase": "new_solving_approach"}, {"score": 0.0032208091960514128, "phrase": "previous_cluster"}, {"score": 0.003009022147559257, "phrase": "non-rigid_clusters"}, {"score": 0.0029249294679606656, "phrase": "particular_degrees"}, {"score": 0.0025965853546625352, "phrase": "expensive_algebraic_solving_methods"}, {"score": 0.0025097154697345096, "phrase": "basic_ideas"}, {"score": 0.0024257447861185813, "phrase": "incremental_solving_algorithm"}, {"score": 0.0023713273141757326, "phrase": "solution_selection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Geometric constraint solving", " Cluster rewriting", " Solution selection"], "paper_abstract": "We present a new constructive solving approach for systems of 3D geometric constraints. The solver is based on the cluster rewriting approach, which can efficiently solve large systems of constraints on points, and incrementally handle changes to a system, but can so far solve only a limited class of problems. The new solving approach extends the class of problems that can be solved, while retaining the advantages of the cluster rewriting approach. Whereas previous cluster rewriting solvers only determined rigid clusters, we also determine two types of non-rigid clusters, i.e. clusters with particular degrees of freedom. This allows us to solve many additional problems that cannot be decomposed into rigid clusters, without resorting to expensive algebraic solving methods. In addition to the basic ideas of the approach, an incremental solving algorithm, two methods for solution selection, and a method for mapping constraints on 3D primitives to constraints on points are presented. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A non-rigid cluster rewriting approach to solve systems of 3D geometric constraints", "paper_id": "WOS:000273879800005"}