{"auto_keywords": [{"score": 0.045529220460039106, "phrase": "\"prepared_state"}, {"score": 0.00481495049065317, "phrase": "simple_molecular_machines"}, {"score": 0.004167653403322565, "phrase": "random_fluctuations"}, {"score": 0.004065156038847781, "phrase": "initial_random_motion"}, {"score": 0.003945467978172845, "phrase": "net_directional_displacement"}, {"score": 0.0038676325043529524, "phrase": "chemical_mechanisms"}, {"score": 0.0033140589981208693, "phrase": "crucial_step"}, {"score": 0.0031686717525002935, "phrase": "discrete_markovian_stochastic_model"}, {"score": 0.003075296862372287, "phrase": "chemical_quantities"}, {"score": 0.0030296432347510687, "phrase": "interatomic_distances"}, {"score": 0.00299958349498286, "phrase": "energy_differences"}, {"score": 0.0028822890425197582, "phrase": "simplest_molecular_machine_system"}, {"score": 0.002634830238219976, "phrase": "final_equilibrium_state"}, {"score": 0.00256993314099902, "phrase": "thermodynamically_stable_state"}, {"score": 0.0024693979425773993, "phrase": "time-dependent_force"}, {"score": 0.0023028105026714533, "phrase": "general_rules"}, {"score": 0.002136747803494932, "phrase": "basic_features"}, {"score": 0.0021049977753042253, "phrase": "machine's_operation"}], "paper_keywords": [""], "paper_abstract": "Many biological and artificial molecular machines start their operation with an external stimulus/input that moves them out of equilibrium and places them into a \"prepared state\". Their functioning sets off by exploiting random fluctuations of their environment. The initial random motion is then organized to achieve net directional displacement. While the chemical mechanisms behind the motion are often clear, predicting and extracting properties connected to their dynamical evolution is difficult. The determination of the force and the efficiency of the system is a crucial step towards their systematic design and exploitation. By using a discrete Markovian stochastic model whose parameters are matched to chemical quantities such as interatomic distances and energy differences, we describe the dynamics of the simplest molecular machine system, a double-well system where the \"prepared state\" is slightly higher in energy than the final equilibrium state and evolves towards this thermodynamically stable state. We determine the form of the time-dependent force exerted on the environment, the efficiency of the machine, while some general rules for the design of nanomachines are obtained and discussed. The model captures the basic features of the machine's operation, while it can be extended to describe systems consisting of more than two states.", "paper_title": "Calculating the Force Exerted by Simple Molecular Machines", "paper_id": "WOS:000294591400003"}