{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "commitment-based_business_protocols"}, {"score": 0.004497973025639345, "phrase": "multilevel_nature"}, {"score": 0.003978866233891427, "phrase": "new_rules"}, {"score": 0.0037848978618663684, "phrase": "methodological_framework"}, {"score": 0.003716724243777879, "phrase": "engineering_business_protocols"}, {"score": 0.0036497740708342093, "phrase": "primary_position"}, {"score": 0.00334780964309978, "phrase": "new_regulation"}, {"score": 0.0026913130726432645, "phrase": "integrated_software_tools"}, {"score": 0.002193013499219711, "phrase": "decision_making"}, {"score": 0.0021049977753042253, "phrase": "real-world_case_study"}], "paper_keywords": ["Commitment-based business protocols", " Regulations", " Methodologies", " Risks of violations", " Accountability"], "paper_abstract": "Enterprises must respect a number of regulations, with multilevel nature and which change along time. They must not only adapt their business interactions to the regulations and their changes but also evaluate the risks of violation of the new rules and to account for responsibilities. This work proposes a methodological framework for modeling and engineering business protocols, which gives primary position to the notions of commitment and responsibility, and supports the analysis of risks of violation when a new regulation is issued. We build on 2CL commitment-based protocols and introduce 2CL Methodology, a software engineering methodology for such protocols, which includes guidelines for specifying 2CL business protocols, for specialising them, and for composing a new 2CL protocol based on a set of given 2CL protocols. We developed a set of integrated software tools for the design and the analysis of 2CL protocols, with the aim of concretely supporting, on the one hand, designers in the task of identifying exposure to risks of violation, and, on the other hand, the management in the task of reasoning about accountability and of decision making. The proposal is evaluated by using a real-world case study from the banking sector.", "paper_title": "Engineering commitment-based business protocols with the 2CL methodology", "paper_id": "WOS:000330962900001"}