{"auto_keywords": [{"score": 0.03282260491043681, "phrase": "distributed_applications"}, {"score": 0.010228102307376074, "phrase": "large-scale_distributed_applications"}, {"score": 0.00481495049065317, "phrase": "large-scale_science_and_engineering_applications"}, {"score": 0.004193059395895776, "phrase": "distributed_infrastructure"}, {"score": 0.003919404114585274, "phrase": "scientific_applications"}, {"score": 0.0036883616416213206, "phrase": "current_distributed_applications"}, {"score": 0.0034944094552943, "phrase": "comprehensive_analysis"}, {"score": 0.003401278997237025, "phrase": "existing_models"}, {"score": 0.0029020077365708966, "phrase": "infrastructure_details"}, {"score": 0.002805597755796506, "phrase": "application_vectors"}, {"score": 0.002694112801983161, "phrase": "important_contributions"}, {"score": 0.0025870463897472943, "phrase": "wide_range"}, {"score": 0.0025696192337207155, "phrase": "real_distributed_applications"}, {"score": 0.0025180372061991206, "phrase": "integrated_approach"}, {"score": 0.0023774292521631093, "phrase": "critical_assessment"}, {"score": 0.002353441996629643, "phrase": "current_practice"}, {"score": 0.0021700361584578633, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "It is generally accepted that the ability to develop large-scale distributed applications has lagged seriously behind other developments in cyberinfrastructure. In this paper, we provide insight into how such applications have been developed and an understanding of why developing applications for distributed infrastructure is hard. Our approach is unique in the sense that it is centered around half a dozen existing scientific applications; we posit that these scientific applications are representative of the characteristics, requirements, as well as the challenges of the bulk of current distributed applications on production cyberinfrastructure (such as the US TeraGrid). We provide a novel and comprehensive analysis of such distributed scientific applications. Specifically, we survey existing models and methods for large-scale distributed applications and identify commonalities, recurring structures, patterns and abstractions. We find that there are many ad hoc solutions employed to develop and execute distributed applications, which result in a lack of generality and the inability of distributed applications to be extensible and independent of infrastructure details. In our analysis, we introduce the notion of application vectors: a novel way of understanding the structure of distributed applications. Important contributions of this paper include identifying patterns that are derived from a wide range of real distributed applications, as well as an integrated approach to analyzing applications, programming systems and patterns, resulting in the ability to provide a critical assessment of the current practice of developing, deploying and executing distributed applications. Gaps and omissions in the state of the art are identified, and directions for future research are outlined. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "Distributed computing practice for large-scale science and engineering applications", "paper_id": "WOS:000321697100004"}