{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "self-interested_wlans"}, {"score": 0.004472935829694716, "phrase": "overlapping_coverage"}, {"score": 0.0039006600544599537, "phrase": "improved_performance"}, {"score": 0.003839510177926892, "phrase": "wireless_networks"}, {"score": 0.0037005154613244363, "phrase": "well-known_property"}, {"score": 0.0035853745478488254, "phrase": "low_rate_users"}, {"score": 0.0034193226278107346, "phrase": "high_rate_users"}, {"score": 0.0032609360162842767, "phrase": "key_difference"}, {"score": 0.0028432828877281388, "phrase": "comprehensive_analytical_model"}, {"score": 0.002740253546178098, "phrase": "handover_gains"}, {"score": 0.0023891283748647416, "phrase": "practical_handover_decision_policy"}, {"score": 0.0021612684684351974, "phrase": "significant_gains"}, {"score": 0.0021049977753042253, "phrase": "performance-induced_handover_incentives"}], "paper_keywords": ["Multirate wireless networks", " handovers", " incentives"], "paper_abstract": "We consider an environment where self-interested IEEE 802.11 Wireless Local Area Networks (WLANs) have overlapping coverage, and investigate the incentives that can trigger handovers between the WLANs. Our focus is on the incentives for supporting handovers due solely to the improved performance for all wireless networks. Such incentives arise due to a well-known property of 802.11 networks, where low rate users that send traffic significantly degrade the performance of high rate users that are associated with the same access point. A key difference of this paper compared to other works is that WLANs are self-interested, seeking to improve the performance of their own clients. We develop a comprehensive analytical model for accurately identifying and quantifying the handover gains. The model captures cases such as uplink and downlink traffic, wired link capacity constraints, and nonsaturated traffic conditions, and yields a practical handover decision policy. Simulations and experiments on a real testbed verify the accuracy of the model, and indicate that significant gains can be achieved through performance-induced handover incentives.", "paper_title": "Handover Incentives for Self-Interested WLANs with Overlapping Coverage", "paper_id": "WOS:000310390400007"}