{"auto_keywords": [{"score": 0.04864349780900302, "phrase": "video_description"}, {"score": 0.022161546831790137, "phrase": "vision_loss"}, {"score": 0.00481495049065317, "phrase": "computer-vision_software_tools"}, {"score": 0.004318881178805575, "phrase": "computer-vision_tools"}, {"score": 0.0034742854447532678, "phrase": "main_conclusions"}, {"score": 0.003170667618004276, "phrase": "described_productions"}, {"score": 0.0030888830649190282, "phrase": "video_description_typology"}, {"score": 0.003048782877550259, "phrase": "current_status"}, {"score": 0.0030092017034068666, "phrase": "prototype_software"}, {"score": 0.0024842242921857705, "phrase": "key-object_spotting"}, {"score": 0.0023990982005125763, "phrase": "visual_content"}, {"score": 0.0023782753249846794, "phrase": "associate_textual_descriptions"}, {"score": 0.0023168823213024856, "phrase": "audio_track"}, {"score": 0.002286781334850213, "phrase": "synthetic_voice"}, {"score": 0.0021702292394814144, "phrase": "first_adaptive_video_description_player"}], "paper_keywords": ["e-Accessibility", " Video description", " Video indexing", " Computer vision"], "paper_abstract": "This paper presents the status of a R&D project targeting the development of computer-vision tools to assist humans in generating and rendering video description for people with vision loss. Three principal issues are discussed: (1) production practices, (2) needs of people with vision loss, and (3) current system design, core technologies and implementation. The paper provides the main conclusions of consultations with producers of video description regarding their practices and with end-users regarding their needs, as well as an analysis of described productions that lead to propose a video description typology. The current status of a prototype software is also presented (audio-vision manager) that uses many computer-vision technologies (shot transition detection, key-frame identification, key-face recognition, key-text spotting, visual motion, gait/gesture characterization, key-place identification, key-object spotting and image categorization) to automatically extract visual content, associate textual descriptions and add them to the audio track with a synthetic voice. A proof of concept is also briefly described for a first adaptive video description player which allows end users to select various levels of video description.", "paper_title": "Towards computer-vision software tools to increase production and accessibility of video description for people with vision loss", "paper_id": "WOS:000207889400006"}