{"auto_keywords": [{"score": 0.03559858337725859, "phrase": "sensor_networks"}, {"score": 0.030027520448339416, "phrase": "proposed_caser_protocol"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.00477190623242136, "phrase": "lifetime_optimization"}, {"score": 0.004645057834614705, "phrase": "multi-hop_wireless_sensor_networks"}, {"score": 0.004541918674719973, "phrase": "non-replenishable_energy_resources"}, {"score": 0.003660788124282824, "phrase": "energy_consumption"}, {"score": 0.003563370084662192, "phrase": "uniform_energy_deployment"}, {"score": 0.0032277611129050234, "phrase": "efficient_non-uniform_energy_deployment_strategy"}, {"score": 0.003141830113006653, "phrase": "message_delivery_ratio"}, {"score": 0.0029767499830258754, "phrase": "quantitative_security_analysis"}, {"score": 0.002936849401568391, "phrase": "proposed_routing_protocol"}, {"score": 0.0028844769395018595, "phrase": "opnet_simulation_results"}, {"score": 0.0027825094419000637, "phrase": "excellent_tradeoff"}, {"score": 0.0027206133859493725, "phrase": "energy_balance"}, {"score": 0.0025202582748972122, "phrase": "non-uniform_energy_deployment"}, {"score": 0.002143247921132179, "phrase": "high_message_delivery_ratio"}, {"score": 0.0021049977753042253, "phrase": "traceback_attacks"}], "paper_keywords": ["Routing", " security", " energy efficiency", " energy balance", " delivery ratio", " deployment", " simulation"], "paper_abstract": "Lifetime optimization and security are two conflicting design issues for multi-hop wireless sensor networks (WSNs) with non-replenishable energy resources. In this paper, we first propose a novel secure and efficient Cost-Aware SEcure Routing (CASER) protocol to address these two conflicting issues through two adjustable parameters: energy balance control (EBC) and probabilistic-based random walking. We then discover that the energy consumption is severely disproportional to the uniform energy deployment for the given network topology, which greatly reduces the lifetime of the sensor networks. To solve this problem, we propose an efficient non-uniform energy deployment strategy to optimize the lifetime and message delivery ratio under the same energy resource and security requirement. We also provide a quantitative security analysis on the proposed routing protocol. Our theoretical analysis and OPNET simulation results demonstrate that the proposed CASER protocol can provide an excellent tradeoff between routing efficiency and energy balance, and can significantly extend the lifetime of the sensor networks in all scenarios. For the non-uniform energy deployment, our analysis shows that we can increase the lifetime and the total number of messages that can be delivered by more than four times under the same assumption. We also demonstrate that the proposed CASER protocol can achieve a high message delivery ratio while preventing routing traceback attacks.", "paper_title": "Cost-Aware SEcure Routing (CASER) Protocol Design for Wireless Sensor Networks", "paper_id": "WOS:000351453000005"}