{"auto_keywords": [{"score": 0.048451073513520106, "phrase": "cloud_computing"}, {"score": 0.03782491189150546, "phrase": "data_flows"}, {"score": 0.031865784855921876, "phrase": "ike_scheme"}, {"score": 0.00481495049065317, "phrase": "ccbke_-_session"}, {"score": 0.0047415081747150065, "phrase": "fast_and_secure_scheduling"}, {"score": 0.00442457549952546, "phrase": "data-intensive_scientific_applications"}, {"score": 0.0039729853486821995, "phrase": "server_instances"}, {"score": 0.0037937873032347, "phrase": "greatest_concerns"}, {"score": 0.003636605792981828, "phrase": "malicious_parties"}, {"score": 0.0034993519231560637, "phrase": "existing_typical_method"}, {"score": 0.0033672608231654897, "phrase": "key_exchange"}, {"score": 0.0032526334220034326, "phrase": "session_keys"}, {"score": 0.0031298260299218684, "phrase": "symmetric-key_encryption"}, {"score": 0.002977061391551628, "phrase": "low_efficiency"}, {"score": 0.002853620962601042, "phrase": "high-density_operations"}, {"score": 0.0027777389949155975, "phrase": "scientific_applications"}, {"score": 0.0026934777251033776, "phrase": "cloud_computing_background_key_exchange"}, {"score": 0.0026117657828249137, "phrase": "key_exchange_scheme"}, {"score": 0.002571841741339248, "phrase": "efficient_security-aware_scheduling"}, {"score": 0.002465161736207254, "phrase": "randomness-reuse_strategy"}, {"score": 0.002221655243524476, "phrase": "time_consumption"}, {"score": 0.0022046030435199796, "phrase": "computation_load"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Hybrid environment", " Cloud computing", " Scheduling", " Efficiency", " Communication security", " Authenticated key exchange"], "paper_abstract": "Instead of purchasing and maintaining their own computing infrastructure, scientists can now run data-intensive scientific applications in a hybrid environment such as cloud computing by facilitating its vast storage and computation capabilities. During the scheduling of such scientific applications for execution, various computation data flows will happen between the controller and computing server instances. Amongst various quality-of-service (QoS) metrics, data security is always one of the greatest concerns to scientists because their data may be intercepted or stolen by malicious parties during those data flows, especially for less secure hybrid cloud systems. An existing typical method for addressing this issue is to apply the Internet Key Exchange (IKE) scheme to generate and exchange session keys, and then to apply these keys for performing symmetric-key encryption which will encrypt those data flows. However, the IKE scheme suffers from low efficiency due to its asymmetric-key cryptological operations over a large amount of data and high-density operations which are exactly the characteristics of scientific applications. In this paper, we propose Cloud Computing Background Key Exchange (CCBKE), a novel authenticated key exchange scheme that aims at efficient security-aware scheduling of scientific applications. Our scheme is designed based on the randomness-reuse strategy and the Internet Key Exchange (IKE) scheme. Theoretical analyses and experimental results demonstrate that, compared with the IKE scheme, our CCBKE scheme can significantly improve the efficiency by dramatically reducing time consumption and computation load without sacrificing the level of security. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "CCBKE - Session key negotiation for fast and secure scheduling of scientific applications in cloud computing", "paper_id": "WOS:000317889500016"}