{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vehicular_networks"}, {"score": 0.004708982310710893, "phrase": "strong_correlation"}, {"score": 0.004669845451682529, "phrase": "vehicle's_identity"}, {"score": 0.0044914449177247545, "phrase": "driver_privacy"}, {"score": 0.003897064755246921, "phrase": "roadside_infrastructure"}, {"score": 0.0038431888954930083, "phrase": "large_number"}, {"score": 0.0037795163893761027, "phrase": "city_streets"}, {"score": 0.0037168948492715386, "phrase": "possible_attacks"}, {"score": 0.003696251566632813, "phrase": "privacy_protection"}, {"score": 0.00360476133703808, "phrase": "first_main_contribution"}, {"score": 0.003525332840272254, "phrase": "nontrivial_step"}, {"score": 0.003486275025030832, "phrase": "scalable_and_robust_solution"}, {"score": 0.003197843245296877, "phrase": "geographic_area"}, {"score": 0.0029169007179202164, "phrase": "entire_downtown_area"}, {"score": 0.0028926147550022607, "phrase": "small_town"}, {"score": 0.0026680011467947206, "phrase": "virtually_all_existing_schemes"}, {"score": 0.002537424329317581, "phrase": "analytically_the_time-varying_request"}, {"score": 0.0024607859021142887, "phrase": "capacity_planning_purposes"}, {"score": 0.002433493596574017, "phrase": "system_managers"}, {"score": 0.0023731849094845475, "phrase": "time-varying_attributes"}, {"score": 0.0021524941421636997, "phrase": "empirical_results"}, {"score": 0.0021345589634924633, "phrase": "detailed_simulation"}], "paper_keywords": ["Vehicular networks", " privacy", " scalability"], "paper_abstract": "In vehicular networks, there is a strong correlation between a vehicle's identity and that of the driver. It follows that any effort to protect driver privacy must attempt to make the link between the two harder to detect. One of the most appealing solutions to hiding the identity of a vehicle is the use of pseudonyms, whereby each vehicle is issued one or several temporary identities (i.e., pseudonyms) that it uses to communicate with other vehicles and/or the roadside infrastructure. Due to the large number of vehicles on our roadways and city streets and of the sophistication of possible attacks, privacy protection must be both scalable and robust. The first main contribution of this work is to take a nontrivial step towards providing a scalable and robust solution to privacy protection in vehicular networks. To promote scalability and robustness we employ two strategies. First, we view vehicular networks as consisting of nonoverlapping subnetworks, each local to a geographic area referred to as a cell. Depending on the topology and the nature of the area, these cells may be as large as few city blocks or, indeed, may comprise the entire downtown area of a small town. Each cell has a server that maintains a list of pseudonyms valid for use in the cell. Instead of issuing pseudonyms to vehicles proactively, as virtually all existing schemes do, we issue pseudonyms only to those vehicles that request them. Our second main contribution is to model analytically the time-varying request for pseudonyms in a given cell. This is important for capacity planning purposes since it allows system managers to predict, by taking into account the time-varying attributes of the traffic, the probability that a given number of pseudonyms will be required at a certain time as well as the expected number of pseudonyms in use in a cell at a certain time. Empirical results obtained by detailed simulation confirmed the accuracy of our analytical predictions.", "paper_title": "Towards Providing Scalable and Robust Privacy in Vehicular Networks", "paper_id": "WOS:000340282400023"}