{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vulnerability_discovery_process"}, {"score": 0.004773692073488661, "phrase": "apache_and_iis_http_servers"}, {"score": 0.004195418010131832, "phrase": "end_users"}, {"score": 0.004088421020408183, "phrase": "resource_allocation"}, {"score": 0.003933000051147382, "phrase": "independent_variable"}, {"score": 0.003899269293218826, "phrase": "effort-based_modeling"}, {"score": 0.0037188360359702182, "phrase": "market_share_data"}, {"score": 0.00350118709812536, "phrase": "apache"}, {"score": 0.003471144745575279, "phrase": "iis"}, {"score": 0.0033391018638565715, "phrase": "effort-based_vulnerability_discovery_models"}, {"score": 0.0031032109441552287, "phrase": "software_evolution"}, {"score": 0.0029980260560551982, "phrase": "aggregate_vulnerabilities"}, {"score": 0.0029722900280316216, "phrase": "different_groups"}, {"score": 0.002762240719058935, "phrase": "selected_vulnerability_discovery_models"}, {"score": 0.002555950807368337, "phrase": "separate_modeling"}, {"score": 0.0025230952890994236, "phrase": "individual_class"}, {"score": 0.002255431275670053, "phrase": "quantitative_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Vulnerability discovery model (VDM)", " Risk evaluation", " Web server", " Quantitative modeling", " Security"], "paper_abstract": "Vulnerability discovery models allow prediction of the number of vulnerabilities that are likely to be discovered in the future. Hence, they allow the vendors and the end users to manage risk by optimizing resource allocation. Most vulnerability discovery models proposed use the time as an independent variable. Effort-based modeling has also been proposed, which requires the use of market share data. Here, the feasibility of characterizing the vulnerability discovery process in the two major HTTP servers, Apache and IIS, is quantitatively examined using both time and effort-based vulnerability discovery models, using data spanning more than a decade. The data used incorporates the effect of software evolution for both servers. In addition to aggregate vulnerabilities, different groups of vulnerabilities classified using both the error types and severity levels are also examined. Results show that the selected vulnerability discovery models of both types can fit the data of the two HTTP servers very well. Results also suggest that separate modeling for an individual class of vulnerabilities can be done. In addition to the model fitting, predictive capabilities of the two models are also examined. The results demonstrate the applicability of quantitative methods to widely-used products, which have undergone evolution. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Modeling vulnerability discovery process in Apache and IIS HTTP servers", "paper_id": "WOS:000287431400007"}