{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "pedestrian_content_distribution"}, {"score": 0.004621447740470602, "phrase": "mobile_communication_devices"}, {"score": 0.004461761855323898, "phrase": "multimedia_data"}, {"score": 0.0038085117064624208, "phrase": "short_range_radio"}, {"score": 0.003676811616723809, "phrase": "public_content_distribution_system"}, {"score": 0.0036126731589251906, "phrase": "vast_urban_areas"}, {"score": 0.0035496495489801667, "phrase": "transport_mechanism"}, {"score": 0.002725740264152553, "phrase": "similar_or_related_scenarios"}, {"score": 0.0025106241866273897, "phrase": "pedestrian_speeds"}, {"score": 0.0024667783849055634, "phrase": "low_arrival_rates"}, {"score": 0.0024236964502593254, "phrase": "studied_region"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mobility modeling", " Ad hoc network", " Opportunistic networking", " Delay-tolerant networking", " Content distribution"], "paper_abstract": "Mobile communication devices may be used for spreading multimedia data without support of an infrastructure. Such a scheme, where the data is carried by people walking around and relayed from device to device by means of short range radio, could potentially form a public content distribution system that spans vast urban areas. The transport mechanism is the flow of people and it can be studied but not engineered. We study the efficiency of pedestrian content distribution by modeling the mobility of people moving around in a city, constrained by a given topology. The model is supplemented by simulation of similar or related scenarios for validation and extension. The results show that contents spread well with pedestrian speeds already at low arrival rates into a studied region. Our contributions are both the queuing analytic model that captures the flow of people and the results on the feasibility of pedestrian content distribution. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "An analytical model for pedestrian content distribution in a grid of streets", "paper_id": "WOS:000318915800032"}