{"auto_keywords": [{"score": 0.04688827389583813, "phrase": "fuzzy_information_granularity"}, {"score": 0.008713768692145006, "phrase": "fuzzy_granular_structure"}, {"score": 0.005236629961047524, "phrase": "fuzzy_granular_structure_distance"}, {"score": 0.004948074109152314, "phrase": "fuzzy_information"}, {"score": 0.004737579882204798, "phrase": "mathematical_structure"}, {"score": 0.004642604455537883, "phrase": "fuzzy_information_granules"}, {"score": 0.0043161190928529755, "phrase": "existing_forms"}, {"score": 0.0035965032173588753, "phrase": "existing_axiomatic_approaches"}, {"score": 0.00342568771304873, "phrase": "partial_order_relation"}, {"score": 0.003398015125667192, "phrase": "fuzzy_granular_structures"}, {"score": 0.003158776195052182, "phrase": "so-called_fuzzy_granular_structure_distance"}, {"score": 0.0028541057064952876, "phrase": "important_benefit"}, {"score": 0.002751751956416832, "phrase": "generalized_axiomatic_constraint"}, {"score": 0.0026638482306228575, "phrase": "axiomatic_constraint"}, {"score": 0.0024862418814045723, "phrase": "fuzzy_granular_structure_distances"}, {"score": 0.0022190974300886467, "phrase": "applicable_analysis"}, {"score": 0.0021394674440767124, "phrase": "generalized_fuzzy_information_granularity"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["Granular computing (GrC)", " fuzzy granular structure distance", " fuzzy information entropy", " fuzzy information granularity"], "paper_abstract": "A fuzzy granular structure refers to a mathematical structure of the collection of fuzzy information granules granulated from a dataset, while a fuzzy information granularity is used to measure its uncertainty. However, the existing forms of fuzzy information granularity have two limitations. One is that when the fuzzy information granularity of one fuzzy granular structure equals that of the other, one can say that these two fuzzy granular structures possess the same uncertainty, but these two fuzzy granular structures may be not equivalent to each other. The other limitation is that existing axiomatic approaches to fuzzy information granularity are still not complete, under which when the partial order relation among fuzzy granular structures cannot be found, their coarseness/fineness relationships will not be revealed. To address these issues, a so-called fuzzy granular structure distance is proposed in this study, which can well discriminate the difference between any two fuzzy granular structures. Besides this advantage, the fuzzy granular structure distance has another important benefit: It can be used to establish a generalized axiomatic constraint for fuzzy information granularity. By using the axiomatic constraint, the coarseness/fineness of any two fuzzy granular structures can be distinguished. In addition, through taking the fuzzy granular structure distances of a fuzzy granular structure to the finest one and the coarsest one into account, we also can build a bridge between fuzzy information granularity and fuzzy information entropy. The applicable analysis on 12 real-world datasets shows that the fuzzy granular structure distance and the generalized fuzzy information granularity have much better performance than existing methods.", "paper_title": "Fuzzy Granular Structure Distance", "paper_id": "WOS:000365989300027"}