{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "geodesic_region_models"}, {"score": 0.004737579882204798, "phrase": "multidimensional_and_complex_medical_images"}, {"score": 0.004611369021812453, "phrase": "radiotherapy_treatment_planning"}, {"score": 0.00441635700580562, "phrase": "fundamental_task"}, {"score": 0.004007083686875716, "phrase": "intrinsic_techniques"}, {"score": 0.00394264312173188, "phrase": "image_processing_methods"}, {"score": 0.003879234831701853, "phrase": "medical_images"}, {"score": 0.0034442607586033657, "phrase": "tracking_models"}, {"score": 0.0032806521851034766, "phrase": "medical_procedures"}, {"score": 0.0025167026017217926, "phrase": "regional_features"}, {"score": 0.0023841092222805253, "phrase": "ct_images"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Tracking organs", " Geodesic models", " Medical images", " Multiple region organs", " 3D and 4D images"], "paper_abstract": "From surgery to radiotherapy treatment planning, tracking organs or tissues is a fundamental task. The techniques used to achieve this tracking can be classified as: extrinsic and intrinsic. Intrinsic techniques only use image processing methods applied to medical images or sequences, as dealt with in this paper. To accurately perform this organ tracking it is necessary to find tracking models that can be applied to various image modalities involved in medical procedures (CT, MRI, etc.). Moreover these models must handle several image dimensions (2D, 3D, and 4D) that are common in many medical tasks. Among the several alternatives for tracking the organs of interest, a model based on a geodesic one combined with regional features is proposed. This model has been tested on CT images from the pelvic, cardiac and thoracic area. A novel model for the segmentation of organs composed of more than one region is proposed. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Tracking by means of geodesic region models applied to multidimensional and complex medical images", "paper_id": "WOS:000292020900001"}