{"auto_keywords": [{"score": 0.03161009677011822, "phrase": "high_gain"}, {"score": 0.004822980959269888, "phrase": "survey"}, {"score": 0.00478701880312723, "phrase": "study_of_planar_antennas"}, {"score": 0.00475924837336259, "phrase": "pico-satellites"}, {"score": 0.004336115760817672, "phrase": "high_temporal_resolution"}, {"score": 0.004310949776826717, "phrase": "observational_data"}, {"score": 0.003961971696168206, "phrase": "distributed_processing_algorithms"}, {"score": 0.0038037169725424567, "phrase": "cross-link_communication"}, {"score": 0.0036945485333312747, "phrase": "cross-link_antenna"}, {"score": 0.0032596049901888724, "phrase": "existing_planar_antenna_designs"}, {"score": 0.0030750809317435304, "phrase": "microstrip_patch"}, {"score": 0.0029694040368299624, "phrase": "beam_steering"}, {"score": 0.0029435555176530732, "phrase": "wide_bandwidth"}, {"score": 0.00278497898719426, "phrase": "extensive_qualitative_comparison"}, {"score": 0.0024856733811053243, "phrase": "pico-satellite_challenges"}, {"score": 0.0024640253074497114, "phrase": "common_platform"}, {"score": 0.002421291757425244, "phrase": "asymmetric_e-shaped_patch_antenna_design"}], "paper_keywords": ["Circular polarization", " reconfigurable antennas", " antenna arrays", " beam steering", " CubeSat", " pico-satellites", " planar antennas", " microstrip patch antennas", " sequential phase-rotation", " photonic band-gap (PBG)"], "paper_abstract": "Works on pico-satellites have gained momentum recently, especially those that consider pico., satellites as part of a much larger constellation or swarm. This feature allows pico-satellites to provide high temporal resolution of observational data and redundancy. In particular, it reduces the need for satellite-to ground communications and, hence, helps save energy and allows the execution of distributed processing algorithms on the satellites themselves. Consequently, satellite-to-satellite or cross-link communication is critical. To realize these advantages, the cross-link antenna employed on pico-satellites must meet many criteria, namely, small size, lightweight, low-power consumption, high gain, wide bandwidth, circular polarization, and beam steerability. To date, no works have examined the suitability of existing planar antenna designs for the use on pico-satellites. To this end, this paper contributes to the literature by focusing on microstrip patch and slot antennas that have the ability to achieve high gain, beam steering, and wide bandwidth. This paper reviews 66 planar antenna designs, which includes 38-patch and 28-slot antennas. In addition, we provide an extensive qualitative comparison of these antennas in terms of their mass, size, gain, beam steerability, type of polarization, operating frequency band, and return loss. In addition, we have evaluated three antenna designs that best address the pico-satellite challenges on a common platform. We find that the asymmetric E-shaped patch antenna design is the most suitable for the use on 2U CubeSats. This is because of its small size (34 x 13 mm2) and high gain (7.3 dB). In addition, the E-shaped patch antenna yields a wide 10-dB bandwidth of 2300 MHz and a small return loss of 15.2 dB.", "paper_title": "A Survey and Study of Planar Antennas for Pico-Satellites", "paper_id": "WOS:000371388200198"}