{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adaptive_hypermedia"}, {"score": 0.027227015614200805, "phrase": "domain_model"}, {"score": 0.007451445321039452, "phrase": "adaptation_model"}, {"score": 0.007159751391012541, "phrase": "user_model"}, {"score": 0.005914978949022672, "phrase": "personalized_presentation"}, {"score": 0.00478004925856914, "phrase": "ontologies"}, {"score": 0.004509594355983191, "phrase": "link_structure"}, {"score": 0.004460609967916904, "phrase": "adaptive_hypermedia_system"}, {"score": 0.0039268117782861696, "phrase": "whole_knowledge"}, {"score": 0.003800156761779008, "phrase": "adaptation_rules"}, {"score": 0.0034440966820590024, "phrase": "apprropiate_adaptation_model"}, {"score": 0.003284718806701356, "phrase": "authoring_tools"}, {"score": 0.0031212935348800467, "phrase": "basic_concepts"}, {"score": 0.002601065207135226, "phrase": "owl_ontology"}, {"score": 0.002391739069644444, "phrase": "best_known_open_source_general-purpose_adaptive_hypermedia_systems"}, {"score": 0.002289285767792039, "phrase": "well-defined_knowledge_structure"}, {"score": 0.0021437580456873584, "phrase": "initial_step"}], "paper_keywords": ["Ontology", " Adaptive hypermedia"], "paper_abstract": "Adaptive hypermedia has been developed to overcome the problems of disorientation by providing personalized presentation and link structure. An adaptive hypermedia system consists of an adaptation model, a domain model, and a user model. The user model describes various aspects of a user such as interests, knowledge, preferences, etc. The domain model describes the whole knowledge accessible in adaptive hypermedia. The adaptation model consists of adaptation rules that define both how to generate the personalized presentation and update the user model [12]. Authoring adaptive hypermedia typically starts by designing a domain model so that apprropiate adaptation model and user model can be created based the domain model. While there are authoring tools developed for creating domain model of an adaptive hypermedia, authors need to manually create basic concepts as well as their relationships for a domain of interests. In this paper, we present a system that transforms an ontology into the domain and adaptation model of adaptive hypermedia so that the authors can generate adaptive hypermedia easily. The system transforms classes and relationships between the classes defined in OWL ontology [7] into concepts and relationships between the concepts defined in the domain model of AHA! system which is one of best known open source general-purpose adaptive hypermedia systems [1]. Using our system, authors can utilize well-defined knowledge structure in ontologies for authoring adaptive hypermedia. On top of this, since designing domain model is generally an initial step to author adaptive hypermedia, our system can help authors reduce tasks to create adaptive hypermedia by automatically generating domain model from an ontology.", "paper_title": "Authoring Adaptive Hypermedia using Ontologies", "paper_id": "WOS:000302511300008"}