{"auto_keywords": [{"score": 0.04577187437978843, "phrase": "proposed_model"}, {"score": 0.03987218711500845, "phrase": "weighting_coefficient"}, {"score": 0.01411427878168083, "phrase": "local_and_global_region"}, {"score": 0.00481495049065317, "phrase": "local_and_global_gaussian_distribution_fitting_energies"}, {"score": 0.004605258779434384, "phrase": "active_contour_model"}, {"score": 0.004515004397496303, "phrase": "detailed_implementation"}, {"score": 0.004470539706227421, "phrase": "image_segmentation"}, {"score": 0.004109770306454165, "phrase": "local_and_global_gaussian_distributions"}, {"score": 0.00308357048262018, "phrase": "modified_algorithm"}, {"score": 0.002806449337145999, "phrase": "time_step"}, {"score": 0.0027650234530228923, "phrase": "contour_evolution"}, {"score": 0.0025289662786567896, "phrase": "convergence_rate"}, {"score": 0.0023245146355917626, "phrase": "desired_objects"}, {"score": 0.002301572462091142, "phrase": "experiment_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Active contour model", " Image segmentation", " Gaussian distribution", " Level set method", " Chan-Vese model", " LBF model"], "paper_abstract": "In this paper, we propose an active contour model and its corresponding algorithms with detailed implementation for image segmentation. In the proposed model, the local and global region fitting energies are described by the combination of the local and global Gaussian distributions with different means and variances, respectively. In this combination, we increase a weighting coefficient by which we can adjust the ratio between the local and global region fitting energies. Then we present an algorithm for implementing the proposed model directly. Considering that, in practice, the selection of the weighting coefficient is troublesome, we present a modified algorithm in order to overcome this problem and increase the flexibility. By adaptively updating the weighting coefficient and the time step with the contour evolution, this algorithm is less sensitive to the initialization of the contour and can speed up the convergence rate. Besides, it is robust to the noise and can be used to extract the desired objects. Experiment results demonstrate that the proposed model and its algorithms are effective with application to both the synthetic and real-world images. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "An active contour model and its algorithms with local and global Gaussian distribution fitting energies", "paper_id": "WOS:000331919400004"}