{"auto_keywords": [{"score": 0.049250789168149005, "phrase": "biological_networks"}, {"score": 0.046844750455014995, "phrase": "important_components"}, {"score": 0.03808005742176963, "phrase": "network_structure"}, {"score": 0.028624140227865972, "phrase": "tamic"}, {"score": 0.015539831657690243, "phrase": "attack_robustness"}, {"score": 0.010255849244084618, "phrase": "targeted_components"}, {"score": 0.00481495049065317, "phrase": "regulatory_effects"}, {"score": 0.004386887374401584, "phrase": "present_study"}, {"score": 0.004236321075918639, "phrase": "mirna_targets"}, {"score": 0.004138813595009761, "phrase": "human_protein-protein_interaction_network"}, {"score": 0.004079009742218227, "phrase": "metabolic_network"}, {"score": 0.0038037169725424567, "phrase": "network_vertices"}, {"score": 0.003781629193080687, "phrase": "descending_order"}, {"score": 0.0036730923460000717, "phrase": "vertex_degrees"}, {"score": 0.0035469375686704207, "phrase": "current_study"}, {"score": 0.002817639725689939, "phrase": "\"mirna_count"}, {"score": 0.0026196042223068923, "phrase": "classical_centrality_measures"}, {"score": 0.002435453488008121, "phrase": "betweenness_centrality_measures"}, {"score": 0.002351705899181029, "phrase": "eigenvector_centrality_measures"}, {"score": 0.002224942603922241, "phrase": "biological_knowledge"}, {"score": 0.002186346373382786, "phrase": "important_network_components"}, {"score": 0.0021672995161145276, "phrase": "mirna_regulation"}, {"score": 0.002154693685426657, "phrase": "network_robustness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Attack robustness", " Vulnerability", " Centrality measures", " Biological networks"], "paper_abstract": "It has been previously suggested that microRNAs (miRNAs) have a tendency to regulate the important components of biological networks. The goal of the present study was to systematically test if one can establish a relationship between miRNA targets and the important components of biological networks (including human protein-protein interaction network, signaling network and metabolic network). For this analysis, we have studied the attack robustness of these networks. It has been previously shown that deletion of network vertices in descending order of their importance (e.g., in decreasing order of vertex degrees) can affect the network structure much more considerably. In the current study, we introduced three miRNA-based measures of importance: \"miRNA count\" (i.e., the number of miRNAs that regulate a given network component); average adjacent miRNA count, \"AAmiC\" (i.e., the average number of miRNAs regulating the targeted components adjacent to a given component); and total adjacent miRNA count, \"TAmiC\" (i.e., the total number of miRNAs regulating the targeted components adjacent to a given component). Our results suggest that \"miRNA count\" is only marginally capable of locating the important components of the networks, while TAmiC was the most relevant measure. By comparing TAmiC with the classical centrality measures (which are solely based on the network structure) when simultaneously removing vertices, we show that this measure is correlated to degree and betweenness centrality measures, while its performance is generally better than that of closeness and eigenvector centrality measures. The results of this study suggest that TAmiC which represents a measure based on both network structure and biological knowledge, can successfully determine the important network components indicating that miRNA regulation and network robustness are related. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Evidence for the relationship between the regulatory effects of microRNAs and attack robustness of biological networks", "paper_id": "WOS:000358269300010"}