{"auto_keywords": [{"score": 0.03820142189580796, "phrase": "discrete_attributes"}, {"score": 0.00481495049065317, "phrase": "mixed_attributes"}, {"score": 0.004545240514015278, "phrase": "recursive_algorithm"}, {"score": 0.004458722048888919, "phrase": "classification_rules"}, {"score": 0.004401955895933783, "phrase": "feedforward_neural_networks"}, {"score": 0.004155283263388382, "phrase": "data_sets"}, {"score": 0.0037743802306714545, "phrase": "extracted_rules"}, {"score": 0.003494866798828308, "phrase": "continuous_attributes"}, {"score": 0.003362944428837724, "phrase": "first_generating_rules"}, {"score": 0.003215295260684715, "phrase": "classification_process"}, {"score": 0.0026184796288543878, "phrase": "rule_condition"}], "paper_keywords": ["continuous attributes", " credit scoring", " discrete attributes", " rule extraction"], "paper_abstract": "In this paper, we present a recursive algorithm for extracting classification rules from feedforward neural networks (NNs) that have been trained on data sets having both discrete and continuous attributes. The novelty of this algorithm lies in the conditions of the extracted rules: the rule conditions involving discrete attributes are disjoint from those involving continuous attributes. The algorithm starts by first generating rules with discrete attributes only to explain the classification process of the NN. If the accuracy of a rule with only discrete attributes is not satisfactory, the algorithm refines this rule by recursively generating more rules with discrete attributes not already present in the rule condition, or by generating a hyperplane involving only the continuous attributes. We show that for three real-life credit scoring data sets, the algorithm generates rules that are not only more accurate but also more comprehensible than those generated by other NN rule extraction methods.", "paper_title": "Recursive neural network rule extraction for data with mixed attributes", "paper_id": "WOS:000253272100008"}