{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "construction_sites"}, {"score": 0.004268780663872836, "phrase": "unordered_photo_collections"}, {"score": 0.0029573932605287947, "phrase": "project_manager"}, {"score": 0.002925149105307855, "phrase": "facility_owner"}, {"score": 0.0028460640294160383, "phrase": "construction_site"}, {"score": 0.0025786066704445304, "phrase": "photorealistic_architectural_visualizations"}, {"score": 0.0024815011359381692, "phrase": "automatic_reasoning"}, {"score": 0.0024143815950383647, "phrase": "static_and_dynamic_occlusions"}, {"score": 0.002349073225500705, "phrase": "rendering_information"}, {"score": 0.002285527382381719, "phrase": "semantic_selection_tools"}, {"score": 0.0022482261385133617, "phrase": "user_input"}, {"score": 0.0021049977753042253, "phrase": "real-world_construction_data"}], "paper_keywords": ["architectural visualization", " progress monitoring", " image-based rendering", " structure from motion", " augmented reality"], "paper_abstract": "We describe a set of tools for analyzing, visualizing, and assessing architectural/construction progress with unordered photo collections and 3D building models. With our interface, a user guides the registration of the model in one of the images, and our system automatically computes the alignment for the rest of the photos using a novel Structure-from-Motion (SfM) technique; images with nearby viewpoints are also brought into alignment with each other. After aligning the photo(s) and model(s), our system allows a user, such as a project manager or facility owner, to explore the construction site seamlessly in time, monitor the progress of construction, assess errors and deviations, and create photorealistic architectural visualizations. These interactions are facilitated by automatic reasoning performed by our system: static and dynamic occlusions are removed automatically, rendering information is collected, and semantic selection tools help guide user input. We also demonstrate that our user-assisted SfM method outperforms existing techniques on both real-world construction data and established multi-view datasets.", "paper_title": "ConstructAide: Analyzing and Visualizing Construction Sites through Photographs and Building Models", "paper_id": "WOS:000345855600005"}