{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "trust_models"}, {"score": 0.0047910471257663805, "phrase": "agent_simulations"}, {"score": 0.004513255056769647, "phrase": "trust_modeling"}, {"score": 0.004424268136268051, "phrase": "agent's_decision"}, {"score": 0.004024863549087511, "phrase": "different_conditions"}, {"score": 0.003975056840766793, "phrase": "different_types"}, {"score": 0.0037257904871180305, "phrase": "sudden_changes"}, {"score": 0.0036741933501389604, "phrase": "agent_systems"}, {"score": 0.0036160578937825295, "phrase": "complete_way"}, {"score": 0.0035802007154988632, "phrase": "best_trust_model"}, {"score": 0.0034146585649631692, "phrase": "new_way"}, {"score": 0.003281186608301359, "phrase": "right_equilibrium"}, {"score": 0.0032405527786547915, "phrase": "multiagent_system"}, {"score": 0.003037204977663065, "phrase": "worst_agent"}, {"score": 0.00286795254228461, "phrase": "interesting_feature"}, {"score": 0.002846581005366559, "phrase": "trust_model"}, {"score": 0.002797329638474873, "phrase": "evolutionary-inspired_approach"}, {"score": 0.00253808496152038, "phrase": "agents_ability"}, {"score": 0.002349228457383314, "phrase": "new_evaluation_method"}, {"score": 0.0023085623309707535, "phrase": "art_competition"}, {"score": 0.0022856406631396537, "phrase": "additional_information"}, {"score": 0.0021474369836979048, "phrase": "art_domain"}, {"score": 0.0021049977753042253, "phrase": "evolutionary_approach"}], "paper_keywords": ["Trust models", " autonomous agents", " evolutionary game theory"], "paper_abstract": "In many dynamic open systems, agents have to interact with one another to achieve their goals. These interactions pose challenges in relation to the trust modeling of agents which aim to facilitate an agent's decision making regarding the uncertainty of the behaviour of its peers. A lot of literature has focused on describing trust models, but less on evaluating and comparing them. The most extensive way to evaluate trust models is executing simulations with different conditions and a given combination of different types of agents (honest, altruist, etc.). Trust models are then compared according to efficiency, speed of convergence, adaptability to sudden changes, etc. Our opinion is that such evaluation measures do not represent a complete way to determine the best trust model, since they do not include testing which one is evolutionarily stable. Our contribution is the definition of a new way to compare trust models observing their ability to become dominant. It consists of finding out the right equilibrium of trust models in a multiagent system that is evolutionarily stable, and then observing which agent became dominant. We propose a sequence of simulations where evolution is implemented assuming that the worst agent in a simulation would replace its trust model with the best one in such simulation. Therefore the ability to become dominant could be an interesting feature for any trust model. Testing this ability through this evolutionary-inspired approach is then useful to compare and evaluate trust models in agent systems. Specifically we have applied our evaluation method to the Agent Reputation and Trust competitions held at 2006, 2007 and 2008 AAMAS conferences. We observe then that the resulting ranking of comparing the agents ability of becoming dominant is different from the official one where the winner was decided running a game with a representative of all participants several times. Since it is a new evaluation method that, as our application to the ART competition showed, gives additional information on the quality of trust models, it would improve the way they are compared. The application of our proposal is not restricted to the ART domain, we suggest that this kind of evolutionary approach has to be taken into account in any evaluation of trust models in agent systems.", "paper_title": "Evolutionary-inspired approach to compare trust models in agent simulations", "paper_id": "WOS:000358733300004"}