{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coupled_field_formulations"}, {"score": 0.02800366786508098, "phrase": "electrical_machinery"}, {"score": 0.005272230863561286, "phrase": "coupled-field_formulation"}, {"score": 0.004747141873785, "phrase": "purpose_-_this_paper"}, {"score": 0.0043289723873340255, "phrase": "selective_bibliography"}, {"score": 0.004298367681427065, "phrase": "practical_examples"}, {"score": 0.004237803085579238, "phrase": "postgraduate_students"}, {"score": 0.003961526165403768, "phrase": "recent_trends"}, {"score": 0.003796355951305572, "phrase": "non-destructive_testing"}, {"score": 0.003258871417680268, "phrase": "landmark_papers"}, {"score": 0.003212906206685004, "phrase": "practical_engineering_case_studies"}, {"score": 0.0031563574387360465, "phrase": "wide_applicability"}, {"score": 0.0027873491386063913, "phrase": "detailed_description"}, {"score": 0.002728557856380231, "phrase": "coupled_field_formulation_method"}, {"score": 0.0026333078412549807, "phrase": "different_electrical_machines"}, {"score": 0.0024877583128884457, "phrase": "application_examples"}, {"score": 0.002333586381274878, "phrase": "rotational_machines"}, {"score": 0.0023006418600072325, "phrase": "reference_data"}, {"score": 0.002120018771276572, "phrase": "ongoing_research"}, {"score": 0.0021049977753042253, "phrase": "coupled_problems"}], "paper_keywords": ["finite element analysis", " coupled analysis", " electrical machinery"], "paper_abstract": "Purpose - This paper aims to give a perspective about the variety of techniques which are available and are being further developed in the area of coupled field formulations, with selective bibliography and practical examples, to help postgraduate students, researchers and designers working in design or analysis of electrical machinery. Design/methodology/approach - This paper reviews the recent trends in coupled field formulations. The use of these formulations for designing and non-destructive testing of electrical machinery is described, followed by their classifications, solutions and applications. Their advantages and shortcomings are discussed. Findings - The paper gives an over-view of research, development and applications of coupled field formulations for electrical machinery based on more than 160 references. All landmark papers are classified. Practical engineering case studies are given which illustrate wide applicability of coupled field formulations. Research limitations/implications - Problems which continue to pose challenges to researchers are enumerated and the advantages of using the coupled-field formulation are pointed out. Practical implications - This paper gives a detailed description of the application of the coupled field formulation method to the analysis of problems that are present in different electrical machines. Examples of analysis of generators and transformers with this formulation are presented. The application examples give guidelines for its use in other analyses. Originality/value - The coupled-field formulation is used in the analysis of rotational machines and transformers where reference data are available and comparisons with other methods are performed and the advantages are justified. This paper serves as a guide for the ongoing research on coupled problems in electrical machinery.", "paper_title": "Applications of coupled field formulations to electrical machinery", "paper_id": "WOS:000246638700025"}