{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "electronic_patient_record"}, {"score": 0.004752873752686246, "phrase": "trans-institutional_networks"}, {"score": 0.004611108249179507, "phrase": "tight_control"}, {"score": 0.004210576688291019, "phrase": "small_community_care_network"}, {"score": 0.004120435930514554, "phrase": "clinical_information"}, {"score": 0.003962998498942111, "phrase": "therapeutic_relationship"}, {"score": 0.0036817833826578395, "phrase": "administrative_or_scientific_research_accesses"}, {"score": 0.003525744120930142, "phrase": "challenging_goal"}, {"score": 0.003480230347985338, "phrase": "patient_privacy"}, {"score": 0.003450213580299164, "phrase": "regulatory_limits"}, {"score": 0.0032191849045822415, "phrase": "main_characteristics"}, {"score": 0.0030560920414081645, "phrase": "computerized_patient_record"}, {"score": 0.0026718978608934077, "phrase": "profession-specific_access_profiles"}, {"score": 0.0025036862991477437, "phrase": "clinical_information_system"}, {"score": 0.0022562464662197867, "phrase": "trans-institutional_computerized_patient_record"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["computerized patient record", " access policy", " privacy", " networked care"], "paper_abstract": "Background: A system ensuring tight control access is used since 5 years at the University Geneva Hospitals (HUG) over a four campuses health care system with ambulatory care settings behaving like a small community care network. Access to identified clinical information is limited to care providers that have a therapeutic relationship with the patient and to those data needed for that relation. The same policy applies to administrative or scientific research accesses. This paper presents how the HUG met the challenging goal of protecting patient privacy within regulatory limits while keeping the system operational in terms of use and management. Solution: The main characteristics of the system are: (a) an institution-wide policy for access rights to the computerized patient record; (b) an institutional management of the contracts of the collaborators; (c) access profiles based on application-independent, fine-grained access rights; (d) a decentralized attribution of profession-specific access profiles; (e) a complete, centralized log of all accesses to the clinical information system; and (f) a decentralized verification of the accesses. Many of these characteristics can be maintained when evolving towards a trans-institutional computerized patient record, but new constraints need to be taken into account. (C) 2006 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Comprehensive management of the access to the electronic patient record: Towards trans-institutional networks", "paper_id": "WOS:000246320500023"}