{"auto_keywords": [{"score": 0.032576110574299134, "phrase": "outdated_csi"}, {"score": 0.015380848847530496, "phrase": "wireless_multi-hop_networks"}, {"score": 0.014967362359141197, "phrase": "cross-layer_resource_allocation_problem"}, {"score": 0.013059921360536648, "phrase": "csi"}, {"score": 0.004814956926852061, "phrase": "cross-layer"}, {"score": 0.004658426838467567, "phrase": "outdated_channel_state_information"}, {"score": 0.004482207947724242, "phrase": "wmhns"}, {"score": 0.0040366412779632085, "phrase": "perfect_channel_state_information"}, {"score": 0.0038624981944755813, "phrase": "practical_settings"}, {"score": 0.003421245054271364, "phrase": "time-variant_channel"}, {"score": 0.0030470127429039497, "phrase": "channel_conditions"}, {"score": 0.0024434201175883674, "phrase": "power_control"}, {"score": 0.00240328454980006, "phrase": "channel_allocation"}, {"score": 0.002175913488493802, "phrase": "network_utility"}], "paper_keywords": ["Wireless multi-hop networks", " Outdated channel state information", " Cross-layer resource allocation", " Distributed algorithm"], "paper_abstract": "The cross-layer resource allocation problem in wireless multi-hop networks (WMHNs) has been extensively studied in the past few years. Most of these studies assume that every node has the perfect channel state information (CSI) of other nodes. In practical settings, however, the networks are generally dynamic and CSI usually becomes outdated when it is used, due to the time-variant channel and feedback delay. To deal with this issue, we study the cross-layer resource allocation problem in dynamic WMHNs with outdated CSI under channel conditions where there is correlation between the outdated CSI and current CSI. Two major contributions are made in this work: (1) a closed-form expression of conditional average capacity is derived under the signal-to-interference-plus-noise ratio (SINR) model; (2) a joint optimization problem of congestion control, power control, and channel allocation in the context of outdated CSI is formulated and solved in both centralized and distributed manners. Simulation results show that the network utility can be improved significantly using our proposed algorithm.", "paper_title": "Cross-layer resource allocation in wireless multi-hop networks with outdated channel state information", "paper_id": "WOS:000335724900002"}