{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "brain_metastasis"}, {"score": 0.049734762741514164, "phrase": "lung_cancer"}, {"score": 0.008589407257699291, "phrase": "bayesian_network"}, {"score": 0.008406194836300045, "phrase": "taiwan"}, {"score": 0.004915286112247926, "phrase": "proposed_bn"}, {"score": 0.004495922204117959, "phrase": "promising_method"}, {"score": 0.004447509888681154, "phrase": "cancer_metastasis"}, {"score": 0.004383819922692963, "phrase": "bn"}, {"score": 0.004305364955542171, "phrase": "bioinformatics_variables"}, {"score": 0.004137761530535196, "phrase": "probabilistic_reasoning"}, {"score": 0.0038356264368681107, "phrase": "nationwide_database"}, {"score": 0.0037806195039533355, "phrase": "cancer_patients"}, {"score": 0.0035942114996235803, "phrase": "bn_topology"}, {"score": 0.0032018141503341365, "phrase": "proposed_bn_model"}, {"score": 0.00307708097386834, "phrase": "bayes"}, {"score": 0.0028832306043717637, "phrase": "experimental_results"}, {"score": 0.0028418430688995247, "phrase": "significant_differences"}, {"score": 0.002643624979574088, "phrase": "sampled_average_sensitivity"}, {"score": 0.002337791830793841, "phrase": "non-linear_situations"}, {"score": 0.0022958971655679832, "phrase": "stochastic_medical_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bayesian network", " Brain metastasis", " Lung cancer"], "paper_abstract": "The Bayesian network (BN) is a promising method for modeling cancer metastasis under uncertainty. BN is graphically represented using bioinformatics variables and can be used to support an informative medical decision/observation by using probabilistic reasoning. In this study, we propose such a BN to describe and predict the occurrence of brain metastasis from lung cancer. A nationwide database containing more than 50,000 cases of cancer patients from 1996 to 2010 in Taiwan was used in this study. The BN topology for studying brain metastasis from lung cancer was rigorously examined by domain experts/doctors. We used three statistical measures, namely, the accuracy, sensitivity, and specificity, to evaluate the performances of the proposed BN model and to compare it with three competitive approaches, namely, naive Bayes (NB), logistic regression (LR) and support vector machine (SVM). Experimental results show that no significant differences are observed in accuracy or specificity among the four models, while the proposed BN outperforms the others in terms of sampled average sensitivity. Moreover the proposed BN has advantages compared with the other approaches in interpreting how brain metastasis develops from lung cancer. It is shown to be easily understood by physicians, to be efficient in modeling non-linear situations, capable of solving stochastic medical problems, and handling situations wherein information are missing in the context of the occurrence of brain metastasis from lung cancer. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Modeling and predicting the occurrence of brain metastasis from lung cancer by Bayesian network: A case study of Taiwan", "paper_id": "WOS:000347745500017"}