{"auto_keywords": [{"score": 0.030065087111219874, "phrase": "preprocessing_matrix"}, {"score": 0.00481495049065317, "phrase": "relay-aided_downlink_ds-cdma_system"}, {"score": 0.00368673793612343, "phrase": "based_estimation_technique"}, {"score": 0.0035382855372646164, "phrase": "estimated_cirs"}, {"score": 0.003292685392413911, "phrase": "base_station"}, {"score": 0.003209152260950748, "phrase": "feedback_channels"}, {"score": 0.002940626369102927, "phrase": "linear_detector"}, {"score": 0.0027789349951704177, "phrase": "dl_multi-user_interference"}, {"score": 0.0026532596852754525, "phrase": "attainable_bit-error-rate"}, {"score": 0.0026262136583931365, "phrase": "ber"}, {"score": 0.002357249810661667, "phrase": "resultant_ber_performance"}, {"score": 0.0023211517663846346, "phrase": "mutp"}, {"score": 0.002250601866422547, "phrase": "ideal_feedback"}, {"score": 0.0021709933368474223, "phrase": "perfect_cirs_assumption"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "In this contribution, we investigate the performance of relay-aided downlink (DL) direct sequence code division multiple access (DS-CDMA) system with multi-user transmitter preprocessing (MUTP) based on vector quantized channel impulse responses (VQ-CIRs). Specifically, the CIRs are estimated with the aid of training-sequence based estimation technique at each of the relays. These estimated CIRs are then VQ and the magnitudes and phases are fed back to the base station (BS) through feedback channels, that conflict noise and fading. At the BS, the CIRs recovered using a linear detector are then exploited to formulate the preprocessing matrix to mitigate the DL multi-user interference at the relays. Our study shows that the attainable bit-error-rate (BER) degrades when noise and fading contaminated VQ-CIRs are invoked to realize the preprocessing matrix. Nevertheless, the resultant BER performance of the MUTP based on VQ-CIRs acquired via ideal feedback remains close to that achieved with perfect CIRs assumption. (c) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Performance of relay-aided downlink DS-CDMA system using transmitter preprocessing based on feedback information", "paper_id": "WOS:000336700800025"}