{"auto_keywords": [{"score": 0.04520628298006752, "phrase": "perceived_risk"}, {"score": 0.009333459971790784, "phrase": "uniform_case"}, {"score": 0.008545952882702207, "phrase": "risk_function"}, {"score": 0.008207381299295347, "phrase": "preferential_case"}, {"score": 0.00481495049065317, "phrase": "epidemic_on_complex_networks_under_voluntary_vaccination_mechanism."}, {"score": 0.004623503587186056, "phrase": "voluntary_behavior"}, {"score": 0.004456044928556639, "phrase": "risk_functions"}, {"score": 0.003930581102447622, "phrase": "time_step"}, {"score": 0.003378385493203297, "phrase": "network_terminology"}, {"score": 0.0032800186243040663, "phrase": "immediate_neighbors"}, {"score": 0.0028821607224183135, "phrase": "susceptible_individuals"}, {"score": 0.002860938351029155, "phrase": "complex_network"}, {"score": 0.0026084451971464845, "phrase": "voluntary_vaccination_mechanism"}, {"score": 0.0021842976754894846, "phrase": "vaccination_options"}, {"score": 0.0021049977753042253, "phrase": "control_strategy"}], "paper_keywords": ["Spread of epidemic", " complex networks", " voluntary vaccination mechanism", " risk function", " cost function"], "paper_abstract": "Under the assumption that the decision of vaccination is a voluntary behavior, in this paper, we use two forms of risk functions to characterize how susceptible individuals estimate the perceived risk of infection. One is uniform case, where each susceptible individual estimates the perceived risk of infection only based on the density of infection at each time step, so the risk function is only a function of the density of infection; another is preferential case, where each susceptible individual estimates the perceived risk of infection not only based on the density of infection but only related to its own activities/immediate neighbors (in network terminology, the activity or the number of immediate neighbors is the degree of node), so the risk function is a function of the density of infection and the degree of individuals. By investigating two different ways of estimating the risk of infection for susceptible individuals on complex network, we find that, for the preferential case, the spread of epidemic can be effectively controlled; yet, for the uniform case, voluntary vaccination mechanism is almost invalid in controlling the spread of epidemic on networks. Furthermore, given the temporality of some vaccines, the waves of epidemic for two cases are also different. Therefore, our work insight that the way of estimating the perceived risk of infection determines the decision on vaccination options, and then determines the success or failure of control strategy.", "paper_title": "SPREAD OF EPIDEMIC ON COMPLEX NETWORKS UNDER VOLUNTARY VACCINATION MECHANISM", "paper_id": "WOS:000282814400008"}