{"auto_keywords": [{"score": 0.041286674428067535, "phrase": "wordnet"}, {"score": 0.011271814236944414, "phrase": "semantic_classes"}, {"score": 0.011085503517725567, "phrase": "word_senses"}, {"score": 0.00481495049065317, "phrase": "class-basedword_sense_disambiguation"}, {"score": 0.004675652357253327, "phrase": "word_sense_disambiguation"}, {"score": 0.00446481608187988, "phrase": "appropriate_meaning"}, {"score": 0.004054071599735255, "phrase": "inappropriate_sets"}, {"score": 0.004020185355794902, "phrase": "word_meanings"}, {"score": 0.003838791650587681, "phrase": "de-facto_standard_repository"}, {"score": 0.003191207814294487, "phrase": "wsd"}, {"score": 0.0029587924529332695, "phrase": "appropriate_level"}, {"score": 0.0026862220320327613, "phrase": "simple_method"}, {"score": 0.0026193328696791306, "phrase": "intermediate_levels"}, {"score": 0.002564862727498502, "phrase": "nominal_and_verbal_wordnet_meanings"}, {"score": 0.002270495425498003, "phrase": "new_semantic_classes"}, {"score": 0.0022514836269627186, "phrase": "additional_semantic_features"}, {"score": 0.0021953959824690316, "phrase": "training_examples"}], "paper_keywords": [""], "paper_abstract": "As empirically demonstrated by the Word Sense Disambiguation (WSD) tasks of the last SensEval/SemEval exercises, assigning the appropriate meaning to words in context has resisted all attempts to be successfully addressed. Many authors argue that one possible reason could be the use of inappropriate sets of word meanings. In particular, WordNet has been used as a de-facto standard repository of word meanings in most of these tasks. Thus, instead of using the word senses defined in WordNet, some approaches have derived semantic classes representing groups of word senses. However, the meanings represented by WordNet have been only used for WSD at a very fine-grained sense level or at a very coarse-grained semantic class level (also called SuperSenses). We suspect that an appropriate level of abstraction could be on between both levels. The contributions of this paper are manifold. First, we propose a simple method to automatically derive semantic classes at intermediate levels of abstraction covering all nominal and verbal WordNet meanings. Second, we empirically demonstrate that our automatically derived semantic classes outperform classical approaches based on word senses and more coarse-grained sense groupings. Third, we also demonstrate that our supervised WSD system benefits from using these new semantic classes as additional semantic features while reducing the amount of training examples. Finally, we also demonstrate the robustness of our supervised semantic class-based WSD system when tested on out of domain corpus.", "paper_title": "Word vs. Class-BasedWord Sense Disambiguation", "paper_id": "WOS:000365177800002"}