{"auto_keywords": [{"score": 0.03846839440817044, "phrase": "porrill_et_al"}, {"score": 0.012264616935202304, "phrase": "motor_apparatus"}, {"score": 0.00481495049065317, "phrase": "different_classes"}, {"score": 0.004791811869926821, "phrase": "sensorimotor_disturbance"}, {"score": 0.004768783910822113, "phrase": "cerebellar-based_motor_learning_models"}, {"score": 0.004666513535995737, "phrase": "motor_control"}, {"score": 0.004490060573956286, "phrase": "cerebellar_cortex"}, {"score": 0.004299479221533447, "phrase": "computational_significance"}, {"score": 0.004067635935640407, "phrase": "motor_adaptation"}, {"score": 0.003923185365210385, "phrase": "purely_feedforward_pathway"}, {"score": 0.003848246150510134, "phrase": "outgoing_motor_command"}, {"score": 0.0037747329719046174, "phrase": "inverse_model"}, {"score": 0.0037026188983126807, "phrase": "accurate_control"}, {"score": 0.0033218213825698417, "phrase": "potential_importance"}, {"score": 0.003297869502310498, "phrase": "recurrent_connections"}, {"score": 0.003266201217790818, "phrase": "alternative_architecture"}, {"score": 0.003196051444042582, "phrase": "recurrent_loop"}, {"score": 0.0031806677046452643, "phrase": "brainstem_control_circuitry"}, {"score": 0.0031274035833959526, "phrase": "feedforward_connections"}, {"score": 0.0030381542775851206, "phrase": "forward_model"}, {"score": 0.0030017207229983385, "phrase": "accurate_motor_commands"}, {"score": 0.0027719452656588795, "phrase": "motor_system"}, {"score": 0.0026993200077803075, "phrase": "motor_command"}, {"score": 0.0026798445839024145, "phrase": "observed_outcome"}, {"score": 0.002609626058929466, "phrase": "desired_outcome"}, {"score": 0.002590796090108595, "phrase": "computational_distinction"}, {"score": 0.0024097920845706795, "phrase": "feedforward_architecture"}, {"score": 0.0023694065215394593, "phrase": "stimulus-desired_outcome"}, {"score": 0.002274116256124247, "phrase": "motor_command-outcome"}, {"score": 0.0021512518168638074, "phrase": "vestibulo-ocular_reflex"}], "paper_keywords": ["Cerebellum", " Motor adaptation", " VOR", " Kinematics"], "paper_abstract": "The exact role of the cerebellum in motor control and learning is not yet fully understood. The structure, connectivity and plasticity within cerebellar cortex has been extensively studied, but the patterns of connectivity and interaction with other brain structures, and the computational significance of these patterns, is less well known and a matter of debate. Two contrasting models of the role of the cerebellum in motor adaptation have previously been proposed. Most commonly, the cerebellum is employed in a purely feedforward pathway, with its output contributing directly to the outgoing motor command. The cerebellum must then learn an inverse model of the motor apparatus in order to achieve accurate control. More recently, Porrill et al. (Proc Biol Sci 271(1541):789-796, 2004) and Porrill et al. (PLoS Comput Biol 3:1935-1950, 2007a) and Porrill et al. (Neural Comput 19(1), 170-193, 2007b) have highlighted the potential importance of these recurrent connections by proposing an alternative architecture in which the cerebellum is embedded in a recurrent loop with brainstem control circuitry. In this framework, the feedforward connections are not necessary at all. The cerebellum must learn a forward model of the motor apparatus for accurate motor commands to be generated. We show here how these two models exhibit contrasting yet complimentary learning capabilities. Central to the differences in performance between architectures is that there are two distinct kinds of disturbance to which a motor system may need to adapt (1) changes in the relationship between the motor command and the observed outcome and (2) changes in the relationship between the stimulus and the desired outcome. The computational distinction between these two kinds of transformation is subtle and has therefore often been overlooked. However, the implications for learning turn out to be significant: learning with a feedforward architecture is robust following changes in the stimulus-desired outcome mapping but not necessarily the motor command-outcome mapping, while learning with a recurrent architecture is robust under changes in the motor command-outcome mapping but not necessarily the stimulus-desired outcome mapping. We first analyse these differences theoretically and through simulations in the vestibulo-ocular reflex (VOR), then illustrate how these same concepts apply more generally with a model of reaching movements.", "paper_title": "Implications of different classes of sensorimotor disturbance for cerebellar-based motor learning models", "paper_id": "WOS:000263486700008"}