{"auto_keywords": [{"score": 0.04407953898448545, "phrase": "sample_size"}, {"score": 0.014092301643301393, "phrase": "correlation_structure"}, {"score": 0.008263118599807199, "phrase": "poisson_regression_model"}, {"score": 0.004815389314460338, "phrase": "poisson"}, {"score": 0.0047784273577245505, "phrase": "zero-inflated_poisson_regression_models"}, {"score": 0.004262539473250432, "phrase": "explanatory_covariates"}, {"score": 0.00405658135587089, "phrase": "wald_test"}, {"score": 0.003802135020791801, "phrase": "multivariate_normal_distribution"}, {"score": 0.003659954070354848, "phrase": "pre-specified_correlation_structure"}, {"score": 0.0035096666710980108, "phrase": "different_values"}, {"score": 0.003047865053078826, "phrase": "discrete_approximation"}, {"score": 0.003013191092393344, "phrase": "normal_distribution"}, {"score": 0.002922637921202474, "phrase": "higher_dimensions"}, {"score": 0.002900426826591769, "phrase": "monte_carlo_simulations"}, {"score": 0.0027079507175554857, "phrase": "exchangeable_correlation_matrix"}, {"score": 0.0021952683716334478, "phrase": "zero-inflated_poisson_regression_model"}, {"score": 0.0021537671245615286, "phrase": "analogous_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wald test", " Generalized linear models", " Correlation structure", " AR(1)", " Exchangeable", " Monte Carlo simulations"], "paper_abstract": "Although sample size calculations for testing a parameter in the Poisson regression model have been previously done, very little attention has been given to the effect of the correlation structure of the explanatory covariates on the sample size. A method to calculate the sample size for the Wald test in the Poisson regression model is proposed, assuming that the covariates may be correlated and have a multivariate normal distribution. Although this method of calculation works with any pre-specified correlation structure, the exchangeable and the AR(1) correlation matrices with different values for the correlation are used to illustrate the approach. The method used here to calculate the sample size is based on a modification of a methodology already proposed in the literature. Rather than using a discrete approximation to the normal distribution which may be much more problematic in higher dimensions, Monte Carlo simulations are used. It is observed that the sample size depends on the number of covariates for the exchangeable correlation matrix, but much more so on the correlation structure of the covariates. The sample size for the AR(1) correlation matrix changes less substantially as the dimension increases, and it also depends on the correlation structure of the covariates, but to a much lesser extent. The methodology is also extended to the case of the zero-inflated Poisson regression model in order to obtain analogous results. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Power and sample size calculations for Poisson and zero-inflated Poisson regression models", "paper_id": "WOS:000330147000017"}