{"auto_keywords": [{"score": 0.04954756810706401, "phrase": "nurses'_situation_awareness"}, {"score": 0.014337503047160633, "phrase": "sa"}, {"score": 0.00481495049065317, "phrase": "integrated_displays"}, {"score": 0.004726184966910756, "phrase": "objective_fatal_errors"}, {"score": 0.00465634671242413, "phrase": "intensive_care_units"}, {"score": 0.004519736937243476, "phrase": "information_integration"}, {"score": 0.0036553070575015344, "phrase": "nurses'_sa._materials"}, {"score": 0.003614678418617691, "phrase": "systematic_observations_methods"}, {"score": 0.0034309482755326016, "phrase": "concept_mapping"}, {"score": 0.003367611042980526, "phrase": "observed_tasks"}, {"score": 0.0031845067058084583, "phrase": "sa_level"}, {"score": 0.003102488033561956, "phrase": "research_team"}, {"score": 0.0030113280682863234, "phrase": "information_displays"}, {"score": 0.0029447150254434842, "phrase": "information_deficits"}, {"score": 0.0029228387900175554, "phrase": "results_nurses"}, {"score": 0.002603758927691463, "phrase": "multiple_monitoring_devices"}, {"score": 0.0025844090835070986, "phrase": "current_devices"}, {"score": 0.0025556529150386168, "phrase": "icu_bedside"}, {"score": 0.002499094513009327, "phrase": "nurse's_information-gathering_activities"}, {"score": 0.0024075916292945715, "phrase": "discussion_information_gaps"}, {"score": 0.002259642580775186, "phrase": "theoretical_model"}, {"score": 0.002234491924392104, "phrase": "information_gaps"}, {"score": 0.002193193339812606, "phrase": "functional_requirements"}, {"score": 0.002176887956041267, "phrase": "conclusion_integrated_information"}, {"score": 0.0021049977753042253, "phrase": "patient_safety"}], "paper_keywords": [""], "paper_abstract": "Objective Fatal errors can occur in intensive care units (ICUs). Researchers claim that information integration at the bedside may improve nurses' situation awareness (SA) of patients and decrease errors. However, it is unclear which information should be integrated and in what form. Our research uses the theory of SA to analyze the type of tasks, and their associated information gaps. We aimed to provide recommendations for integrated, consolidated information displays to improve nurses' SA. Materials and Methods Systematic observations methods were used to follow 19 ICU nurses for 38 hours in 3 clinical practice settings. Storyboard methods and concept mapping helped to categorize the observed tasks, the associated information needs, and the information gaps of the most frequent tasks by SA level. Consensus and discussion of the research team was used to propose recommendations to improve information displays at the bedside based on information deficits. Results Nurses performed 46 different tasks at a rate of 23.4 tasks per hour. The information needed to perform the most common tasks was often inaccessible, difficult to see at a distance or located on multiple monitoring devices. Current devices at the ICU bedside do not adequately support a nurse's information-gathering activities. Medication management was the most frequent category of tasks. Discussion Information gaps were present at all levels of SA and across most of the tasks. Using a theoretical model to understand information gaps can aid in designing functional requirements. Conclusion Integrated information that enhances nurses' Situation Awareness may decrease errors and improve patient safety in the future.", "paper_title": "Intensive care unit nurses' information needs and recommendations for integrated displays to improve nurses' situation awareness", "paper_id": "WOS:000306024100017"}