{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "topological_relations"}, {"score": 0.022313961537886114, "phrase": "spatial_objects"}, {"score": 0.009267792934210062, "phrase": "simple_regions"}, {"score": 0.004559661374976129, "phrase": "important_aspect"}, {"score": 0.004518442937844318, "phrase": "spatial_representation"}, {"score": 0.0041074234667687875, "phrase": "connected_boundary"}, {"score": 0.003649869387240531, "phrase": "italy"}, {"score": 0.0034717929086014636, "phrase": "existing_formalisms"}, {"score": 0.0031845067058084583, "phrase": "general_regions"}, {"score": 0.0030847461428168614, "phrase": "non-empty_proper_regular_closed_subset"}, {"score": 0.0030432103937426684, "phrase": "euclidean"}, {"score": 0.0029610472910087176, "phrase": "complete_classification"}, {"score": 0.0029076695661972114, "phrase": "plane_regions"}, {"score": 0.002855251306715901, "phrase": "possible_relation"}, {"score": 0.002753224894944965, "phrase": "topological_constraints"}], "paper_keywords": ["qualitative spatial reasoning", " geographic information science", " topological relation", " 9-intersection method"], "paper_abstract": "Formalization of topological relations between spatial objects is an important aspect of spatial representation and reasoning. The well-known 9-Intersection Method (9IM) was previously used to characterize topological relations between simple regions, i.e. regions with connected boundary and exterior. This simplified abstraction of spatial objects as simple regions cannot model the variety and complexity of spatial objects. For example, countries like Italy may contain islands and holes. It is necessary that existing formalisms, 9IM in particular, cover this variety and complexity. This paper generalizes 9IM to cope with general regions, where a (general) region is a non-empty proper regular closed subset of the Euclidean plane. We give a complete classification of topological relations between plane regions. For each possible relation we either show that it violates some topological constraints and hence is non-realizable or find two plane regions it relates. Altogether 43 (out of 512) relations are identified as realizable. Among these, five can be realized only between exotic (plane) regions, where a region is exotic if there is another region that has the same boundary but is not its complement. For all the remaining 38 relations, we construct configurations by using sums, differences and complements of discs.", "paper_title": "A complete classification of topological relations using the 9-intersection method", "paper_id": "WOS:000238201300001"}