{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "age_progression"}, {"score": 0.0392651775812754, "phrase": "face_images"}, {"score": 0.004684157900507474, "phrase": "considerable_amounts"}, {"score": 0.004506968388996092, "phrase": "face_recognition_systems"}, {"score": 0.004103942174451674, "phrase": "facial_aging_effects"}, {"score": 0.0031845067058084583, "phrase": "bayesian_age_difference_classifier"}, {"score": 0.003030247482854539, "phrase": "age_differences"}, {"score": 0.0029805015010906013, "phrase": "face_verification"}, {"score": 0.002470547930651519, "phrase": "experimental_results"}, {"score": 0.0024299678474208023, "phrase": "database_comprising"}, {"score": 0.0022122603123901114, "phrase": "verification_system"}, {"score": 0.0021049977753042253, "phrase": "equal_error_rate"}], "paper_keywords": ["age progression", " face recognition", " face verification", " probabilistic eigenspaces", " similarity measure"], "paper_abstract": "Human faces undergo considerable amounts of variations with aging. While face recognition systems have been proven to be sensitive to factors such as illumination and pose, their sensitivity to facial aging effects is yet to be studied. How does age progression affect the similarity between a pair of face images of an individual? What is the confidence associated with establishing the identity between a pair of age separated face images? In this paper, we develop a Bayesian age difference classifier that classifies face images of individuals based on age differences and performs face verification across age progression. Further, we study the similarity of faces across age progression. Since age separated face images invariably differ in illumination and pose, we propose preprocessing methods for minimizing such variations. Experimental results using a database comprising of pairs of face images that were retrieved from the passports of 465 individuals are presented. The verification system for faces separated by as many as nine years, attains an equal error rate of 8.5%.", "paper_title": "Face verification across age progression", "paper_id": "WOS:000241391100009"}