{"auto_keywords": [{"score": 0.03895639762446665, "phrase": "wireless_communications"}, {"score": 0.037100252287883946, "phrase": "pda"}, {"score": 0.0368869729935726, "phrase": "mobile_phone"}, {"score": 0.03615152752006831, "phrase": "medical_device"}, {"score": 0.03563487116084962, "phrase": "mobile_device"}, {"score": 0.00481495049065317, "phrase": "mobile_device_application"}, {"score": 0.004646258518859209, "phrase": "muscular_activity"}, {"score": 0.004618720776729413, "phrase": "different_environments"}, {"score": 0.004483450050677258, "phrase": "training_session"}, {"score": 0.004313477880211006, "phrase": "specific_actions"}, {"score": 0.004162281538812753, "phrase": "incorrect_posture"}, {"score": 0.003898665270269876, "phrase": "muscular_condition"}, {"score": 0.0038069853794502353, "phrase": "comfortable_and_simple_way"}, {"score": 0.003587073648802551, "phrase": "medical_portable_equipment"}, {"score": 0.003481911583035097, "phrase": "wireless_interface"}, {"score": 0.0032709661258673206, "phrase": "electromyographic_signals"}, {"score": 0.003232254571848865, "phrase": "medical_equipment"}, {"score": 0.0031750418391373035, "phrase": "specific_protocol"}, {"score": 0.002938560664857691, "phrase": "offline_mode"}, {"score": 0.0027522340188241446, "phrase": "online_way"}, {"score": 0.0026477194580630963, "phrase": "background_application"}, {"score": 0.002472412920623605, "phrase": "healthy_behaviours"}, {"score": 0.002142970278347126, "phrase": "preliminary_usability"}, {"score": 0.0021049977753042253, "phrase": "communication_performance_study"}], "paper_keywords": ["Wireless telemedicine", " Handheld devices", " Multimedia", " Health monitoring", " Electromyography", " Usability"], "paper_abstract": "Many muscular function assessments require the monitoring of muscular activity in different environments. This can happen in the gymnasium during a training session or while practising a sport; at work, where movements and specific actions are executed; at school, where the child adopts an incorrect posture, or even while we walk. In this paper, we propose a system to allow the assessment of the muscular condition in any of these environments in a comfortable and simple way for the patient and using the advances in wireless communications. Just a wireless biomonitor (we have used the ME6000 biomonitor, a medical portable equipment of very small dimensions) and one PDA or mobile phone with wireless interface are needed. The medical device is configured from the mobile device. Then, wireless communications are used to transmit online the electromyographic signals registered by the medical equipment to a mobile device. The specific protocol used by the medical device is implemented to carry out the communication. There are two ways to configure the system: offline and online. In offline mode, once all the information is received, it is sent to a server using a connection to the Internet instead of the online way, where this information is sent simultaneously. The server includes a background application to process the information in real-time with the aim to evaluate the function of the muscle during the exercise and to establish healthy behaviours for the patient. Then, this information can be consulted by the specialist and also by the client using the PDA or mobile phone to show the report. A prototype of this system has been developed and implemented. The system has been evaluated by a preliminary usability, reliability, feasibility and communication performance study.", "paper_title": "A mobile device application applied to low back disorders", "paper_id": "WOS:000264487500003"}