{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uncertain_data"}, {"score": 0.004633429997452688, "phrase": "general_terms"}, {"score": 0.004580314008293946, "phrase": "uncertain_relation"}, {"score": 0.004493130934067195, "phrase": "possible_certain_relations"}, {"score": 0.004307099985737249, "phrase": "alternative_values"}, {"score": 0.004241370886886689, "phrase": "rich_constraint_languages"}, {"score": 0.004176640648520877, "phrase": "possible_models"}, {"score": 0.004034572092608487, "phrase": "simple_and_intuitive_models"}, {"score": 0.0038973170902076707, "phrase": "complete_models"}, {"score": 0.003445906915464945, "phrase": "tuple-existence_constraints"}, {"score": 0.0031178024467857215, "phrase": "relational_operations"}, {"score": 0.0029428772818833166, "phrase": "different_models"}, {"score": 0.0029203055813347874, "phrase": "unique_representations"}, {"score": 0.0027670642397888494, "phrase": "complexity_results"}, {"score": 0.002662541169311738, "phrase": "next_problem"}, {"score": 0.0021049977753042253, "phrase": "insufficiently_expressive_model"}], "paper_keywords": ["Uncertain data", " Data modeling", " Uncertainty"], "paper_abstract": "In general terms, an uncertain relation encodes a set of possible certain relations. There are many ways to represent uncertainty, ranging from alternative values for attributes to rich constraint languages. Among the possible models for uncertain data, there is a tension between simple and intuitive models, which tend to be incomplete, and complete models, which tend to be nonintuitive and more complex than necessary for many applications. We present a space of models for representing uncertain data based on a variety of uncertainty constructs and tuple-existence constraints. We explore a number of properties and results for these models. We study completeness of the models, as well as closure under relational operations, and we give results relating closure and completeness. We then examine whether different models guarantee unique representations of uncertain data, and for those models that do not, we provide complexity results and algorithms for testing equivalence of representations. The next problem we consider is that of minimizing the size of representation of models, showing that minimizing the number of tuples also minimizes the size of constraints. We show that minimization is intractable in general and study the more restricted problem of maintaining minimality incrementally when performing operations. Finally, we present several results on the problem of approximating uncertain data in an insufficiently expressive model.", "paper_title": "Representing uncertain data: models, properties, and algorithms", "paper_id": "WOS:000270651600002"}