{"auto_keywords": [{"score": 0.03218425533660608, "phrase": "xnc"}, {"score": 0.014058623648388991, "phrase": "network_coding"}, {"score": 0.008713768289289523, "phrase": "inter-flow_network_coding"}, {"score": 0.008526267451918616, "phrase": "unicast_traffic"}, {"score": 0.00819284588639725, "phrase": "wireless_channel"}, {"score": 0.008045596776518674, "phrase": "different_flows"}, {"score": 0.00467677555573346, "phrase": "wireless_network_performance"}, {"score": 0.004396120480895021, "phrase": "shared_network_resources"}, {"score": 0.0040135756033094225, "phrase": "network_performance"}, {"score": 0.0038841330270679097, "phrase": "intermediate_node"}, {"score": 0.0038559375376635047, "phrase": "multiple_flows"}, {"score": 0.003624361893008392, "phrase": "multiple_transmissions"}, {"score": 0.0035849585026689573, "phrase": "traditional_way"}, {"score": 0.003320833167729157, "phrase": "encoding_packets"}, {"score": 0.0032253960472377356, "phrase": "wireless_mesh_networks"}, {"score": 0.0027876981671591202, "phrase": "reliable_links"}, {"score": 0.002737327060030586, "phrase": "lossy_links"}, {"score": 0.0022072611570187334, "phrase": "resource_competition"}, {"score": 0.002167355210897559, "phrase": "channel_unreliability_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Inter-flow network coding", " Wireless mesh networks", " Unicast traffic", " Broadcast channel", " Channel unreliability"], "paper_abstract": "Wireless network performance is much restricted by the unreliability of the wireless channel and the competition among different flows for the shared network resources such as the bandwidth. Network coding is a technique that exploits the broadcast of the wireless channel and can effectively address these two restrictions to improve network performance. For example, with network coding, an intermediate node of multiple flows can encode packets from these flows into one mixed packet and serve these flows using only one transmission instead of multiple transmissions in the traditional way, thus mitigating the competition among flows. Inter-flow network coding (XNC), as a form of network coding, considers encoding packets from different flows, and it can benefit wireless mesh networks (WMNs) with either reliable or lossy links. In this paper, we present a survey on XNC in WMNs for unicast traffic, with various design factors related to XNC being covered. Specifically, our survey considers two types of WMNs, one with reliable links and the other with lossy links, and we study how XNC can be effectively utilized in both two types of WMNs. In addition to the benefits of XNC, we also present in this survey some drawbacks of applying XNC in WMNs. With this paper, we believe that readers will have a more thorough understanding of XNC on how it effectively mitigates the resource competition among flows and the channel unreliability problem in WMNs. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A survey of inter-flow network coding in wireless mesh networks with unicast traffic", "paper_id": "WOS:000364436900047"}