{"auto_keywords": [{"score": 0.025969637420719855, "phrase": "feature_economy"}, {"score": 0.015505893263073018, "phrase": "consonant_inventories"}, {"score": 0.00481495049065317, "phrase": "co-occurrence_principles"}, {"score": 0.004597754207658615, "phrase": "speech_sounds"}, {"score": 0.004410629943506433, "phrase": "remarkable_patterns"}, {"score": 0.0035335154419206634, "phrase": "weighted_network"}, {"score": 0.0027913353347879507, "phrase": "constituent_consonants"}, {"score": 0.002714943351733626, "phrase": "real_languages"}, {"score": 0.0025802660239538353, "phrase": "strong_correlations"}, {"score": 0.002396179086883187, "phrase": "driving_force"}, {"score": 0.0023741093119014436, "phrase": "community_formation"}, {"score": 0.002225196379204285, "phrase": "theoretical_information_definition"}, {"score": 0.0021049977753042253, "phrase": "consonant_communities"}], "paper_keywords": ["consonants", " complex network", " community structure", " feature economy", " feature entropy"], "paper_abstract": "Speech sounds of the languages all over the world show remarkable patterns of co-occurrence. In this work, we attempt to automatically capture the patterns of co-occurrence of the consonants across languages and at the same time figure out the nature of the force leading to the emergence of such patterns. For this purpose we define a weighted network where the consonants are the nodes and an edge between two nodes (read consonants) signify their co-occurrence likelihood over the consonant inventories. Through this network we identify communities of consonants that essentially reflect their patterns of co-occurrence across languages. We test the goodness of the communities and observe that the constituent consonants frequently occur in such groups in real languages also. Interestingly, the consonants forming these communities reflect strong correlations in terms of their features, which indicate that the principle of feature economy acts as a driving force towards community formation. In order to measure the strength of this force we propose a theoretical information definition of feature economy and show that indeed the feature economy exhibited by the consonant communities are substantially better than that of those where the consonant inventories had evolved just by chance.", "paper_title": "Modeling the co-occurrence principles of the consonant inventories: A complex network approach", "paper_id": "WOS:000250954800011"}