{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lasagna-search"}, {"score": 0.00467855218490191, "phrase": "integrated_webtool"}, {"score": 0.0046118021635786315, "phrase": "transcription_factor"}, {"score": 0.003853251284913932, "phrase": "nucleotide_association"}, {"score": 0.003690527690610707, "phrase": "manual_tf_model_collection"}, {"score": 0.003637822529522622, "phrase": "promoter_sequence_retrieval"}, {"score": 0.0035858673522839407, "phrase": "search_results"}, {"score": 0.003361069456060196, "phrase": "gene_regulatory_network_inference"}, {"score": 0.0029740732099993706, "phrase": "target_genes"}, {"score": 0.0025568135952982345, "phrase": "automatic_promoter_retrieval"}, {"score": 0.002396371892825691, "phrase": "user-friendly_tool"}, {"score": 0.002166530105679438, "phrase": "important_changes"}, {"score": 0.0021049977753042253, "phrase": "initial_release"}], "paper_keywords": [""], "paper_abstract": "LASAGNA-Search 2.0 is an integrated webtool for transcription factor (TF) binding site search and visualization. The tool is based on the LASAGNA (Length-Aware Site Alignment Guided by Nucleotide Association) algorithm. It eliminates manual TF model collection and promoter sequence retrieval. Search results can be visualized locally or in the University of California Santa Cruz Genome Browser. Gene regulatory network inference based on the search results offers another way of visualization. A list of TFs and target genes is all a user needs to start using the tool. LASAGNA-Search 2.0 currently offers 1792 TF models and supports 15 species for automatic promoter retrieval and visualization in the University of California Santa Cruz Genome Browser. It is a user-friendly tool designed for non-bioinformaticians and is suitable for research and teaching. We describe important changes made since the initial release. Availability and implementation: LASAGNA-Search 2.0 is freely available without registration at http://biogrid.engr.uconn.edu/lasagna_search/.", "paper_title": "LASAGNA-Search 2.0: integrated transcription factor binding site search and visualization in a browser", "paper_id": "WOS:000339121900019"}