{"auto_keywords": [{"score": 0.04409969247376604, "phrase": "weber"}, {"score": 0.015628033110110403, "phrase": "prime-order_elliptic_curves"}, {"score": 0.012962061803163087, "phrase": "cm_method"}, {"score": 0.012441620807771682, "phrase": "prime-order_ecs"}, {"score": 0.011361530592916098, "phrase": "prime_order"}, {"score": 0.0101633062038265, "phrase": "weber_polynomials"}, {"score": 0.00822581263835366, "phrase": "alternative_class"}, {"score": 0.00481495049065317, "phrase": "efficient_generation"}, {"score": 0.004606479650820579, "phrase": "prime_field"}, {"score": 0.004593026186917992, "phrase": "fp"}, {"score": 0.004368142221528535, "phrase": "special_type"}, {"score": 0.004342430078306461, "phrase": "class_field_polynomials"}, {"score": 0.004241702540826927, "phrase": "hilbert"}, {"score": 0.004093453936415085, "phrase": "cm_discriminant_d."}, {"score": 0.0039276803200112695, "phrase": "elliptic_curves"}, {"score": 0.00387011040370557, "phrase": "prime_order_usingweber_polynomials"}, {"score": 0.0036697319652557363, "phrase": "necessary_transformations"}, {"score": 0.003531474887552889, "phrase": "first_one"}, {"score": 0.0031377955308198634, "phrase": "second_difficulty"}, {"score": 0.002914288956035066, "phrase": "efficient_methods"}, {"score": 0.002821044196775531, "phrase": "thorough_experimental_study"}, {"score": 0.0027146742941153443, "phrase": "extension_field"}, {"score": 0.002286781334850213, "phrase": "extensive_experimental_study"}, {"score": 0.0022005118194652704, "phrase": "aforementioned_weber_polynomials"}, {"score": 0.002155412043665635, "phrase": "time_efficiency"}, {"score": 0.0021363670305843403, "phrase": "cm_variant"}, {"score": 0.0021049977753042253, "phrase": "crucial_step"}], "paper_keywords": ["Public key cryptography", " Elliptic curve cryptosystems", " Complex multiplication", " Weber polynomials", " Prime order"], "paper_abstract": "We consider the generation of prime-order elliptic curves (ECs) over a prime field Fp using the Complex Multiplication (CM) method. A crucial step of this method is to compute the roots of a special type of class field polynomials with the most commonly used being the Hilbert and Weber ones. These polynomials are uniquely determined by the CM discriminant D. In this paper, we consider a variant of the CM method for constructing elliptic curves (ECs) of prime order usingWeber polynomials. In attempting to construct prime-order ECs using Weber polynomials, two difficulties arise (in addition to the necessary transformations of the roots of such polynomials to those of their Hilbert counterparts). The first one is that the requirement of prime order necessitates that D = 3 (mod 8), which gives Weber polynomials with degree three times larger than the degree of their corresponding Hilbert polynomials (a fact that could affect efficiency). The second difficulty is that these Weber polynomials do not have roots in F-p. In this work, we show how to overcome the above difficulties and provide efficient methods for generating ECs of prime order focusing on their support by a thorough experimental study. In particular, we show that such Weber polynomials have roots in the extension field F-p3 and present a set of transformations for mapping roots of Weber polynomials in F-p3 to roots of their corresponding Hilbert polynomials in F-p. We also show how an alternative class of polynomials, with degree equal to their corresponding Hilbert counterparts (and hence having roots in F-p), can be used in the CM method to generate prime-order ECs. We conduct an extensive experimental study comparing the efficiency of using this alternative class against the use of the aforementioned Weber polynomials. Finally, we investigate the time efficiency of the CM variant under four different implementations of a crucial step of the variant and demonstrate the superiority of two of them.", "paper_title": "On the Efficient Generation of Prime-Order Elliptic Curves", "paper_id": "WOS:000277178400005"}