{"auto_keywords": [{"score": 0.04409251033766783, "phrase": "conflict_graph"}, {"score": 0.040984823331088625, "phrase": "resolution_derivation"}, {"score": 0.00481495049065317, "phrase": "extremely_large_propositional_refutations"}, {"score": 0.004357927940322685, "phrase": "high_performance_propositional_satisfiability_solvers"}, {"score": 0.00398177607914381, "phrase": "new_clauses"}, {"score": 0.0037432199549135826, "phrase": "resolution_proofs"}, {"score": 0.0031244995579170465, "phrase": "automated_verification"}, {"score": 0.0029935730127943496, "phrase": "alternative_formats"}, {"score": 0.0026705669656375197, "phrase": "practical_system"}, {"score": 0.0026452734009203764, "phrase": "formal_verification"}, {"score": 0.0024513404432665153, "phrase": "reverse_unit_propagation"}, {"score": 0.0022824314760583834, "phrase": "conflict-clause_proofs"}, {"score": 0.002250089031154004, "phrase": "goldberg"}, {"score": 0.0022288148074657748, "phrase": "novikov"}, {"score": 0.0021659920594094407, "phrase": "conflict-clause_minimization"}], "paper_keywords": ["Propositional satisfiability", " Resolution refutations", " Space complexity", " Pseudo-unit propagation"], "paper_abstract": "The importance of producing a certificate of unsatisfiability is increasingly recognized for high performance propositional satisfiability solvers. The leading solvers develop a conflict graph as the basis for deriving (or \"learning\") new clauses. Extracting a resolution derivation from the conflict graph is theoretically straightforward, but resolution proofs can be extremely long. This paper reports on a tool that has verified proofs more than 1600 gigabytes long. Several other certificate formats have been proposed and studied, but the verifiers for these formats are beyond any hope of automated verification in their own rights. However, some of the alternative formats enjoy the advantages of being easy to produce proofs for, and reasonable in their space requirements. This paper reports progress on developing a practical system for formal verification of a more compact certificate format. Experimental comparisons are presented. A format called RUP (for Reverse Unit Propagation) is introduced and two implementations are evaluated. This method is an extension of conflict-clause proofs introduced by Goldberg and Novikov, and is compatible with conflict-clause minimization. Extracting a resolution derivation from other decidable theories is discussed briefly.", "paper_title": "Producing and verifying extremely large propositional refutations Have your cake and cat it too", "paper_id": "WOS:000311390900003"}