{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hereditary_p-helly_hypergraphs"}, {"score": 0.015112558962221922, "phrase": "vertices_v"}, {"score": 0.004490842671590769, "phrase": "nonempty_subsets"}, {"score": 0.004272724011826495, "phrase": "partial_hypergraph"}, {"score": 0.0039651694106206245, "phrase": "v'_subset"}, {"score": 0.003500812175550438, "phrase": "nonempty_intersections"}, {"score": 0.0031372369299648203, "phrase": "p_hyperedges"}, {"score": 0.0030600032877646263, "phrase": "common_vertex"}, {"score": 0.0026086775334428617, "phrase": "hereditary_p-helly"}, {"score": 0.00239657981537094, "phrase": "new_characterizations"}, {"score": 0.0023259039577313294, "phrase": "recognition_problems"}, {"score": 0.002168975681697056, "phrase": "existing_recognition_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Algorithms", " p-Helly hypergraphs", " Hereditary p-Helly hypergraphs"], "paper_abstract": "A hypergraph H is set of vertices V together with a collection of nonempty subsets of it, called the hyperedges of H. A partial hypergraph of R is a hypergraph whose hyperedges are all hyperedges of H, whereas for V' subset of V the subhypergraph (induced by V') is a hypergraph with vertices V' and having as hyperedges the subsets obtained as nonempty intersections of V' and each of the hyperedges of R. For p >= 1 say that R is p-intersecting when every subset formed by p hyperedges of R contain a common vertex. Say that H is p-Helly when every p-intersecting partial hypergraph I-C of R contains a vertex belonging to all the hyperedges of H'. A hypergraph is hereditary p-Helly when every (induced) subhypergraph of it is p-Helly. In this paper we describe new characterizations for hereditary p-Helly hypergraphs and discuss the recognition problems for both p-Helly and hereditary p-Helly hypergraphs. The proposed algorithms improve the complexity of the existing recognition algorithms. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Improved algorithms for recognizing p-Helly and hereditary p-Helly hypergraphs", "paper_id": "WOS:000260355400016"}