{"auto_keywords": [{"score": 0.04967710401179305, "phrase": "omega_networks"}, {"score": 0.00609541396058278, "phrase": "cgra"}, {"score": 0.00481495049065317, "phrase": "coarse-grained_reconfigurable_arrays"}, {"score": 0.004734448316824488, "phrase": "reconfigurable_computing_architectures"}, {"score": 0.004539005582217309, "phrase": "energy_savings"}, {"score": 0.004084829853870028, "phrase": "dynamic_compilation"}, {"score": 0.003982741546775355, "phrase": "application_portability"}, {"score": 0.003949280009382125, "phrase": "embedded_systems"}, {"score": 0.0036759314172445934, "phrase": "coarse-grained_reconfigurable_array"}, {"score": 0.003584025547693836, "phrase": "global_multistage_interconnect_networks"}, {"score": 0.00305285084207725, "phrase": "proposed_cgra"}, {"score": 0.00284137141260141, "phrase": "processing_elements"}, {"score": 0.002805597755796506, "phrase": "neighbor_interconnections"}, {"score": 0.002758597251689795, "phrase": "torus_topology"}, {"score": 0.002723862897844177, "phrase": "execution_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Coarse-grained reconfigurable arrays", " Multistage interconnection networks", " Placement and Routing", " FPGAs"], "paper_abstract": "Reconfigurable computing architectures are commonly used for accelerating applications and/or for achieving energy savings. However, most reconfigurable computing architectures suffer from computationally demanding placement and routing (P&R) steps. This problem may disable their use in systems requiring dynamic compilation (e.g., to guarantee application portability in embedded systems). Bearing in mind the simplification of P&R steps, this paper presents and analyzes a coarse-grained reconfigurable array (CGRA) extended with global multistage interconnect networks, specifically Omega Networks. We show that integrating one or two Omega Networks in a CGRA permits to simplify the P&R stage resulting in both low hardware resource overhead and low performance degradation (18% for an 8 x 8 array). We compare the proposed CGRA, which integrates one or two Omega Networks, with a CGRA based on a grid of processing elements with reach neighbor interconnections and with a torus topology. The execution time needed to perform the P&R stage for the two array architectures shows that the array using two Omega Networks needs a far simpler and faster P&R. The P&R stage in our approach completed on average in about 16 x less time for the 17 benchmarks used. Similar fast approaches needed CGRAs with more complex interconnect resources in order to allow most of the benchmarks used to be successfully placed and routed. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Fast placement and routing by extending coarse-grained reconfigurable arrays with Omega Networks", "paper_id": "WOS:000295504100003"}