{"auto_keywords": [{"score": 0.048186916426953504, "phrase": "cyber"}, {"score": 0.009314733257393024, "phrase": "index_tuning_technique"}, {"score": 0.00481495049065317, "phrase": "community_feedback"}, {"score": 0.004782718554230406, "phrase": "information_retrieval"}, {"score": 0.00475070135279933, "phrase": "dht_networks"}, {"score": 0.004442032546224076, "phrase": "community_feedback_information"}, {"score": 0.004397487039229447, "phrase": "dht_network"}, {"score": 0.004209539728590977, "phrase": "user_profiles"}, {"score": 0.003935892934907777, "phrase": "indexed_term"}, {"score": 0.0038964032225585117, "phrase": "document_profile"}, {"score": 0.0036923623384423816, "phrase": "relevant_answer"}, {"score": 0.003216804708106142, "phrase": "similar_query"}, {"score": 0.0031208772639433145, "phrase": "earlier_user"}, {"score": 0.0030688220103201836, "phrase": "search_quality"}, {"score": 0.00279291004189267, "phrase": "indexing_terms"}, {"score": 0.002755567647101251, "phrase": "community-based_relevance_feedback"}, {"score": 0.0026914126067254444, "phrase": "re-evaluating_queries"}, {"score": 0.0026376095791298413, "phrase": "naive_scheme"}, {"score": 0.0024576084154573396, "phrase": "separate_step"}, {"score": 0.0023131084326717755, "phrase": "relevance_feedback"}, {"score": 0.0021624739899833868, "phrase": "comprehensive_experimental_study"}], "paper_keywords": ["Information retrieval", " Social search", " Relevance feedback"], "paper_abstract": "In this paper, we propose CYBER, a CommunitY Based sEaRch engine, for information retrieval utilizing community feedback information in a DHT network. In CYBER, each user is associated with a set of user profiles that capture his/her interests. Likewise, a document is associated with a set of profiles-one for each indexed term. A document profile is updated by users who query on the term and consider the document as a relevant answer. Thus, the profile acts as a consolidation of users feedback from the same community, and reflects their interests. In this way, as one user finds a document to be relevant, another user in the same community issuing a similar query will benefit from the feedback provided by the earlier user. Hence, the search quality in terms of both precision and recall is improved. Moreover, we further improve the effectiveness of CYBER by introducing an index tuning technique. By choosing the indexing terms more carefully, community-based relevance feedback is utilized in both building/refining indices and re-evaluating queries. We first propose a naive scheme, CYBER+, which involves an index tuning technique based on past queries only, and then re-evaluates queries in a separate step. We then propose a more complex scheme, CYBER+ +, which refines its index based on both past queries and relevance feedback. As the index is built with more selective and accurate terms, the search performance is further improved. We conduct a comprehensive experimental study and the results show the effectiveness of our schemes.", "paper_title": "Exploiting community feedback for information retrieval in DHT networks", "paper_id": "WOS:000289482200003"}