{"auto_keywords": [{"score": 0.042705003697255564, "phrase": "multifractal_cumulants"}, {"score": 0.04132123127632088, "phrase": "predictive_complexity"}, {"score": 0.004768104290288521, "phrase": "eeg-based_brain-computer_interfaces"}, {"score": 0.004240116703465252, "phrase": "brain-computer_interfaces"}, {"score": 0.004198883329136447, "phrase": "bci"}, {"score": 0.0038827100184187805, "phrase": "eeg_time_series"}, {"score": 0.0037519679864796906, "phrase": "signal_regularity"}, {"score": 0.0030847461428168614, "phrase": "eeg_data"}, {"score": 0.0029229677574293725, "phrase": "gold_standard"}, {"score": 0.0025860636370864084, "phrase": "eeg_signals"}, {"score": 0.0024383967028975616, "phrase": "bci_designs"}, {"score": 0.002414616656410503, "phrase": "improved_classification_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["BCI", " Feature extraction", " Classification", " Multifractal", " Predictive complexity"], "paper_abstract": "In this paper, we introduce two new features for the design of electroencephalography (EEG) based Brain-Computer Interfaces (BCI): one feature based on multifractal cumulants and the other feature based on the predictive complexity of the EEG time series. The multifractal cumulants feature measures the signal regularity, while the predictive complexity measures the difficulty to predict the future of the signal based on its past, hence a degree of how complex it is. We have conducted an evaluation of the performance of these two novel features on EEG data corresponding to motor-imagery. We also compared them to the gold standard features used in the BC! field, namely the band-power features. We evaluated these three kinds of features and their combinations on EEG signals from 13 subjects. Results obtained show that our novel features can lead to BCI designs with improved classification performance, notably when using and combining the three kinds of feature (band-power, multifractal cumulants, predictive complexity) together. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Exploring two novel features for EEG-based brain-computer interfaces: Multifractal cumulants and predictive complexity", "paper_id": "WOS:000300138900010"}