{"auto_keywords": [{"score": 0.04848034369451246, "phrase": "molecular_interactions"}, {"score": 0.009644636462061828, "phrase": "biological_systems"}, {"score": 0.00481495049065317, "phrase": "non-immediate_triggers"}, {"score": 0.004373267443572639, "phrase": "side_effects"}, {"score": 0.004251210982670317, "phrase": "unusual_cellular_behavior"}, {"score": 0.0030955250132409964, "phrase": "engineering_systems"}, {"score": 0.0029920129598858545, "phrase": "serious_problem"}, {"score": 0.002671263324230699, "phrase": "different_granularity"}, {"score": 0.0025673005153462707, "phrase": "immediate_triggers"}, {"score": 0.0023579143175099324, "phrase": "action_language"}, {"score": 0.0021655683497137234, "phrase": "biological_knowledge"}, {"score": 0.0021049977753042253, "phrase": "higher_cost"}], "paper_keywords": ["molecular interaction networks", " knowledge-based modeling", " causality"], "paper_abstract": "Modeling molecular interactions in signalling networks is important from various perspectives such as predicting side effects of drugs, explaining unusual cellular behavior and drug and therapy design. Various formal languages have been proposed for representing and reasoning about molecular interactions. The interactions are modeled as triggered events in most of the approaches. The triggering of events is assumed to be immediate: once an interaction is triggered, it should occur immediately. Although working well for engineering systems, this assumption poses a serious problem in modeling biological systems. Our knowledge about biological systems is inherently incomplete, thus molecular interactions are constantly elaborated and refined at different granularity of abstraction. The model of immediate triggers can not consistently deal with this refinement. In this paper we propose an action language to address this problem. We show that the language allows for refinements of biological knowledge, although at a higher cost in terms of complexity.", "paper_title": "Reasoning about non-immediate triggers in biological networks", "paper_id": "WOS:000254176500007"}