{"auto_keywords": [{"score": 0.04475762650789477, "phrase": "reliable_negative_examples"}, {"score": 0.00481495049065317, "phrase": "-based_method_for_positive"}, {"score": 0.004747620102130588, "phrase": "text_categorization"}, {"score": 0.004681226806682058, "phrase": "improved_tfidf._pu_learning"}, {"score": 0.004594137808658537, "phrase": "web_pages_classification"}, {"score": 0.004551199992546761, "phrase": "text_retrieval_applications"}, {"score": 0.00422177384286051, "phrase": "key_step"}, {"score": 0.004028054020045027, "phrase": "machine_learning"}, {"score": 0.003916098498242888, "phrase": "training_set_or_negative_examples"}, {"score": 0.003701401653850141, "phrase": "novel_clustering-based_method"}, {"score": 0.0034984340449789745, "phrase": "traditional_methods"}, {"score": 0.003081400693055518, "phrase": "novel_tfidf-improved_feature_weighting_approach"}, {"score": 0.0029260602766930065, "phrase": "positive_and_negative_training_examples"}, {"score": 0.0027916287357898544, "phrase": "vector_space_model"}, {"score": 0.0027139447110929586, "phrase": "weighted_voting_classifier"}, {"score": 0.002650857539177183, "phrase": "svm_algorithm"}, {"score": 0.0022273034991008326, "phrase": "c-crne"}, {"score": 0.0021755038991725147, "phrase": "baseline_algorithms"}], "paper_keywords": ["text classification", " reliable negative examples", " clustering", " C-CRNE", " WVC"], "paper_abstract": "PU learning occurs frequently in Web pages classification and text retrieval applications because users may be interested in information on the same topic. Collecting reliable negative examples is a key step in PU (Positive and Unlabeled) text classification, which solves a key problem in machine learning when no labeled negative examples are available in the training set or negative examples are difficult to collect. Thus, this paper presents a novel clustering-based method for collecting reliable negative examples (C-CRNE). Different from traditional methods, we remove as many probable positive examples from unlabeled set as possible, which results that more reliable negative examples are found out. During the process of building classifier, a novel TFIDF-improved feature weighting approach, which reflects the importance of the term in the positive and negative training examples respectively, is presented to describe documents in the Vector Space Model. We also build a weighted voting classifier by iteratively applying the SVM algorithm and implement OCS (One-class SVM), PEBL (Positive Example Based Learning) and 1-DNFII (Constrained 1-DNF) methods used for comparison. Experimental results on three real-world datasets (Reuters Corpus Volume 1 (RCV1), Reuters-21578 and 20 Newsgroups) show that our proposed C-CRNE extracts more reliable negative examples than the baseline algorithms with very low error rates. And our classifier outperforms other state-of-art classification methods from the perspective of traditional performance metrics.", "paper_title": "Clustering-based Method for Positive and Unlabeled Text Categorization Enhanced by Improved TFIDF", "paper_id": "WOS:000342328800010"}