{"auto_keywords": [{"score": 0.04897995717051969, "phrase": "content_search"}, {"score": 0.015616881986156449, "phrase": "comparison-based_search"}, {"score": 0.011615746503891545, "phrase": "small-world_network_design_problem"}, {"score": 0.010180341166979742, "phrase": "heterogeneous_demand"}, {"score": 0.00481495049065317, "phrase": "small-world_networks"}, {"score": 0.004611669085594069, "phrase": "considerable_attention"}, {"score": 0.004461131750106576, "phrase": "target_object"}, {"score": 0.004133204817078675, "phrase": "small_list"}, {"score": 0.004065156038847781, "phrase": "new_object_list"}, {"score": 0.003477628306017313, "phrase": "prior_work"}, {"score": 0.0030555450092532746, "phrase": "np"}, {"score": 0.0029452441730331617, "phrase": "novel_mechanism"}, {"score": 0.002925728709297618, "phrase": "small-world_design"}, {"score": 0.002887083738036996, "phrase": "upper_bound"}, {"score": 0.002792683583705368, "phrase": "natural_equivalent"}, {"score": 0.002318180580715058, "phrase": "target_objects"}, {"score": 0.0022799458141165587, "phrase": "interesting_connections"}, {"score": 0.0022274718912558343, "phrase": "information_theory"}, {"score": 0.0021762030438262046, "phrase": "adaptive_learning_algorithm"}, {"score": 0.002133196554995389, "phrase": "performance_guarantees"}], "paper_keywords": ["Nearest neighbor searches", " routing protocols", " information entropy", " greedy algorithms"], "paper_abstract": "The problem of content search through comparisons has recently received considerable attention. In short, a user searching for a target object navigates through a database in the following manner. The user is asked to select the object most similar to her target from a small list of objects. A new object list is then presented to the user based on her earlier selection. This process is repeated until the target is included in the list presented, at which point the search terminates. This problem is known to be strongly related to the small-world network design problem. However, contrary to prior work, which focuses on cases where objects in the database are equally popular, we consider here the case where the demand for objects may be heterogeneous. We show that, under heterogeneous demand, the small-world network design problem is NP-hard. Given the above negative result, we propose a novel mechanism for small-world design and provide an upper bound on its performance under heterogeneous demand. The above mechanism has a natural equivalent in the context of content search through comparisons, and we establish both an upper bound and a lower bound for the performance of this mechanism. These bounds are intuitively appealing, as they depend on the entropy of the demand as well as its doubling constant, a quantity capturing the topology of the set of target objects. They also illustrate interesting connections between comparison-based search to classic results from information theory. Finally, we propose an adaptive learning algorithm for content search that meets the performance guarantees achieved by the above mechanisms.", "paper_title": "From Small-World Networks to Comparison-Based Search", "paper_id": "WOS:000354943600008"}