{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "real-time_systems"}, {"score": 0.004718897469501381, "phrase": "highly_variable_task_execution_times"}, {"score": 0.004283739213556286, "phrase": "single_value"}, {"score": 0.00421520166010848, "phrase": "proper_characterization"}, {"score": 0.003999907278478564, "phrase": "deepest_kinds"}, {"score": 0.003431384878608803, "phrase": "real-time_system"}, {"score": 0.0030895394261534776, "phrase": "variable_execution_times"}, {"score": 0.0029672941061574375, "phrase": "real-time_requirements"}, {"score": 0.002931569771634119, "phrase": "video_processing"}, {"score": 0.002748159131396737, "phrase": "self-similar_task_sets"}, {"score": 0.002597088221737922, "phrase": "analytical_expression"}, {"score": 0.002385872451981323, "phrase": "system's_modeling"}, {"score": 0.002254672021120091, "phrase": "soft_real-time_systems"}, {"score": 0.002165388556451298, "phrase": "proper_scheduling_policies"}, {"score": 0.0021049977753042253, "phrase": "system_design_time"}], "paper_keywords": ["Workload modeling", " Stochastic models", " Real-time scheduling", " Multimedia processing", " Self-similar processes"], "paper_abstract": "In real-time systems with highly variable task execution times simplistic task models are insufficient to accurately model and to analyze the system. Variability can be tackled using distributions rather than a single value, but the proper characterization depends on the degree of variability. Self-similarity is one of the deepest kinds of variability. It characterizes the fact that a workload is not only highly variable, but it is also bursty on many time-scales. This paper identifies in which situations this source of indeterminism can appear in a real-time system: the combination of variability in task inter-arrival times and execution times. Although self-similarity is not a claim for all systems with variable execution times, it is not unusual in some applications with real-time requirements, like video processing, networking and gaming. The paper shows how to properly model and to analyze self-similar task sets and how improper modeling can mask deadline misses. The paper derives an analytical expression for the dependence of the deadline miss ratio on the degree of self-similarity and proofs its negative impact on real-time systems performance through system's modeling and simulation. This study about the nature and impact of self-similarity on soft real-time systems can help to reduce its effects, to choose the proper scheduling policies, and to avoid its causes at system design time.", "paper_title": "On the nature and impact of self-similarity in real-time systems", "paper_id": "WOS:000301847500003"}