{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "possible_outcomes"}, {"score": 0.042143904057605854, "phrase": "uncertainty_profile"}, {"score": 0.00973810615578236, "phrase": "owa_operator"}, {"score": 0.0041725881174377345, "phrase": "representative_value"}, {"score": 0.0036008372531664695, "phrase": "decision_attitude"}, {"score": 0.003556873173040166, "phrase": "decision_maker"}, {"score": 0.003277140908834426, "phrase": "aggregation_process"}, {"score": 0.003210704011271791, "phrase": "representative_values"}, {"score": 0.003107186371289819, "phrase": "discrete_set"}, {"score": 0.002583931950389087, "phrase": "potential_outcomes"}, {"score": 0.002541910967437926, "phrase": "associated_uncertainty"}, {"score": 0.002419895344071104, "phrase": "owa"}, {"score": 0.002275557501858879, "phrase": "associated_probability_density_function"}, {"score": 0.0021398115287338693, "phrase": "belief_structure"}, {"score": 0.0021049977753042253, "phrase": "possibility_distribution"}], "paper_keywords": ["Aggregation", " decision-making", " ordered weighted averaging (OWA) operators", " uncertainty"], "paper_abstract": "In decision-making under uncertainty we have a collection of alternatives from which we must choose one. Associated with each alternative is an uncertainty profile consisting of the set of possible outcomes that can occur if we choose this alternative along with some indication of the uncertainty associated with the outcomes. Since it is difficult to compare these uncertainty profiles one commonly used approach is to obtain a representative value, an aggregation of the information in the uncertainty profile, and use these to compare the alternatives. The method that we use to aggregate the information in the uncertainty profile must reflect aspects of the decision attitude of the decision maker. Here we look at the role that the ordered weighted averaging (OWA) can play in the aggregation process used to obtain these representative values. Since an uncertainty profile can involve a discrete set of possible outcomes or an interval of possible outcomes we provide the OWA operator with the capability to perform aggregations in either of these environments. In addition we provide the OWA operator with the ability to perform aggregations in situations where the arguments being aggregated, the potential outcomes, have an associated uncertainty, probability of occurrence. Particularly notable is the extension the OWA operator to perform aggregation with arguments consisting of a continuum of values with an associated probability density function. We also look at the cases where the uncertainty is modeled with a belief structure as well a possibility distribution.", "paper_title": "Probabilistically Weighted OWA Aggregation", "paper_id": "WOS:000331297300004"}