{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "image_quality_assessment"}, {"score": 0.004010102190292041, "phrase": "natural-image_approximations"}, {"score": 0.003929391999210588, "phrase": "distorted_image"}, {"score": 0.003671865026158296, "phrase": "wavelet_coefficients"}, {"score": 0.00357362651129581, "phrase": "distorted_images"}, {"score": 0.003141598480804135, "phrase": "entropy_difference"}, {"score": 0.0028184476518849015, "phrase": "quality_computation"}, {"score": 0.0027429789393362703, "phrase": "almost_full_information"}, {"score": 0.0027060037347363987, "phrase": "almost_no_information"}, {"score": 0.002598034157587518, "phrase": "special_case"}, {"score": 0.0022376375252254987, "phrase": "subjective_quality_scores"}, {"score": 0.0021049977753042253, "phrase": "performance_degradation"}], "paper_keywords": ["Entropy", " image information", " image quality", " natural scene statistics", " perceptual approaches", " reduced reference quality"], "paper_abstract": "We study the problem of automatic \"reduced-reference\" image quality assessment (QA) algorithms from the point of view of image information change. Such changes are measured between the reference-and natural-image approximations of the distorted image. Algorithms that measure differences between the entropies of wavelet coefficients of reference and distorted images, as perceived by humans, are designed. The algorithms differ in the data on which the entropy difference is calculated and on the amount of information from the reference that is required for quality computation, ranging from almost full information to almost no information from the reference. A special case of these is algorithms that require just a single number from the reference for QA. The algorithms are shown to correlate very well with subjective quality scores, as demonstrated on the Laboratory for Image and Video Engineering Image Quality Assessment Database and the Tampere Image Database. Performance degradation, as the amount of information is reduced, is also studied.", "paper_title": "RRED Indices: Reduced Reference Entropic Differencing for Image Quality Assessment", "paper_id": "WOS:000300559700008"}