{"auto_keywords": [{"score": 0.04182833290656605, "phrase": "input_point"}, {"score": 0.00481495049065317, "phrase": "unoriented_point_clouds"}, {"score": 0.004514714250357749, "phrase": "binary_orientation_tree"}, {"score": 0.0043482604833437735, "phrase": "surface_representation"}, {"score": 0.00409895142748329, "phrase": "exterior_regions"}, {"score": 0.003781772207256374, "phrase": "traditional_octree_subdivision_technique"}, {"score": 0.003306559295382181, "phrase": "root_cell"}, {"score": 0.0032536902910768957, "phrase": "growing_stage"}, {"score": 0.003100085797251317, "phrase": "connected_empty_sub-cells"}, {"score": 0.002985631781749091, "phrase": "remaining_cell_corners"}, {"score": 0.002859977408815691, "phrase": "hidden_point_removal_operator"}, {"score": 0.002724909017963099, "phrase": "input_point_set"}, {"score": 0.0023189818169615135, "phrase": "surface_representation_techniques"}, {"score": 0.0021857667493036786, "phrase": "modified_mpu_implicits_algorithm"}, {"score": 0.0021049977753042253, "phrase": "input_unoriented_point_clouds"}], "paper_keywords": [""], "paper_abstract": "Given a complete unoriented point set, we propose a binary orientation tree (BOT) for volume and surface representation, which roughly splits the space into the interior and exterior regions with respect to the input point set. The BOTs are constructed by performing a traditional octree subdivision technique while the corners of each cell are associated with a tag indicating the in/out relationship with respect to the input point set. Starting from the root cell, a growing stage is performed to efficiently assign tags to the connected empty sub-cells. The unresolved tags of the remaining cell corners are determined by examining their visibility via the hidden point removal operator. We show that the outliers accompanying the input point set can be effectively detected during the construction of the BOTs. After removing the outliers and resolving the in/out tags, the BOTs are ready to support any volume or surface representation techniques. To represent the surfaces, we also present a modified MPU implicits algorithm enabled to reconstruct surfaces from the input unoriented point clouds by taking advantage of the BOTs.", "paper_title": "Binary Orientation Trees for Volume and Surface Reconstruction from Unoriented Point Clouds", "paper_id": "WOS:000283159400001"}