{"auto_keywords": [{"score": 0.04946189595812949, "phrase": "user_query_logs"}, {"score": 0.015719716506582538, "phrase": "component_description"}, {"score": 0.008146647574233667, "phrase": "similar_components"}, {"score": 0.004454237726525018, "phrase": "based_software_development"}, {"score": 0.004415857760651366, "phrase": "cbsd"}, {"score": 0.004138309011478741, "phrase": "component_retrieval_mechanisms"}, {"score": 0.003962998498942111, "phrase": "software_component"}, {"score": 0.003911862375084159, "phrase": "description_text"}, {"score": 0.003697760799674494, "phrase": "component_description_text"}, {"score": 0.003618558599449415, "phrase": "component_retrieval"}, {"score": 0.003465189575252443, "phrase": "improper_or_even_noisy_information"}, {"score": 0.0033471722682967046, "phrase": "retrieval_mechanism"}, {"score": 0.003003579442221871, "phrase": "key_idea"}, {"score": 0.0028390477456009568, "phrase": "proper_information"}, {"score": 0.0026951616152303373, "phrase": "information_extraction"}, {"score": 0.0026603411931700556, "phrase": "first_strategy"}, {"score": 0.0024078737745407614, "phrase": "experimental_study"}, {"score": 0.0022957232752482196, "phrase": "experimental_results"}, {"score": 0.0021982976170703884, "phrase": "retrieval_performance"}, {"score": 0.0021049977753042253, "phrase": "second_strategy"}], "paper_keywords": ["Software reuse", " CBSD", " Reuse repository", " Component retrieval", " Log mining"], "paper_abstract": "How to help reusers retrieve components efficiently and conveniently is critical to the Success of the component-based software development (CBSD). In the literature, many research efforts have been devoted to the improvement of component retrieval mechanisms. Although various retrieval methods have been proposed. nowadays retrieving software component by the description text is still prevalent in most real-world scenarios. Therefore, the quality of the component description text is vital for the component retrieval. Unfortunately, the descriptions of components often contain improper or even noisy information which could deteriorate the effectiveness of the retrieval mechanism. To alleviate the problem, in this paper, we propose an approach which can improve the component description by leveraging user query logs. The key idea of our approach is to refine the description of a component by extracting proper information from the user query logs. Two different strategies are proposed to carry out the information extraction. The first strategy extracts information for a component only from its own related query logs. Whereas our second strategy further takes logs from similar components into consideration. We performed an experimental study on two different data sets to evaluate the effectiveness of our approach. The experimental results demonstrate that by using either extraction strategy our approach can improve retrieval performance and our approach can be more effective by leveraging the second strategy which utilizes logs from similar components. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Refining component description by leveraging user query logs", "paper_id": "WOS:000265318300002"}