{"auto_keywords": [{"score": 0.03681703781612336, "phrase": "color-to-grayscale_conversions"}, {"score": 0.00481495049065317, "phrase": "color-to-grayscale_image_conversions"}, {"score": 0.004503525064934708, "phrase": "artistic_purposes"}, {"score": 0.004418287966422041, "phrase": "subsequent_processing"}, {"score": 0.004272969980602508, "phrase": "color_images"}, {"score": 0.00409310463335204, "phrase": "original_color_image"}, {"score": 0.003958439439112026, "phrase": "perceptually_plausible_grayscale_results"}, {"score": 0.002887028262617443, "phrase": "paired_comparison_paradigm"}, {"score": 0.0024771000236931836, "phrase": "first_perceptual_evaluation"}, {"score": 0.0023388183537341213, "phrase": "researched_methods"}, {"score": 0.0022188370388602813, "phrase": "deeper_understanding"}, {"score": 0.002187194307878705, "phrase": "examined_field"}, {"score": 0.0021049977753042253, "phrase": "color-to-grayscale_conversion"}], "paper_keywords": [""], "paper_abstract": "Color images often have to be converted to grayscale for reproduction, artistic purposes, or for subsequent processing. Methods performing the conversion of color images to grayscale aim to retain as much information about the original color image as possible, while simultaneously producing perceptually plausible grayscale results. Recently, many methods of conversion have been proposed, but their performance has not yet been assessed. Therefore, the strengths and weaknesses of color-to-grayscale conversions are not known. In this paper, we present the results of two subjective experiments in which a total of 24 color images were converted to grayscale using seven state-of-the-art conversions and evaluated by 119 human subjects using a paired comparison paradigm. We surveyed nearly 20000 human responses and used them to evaluate the accuracy and preference of the color-to-grayscale conversions. To the best of our knowledge, the study presented in this paper is the first perceptual evaluation of color-to-grayscale conversions. Besides exposing the strengths and weaknesses of the researched methods, the aim of the study is to attain a deeper understanding of the examined field, which can accelerate the progress of color-to-grayscale conversion.", "paper_title": "Perceptual Evaluation of Color-to-Grayscale Image Conversions", "paper_id": "WOS:000262666000005"}