{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mainstream_opinion"}, {"score": 0.00433645229352341, "phrase": "over-competitive_research_funding"}, {"score": 0.003992385826251404, "phrase": "simulation_results"}, {"score": 0.003778253716938922, "phrase": "monopoly_supremacy"}, {"score": 0.00325555555110395, "phrase": "positive_feedback_mechanism"}, {"score": 0.003097865379563127, "phrase": "big_bang"}, {"score": 0.00282048824450047, "phrase": "non-mainstream_opinions"}, {"score": 0.0025678829712650437, "phrase": "standard_theory"}, {"score": 0.0024569466759289055, "phrase": "orthodox_theory"}, {"score": 0.002163930783583212, "phrase": "actual_situation"}], "paper_keywords": ["Peer review", " Research funding", " Publications", " Excessive competition", " Mainstream", " Cosmology"], "paper_abstract": "In our previous work (Scientometrics 87:293-301, 2011), a numerical model of over-competitive research funding in \"peer-group-assessed-grant-based-funding-system\" was proposed and the process was firstly investigated quantitatively. The simulation results show that the mainstream of a very complicated research topic could obtain monopoly supremacy with only the aid of the mechanism the model described. Here, the numbers of publications of cosmology back to 1950 are utilized to empirically test this positive feedback mechanism. The development of three main theories of cosmology, Big Bang, Steady State and Plasma Universe, are revisited. The later two, which are non-mainstream opinions, both state in their peer reviewed papers, that their theories fit the phenomena that support the standard theory. The ratios of publications of the orthodox theory, Big Bang, approximately satisfy the numeric calculating results of our model. The reason for the discrepancy between the model and actual situation is discussed. A further question about the controversy is presented.", "paper_title": "Peer review and over-competitive research funding fostering mainstream opinion to monopoly. Part II", "paper_id": "WOS:000299088900016"}