{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "functional_robustness"}, {"score": 0.012327878770757866, "phrase": "distribution_networks"}, {"score": 0.004513151518938864, "phrase": "source_nodes"}, {"score": 0.004428025469002531, "phrase": "junction_nodes"}, {"score": 0.00434449804021954, "phrase": "fundamental_characteristics"}, {"score": 0.00405658135587089, "phrase": "internal_or_external_disruptions"}, {"score": 0.0038605361756636667, "phrase": "centralized_control_mechanisms"}, {"score": 0.003659954070354848, "phrase": "decentralized_way"}, {"score": 0.0032150101448578734, "phrase": "local_interaction"}, {"score": 0.003106541164572609, "phrase": "utility_function"}, {"score": 0.0030595112110658675, "phrase": "network_entropy"}, {"score": 0.0029789104204803137, "phrase": "distribution_network"}, {"score": 0.002900426826591769, "phrase": "decentralized_network_pricing_mechanism"}, {"score": 0.002760101069870307, "phrase": "\"price\"_signal"}, {"score": 0.0027079507175554857, "phrase": "\"price\"_signals"}, {"score": 0.002499438189264537, "phrase": "decentralized_pricing_mechanism"}, {"score": 0.0024150528983695446, "phrase": "ideal_centralized_maximization"}, {"score": 0.0023966900120342364, "phrase": "complete_information"}, {"score": 0.002263336340041527, "phrase": "case_study"}, {"score": 0.0022375675189464715, "phrase": "natural_gas_distribution_network"}, {"score": 0.0021049977753042253, "phrase": "existing_algorithm"}], "paper_keywords": ["Distribution networks", " network entropy", " pricing mechanism", " robustness"], "paper_abstract": "Most real-world distribution systems can be modeled as distribution networks, where a commodity can flow from source nodes to sink nodes through junction nodes. One of the fundamental characteristics of distribution networks is the functional robustness, which reflects the ability of maintaining its function in the face of internal or external disruptions. In view of the fact that most distribution networks do not have any centralized control mechanisms, we consider the problem of how to improve the functional robustness in a decentralized way. To achieve this goal, we study two important problems: 1) how to formally measure the functional robustness, and 2) how to improve the functional robustness of a network based on the local interaction of its nodes. First, we derive a utility function in terms of network entropy to characterize the functional robustness of a distribution network. Second, we propose a decentralized network pricing mechanism, where each node need only communicate with its distribution neighbors by sending a \"price\" signal to its upstream neighbors and receiving \"price\" signals from its downstream neighbors. By doing so, each node can determine its outflows by maximizing its own payoff function. Our mathematical analysis shows that the decentralized pricing mechanism can produce results equivalent to those of an ideal centralized maximization with complete information. Finally, to demonstrate the properties of our mechanism, we carry out a case study on the U. S. natural gas distribution network. The results validate the convergence and effectiveness of our mechanism when comparing it with an existing algorithm.", "paper_title": "A Decentralized Mechanism for Improving the Functional Robustness of Distribution Networks", "paper_id": "WOS:000308995500006"}