{"auto_keywords": [{"score": 0.03952527802954205, "phrase": "atc"}, {"score": 0.004444921827311577, "phrase": "simple_air_traffic_control_system"}, {"score": 0.004130660282810338, "phrase": "read-only_operations"}, {"score": 0.003995226376780718, "phrase": "atomic_and_finegrained_levels"}, {"score": 0.0038385317554884713, "phrase": "non-acid_timing_aspects"}, {"score": 0.00312138530097218, "phrase": "different_case_studies"}, {"score": 0.002900426826591769, "phrase": "conventional_atomic_transaction"}, {"score": 0.0028052155436760528, "phrase": "recovery_protocol"}, {"score": 0.0027680095380207756, "phrase": "mondex"}, {"score": 0.0026771333996253783, "phrase": "compensated_transaction"}, {"score": 0.002389839896897424, "phrase": "final_one"}, {"score": 0.002265497060260791, "phrase": "software_transactional_memory_systems"}, {"score": 0.0021764949731965656, "phrase": "non-acid_behaviour"}], "paper_keywords": ["Atomic actions", " Refinement", " Retrenchment", " Air traffic control", " Mondex", " Compensated transactions", " Software transactional memory"], "paper_abstract": "The issues surrounding the question of atomicity, both in the past and nowadays, are briefly reviewed, and a picture of an ACID (atomic, consistent, isolated, durable) transaction as a refinement problem is presented. An example of a simple air traffic control system is introduced, and the discrepancies that can arise when read-only operations examine the state at atomic and finegrained levels are handled by retrenchment. Non-ACID timing aspects of the ATC example are also handled by retrenchment, and the treatment is generalised to yield the Retrenchment Atomicity Pattern. The utility of the pattern is confirmed against a number of different case studies. One is the Mondex Electronic Purse, its protocol treated as a conventional atomic transaction. Another is the recovery protocol of Mondex, viewed as a compensated transaction (leading to the view that compensated transactions in general fit the pattern). A final one comprises various unruly phenomena occurring in the implementations of software transactional memory systems, which can frequently display non-ACID behaviour. In all cases the Atomicity Pattern is seen to perform well.", "paper_title": "Atomicity failure and the retrenchment atomicity pattern", "paper_id": "WOS:000318568700006"}