{"auto_keywords": [{"score": 0.03729083385782431, "phrase": "quality_assurance"}, {"score": 0.016558990223459295, "phrase": "process_control"}, {"score": 0.007568541358414191, "phrase": "user_knowledge"}, {"score": 0.00481495049065317, "phrase": "industrial_cfd"}, {"score": 0.004650430621469372, "phrase": "useful_research_and_design_instrument"}, {"score": 0.0045843245695654875, "phrase": "appropriate_standards"}, {"score": 0.004546970518808189, "phrase": "increasing_confidence"}, {"score": 0.004346874334971379, "phrase": "user_competence_increase"}, {"score": 0.004258843584164121, "phrase": "increased_use"}, {"score": 0.004241451614311598, "phrase": "cfd_codes"}, {"score": 0.004215496175674517, "phrase": "applied_research_industry"}, {"score": 0.0041301149938407465, "phrase": "quality_assurance_to_research_and_development"}, {"score": 0.003876226041373242, "phrase": "methodological_approach"}, {"score": 0.0038525082066378, "phrase": "cfd"}, {"score": 0.003608217060349307, "phrase": "cfd_analysis"}, {"score": 0.0035934724853059243, "phrase": "industrial_problems"}, {"score": 0.0033518050602629277, "phrase": "great_importance"}, {"score": 0.003237116128682586, "phrase": "small_or_medium_enterprise"}, {"score": 0.0031975786158658158, "phrase": "cfd_code"}, {"score": 0.0031649986522814502, "phrase": "support_tool"}, {"score": 0.0031391730990655837, "phrase": "product_development"}, {"score": 0.0030881505090348624, "phrase": "software_reliability"}, {"score": 0.0029763522906533914, "phrase": "model_development"}, {"score": 0.002933973181012572, "phrase": "vital_role"}, {"score": 0.002915995387784664, "phrase": "accurate_results"}, {"score": 0.0027989184226250444, "phrase": "continuous_cfd_analyst_training"}, {"score": 0.002759058732719621, "phrase": "cfd_cycled_process"}, {"score": 0.0027253441561528495, "phrase": "cyclic_logic"}, {"score": 0.0026700637696697414, "phrase": "specific_industrial_scenarios"}, {"score": 0.0025697686349702106, "phrase": "calculation"}, {"score": 0.002500571634075998, "phrase": "critical_elements"}, {"score": 0.0024398167078355224, "phrase": "radar_logic"}, {"score": 0.002370794661629904, "phrase": "quality_assurance_management"}, {"score": 0.0023418133729330303, "phrase": "specific_study"}, {"score": 0.00231793248157523, "phrase": "experimental_data"}, {"score": 0.002256973121326987, "phrase": "single_tool"}, {"score": 0.0022248141120349806, "phrase": "qualified_cfd"}, {"score": 0.002202123699556382, "phrase": "internal_or_external_audit"}, {"score": 0.002131054594847684, "phrase": "personnel_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Quality Assurance", " CFD", " Verification and Validation", " Cycled process", " Protocol of analysis"], "paper_abstract": "Computational Fluid Dynamics (CFD) analysis has become a useful research and design instrument albeit with errors and uncertainties. Appropriate standards and protocols for increasing confidence and reliability need to be identified and applied. These requirements become more relevant as improvements in hardware, software and user competence increase. Advances in these sectors have led to the increased use of CFD codes in the applied research industry. In the discussion on the opportunities of applying Quality Assurance to Research and Development (R&D) activities, and on investigating methodologies (numerical or experimental), CFD results need to be qualified; rules, and procedures should be instated and followed. This paper proposes a methodological approach to qualify CFD, named Q(3) approach. The approach is based on three interdependent, but related, dimensions: software reliability, user knowledge and process control. Applying the quality of CFD analysis to industrial problems, while following the principles of Quality Assurance, is of particular concerned. The paper aims to focus on the dimensions of user knowledge and process control, which are often overlooked and are of great importance when determining the quality of CFD. The approach discussed here refers to a typical R&D department in a Small or Medium Enterprise (SME) where a CFD code is used as a support tool for process or product development, optimisation and/or innovation. Within the three dimensions, software reliability immediately refers to Verification and Validation (V&V) procedures, a well known issue for those who are involved in code and model development. User knowledge and process control play a vital role in achieving accurate results and cannot be neglected, as per the principles of Quality Assurance. Therefore it is vital to provide continuous CFD analyst training to industrial professionals. Applying a CFD cycled process, which refers to the cyclic logic proposed in Quality Assurance, may face some constrains in specific industrial scenarios. A protocol will serve as an instrument of process control. Within the protocol, the phases of Calculation. Verification and Validation as well as User Defined Model Verification represent critical elements, and are specifically detailed and structured in accordance with the RADAR logic (Results, Approach, Deploy, Assess, Refine) used for Quality Assurance Management. In the case a specific study does not rely on experimental data, an alternative is proposed. The protocol is designed as a single tool that responds to both the need for qualified CFD and the requirement of internal or external audit of Quality Assurance (as far as calculations are concerned), thus increasing cost and personnel efficiency. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A methodology for qualifying industrial CFD: The Q(3) approach and the role of a protocol", "paper_id": "WOS:000299406900006"}