{"auto_keywords": [{"score": 0.04933048408766578, "phrase": "maintenance_effort"}, {"score": 0.0450678547644915, "phrase": "kms"}, {"score": 0.03887834892138911, "phrase": "knowledge_documents"}, {"score": 0.014541968948326373, "phrase": "dynamic_content"}, {"score": 0.00481495049065317, "phrase": "kms_document"}, {"score": 0.004665764181113345, "phrase": "information_system_maintenance"}, {"score": 0.004611013257082199, "phrase": "important_aspect"}, {"score": 0.0045748683993128425, "phrase": "information_system_development"}, {"score": 0.00438105507792004, "phrase": "web-based_systems"}, {"score": 0.004346704947011699, "phrase": "knowledge_management_systems"}, {"score": 0.004195422686382897, "phrase": "dfm"}, {"score": 0.003939296259436904, "phrase": "information_systems"}, {"score": 0.0038624981944755813, "phrase": "usual_system_design_considerations"}, {"score": 0.0030254743224136273, "phrase": "useful_knowledge"}, {"score": 0.0027961342030212353, "phrase": "well-established_kms."}, {"score": 0.0022688141624966967, "phrase": "kms_better_balances_maintenance_effort"}, {"score": 0.0021049977753042253, "phrase": "best_balance"}], "paper_keywords": ["knowledge management", " knowledge design", " knowledge maintenance", " knowledge search", " linking", " links"], "paper_abstract": "Information system maintenance is an important aspect of information system development, especially in systems that provide dynamic content, such as Web-based systems and Knowledge Management Systems (KMS). Design for Maintenance (DFM) is an approach that argues that maintenance effort should be considered during the design of information systems in addition to the usual system design considerations. This research examines how the design of links among knowledge documents in a KMS affects both their maintenance and use. We argue that providing links among knowledge documents increases the cost of maintenance because when a document changes, the documents that link to and from that document are more likely to need changes. At the same, linking knowledge documents makes it easier to locate useful knowledge and thus increases use. We examine this tension between use and maintenance using 10 years of data from a well-established KMS. Our results indicate that as the number of links among documents increases, both maintenance effort and use for these documents increase. Our analyses suggest two DFM principles for dynamic content in practice. First, knowledge coupling (i.e., linking) to documents internal to the KMS rather than sources external to the KMS better balances maintenance effort and use. Second, designing small, knowledge cohesive documents (e.g., 250-350 words) leads to the best balance between maintenance effort and use.", "paper_title": "Design for maintenance: how KMS document linking decisions affect maintenance effort and use", "paper_id": "WOS:000345191400003"}