{"auto_keywords": [{"score": 0.04895586541793087, "phrase": "k-means"}, {"score": 0.010939564639293785, "phrase": "clustering_quality"}, {"score": 0.010484606042096827, "phrase": "feature_weights"}, {"score": 0.00481495049065317, "phrase": "feature_weight_self-adjustment_mechanism"}, {"score": 0.0047468516620285525, "phrase": "k-means_clustering_algorithm"}, {"score": 0.004337276328199398, "phrase": "k-means_algorithm"}, {"score": 0.003962899903266524, "phrase": "meaningful_clustering_phenomenon"}, {"score": 0.0037969755088553326, "phrase": "specific_subset"}, {"score": 0.0035525230119401153, "phrase": "novel_feature_weight_self-adjustment"}, {"score": 0.0032456625605347417, "phrase": "fwsa_mechanism"}, {"score": 0.0031244995579170465, "phrase": "optimization_problem"}, {"score": 0.0028409576481842457, "phrase": "adjustment_margin"}, {"score": 0.0028006988338192375, "phrase": "feature_weight"}, {"score": 0.0023936956017015696, "phrase": "synthetic_and_real_data"}, {"score": 0.0022824314760583834, "phrase": "proposed_fwas_mechanism"}, {"score": 0.002186712881521657, "phrase": "recent_similar_feature_weighting_work"}], "paper_keywords": [""], "paper_abstract": "K-means is one of the most popular and widespread partitioning clustering algorithms due to its superior scalability and efficiency. Typically, the K-means algorithm treats all features fairly and sets weights of all features equally when evaluating dissimilarity. However, a meaningful clustering phenomenon often occurs in a subspace defined by a specific subset of all features. To address this issue, this paper proposes a novel feature weight self-adjustment (FWSA) mechanism embedded into K-means in order to improve the clustering quality of K-means. In the FWSA mechanism, finding feature weights is modeled as an optimization problem to simultaneously minimize the separations within clusters and maximize the separations between clusters. With this objective, the adjustment margin of a feature weight can be derived based on the importance of the feature to the clustering quality. At each iteration in K-means, all feature weights are adaptively updated by adding their respective adjustment margins. A number of synthetic and real data are experimented on to show the benefits of the proposed FWAS mechanism. In addition, when compared to a recent similar feature weighting work, the proposed mechanism illustrates several advantages in both the theoretical and experimental results. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Developing a feature weight self-adjustment mechanism for a K-means clustering algorithm", "paper_id": "WOS:000257377100011"}