{"auto_keywords": [{"score": 0.03373214653721467, "phrase": "objective_decrement"}, {"score": 0.015719716506582538, "phrase": "decremental_multiobjective_optimization_problems"}, {"score": 0.012124281064568091, "phrase": "pareto-optimal_set"}, {"score": 0.009832574761698248, "phrase": "decremented_objective"}, {"score": 0.004626680470601208, "phrase": "evolutionary_algorithm"}, {"score": 0.004574247691703376, "phrase": "multiobjective_optimization_problems"}, {"score": 0.0044967055264893184, "phrase": "dynamic_environment"}, {"score": 0.0032860401904845522, "phrase": "inheritance_strategy"}, {"score": 0.003068537223324389, "phrase": "good_chromosomes"}, {"score": 0.0026302120935562568, "phrase": "experimental_results"}, {"score": 0.0024984517279573906, "phrase": "better_performance"}, {"score": 0.002241517354570928, "phrase": "better_quality"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "In this article, an evolutionary algorithm for multiobjective optimization problems in a dynamic environment is studied. In particular, we focus on decremental multiobjective optimization problems, where some objectives may be deleted during evolution-for such a process we call it objective decrement. It is shown that the Pareto-optimal set after objective decrement is actually a subset of the Pareto-optimal set before objective decrement. Based on this observation, the inheritance strategy is suggested. When objective decrement takes place, this strategy selects good chromosomes according to the decremented objective set from the solutions found before objective decrement, and then continues to optimize them via evolution for the decremented objective set. The experimental results showed that this strategy can help MOGAs achieve better performance than MOGAs without using the strategy, where the evolution is restarted when objective decrement occurs. More solutions with better quality are found during the same time span. (c) 2007 Wiley Periodicals, Inc.", "paper_title": "An evolutionary strategy for decremental multiobjective optimization problems", "paper_id": "WOS:000247838000002"}