{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intelligent_medical_devices"}, {"score": 0.008225245483728124, "phrase": "secure_communications"}, {"score": 0.0076426634736726186, "phrase": "developed_system"}, {"score": 0.004631758267671427, "phrase": "elders'_states"}, {"score": 0.004438250823243621, "phrase": "health_care_industries"}, {"score": 0.003996727479807572, "phrase": "administrative_costs"}, {"score": 0.0036553070575015344, "phrase": "sensitive_and_confidential_information"}, {"score": 0.0034217766191752628, "phrase": "similar_expert_system"}, {"score": 0.0033170847930578473, "phrase": "instantaneous_management"}, {"score": 0.0032914145394036657, "phrase": "clinical_trails"}, {"score": 0.003178326919668771, "phrase": "clinical_professionals"}, {"score": 0.003141498438356646, "phrase": "trail_investigators"}, {"score": 0.003033546013625887, "phrase": "knowledge_base"}, {"score": 0.002952146666681891, "phrase": "future_clinical_trials"}, {"score": 0.002850682396853918, "phrase": "standard_operating_process"}, {"score": 0.002828611294209297, "phrase": "project_management"}, {"score": 0.0028067105937184954, "phrase": "clinical_trials"}, {"score": 0.0026892447164623247, "phrase": "irb_certification"}, {"score": 0.0025766822940260963, "phrase": "trial_investigators"}, {"score": 0.002205560249972527, "phrase": "potential_attacks"}, {"score": 0.002154693685426657, "phrase": "developed_irb_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Elder", " Intelligent medical device", " Expert system", " IRB system", " Healthcare", " Security", " Privacy"], "paper_abstract": "Considering the demand for improvement of monitoring the elders' states of health, various kinds of intelligent medical devices have been designed by health care industries recently. This paper, therefore, develops an integrated Institutional Review Board (IRB) system to connect to hospitals, clinics, manufacturers, and customers for sharing information, reducing administrative costs, and further improving the quality of intelligent medical devices design. Moreover, two efficient security protocols are designed to establish secure communications in our developed integrated IRB system for protecting sensitive and confidential information. Main contributions of our developed IRB system are listed below. (i) The developed system provides a similar expert system to assist the development of intelligent medical devices and instantaneous management of clinical trails. (ii) Information about clinical trials and knowledge, clinical professionals, and trail investigators can be well constructed and maintained as a knowledge base for improving quality and efficiency of future clinical trials. (iii) The system provides a standard operating process and project management for clinical trials. (iv) It is efficient in accessing to IRB certification. (v) The developed system allows or assists the trial investigators and manufactures to communicate and cooperate with one another via a platform. (vi) Secure communications can be established in our IRB system, and hence all sensitive and confidential information can be protected from being disclosed. (vii) It is secure against potential attacks while users login to the developed IRB system. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A secure IRB system for assisting the development of intelligent medical devices", "paper_id": "WOS:000307796300022"}