{"auto_keywords": [{"score": 0.03144592789510008, "phrase": "intra-oral_pressure"}, {"score": 0.00481495049065317, "phrase": "facial_muscle_activation"}, {"score": 0.0046159158660556985, "phrase": "mouthpiece_force"}, {"score": 0.004478782833067256, "phrase": "trumpet_performance"}, {"score": 0.004319566932528865, "phrase": "multiple_factors"}, {"score": 0.004216566615939546, "phrase": "physiological_point"}, {"score": 0.004017846065981189, "phrase": "simple_musical_tone"}, {"score": 0.0033929894721242367, "phrase": "previous_studies"}, {"score": 0.0032722454818973853, "phrase": "control_parameters"}, {"score": 0.003213489259323924, "phrase": "quasi-static_regime"}, {"score": 0.0030991131563500446, "phrase": "present_investigation"}, {"score": 0.0028823939507764238, "phrase": "facial_muscular_activity"}, {"score": 0.0027463775689957255, "phrase": "radiated_sound"}, {"score": 0.002478225374613311, "phrase": "experimental_conditions"}, {"score": 0.0021049977753042253, "phrase": "different_dynamics"}], "paper_keywords": [""], "paper_abstract": "Trumpet performance builds on the synergy of multiple factors. From a physiological point of view, the production of a simple musical tone relies on the control of the pressure at the lips, the contact force on the mouthpiece, and the oral articulatory gestures and configurations. Whereas previous studies described the magnitude of these control parameters in the quasi-static regime of the oscillation, the present investigation focuses on their temporal evolution and interrelation. Intra-oral pressure, mouthpiece force, facial muscular activity of two groups of muscles, and the radiated sound were recorded from three professional players performing isolated and articulated tones with three different dynamics. Results showed that the experimental conditions affected the amount and location of variability in the performance, and the behaviour of intra-oral pressure at note initiation. All together, this suggests that different dynamics and sequencing may cause a reorganization of the mechanisms underlying the production of a tone.", "paper_title": "Measures of Facial Muscle Activation, Intra-oral Pressure and Mouthpiece Force in Trumpet Playing", "paper_id": "WOS:000305326400005"}