{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "demographic_data"}, {"score": 0.049368593327477166, "phrase": "hipaa_privacy_rule"}, {"score": 0.0382538797366961, "phrase": "patient_demographics"}, {"score": 0.03394557417182775, "phrase": "re-identification_risk"}, {"score": 0.03133755014744721, "phrase": "safe_harbor"}, {"score": 0.004708152527097594, "phrase": "objective_healthcare_organizations"}, {"score": 0.004620957579769604, "phrase": "patient_records"}, {"score": 0.004161553532799662, "phrase": "alternative_model"}, {"score": 0.0041151131903594445, "phrase": "privacy_rule"}, {"score": 0.0037899595175206143, "phrase": "published_methodologies"}, {"score": 0.0037058116979705857, "phrase": "intuitive_approach"}, {"score": 0.00342568771304873, "phrase": "patient_cohorts"}, {"score": 0.0034001358540125303, "phrase": "five_medical_centers"}, {"score": 0.0033496005635637316, "phrase": "nih-sponsored_electronic_medical_records_and_genomics_network"}, {"score": 0.0031195948946937378, "phrase": "safe_harbor_policy"}, {"score": 0.0030847461428168614, "phrase": "relative_risk_rate"}, {"score": 0.0030275252142439213, "phrase": "alternative_policies"}, {"score": 0.00286213454317036, "phrase": "alternative_de-identification_models"}, {"score": 0.002675516297446243, "phrase": "patient_ages"}, {"score": 0.002510424048850241, "phrase": "de-identification_approach"}, {"score": 0.0023466842270226888, "phrase": "alternative_de-identification_policies"}, {"score": 0.002320449502337321, "phrase": "safe_harbor_model"}, {"score": 0.0021049977753042253, "phrase": "population_statistics"}], "paper_keywords": [""], "paper_abstract": "Objective Healthcare organizations must de-identify patient records before sharing data. Many organizations rely on the Safe Harbor Standard of the HIPAA Privacy Rule, which enumerates 18 identifiers that must be suppressed (eg, ages over 89). An alternative model in the Privacy Rule, known as the Statistical Standard, can facilitate the sharing of more detailed data, but is rarely applied because of a lack of published methodologies. The authors propose an intuitive approach to de-identifying patient demographics in accordance with the Statistical Standard. Design The authors conduct an analysis of the demographics of patient cohorts in five medical centers developed for the NIH-sponsored Electronic Medical Records and Genomics network, with respect to the US census. They report the re-identification risk of patient demographics disclosed according to the Safe Harbor policy and the relative risk rate for sharing such information via alternative policies. Measurements The re-identification risk of Safe Harbor demographics ranged from 0.01% to 0.19%. The findings show alternative de-identification models can be created with risks no greater than Safe Harbor. The authors illustrate that the disclosure of patient ages over the age of 89 is possible when other features are reduced in granularity. Limitations The de-identification approach described in this paper was evaluated with demographic data only and should be evaluated with other potential identifiers. Conclusion Alternative de-identification policies to the Safe Harbor model can be derived for patient demographics to enable the disclosure of values that were previously suppressed. The method is generalizable to any environment in which population statistics are available.", "paper_title": "Never too old for anonymity: a statistical standard for demographic data sharing via the HIPAA Privacy Rule", "paper_id": "WOS:000289218000002"}