{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "author_communities"}, {"score": 0.004621148492564008, "phrase": "social_aspects"}, {"score": 0.003956558420993431, "phrase": "standard_classification_schemes"}, {"score": 0.0037798652680135106, "phrase": "participation_profile"}, {"score": 0.003119659433566212, "phrase": "bibliometric_analyses"}, {"score": 0.0029128614098881253, "phrase": "jcr_categories"}, {"score": 0.0027322025124213566, "phrase": "bibliographic_coupling"}, {"score": 0.0027073313904678546, "phrase": "vac"}, {"score": 0.002493333098814506, "phrase": "information_science"}, {"score": 0.0024706232839499546, "phrase": "library_science_journals"}, {"score": 0.0021340985236583034, "phrase": "proposed_vac_method"}, {"score": 0.0021049977753042253, "phrase": "novel_way"}], "paper_keywords": ["informetrics", " scientometrics", " scholarly communication"], "paper_abstract": "Conceptualizations of disciplinarity often focus on the social aspects of disciplines; that is, disciplines are defined by the set of individuals who participate in their activities and communications. However, operationalizations of disciplinarity often demarcate the boundaries of disciplines by standard classification schemes, which may be inflexible to changes in the participation profile of that discipline. To address this limitation, a metric called venue-author-coupling (VAC) is proposed and illustrated using journals from the Journal Citation Report's (JCR) library science and information science category. As JCRs are some of the most frequently used categories in bibliometric analyses, this allows for an examination of the extent to which the journals in JCR categories can be considered as proxies for disciplines. By extending the idea of bibliographic coupling, VAC identifies similarities among journals based on the similarities of their author profiles. The employment of this method using information science and library science journals provides evidence of four distinct subfields, that is, management information systems, specialized information and library science, library science-focused, and information science-focused research. The proposed VAC method provides a novel way to examine disciplinarity from the perspective of author communities.", "paper_title": "Venue-author-coupling: A measure for identifying disciplines through author communities", "paper_id": "WOS:000323388100004"}