{"auto_keywords": [{"score": 0.037280866620429697, "phrase": "subject-specific_surface"}, {"score": 0.00481495049065317, "phrase": "subject-specific_anatomic_structures"}, {"score": 0.004528156929805637, "phrase": "computational_techniques"}, {"score": 0.004477870190590885, "phrase": "finite_element_analysis"}, {"score": 0.004428139418750855, "phrase": "clinical_settings"}, {"score": 0.004118026552723285, "phrase": "unique_model"}, {"score": 0.003601235776892337, "phrase": "template_mesh"}, {"score": 0.0033301694494391643, "phrase": "template_block_structure"}, {"score": 0.0027382040767844093, "phrase": "high_quality"}, {"score": 0.002189105604712615, "phrase": "bony_surface_size"}, {"score": 0.002164738347530834, "phrase": "spatial_position"}, {"score": 0.0021049977753042253, "phrase": "building_block_structures"}], "paper_keywords": ["mapped meshing", " finite element analysis", " multiblock meshing", " subject-specific models", " orthopaedic biomechanics"], "paper_abstract": "To extend the use of computational techniques like finite element analysis to clinical settings, it would be beneficial to have the ability to generate a unique model for every subject quickly and efficiently. This work is an extension of two previously developed mapped meshing tools that utilised force and displacement control to map a template mesh to a subject-specific surface. The objective of this study was to map a template block structure, common to multiblock meshing techniques, to a subject-specific surface. The rationale is that the blocks are considerably less refined and may be readily edited after mapping, thereby yielding a mesh of high quality in less time than mapping the mesh itself. In this paper, the versatility and robustness of the method was verified by processing four data-sets. The method was found to be robust enough to cope with the variability of bony surface size, spatial position and geometry, producing building block structures (BBSs) that generated meshes comparable to those produced using BBSs that were created manually.", "paper_title": "Hexahedral meshing of subject-specific anatomic structures using mapped building blocks", "paper_id": "WOS:000320089000003"}