{"auto_keywords": [{"score": 0.04934553301452922, "phrase": "discrete_event_systems"}, {"score": 0.0482650857509263, "phrase": "conjunctive_architecture"}, {"score": 0.03863019075739011, "phrase": "local_diagnosers"}, {"score": 0.025171621517073806, "phrase": "n_local_diagnosis_decisions"}, {"score": 0.00481495049065317, "phrase": "reliable_decentralized_diagnosis"}, {"score": 0.004355026964936104, "phrase": "conjunctive_decentralized_diagnosis"}, {"score": 0.004031238480458909, "phrase": "decentralized_diagnosis"}, {"score": 0.003760385494931853, "phrase": "diagnosis_decisions"}, {"score": 0.003246672441842787, "phrase": "local_diagnosis_decisions"}, {"score": 0.0021049977753042253, "phrase": "reliable_conjunctive_decentralized_diagnoser"}], "paper_keywords": ["discrete event system", " decentralized diagnosis", " conjunctive codiagnosability", " reliability", " delay bound"], "paper_abstract": "In this paper, we study conjunctive decentralized diagnosis of discrete event systems (DESs). In most existing works on decentralized diagnosis of DESs, it is implicitly assumed that diagnosis decisions of all local diagnosers are available to detect a failure. However, it may be possible that some local diagnosis decisions are not available, due to some reasons. Letting n be the number of local diagnosers, the notion of (n, k)-conjunctive codiagnosability guarantees that the occurrence of any failure is detected in the conjunctive architecture as long as at least k of the n local diagnosis decisions are available. We propose an algorithm for verifying (n, k)-conjunctive codiagnosability. To construct a reliable conjunctive decentralized diagnoser, we need to compute the delay bound within which the occurrence of any failure can be detected as long as at least k of the n local diagnosis decisions are available. We show how to compute the delay bound.", "paper_title": "Reliable Decentralized Diagnosis of Discrete Event Systems Using the Conjunctive Architecture", "paper_id": "WOS:000342738700019"}