{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "decision_making"}, {"score": 0.0047051051659828275, "phrase": "organizational_life"}, {"score": 0.004555499634179394, "phrase": "participatory_process"}, {"score": 0.004492841495994535, "phrase": "multiple_decision_makers"}, {"score": 0.004002972723329302, "phrase": "important_issue"}, {"score": 0.0037696519417841287, "phrase": "decision_makers"}, {"score": 0.003517223847512266, "phrase": "full_and_unanimous_agreement"}, {"score": 0.0034368818187904744, "phrase": "stringent_concept"}, {"score": 0.0031918759137610523, "phrase": "pragmatic_point"}, {"score": 0.002896535621940078, "phrase": "fuzzy_sets"}, {"score": 0.0028566300478906916, "phrase": "new_tools"}, {"score": 0.0026651772919894534, "phrase": "accepted_solution"}, {"score": 0.0025802660239538353, "phrase": "major_aim"}, {"score": 0.002407290605654707, "phrase": "great_attention"}], "paper_keywords": ["Group decision making", " consensus", " fuzzy set theory", " fuzzy logic"], "paper_abstract": "Group decision making is part of every organizational life. It is a type of participatory process in which multiple decision makers acting collectively, analyze problems, consider and evaluate several alternatives, and select from among the alternatives a solution. In such a situation, an important issue is the level of agreement or consensus achieved among the group of decision makers before obtaining the solution. In the beginning, consensus was meant as a full and unanimous agreement. Regrettably, this stringent concept of consensus in many cases is a utopia. As a result, and from a pragmatic point of view, it makes more sense to speak about a degree of consensus and, here, the theory of fuzzy sets has delivered new tools for the analysis of such imprecise phenomena like consensus. Given the significance of reaching an accepted solution by all the decision makers, consensus is a major aim of group decision making problems and, in such a way, it has obtained a great attention in the literature. However, there still exist several dares which have to be tackled by the researchers. The purpose of this paper is to bring out several issues that represent challenges that have to be faced.", "paper_title": "Fuzzy decision making and consensus: Challenges", "paper_id": "WOS:000362970400010"}