{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "search_engine_development_tools"}, {"score": 0.026070058404057708, "phrase": "class_project"}, {"score": 0.004569630374630379, "phrase": "computer_science"}, {"score": 0.004522080178250592, "phrase": "information_systems"}, {"score": 0.0043367547691560175, "phrase": "latest_development"}, {"score": 0.004202741104973709, "phrase": "rapid_development"}, {"score": 0.00396767023935381, "phrase": "internet-related_technologies"}, {"score": 0.0038854765143440965, "phrase": "web_search_engines"}, {"score": 0.0037066895459425824, "phrase": "previous_research"}, {"score": 0.003480993634130542, "phrase": "students'_learning"}, {"score": 0.0030062165552187086, "phrase": "spidersrus"}, {"score": 0.002974886595640409, "phrase": "greenstone"}, {"score": 0.0029285103758715995, "phrase": "alkaline"}, {"score": 0.0028527866590859967, "phrase": "evaluation_study"}, {"score": 0.002301211274459965, "phrase": "overall_satisfaction"}, {"score": 0.0021049977753042253, "phrase": "internet_applications_development"}], "paper_keywords": [""], "paper_abstract": "It is important for education in computer science and information systems to keep up to date with the latest development in technology. With the rapid development of the Internet and the Web, many schools have included Internet-related technologies, such as Web search engines and e-commerce, as part of their curricula. Previous research has shown that it is effective to use search engine development tools to facilitate students' learning. However, the effectiveness of these tools in the classroom has not been evaluated. In this article, we review the design of three search engine development tools, SpidersRUs, Greenstone, and Alkaline, followed by an evaluation study that compared the three tools in the classroom. In the study, 33 students were divided into 13 groups and each group used the three tools to develop three independent search engines in a class project. Our evaluation results showed that SpidersRUs performed better than the two other tools in overall satisfaction and the level of knowledge gained in their learning experience when using the tools for a class project on Internet applications development.", "paper_title": "Evaluating the Use of Search Engine Development Tools in IT Education", "paper_id": "WOS:000274038400005"}