{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_summarization"}, {"score": 0.0417800946642881, "phrase": "complex_networks"}, {"score": 0.0045877173513910055, "phrase": "huge_amount"}, {"score": 0.004487989502479992, "phrase": "digital_media"}, {"score": 0.0038818006513785977, "phrase": "extractive_summary"}, {"score": 0.0035082436540296406, "phrase": "common_meaningful_nouns"}, {"score": 0.0031845067058084613, "phrase": "network_concepts"}, {"score": 0.003142732162296465, "phrase": "node_degree"}, {"score": 0.00308788133472785, "phrase": "shortest_paths"}, {"score": 0.002941913249957503, "phrase": "additional_summarizer"}, {"score": 0.0028652153774536967, "phrase": "highest_ranked_sentences"}, {"score": 0.0027660443371695024, "phrase": "voting_system"}, {"score": 0.002670296619878048, "phrase": "brazilian_portuguese_texts"}, {"score": 0.0026352496813713292, "phrase": "cn-summ_versions"}, {"score": 0.0025328377393370642, "phrase": "deep_linguistic_knowledge"}, {"score": 0.0023708980662168525, "phrase": "expensive_linguistic_resources"}, {"score": 0.0021049977753042253, "phrase": "important_text_features"}], "paper_keywords": ["Automatic summarization", " Complex networks", " Network measurements", " Sentence extraction", " Summary informativeness"], "paper_abstract": "Automatic summarization of texts is now crucial for several information retrieval tasks owing to the huge amount of information available in digital media, which has increased the demand for simple, language-independent extractive summarization strategies. In this paper, we employ concepts and metrics of complex networks to select sentences for an extractive summary. The graph or network representing one piece of text consists of nodes corresponding to sentences, while edges connect sentences that share common meaningful nouns. Because various metrics could be used, we developed a set of 14 summarizers, generically referred to as CN-Summ, employing network concepts such as node degree, length of shortest paths, d-rings and k-cores. An additional summarizer was created which selects the highest ranked sentences in the 14 systems, as in a voting system. When applied to a corpus of Brazilian Portuguese texts, some CN-Summ versions performed better than summarizers that do not employ deep linguistic knowledge, with results comparable to state-of-the-art summarizers based on expensive linguistic resources. The use of complex networks to represent texts appears therefore as suitable for automatic summarization, consistent with the belief that the metrics of such networks may capture important text features. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "A complex network approach to text summarization", "paper_id": "WOS:000262768400013"}