{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "kaos"}, {"score": 0.01856907284292394, "phrase": "tr_systems"}, {"score": 0.004701015188740582, "phrase": "teleo-reactive_systems"}, {"score": 0.004626553332470938, "phrase": "teleo-reactive"}, {"score": 0.004589829614390641, "phrase": "tr"}, {"score": 0.0044101380740283825, "phrase": "reactive_systems"}, {"score": 0.004340263267055143, "phrase": "account_goals"}, {"score": 0.003758981686762617, "phrase": "controlled_experiment"}, {"score": 0.003669941438286456, "phrase": "bachelor_students"}, {"score": 0.0035687137873965684, "phrase": "requirements_model"}, {"score": 0.003526186748088922, "phrase": "mobile_robotic_system"}, {"score": 0.0034289106230496816, "phrase": "evaluated_languages"}, {"score": 0.003065830998810144, "phrase": "second_language"}, {"score": 0.003005151718290603, "phrase": "statistical_analysis"}, {"score": 0.0025202582748972122, "phrase": "understandability_attribute"}, {"score": 0.0023079225317714815, "phrase": "notational_differences"}, {"score": 0.002147540520631409, "phrase": "kaos."}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Teleo-Reactive", " Requirements engineering", " Controlled experiment"], "paper_abstract": "Context: Teleo-Reactive (TR) specifications allow engineers to define the behavior of reactive systems while taking into account goals and changes in the state of the environment. Objective: This article evaluates two different Goal Oriented Requirements Engineering notations, i* and KAOS, to determine their understandability level for specifying TR systems. Method: A controlled experiment was performed by two groups of Bachelor students. Each group first analyzed a requirements model of a mobile robotic system, specified using one of the evaluated languages, and then they filled in a questionnaire to evaluate its understandability. Afterwards, each group proceeded similarly with the model of another system specified with the second language. Results: The statistical analysis of the data obtained by means of the experiment showed that the understandability of i* is higher than that of KAOS when modeling TR systems. Conclusion: Both languages are suitable for specifying TR systems although their notations should be specialized to maximize the understandability attribute. i* surpasses KAOS due to two main reasons: i* models represent dependencies between agents and goals or tasks; and notational differences between tasks and goals in i* are more evident than those between goals and requirements in KAOS. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A controlled experiment to evaluate the understandability of KAOS and i* for modeling Teleo-Reactive systems", "paper_id": "WOS:000347739200001"}