{"auto_keywords": [{"score": 0.0343649692424503, "phrase": "inclusion_test"}, {"score": 0.032461751717849395, "phrase": "test_point"}, {"score": 0.00481495049065317, "phrase": "point-in-polygon_inclusion_test"}, {"score": 0.004562847483469705, "phrase": "new_point_inclusion_algorithms"}, {"score": 0.004518442937844318, "phrase": "non-convex_polygons"}, {"score": 0.004017989546119125, "phrase": "deformable_or_moving_polygons"}, {"score": 0.003385480888810982, "phrase": "special_cases"}, {"score": 0.00311510526624626, "phrase": "barycentric_coordinates"}, {"score": 0.002689430273401131, "phrase": "special_simplicial"}, {"score": 0.0023677483882740317, "phrase": "appropriate_ordering"}, {"score": 0.002333193766510394, "phrase": "rejection_tests"}, {"score": 0.002146676231930341, "phrase": "ray-crossing_methods"}, {"score": 0.0021049977753042253, "phrase": "significant_improvement"}], "paper_keywords": ["inclusion test", " point-in-polygon", " rejection test", " barycentric coordinates", " non-convex polygon"], "paper_abstract": "In this work we present new point inclusion algorithms for non-convex polygons. These algorithms do not perform any pre-processing or any type of decomposition nor features classification, which makes them especially suitable for deformable or moving polygons. The algorithms are more accurate and robust than others in the sense that they consider the inclusion of the point in the vertices and edges of the polygon, and deal with the special cases correctly. In order to perform this inclusion test efficiently, they use the sign of the barycentric coordinates of the test point with regard to the triangles formed by the edges and an origin that depends on the test point. This set of triangles, which is a special simplicial covering of the polygon, is constructed after a transformation of the polygon that simplifies the calculations involved in the inclusion test. Then, an appropriate ordering of the rejection tests allows us to optimize this method. Our algorithms have been tested for robustness and compared with ray-crossing methods, showing a significant improvement.", "paper_title": "Robust and Optimized Algorithms for the Point-in-Polygon Inclusion Test without Pre-processing", "paper_id": "WOS:000272569400021"}