{"auto_keywords": [{"score": 0.04981057254655338, "phrase": "cloud_computing_environments"}, {"score": 0.0198293879823406, "phrase": "saas_systems"}, {"score": 0.008904473073606436, "phrase": "semantic_interoperability"}, {"score": 0.008233167250039655, "phrase": "cloud_saas_systems"}, {"score": 0.006728748866994216, "phrase": "proposed_semantic_interoperability_framework"}, {"score": 0.006348532739447297, "phrase": "semantic_interoperability_framework"}, {"score": 0.00481495049065317, "phrase": "service_systems"}, {"score": 0.004413193567592802, "phrase": "cloud_provider"}, {"score": 0.004207230913063179, "phrase": "common_tactic"}, {"score": 0.004102096151528319, "phrase": "interoperability_framework"}, {"score": 0.0038559853156801094, "phrase": "syntactic_interoperability"}, {"score": 0.003686287033216415, "phrase": "semantic_interoperability_issues"}, {"score": 0.003312486229143855, "phrase": "service_oriented_architecture"}, {"score": 0.003282193254476655, "phrase": "statistical_analysis"}, {"score": 0.003035711716881469, "phrase": "related_works"}, {"score": 0.0029764767329116875, "phrase": "problem_statement"}, {"score": 0.002959765109527493, "phrase": "research_objectives"}, {"score": 0.002910189469006115, "phrase": "next_step"}, {"score": 0.0028857142486884775, "phrase": "saas"}, {"score": 0.002607527117561699, "phrase": "evaluation_methods"}, {"score": 0.002450864311898833, "phrase": "extensive_experimentation"}, {"score": 0.0022270182923887012, "phrase": "proposed_framework"}, {"score": 0.002195866991284673, "phrase": "significant_improvement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cloud computing", " Software as a service", " Interoperability"], "paper_abstract": "In cloud computing environments in software as a service (SaaS) level, interoperability refers to the ability of SaaS systems on one cloud provider to communicate with SaaS systems on another cloud provider. One of the most important barriers to the adoption of SaaS systems in cloud computing environments is interoperability. A common tactic for enabling interoperability is the use of an interoperability framework or model. During the past few years, in cloud SaaS level, various interoperability frameworks and models have been developed to provide interoperability between systems. The syntactic interoperability of SaaS systems have already been intensively researched. However, not enough consideration has been given to semantic interoperability issues. Achieving semantic interoperability is a challenge within the world of SaaS in cloud computing environments. Therefore, a semantic interoperability framework for SaaS systems in cloud computing environments is needed. We develop a semantic interoperability framework for cloud SaaS systems. The capabilities and value of service oriented architecture for semantic interoperability within cloud SaaS systems have been studied and demonstrated. This paper is accomplished through a number of steps (research methodology). It begins with a study on related works in the literature. Then, problem statement and research objectives are explained. In the next step, semantic interoperability requirements for SaaS systems in cloud computing environments that are needed to support are analyzed. The details of the proposed semantic interoperability framework for SaaS systems in cloud computing environments are presented. It includes the design of the proposed semantic interoperability framework. Finally, the evaluation methods of the semantic interoperability framework are elaborated. In order to evaluate the effectiveness of the proposed semantic interoperability framework for SaaS systems in cloud computing environments, extensive experimentation and statistical analysis have been performed. The experiments and statistical analysis specify that the proposed semantic interoperability framework for cloud SaaS systems is able to establish semantic interoperability between cloud SaaS systems in a more efficient way. It is concluded that using the proposed framework, there is a significant improvement in the effectiveness of semantic interoperability of SaaS systems in cloud computing environments. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A semantic interoperability framework for software as a service systems in cloud computing environments", "paper_id": "WOS:000336872300009"}