{"auto_keywords": [{"score": 0.038703030275359485, "phrase": "covering_array"}, {"score": 0.017687310902902504, "phrase": "strength_t"}, {"score": 0.00481495049065317, "phrase": "prime_power_q_equivalent"}, {"score": 0.004633888966463624, "phrase": "q_x_q_cyclotomic_matrix"}, {"score": 0.004347057700479576, "phrase": "addition_table"}, {"score": 0.0041835168653521, "phrase": "character_theoretic_arguments"}, {"score": 0.004112812699639956, "phrase": "epsilon-biased_array"}, {"score": 0.0038253590626087237, "phrase": "suitable_choice"}, {"score": 0.0033804443117334535, "phrase": "different_character-theoretic_argument"}, {"score": 0.0030908254851076005, "phrase": "epsilon-biased_arrays"}, {"score": 0.0026507289852980512, "phrase": "character_theory"}, {"score": 0.0024863459251358217, "phrase": "cyclotomic_matrix"}, {"score": 0.002332133125576037, "phrase": "precise_set"}, {"score": 0.0023123057299992587, "phrase": "small_primes"}], "paper_keywords": ["Covering array", " Orthogonal array", " epsilon-biased array", " Cyclotomic class"], "paper_abstract": "For a prime power q equivalent to 1 (mod nu), the q x q cyclotomic matrix, whose entries are the discrete logarithms modulo nu of the entries in the addition table of F(q), has been shown using character theoretic arguments to produce an epsilon-biased array, provided that q is large enough as a function of nu and epsilon. A suitable choice of epsilon ensures that the array is a covering array of strength t when q > t(2)nu(4t). On the other hand, when nu = 2, using a different character-theoretic argument the matrix has been shown to be a covering array of strength t when q > t(2)2(2t-2). The restrictions on epsilon-biased arrays are more severe than on covering arrays. This is exploited to prove that for all nu >= 2, the matrix is a covering array of strength t whenever q > t(2)nu(2t), again using character theory. A number of constructions of covering arrays arise by developing and extending the cyclotomic matrix. For each construction, extensive computations for various choices of t and nu are reported that determine the precise set of small primes for which the construction produces a covering array. As a consequence, many covering arrays are found when q is smaller than the bound t(2)nu(2t), and consequences for the existence of covering arrays reported.", "paper_title": "Covering arrays from cyclotomy", "paper_id": "WOS:000276079800008"}