{"auto_keywords": [{"score": 0.04567662402064333, "phrase": "database_technology"}, {"score": 0.01068784219624087, "phrase": "next_wave"}, {"score": 0.009218892268673826, "phrase": "different_views"}, {"score": 0.00481495049065317, "phrase": "data_usability_-_concepts"}, {"score": 0.004710854091689325, "phrase": "large_availability"}, {"score": 0.0044896599221451216, "phrase": "serious_privacy_concerns"}, {"score": 0.004278807087784626, "phrase": "adequate_solutions"}, {"score": 0.004149792080414689, "phrase": "delicate_balance"}, {"score": 0.004095692768056685, "phrase": "individual's_privacy_and_convenience_and_data"}, {"score": 0.003423042581201533, "phrase": "important_challenge"}, {"score": 0.003108735847242537, "phrase": "high-assurance_privacy"}, {"score": 0.00270221723573854, "phrase": "conventional_view_technology"}, {"score": 0.0025977542995083624, "phrase": "single_attribute_value"}, {"score": 0.0025638362414466278, "phrase": "single_triple"}, {"score": 0.0023487324083283205, "phrase": "even_a_single_value"}, {"score": 0.0023180581939456686, "phrase": "triple's_attribute"}, {"score": 0.0021422271362195734, "phrase": "important_building_block"}], "paper_keywords": [""], "paper_abstract": "The large availability of repositories storing various types of information about individuals has raised serious privacy concerns over the past decade. Nonetheless, database technology is far from providing adequate solutions to this problem that requires a delicate balance between an individual's privacy and convenience and data usability by enterprises and organizations - a database which is rigid and over-protective may render data of little value. Though these goals may seem odd, we argue that the development of solutions able to reconcile them will be an important challenge to be addressed in the next few years. We believe that the next wave of database technology will be represented by a DBMS that provides high-assurance privacy and security. In this paper, we elaborate on such challenges. In particular, we argue that we need to provide different views of data at a very fine level of granularity; conventional view technology is able to select only up to a single attribute value for a single triple. We need to go even beyond this level. That is, we need a mechanism by which even a single value inside a triple's attribute may have different views; we refer them as micro-views. We believe that such a mechanism can be an important building block, together with other mechanisms and tools, of the next wave of database technology.", "paper_title": "Micro-views, or on how to protect privacy while enhancing data usability - Concepts and challenges", "paper_id": "WOS:000235954900002"}