{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "relative_entropy"}, {"score": 0.010782369631239021, "phrase": "symmetrized_relative_entropy"}, {"score": 0.004779876533667754, "phrase": "probabilistic_automata"}, {"score": 0.004693300099911199, "phrase": "exhaustive_analysis"}, {"score": 0.0043464021636703066, "phrase": "unambiguous_probabilistic_automata"}, {"score": 0.004307778388425421, "phrase": "unambiguous_probabilistic_automaton"}, {"score": 0.004252063063815893, "phrase": "shortest-distance_problem"}, {"score": 0.004205660924155212, "phrase": "appropriate_semiring"}, {"score": 0.004159763048814389, "phrase": "efficient_exact_and_approximate_algorithms"}, {"score": 0.003700170452390401, "phrase": "arbitrary_probabilistic_automata"}, {"score": 0.0032671775301001483, "phrase": "machine_learning_algorithms"}, {"score": 0.002992313172550772, "phrase": "negative_definite_symmetric"}, {"score": 0.002905914725757534, "phrase": "kernel_methods"}, {"score": 0.00253758084385033, "phrase": "gaussian_kernels"}, {"score": 0.00224032791638295, "phrase": "monoid_morphism"}, {"score": 0.0021835829960683666, "phrase": "efficient_algorithms"}, {"score": 0.0021049977753042253, "phrase": "probabilistic_automaton"}], "paper_keywords": [""], "paper_abstract": "We present an exhaustive analysis of the problem of computing the relative entropy of two probabilistic automata. We show that the problem of computing the relative entropy of unambiguous probabilistic automata can be formulated as a shortest-distance problem over an appropriate semiring, give efficient exact and approximate algorithms for its computation in that case, and report the results of experiments demonstrating the practicality of our algorithms for very large weighted automata. We also prove that the computation of the relative entropy of arbitrary probabilistic automata is PSPACE-complete. The relative entropy is used in a variety of machine learning algorithms and applications to measure the discrepancy of two distributions. We examine the use of the symmetrized relative entropy in machine learning algorithms and show that, contrarily to what is suggested by a number of publications in that domain, the symmetrized relative entropy is neither positive definite symmetric nor negative definite symmetric, which limits its use and application in kernel methods. In particular, the convergence of training for learning algorithms is not guaranteed when the symmetrized relative entropy is used directly as a kernel, or as the operand of an exponential as in the case of Gaussian Kernels. Finally, we show that our algorithm. for the computation of the entropy of an unambiguous probabilistic automaton can be generalized to the computation of the norm of an unambiguous probabilistic automaton by using a monoid morphism. In particular, this yields efficient algorithms for the computation of the L-p-norm. of a probabilistic automaton.", "paper_title": "On the computation of the relative entropy of probabilistic automata", "paper_id": "WOS:000253948900016"}