{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "new_product_development_teams"}, {"score": 0.04586846484671967, "phrase": "knowledge_characteristics"}, {"score": 0.03053782285103673, "phrase": "symbolic-analyst-dependent_organization"}, {"score": 0.02953027403660401, "phrase": "communication-intensive_organization"}, {"score": 0.02887655929253389, "phrase": "knowledge-routinized_organization"}, {"score": 0.004741845603430361, "phrase": "new_product_development_team"}, {"score": 0.004616560363089716, "phrase": "cross-functional_knowledge_conversion_task"}, {"score": 0.004309323675697185, "phrase": "fully_armed_military_force"}, {"score": 0.00402245126752142, "phrase": "knowledge_conversion_process"}, {"score": 0.003991774582021095, "phrase": "new_product_development"}, {"score": 0.0037546039916845947, "phrase": "blackler's_perspective"}, {"score": 0.003697538418750941, "phrase": "suitable_organizational_knowledge_structure"}, {"score": 0.003669330508576073, "phrase": "cross-functional_knowledge_conversion"}, {"score": 0.003545024951402821, "phrase": "continual_steps"}, {"score": 0.0033857878144822906, "phrase": "new_product_development_team's_knowledge_conversion_process"}, {"score": 0.0030414140732789186, "phrase": "complex_structures"}, {"score": 0.002983700956478823, "phrase": "knowledge_conversion"}, {"score": 0.0025694584194998356, "phrase": "expert-dependent_organization"}, {"score": 0.002416589459425828, "phrase": "symbolic-analyst-dependent_organization_structures"}, {"score": 0.0022815262950738814, "phrase": "irregular_problems"}, {"score": 0.0022296340517805125, "phrase": "complex_organizational_structures"}, {"score": 0.0021956951486095805, "phrase": "new_product_development's_knowledge_conversion"}, {"score": 0.0021622717349518744, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Organizational knowledge structure", " New product development team", " Knowledge conversion", " Taiwanese", " Complex"], "paper_abstract": "When a new product development team faces challenges, such as the cross-functional knowledge conversion task, both simple and existing organizational structures are comprised of various management methods and knowledge characteristics, analogous to a fully armed military force. However, these features are not arranged in order of priority. Each step within the knowledge conversion process of new product development may not require such a full depot of management methods and keynotes. Therefore, this study adopted Blackler's perspective to examine the suitable organizational knowledge structure for cross-functional knowledge conversion within new product development teams. This study found that the continual steps of socialization, externalization, combination, and internalization in the new product development team's knowledge conversion process were positively related to various organizational knowledge structures based on a survey of 107 Taiwanese high-technology small and medium-sized enterprises' new product development teams - not merely a simple structure for all steps. Thus, these results confirm that complex structures are required to perform knowledge conversion. Socialization requires knowledge characteristics from both the communication-intensive organization and the symbolic-analyst-dependent organization. Externalization requires elements of knowledge from the communication-intensive organization, the symbolic-analyst-dependent organization, and knowledge-routinized organization. Combination requires features from the knowledge-routinized organization, and internalization requires characteristics from the expert-dependent organization. In addition, this study attempted to integrate the knowledge features from communication-intensive organization and symbolic-analyst-dependent organization structures for the socialization and externalization stages. This effort concentrated on solving novel and irregular problems through a simplification of the complex organizational structures which make the new product development's knowledge conversion run smoother. Crown Copyright (C) 2011 Published by Elsevier B.V. All rights reserved.", "paper_title": "Complex organizational knowledge structures for new product development teams", "paper_id": "WOS:000291073400009"}