{"auto_keywords": [{"score": 0.04958309506789283, "phrase": "matching_law"}, {"score": 0.036962449923098536, "phrase": "synaptic_dynamics"}, {"score": 0.00481495049065317, "phrase": "neural_network_models_of_matching_behavior"}, {"score": 0.004715702140552199, "phrase": "quantitative_description"}, {"score": 0.004683073921949839, "phrase": "choice_behavior"}, {"score": 0.004586531354697466, "phrase": "foraging_tasks"}, {"score": 0.004414653335578912, "phrase": "available_response_alternatives"}, {"score": 0.004104132253183181, "phrase": "matching_behavior"}, {"score": 0.00395026016389782, "phrase": "learning_dynamics"}, {"score": 0.003855347387268162, "phrase": "matching_task"}, {"score": 0.003815369123984481, "phrase": "concurrent_variable_interval"}, {"score": 0.003685067218455088, "phrase": "model_neural_network"}, {"score": 0.0034736499231079083, "phrase": "reward_schedule"}, {"score": 0.0032067276476968032, "phrase": "baiting_fractional_probability"}, {"score": 0.0030017207229983385, "phrase": "always_the_same_decision"}, {"score": 0.0027326751144684386, "phrase": "different_parameters"}, {"score": 0.0026762323224804197, "phrase": "different_types"}, {"score": 0.002427826856342292, "phrase": "stable_states"}, {"score": 0.0023776656246300063, "phrase": "bistable_synapses"}, {"score": 0.002320449502337321, "phrase": "proper_learning_rate"}, {"score": 0.0022255425106527727, "phrase": "qualitatively_different_behaviors"}, {"score": 0.002119702106867801, "phrase": "adaptive_behaviors"}, {"score": 0.0021049977753042253, "phrase": "psychiatric_disorders"}], "paper_keywords": [""], "paper_abstract": "The matching law constitutes a quantitative description of choice behavior that is often observed in foraging tasks. According to the matching law, organisms distribute their behavior across available response alternatives in the same proportion that reinforcers are distributed across those alternatives. Recently a few biophysically plausible neural network models have been proposed to explain the matching behavior observed in the experiments. Here we study systematically the learning dynamics of these networks while performing a matching task on the concurrent variable interval (VI) schedule. We found that the model neural network can operate in one of three qualitatively different regimes depending on the parameters that characterize the synaptic dynamics and the reward schedule: (1) a matching behavior regime, in which the probability of choosing an option is roughly proportional to the baiting fractional probability of that option; (2) a perseverative regime, in which the network tends to make always the same decision; and (3) a tristable regime, in which the network can either perseverate or choose the two targets randomly approximately with the same probability. Different parameters of the synaptic dynamics lead to different types of deviations from the matching law, some of which have been observed experimentally. We show that the performance of the network depends on the number of stable states of each synapse and that bistable synapses perform close to optimal when the proper learning rate is chosen. Because our model provides a link between synaptic dynamics and qualitatively different behaviors, this work provides us with insight into the effects of neuro-modulators on adaptive behaviors and psychiatric disorders.", "paper_title": "Dynamical Regimes in Neural Network Models of Matching Behavior", "paper_id": "WOS:000330521500001"}