{"auto_keywords": [{"score": 0.04773866258910522, "phrase": "super-capacitor"}, {"score": 0.00481495049065317, "phrase": "controlled_charge_equalizer"}, {"score": 0.004755054742217193, "phrase": "series-connected_cells"}, {"score": 0.004410938507689426, "phrase": "series-connected_lithium_batteries"}, {"score": 0.003965468669507077, "phrase": "innovative_lithium-battery_cell-to-cell_active_equalizer"}, {"score": 0.0036097844103129043, "phrase": "energy_tank"}, {"score": 0.0029722900280316216, "phrase": "passive_equalization"}, {"score": 0.0027916287357898544, "phrase": "digitally-controlled_switching_converter"}, {"score": 0.002255431275670053, "phrase": "experimental_results"}, {"score": 0.0022273034991008326, "phrase": "laboratory_tests"}], "paper_keywords": ["Active cell balancing", " battery management system", " dc-dc switching converters", " Li-ion batteries", " super-capacitors"], "paper_abstract": "The charge stored in series-connected lithium batteries needs to be well equalized between the elements of the series. We present here an innovative lithium-battery cell-to-cell active equalizer capable of moving charge between series-connected cells using a super-capacitor as an energy tank. The system temporarily stores the charge drawn from a cell in the super-capacitor, then the charge is moved into another cell without wasting energy as it happens in passive equalization. The architecture of the system which employs a digitally-controlled switching converter is compared with the state of the art, then fully investigated, together with the methodology used in its design. The performance of the system is described by presenting and discussing the experimental results of laboratory tests. The most innovative and attractive aspect of the proposed system is its very high efficiency, which is over 90%.", "paper_title": "High-Efficiency Digitally Controlled Charge Equalizer for Series-Connected Cells Based on Switching Converter and Super-Capacitor", "paper_id": "WOS:000313706700058"}