{"auto_keywords": [{"score": 0.04867268826532295, "phrase": "response_completeness"}, {"score": 0.005542481841011002, "phrase": "study_request"}, {"score": 0.00481495049065317, "phrase": "field_time"}, {"score": 0.004633888966463624, "phrase": "list-based_web_surveys"}, {"score": 0.004575053987970206, "phrase": "short_field_time"}, {"score": 0.004516962628112147, "phrase": "often-cited_benefit"}, {"score": 0.0044786435725543685, "phrase": "web-based_surveys"}, {"score": 0.004421770937919324, "phrase": "oil_pre-recruited_people"}, {"score": 0.004130376386308024, "phrase": "different_deadlines"}, {"score": 0.004095323392273661, "phrase": "participation_influence_response_behavior"}, {"score": 0.0036813725040313002, "phrase": "control_group"}, {"score": 0.0032810180076973806, "phrase": "deadline_oil"}, {"score": 0.0032531496610470377, "phrase": "response_rate"}, {"score": 0.003211788912325178, "phrase": "retention_rate"}, {"score": 0.002899229492461335, "phrase": "tentative_evidence"}, {"score": 0.0026058621464926826, "phrase": "quasi-experimental_fashion"}, {"score": 0.002253826965566618, "phrase": "straightforward_association"}], "paper_keywords": ["Field time", " Deadline", " Response", " Retention", " Completeness"], "paper_abstract": "A short field time is an often-cited benefit of Web-based surveys that rely oil pre-recruited people. However, it has never been examined how different field times as implemented through different deadlines for participation influence response behavior. Four experiments were conducted in which the deadline for taking part in the study was varied across several days, and there was it control group who was not told any deadline. We examined the impact of both stating it deadline versus not stating a deadline and the length of the deadline oil the response rate, the retention rate, and response completeness. It was found that response rises with the number of days it study is in the field. There is tentative evidence that the more generous the deadline, the smaller the retention rate and clear evidence that response completeness is lower. Moreover, in a quasi-experimental fashion it wits explored whether responding late to a study request is associated with being retained until the end of the study and with the completeness of filling out the questionnaire. There is no straightforward association between responding late to a study request on the one hand and retention and response completeness oil the other hand. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "The impact of the field time on response, retention, and response completeness in list-based Web surveys", "paper_id": "WOS:000264263400006"}