{"auto_keywords": [{"score": 0.028780091329039595, "phrase": "abnormal_patterns"}, {"score": 0.015719716506582538, "phrase": "collaboration_systems"}, {"score": 0.009024341466542678, "phrase": "proposed_method"}, {"score": 0.0047468516620285525, "phrase": "manufacturing_companies"}, {"score": 0.004580769304731227, "phrase": "cooperative_companies"}, {"score": 0.004250588556735512, "phrase": "collaboration_system"}, {"score": 0.0039723268236794935, "phrase": "existing_systems"}, {"score": 0.003916098498242888, "phrase": "industrial_sections"}, {"score": 0.0038332390893263844, "phrase": "functional_or_service_requirements"}, {"score": 0.0035949949979695063, "phrase": "existing_system"}, {"score": 0.003265012781840765, "phrase": "customization_processes"}, {"score": 0.003094920033010818, "phrase": "user_requirements"}, {"score": 0.002923214590192792, "phrase": "user_patterns"}, {"score": 0.002780783274864117, "phrase": "data_mining_approach"}, {"score": 0.0026737455737636867, "phrase": "drastic_increase"}, {"score": 0.0026171036268367713, "phrase": "specific_function"}, {"score": 0.0025073851194697397, "phrase": "new_normal_patterns"}, {"score": 0.002454258761940649, "phrase": "long_time"}, {"score": 0.0024022553322977165, "phrase": "comparison_studies"}, {"score": 0.0023766673143502384, "phrase": "apriori-like_approach"}, {"score": 0.002212892265364764, "phrase": "function_modules"}, {"score": 0.002173739308244513, "phrase": "specific_collaboration_system"}, {"score": 0.0021582723621960693, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Reconfiguration", " Data mining", " Pattern analysis", " Collaboration system"], "paper_abstract": "Recently, manufacturing companies have been attempting to increase competitiveness in their business collaboration with cooperative companies rather than within their own companies. In order to facilitate their collaboration, they are attempting to adopt or already using a collaboration system, which supports a number of functions and services. However, it is very difficult to apply existing systems into other organizations or industrial sections without customization or reconfiguration because functional or service requirements of users usually differ according to their domain knowledge. In order to re-apply and disseminate an existing system to other companies, therefore, the system must be reconfigured by modifying, upgrading, or newly developing some portions of the system. During the customization processes, functions or services of the system must be refined in order to satisfy user requirements. For facilitating the reconfiguration of collaboration systems, in this paper, we first define user patterns, and subsequently propose a method for investigating and analyzing patterns based on data mining approach. The proposed method validates normal versus abnormal patterns that show a drastic increase in the use of a specific function or service, and automatically makes the system recognize abnormal patterns as new normal patterns when abnormal patterns continue for a long time. We conduct experiments and comparison studies using an Apriori-like approach in order to establish the effectiveness of the proposed method. We also suggest a guideline for the reconfiguration of function modules or services with a specific collaboration system. Crown Copyright (c) 2011 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Function and service pattern analysis for facilitating the reconfiguration of collaboration systems", "paper_id": "WOS:000302432300016"}