{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_usage_streams"}, {"score": 0.016916078650692928, "phrase": "abs"}, {"score": 0.004751972849082626, "phrase": "web_usage_mining"}, {"score": 0.004705278218845159, "phrase": "significant_research_area"}, {"score": 0.00458297991625839, "phrase": "web_usage_data"}, {"score": 0.0041518897573208785, "phrase": "small_fraction"}, {"score": 0.00390000531646629, "phrase": "reliable_description"}, {"score": 0.0038616499489536123, "phrase": "recent_usage_data"}, {"score": 0.0037985575652591985, "phrase": "data_intralinkings"}, {"score": 0.003384754649268796, "phrase": "web_usage_behaviors"}, {"score": 0.0033514495661346524, "phrase": "corresponding_data_stream_models"}, {"score": 0.003210861212842534, "phrase": "important_consequences"}, {"score": 0.003116989767430614, "phrase": "\"bounce_rate\"_problem"}, {"score": 0.0030660263386795526, "phrase": "usage_streams"}, {"score": 0.002832731124016696, "phrase": "first_data_stream_model"}, {"score": 0.0026871217010784143, "phrase": "first_user-centric_data_stream_model"}, {"score": 0.002386218074955624, "phrase": "existing_models"}, {"score": 0.002308768837799101, "phrase": "recent_data"}, {"score": 0.0022412113034595903, "phrase": "bounce_rates"}, {"score": 0.002175626278359828, "phrase": "theoretical_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Web usage streams", " Intralinking records", " Data stream models", " Bounce rate"], "paper_abstract": "Web usage mining is a significant research area with applications in various fields. However, Web usage data is usually considered streaming, due to its high volumes and rates. Because of these characteristics, we only have access, at any point in time, to a small fraction of the stream. When the data is observed through such a limited window, it is challenging to give a reliable description of the recent usage data. We show that data intralinkings, i.e. a usage record (event) may be associated with other records (events) in the same dataset, are common for Web usage streams. Therefore, in order to have a more authentic grasp of Web usage behaviors, the corresponding data stream models for Web usage streams should be able to process such intralinkings. We study the important consequences of the constraints and intralinkings, through the \"bounce rate\" problem and the clustering of usage streams. Then we propose the user-centric ABS (the Anti-Bouncing Stream) model which combines the advantages of previous models but avoids their drawbacks. First, ABS is the first data stream model that is able to seize the intralinkings between the Web usage records. It is also the first user-centric data stream model that can associate the usage records for the users in the Web usage streams. Second, owing to its simple but effective management principle, the data in ABS is available at any time for analysis. Under the same resource constraints as existing models in the literature, ABS can better model the recent data. Third, ABS can better measure the bounce rates for Web usage streams. We demonstrate its superiority through a theoretical study and experiments on two real-world data sets. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "The anti-bouncing data stream model for web usage streams with intralinkings", "paper_id": "WOS:000338390100050"}