{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large-scale_networks"}, {"score": 0.004685012337701536, "phrase": "real-world_complex_networks"}, {"score": 0.004533685795068016, "phrase": "recent_research"}, {"score": 0.0040192915527630995, "phrase": "highly_interwoven_k-clique_communities"}, {"score": 0.00380511089035825, "phrase": "extensive_memory_requirements"}, {"score": 0.0037636590459094762, "phrase": "execution_time"}, {"score": 0.0033363396054797044, "phrase": "innovative_technique"}, {"score": 0.0032819448594643853, "phrase": "connected_components"}, {"score": 0.0030562674358159945, "phrase": "novel_method"}, {"score": 0.0029573932605287947, "phrase": "input-independent_maximum_degree"}, {"score": 0.0027996401456881806, "phrase": "full_use"}, {"score": 0.0027691111795848183, "phrase": "computational_resources"}, {"score": 0.0027239390917424898, "phrase": "tight_upper_bounds"}, {"score": 0.002536534348967786, "phrase": "real-world_networks"}, {"score": 0.0024143815950383647, "phrase": "almost_optimal_use"}, {"score": 0.0021049977753042253, "phrase": "open-source_implementation"}], "paper_keywords": ["k-clique communities", " parallel community detection method"], "paper_abstract": "The analysis of real-world complex networks has been the focus of recent research. Detecting communities helps in uncovering their structural and functional organization. Valuable insight can be obtained by analyzing the dense, overlapping, and highly interwoven k-clique communities. However, their detection is challenging due to extensive memory requirements and execution time. In this paper, we present a novel, parallel k-clique community detection method, based on an innovative technique which enables connected components of a network to be obtained from those of its subnetworks. The novel method has an unbounded, user-configurable, and input-independent maximum degree of parallelism, and hence is able to make full use of computational resources. Theoretical tight upper bounds on its worst case time and space complexities are given as well. Experiments on real-world networks such as the Internet and the World Wide Web confirmed the almost optimal use of parallelism (i.e., a linear speedup). Comparisons with other state-of-the-art k-clique community detection methods show dramatic reductions in execution time and memory footprint. An open-source implementation of the method is also made publicly available.", "paper_title": "Parallel k-Clique Community Detection on Large-Scale Networks", "paper_id": "WOS:000321153600017"}