{"auto_keywords": [{"score": 0.04736619388826607, "phrase": "scientific_information"}, {"score": 0.037467139229645396, "phrase": "scientific_workflow_systems"}, {"score": 0.004330941610682453, "phrase": "distributed_resources"}, {"score": 0.004285289574869884, "phrase": "systematic_analysis"}, {"score": 0.004151188559520802, "phrase": "growing_need"}, {"score": 0.0041074234667687875, "phrase": "automated_data-driven_applications"}, {"score": 0.003597625122515975, "phrase": "recent_advancements"}, {"score": 0.003503497128638102, "phrase": "major_profit"}, {"score": 0.0027303606813078255, "phrase": "workflow_design"}, {"score": 0.0026168641536413978, "phrase": "complete_framework"}, {"score": 0.0025892330566358503, "phrase": "data_and_process_provenance"}, {"score": 0.0024037949232582462, "phrase": "workflow_provenance"}, {"score": 0.002365815362517737, "phrase": "multi-disciplinary_workflow_system"}, {"score": 0.002316105585203396, "phrase": "generic_provenance_capture"}, {"score": 0.002255431275670053, "phrase": "kepler's_actor-oriented_workflow_environment"}, {"score": 0.0021501863832966966, "phrase": "stored_provenance_information"}, {"score": 0.0021274723597955567, "phrase": "efficient_rerun"}, {"score": 0.0021049977753042253, "phrase": "scientific_workflows"}], "paper_keywords": [""], "paper_abstract": "In many data-driven applications, analysis needs to be performed on scientific information obtained from several sources and generated by computations on distributed resources. Systematic analysis of this scientific information unleashes a growing need for automated data-driven applications that also can keep track of the provenance of the data and processes with little user interaction and overhead. Such data analysis can be facilitated by the recent advancements in scientific workflow systems. A major profit when using scientific workflow systems is the ability to make provenance collection a part of the workflow. Specifically, provenance should include not only the standard data lineage information but also information about the context in which the workflow was used, execution that processed the data, and the evolution of the workflow design. In this paper we describe a complete framework for data and process provenance in the Kepler Scientific Workflow System. We outline the requirements and issues related to data and workflow provenance in a multi-disciplinary workflow system and introduce how generic provenance capture can be facilitated in Kepler's actor-oriented workflow environment. We also describe the usage of the stored provenance information for efficient rerun of scientific workflows.", "paper_title": "Provenance collection support in the Kepler Scientific Workflow System", "paper_id": "WOS:000241462000014"}