{"auto_keywords": [{"score": 0.033725015917348174, "phrase": "volume_shader"}, {"score": 0.026229422178109484, "phrase": "volume_tree"}, {"score": 0.00481495049065317, "phrase": "contextual_cues"}, {"score": 0.003941964605885606, "phrase": "different_operators"}, {"score": 0.0037005154613244363, "phrase": "different_data_sets"}, {"score": 0.0034013521529056715, "phrase": "different_renderings"}, {"score": 0.0033656930865509547, "phrase": "individual_data_sets"}, {"score": 0.00291923164591297, "phrase": "comparison_relationships"}, {"score": 0.002798662730881037, "phrase": "set_and_numerical_operations"}, {"score": 0.0026830601040919166, "phrase": "data_fields"}, {"score": 0.0025858215477025117, "phrase": "contextual_information"}, {"score": 0.0024017638230939514, "phrase": "different_levels"}, {"score": 0.0021385822825864425, "phrase": "deeper_understanding"}, {"score": 0.0021049977753042253, "phrase": "final_visualization"}], "paper_keywords": ["multi-variate", " time-varying", " comparative", " focus plus context"], "paper_abstract": "Time-varying, multi-variate, and comparative data sets are not easily visualized due to the amount of data that is presented to the user at once. By combining several volumes together with different operators into one visualized volume, the user is able to compare values from different data sets in space over time, run, or field without having to mentally switch between different renderings of individual data sets. In this paper, we propose using a volume shader where the user is given the ability to easily select and operate on many data volumes to create comparison relationships. The user specifies an expression with set and numerical operations and her data to see relationships between data fields. Furthermore, we render the contextual information of the volume shader by converting it to a volume tree. We visualize the different levels and nodes of the volume tree so that the user can see the results of suboperations. This gives the user a deeper understanding of the final visualization, by seeing how the parts of the whole are operationally constructed.", "paper_title": "Multi-variate, time-varying, and comparative visualization with contextual cues", "paper_id": "WOS:000241383300033"}