{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "visualization_design"}, {"score": 0.004568108391981922, "phrase": "algebraic_considerations"}, {"score": 0.004496542293425754, "phrase": "visualization_process"}, {"score": 0.004356741449157895, "phrase": "visual_encodings"}, {"score": 0.002997203022420553, "phrase": "good_visualization_design"}, {"score": 0.002783945062714816, "phrase": "known_properties"}, {"score": 0.0027547408718334603, "phrase": "existing_visualizations_methods"}, {"score": 0.0025318431634446426, "phrase": "novel_methods"}, {"score": 0.0024017638230939514, "phrase": "experimental_user_studies"}, {"score": 0.0023146962503449186, "phrase": "experiment_outcomes"}, {"score": 0.0022783523466965187, "phrase": "actionable_manner"}, {"score": 0.0021049977753042253, "phrase": "future_visualization_research"}], "paper_keywords": ["Visualization Design", " Symmetries", " Visualization Theory"], "paper_abstract": "We present a model of visualization design based on algebraic considerations of the visualization process. The model helps characterize visual encodings, guide their design, evaluate their effectiveness, and highlight their shortcomings. The model has three components: the underlying mathematical structure of the data or object being visualized, the concrete representation of the data in a computer, and (to the extent possible) a mathematical description of how humans perceive the visualization. Because we believe the value of our model lies in its practical application, we propose three general principles for good visualization design. We work through a collection of examples where our model helps explain the known properties of existing visualizations methods, both good and not-so-good, as well as suggesting some novel methods. We describe how to use the model alongside experimental user studies, since it can help frame experiment outcomes in an actionable manner. Exploring the implications and applications of our model and its design principles should provide many directions for future visualization research.", "paper_title": "An Algebraic Process for Visualization Design", "paper_id": "WOS:000344991700063"}