{"auto_keywords": [{"score": 0.0372757051093694, "phrase": "appropriate_resource"}, {"score": 0.015474611133624772, "phrase": "dynamical_grid"}, {"score": 0.012028395242381425, "phrase": "grid_resource_discovery_problem"}, {"score": 0.011412167977766145, "phrase": "specific_request"}, {"score": 0.009952270286226823, "phrase": "routing_tables_mechanism"}, {"score": 0.0048180065613350805, "phrase": "discovery"}, {"score": 0.004664352260912174, "phrase": "re-routing_tables"}, {"score": 0.004353948887538618, "phrase": "grid-router_model"}, {"score": 0.002833689453299307, "phrase": "static_grid_environment"}, {"score": 0.0024947959375982614, "phrase": "-routing_tables"}, {"score": 0.002378408229095287, "phrase": "dynamical_grid_environment"}, {"score": 0.002196342933346204, "phrase": "offline_state"}, {"score": 0.0021387992835532367, "phrase": "offline_resource_situation"}, {"score": 0.0021049977753042253, "phrase": "resource_request"}], "paper_keywords": ["Grid Resource Discovery", " Re-routing Tables", " dynamical grid", " offline resource"], "paper_abstract": "This paper studies the Resource Discovery problem in a dynamical grid based on a grid-router model. This model suggests that the grid can be seen as an environment comprised by routers and resources, where each router is in charge of its local resources. We address the Grid Resource Discovery problem as a problem of discovering the appropriate resource for a specific request within that environment. Attempting to solve the Grid Resource Discovery problem, several mechanisms have been proposed in the past. One of those mechanisms is the Routing Tables mechanism, which can guarantee finding the appropriate resource for a specific request within a static grid environment, where resources are permanently online, connected in the grid. This paper investigates the effectiveness of a Routing Tables mechanism, called Re-routing Tables which can guarantee finding the appropriate resource in a dynamical grid environment, where resources could disconnect from the grid, and therefore get in an offline state. Due to an offline resource situation, the resource request must be re-routed in order to be satisfied. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Resource Discovery in a dynamical grid based on Re-routing Tables", "paper_id": "WOS:000257341300011"}