{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "threshold_unsigncryption"}, {"score": 0.004669845451682529, "phrase": "signcryption_scheme"}, {"score": 0.004188287972391714, "phrase": "unsigncryption_phase"}, {"score": 0.0037818557818203188, "phrase": "cryptographic_literature"}, {"score": 0.003545024951402818, "phrase": "security_requirements"}, {"score": 0.003438058620195309, "phrase": "existential_unforgeability"}, {"score": 0.0033229756875116597, "phrase": "multi-user_setting"}, {"score": 0.003255777265493076, "phrase": "generic_constructions"}, {"score": 0.0032336801561165113, "phrase": "signcryption_schemes"}, {"score": 0.0031899334050985175, "phrase": "encryption_and_signature_schemes"}, {"score": 0.002831462722290752, "phrase": "random_oracle_model"}, {"score": 0.002783643041818689, "phrase": "standard_model"}, {"score": 0.0027273213556458214, "phrase": "additional_property"}, {"score": 0.0026359661683151006, "phrase": "unsigncryption_protocol"}, {"score": 0.0024455860314641243, "phrase": "single_party"}, {"score": 0.0021049977753042253, "phrase": "electronic_auctions"}], "paper_keywords": ["Signcryption", " Threshold cryptography", " Electronic auctions"], "paper_abstract": "The goal of a signcryption scheme is to achieve the same functionalities as encryption and signature together, but in a more efficient way than encrypting and signing separately. To increase security and reliability in some applications, the unsigncryption phase can be distributed among a group of users, through a (t, n)-threshold process. In this work we consider this task of threshold unsigncryption, which has received very few attention from the cryptographic literature up to now (maybe surprisingly, due to its potential applications). First we describe in detail the security requirements that a scheme for such a task should satisfy: existential unforgeability and indistinguishability, under insider chosen message/ciphertext attacks, in a multi-user setting. Then we show that generic constructions of signcryption schemes (by combining encryption and signature schemes) do not offer this level of security in the scenario of threshold unsigncryption. For this reason, we propose two new protocols for threshold unsigncryption, which we prove to be secure, one in the random oracle model and one in the standard model. The two proposed schemes enjoy an additional property that can be very useful. Namely, the unsigncryption protocol can be divided in two phases: a first one where the authenticity of the ciphertext is verified, maybe by a single party; and a second one where the ciphertext is decrypted by a subset of t receivers, without using the identity of the sender. As a consequence, the schemes can be used in applications requiring some level of anonymity, such as electronic auctions.", "paper_title": "Signcryption schemes with threshold unsigncryption, and applications", "paper_id": "WOS:000331210200005"}