{"auto_keywords": [{"score": 0.044149489620667386, "phrase": "safety_objectives"}, {"score": 0.009655109124028135, "phrase": "winning_strategies"}, {"score": 0.00481495049065317, "phrase": "timed_systems"}, {"score": 0.004676173016967478, "phrase": "real-time_systems"}, {"score": 0.004298974960001275, "phrase": "concurrent_two_player"}, {"score": 0.0037823427084328403, "phrase": "zeno"}, {"score": 0.003541182515693916, "phrase": "system_clocks"}, {"score": 0.0031961879138783012, "phrase": "memory_bits"}, {"score": 0.003115307756631991, "phrase": "memory_states"}, {"score": 0.0027809588979112393, "phrase": "controller_strategies"}, {"score": 0.0026711292765356064, "phrase": "timed_automaton_game"}, {"score": 0.002622647280008795, "phrase": "previous_known_exponential_memory_states"}, {"score": 0.0025562434609873335, "phrase": "open_question"}, {"score": 0.0025190541346053405, "phrase": "region-based_strategies"}, {"score": 0.0022817585639886883, "phrase": "decision_problem"}, {"score": 0.0021835893909861784, "phrase": "exptime"}, {"score": 0.0021518035978153878, "phrase": "timed_automaton_games"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Timed automata and timed games", " Safety objectives", " Controller synthesis", " Zeno systems"], "paper_abstract": "We study synthesis of controllers for real-time systems, where the objective is to stay in a given safe set. The problem is solved by obtaining winning strategies in the setting of concurrent two player timed automaton games with safety objectives. To prevent a player from winning by blocking time, we restrict each player to strategies that ensure that the player cannot be responsible for causing a Zeno run. We construct winning strategies for the controller which require access only to (1) the system clocks (thus, controllers which require their own internal infinitely precise clocks are not necessary), and (2) a logarithmic (in the number of clocks) number of memory bits (i.e. a linear number of memory states). Precisely, we show that for safety objectives, a memory of size (3 + Ig(vertical bar C vertical bar + 1)) bits suffices for winning controller strategies, where C is the set of clocks of the timed automaton game, significantly improving the previous known exponential memory states bound. We also settle the open question of whether winning region-based strategies require memory for safety objectives by showing with an example the necessity of memory for such strategies to win for safety objectives. Finally, we show that the decision problem of determining if there exists a receptive player-1 winning strategy for safety objectives is EXPTIME-complete over timed automaton games. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Synthesis of memory-efficient, clock-memory free, and non-Zeno safety controllers for timed systems", "paper_id": "WOS:000322295300005"}