{"auto_keywords": [{"score": 0.049596205816074275, "phrase": "sparsely_distributed_data"}, {"score": 0.04307985025796589, "phrase": "structure_learning"}, {"score": 0.00481495049065317, "phrase": "network_structures"}, {"score": 0.004718314112245913, "phrase": "flow_cytometric_measurement"}, {"score": 0.004647105813224402, "phrase": "protein_abundances"}, {"score": 0.0044398358177815305, "phrase": "pathway_structure"}, {"score": 0.00437281181878921, "phrase": "single_cell_nature"}, {"score": 0.004156590395333602, "phrase": "statistically_robust_dataset"}, {"score": 0.003871653343842317, "phrase": "high_throughput"}, {"score": 0.0036988415150699945, "phrase": "dimensionality_constraint"}, {"score": 0.0036245239349157236, "phrase": "cutting_edge"}, {"score": 0.0033249197885613937, "phrase": "structure_learning_algorithm"}, {"score": 0.0029137604783116065, "phrase": "flow_cytometer's_upper_dimensionality_limit"}, {"score": 0.0025793874956029795, "phrase": "measurement_technology's_upper_dimensionality_limit"}, {"score": 0.0023780209525032688, "phrase": "markov_neighborhoods"}, {"score": 0.0021049977753042253, "phrase": "constrained_search"}], "paper_keywords": ["Bayesian networks", " flow cytometry", " graphical models", " proteomics", " signaling pathways"], "paper_abstract": "Flow cytometric measurement of signaling protein abundances has proved particularly useful for elucidation of signaling pathway structure. The single cell nature of the data ensures a very large dataset size, providing a statistically robust dataset for structure learning. Moreover, the approach is easily scaled to many conditions in high throughput. However, the technology suffers from a dimensionality constraint: at the cutting edge, only about 12 protein species can be measured per cell, far from sufficient for most signaling pathways. Because the structure learning algorithm ( in practice) requires that all variables be measured together simultaneously, this restricts structure learning to the number of variables that constitute the flow cytometer's upper dimensionality limit. To address this problem, we present here an algorithm that enables structure learning for sparsely distributed data, allowing structure learning beyond the measurement technology's upper dimensionality limit for simultaneously measurable variables. The algorithm assesses pairwise (or n-wise) dependencies, constructs \"Markov neighborhoods\" for each variable based on these dependencies, measures each variable in the context of its neighborhood, and performs structure learning using a constrained search.", "paper_title": "Learning Signaling Network Structures with Sparsely Distributed Data", "paper_id": "WOS:000263057400007"}