{"auto_keywords": [{"score": 0.03355202817847117, "phrase": "metric_space"}, {"score": 0.03303492004904911, "phrase": "change-point_score"}, {"score": 0.004763895422211728, "phrase": "change-point_detection_methods"}, {"score": 0.004374385639298755, "phrase": "data_point"}, {"score": 0.004191690483929023, "phrase": "single_multi-dimensional_vector"}, {"score": 0.003687960013746783, "phrase": "random_variables"}, {"score": 0.0033861224940737846, "phrase": "underlying_distribution"}, {"score": 0.0028543298631502107, "phrase": "distance-based_information_estimator"}, {"score": 0.002592693161475495, "phrase": "confidence_interval"}, {"score": 0.0025109095718850376, "phrase": "time_step"}, {"score": 0.0024447258861321685, "phrase": "false_alarms"}, {"score": 0.002418742283474052, "phrase": "highly_noisy_situations"}, {"score": 0.0022806798371116698, "phrase": "experimental_studies"}, {"score": 0.002256435842862802, "phrase": "numerical_examples"}], "paper_keywords": ["Change-point detection", " entropy estimator", " Earth Mover's Distance", " anomaly detection"], "paper_abstract": "In this paper, the limitation that is prominent in most existing works of change-point detection methods is addressed by proposing a nonparametric, computationally efficient method. The limitation is that most works assume that each data point observed at each time step is a single multi-dimensional vector. However, there are many situations where this does not hold. Therefore, a setting where each observation is a collection of random variables, which we call a bag of data, is considered. After estimating the underlying distribution behind each bag of data and embedding those distributions in a metric space, the change-point score is derived by evaluating how the sequence of distributions is fluctuating in the metric space using a distance-based information estimator. Also, a procedure that adaptively determines when to raise alerts is incorporated by calculating the confidence interval of the change-point score at each time step. This avoids raising false alarms in highly noisy situations and enables detecting changes of various magnitudes. A number of experimental studies and numerical examples are provided to demonstrate the generality and the effectiveness of our approach with both synthetic and real datasets.", "paper_title": "Change-Point Detection in a Sequence of Bags-of-Data", "paper_id": "WOS:000361245300004"}