{"auto_keywords": [{"score": 0.04334590190510079, "phrase": "user_preferences"}, {"score": 0.0383005943678633, "phrase": "purchase_probability"}, {"score": 0.03688032528526164, "phrase": "profitability_factor"}, {"score": 0.026046633340099542, "phrase": "recommendation_accuracy"}, {"score": 0.00481495049065317, "phrase": "product_profitability"}, {"score": 0.004682414867878963, "phrase": "electronic_commerce_web_sites"}, {"score": 0.004354572391793908, "phrase": "suitable_products"}, {"score": 0.003916098498242888, "phrase": "learned_model"}, {"score": 0.003601235776892337, "phrase": "customers'_preferences"}, {"score": 0.003256526411907174, "phrase": "traditional_recommender_systems"}, {"score": 0.0030451958332949735, "phrase": "profitability_perspective_recommender_system"}, {"score": 0.0027382040767844093, "phrase": "traditional_systems"}, {"score": 0.002677616534005393, "phrase": "individual's_preference"}, {"score": 0.002354302193867031, "phrase": "experimental_results"}, {"score": 0.0023021895404322767, "phrase": "proposed_hprs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["electronic commerce", " recommender systems", " product profitability", " collaborative filtering", " personalization", " cross-selling"], "paper_abstract": "In electronic commerce web sites, recommender systems are popularly being employed to help customers in selecting suitable products to meet their personal needs. These systems learn about user preferences over time and automatically suggest products that fit the learned model of user preferences. Traditionally, recommendations are provided to customers depending on purchase probability and customers' preferences, without considering the profitability factor for sellers. This study attempts to integrate the profitability factor into the traditional recommender systems. Based on this consideration, we propose two profitability-based recommender systems called CPPRS (Convenience plus Profitability Perspective Recommender System) and HPRS (Hybrid Perspective Recommender System). Moreover, comparisons between our proposed systems (considering both purchase probability and profitability) and traditional systems (emphasizing an individual's preference) are made to clarify the advantages and disadvantages of these systems in terms of recommendation accuracy and/or profit from cross-selling. The experimental results show that the proposed HPRS can increase profit from cross-selling without losing recommendation accuracy. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Developing recommender systems with the consideration of product profitability for sellers", "paper_id": "WOS:000253184800006"}