{"auto_keywords": [{"score": 0.04243032195732421, "phrase": "optimal_structures"}, {"score": 0.00481495049065317, "phrase": "hydrophobic-polar_two-dimensional_lattice_model"}, {"score": 0.004562743714811391, "phrase": "three-dimensional_native_structure"}, {"score": 0.004340343873304156, "phrase": "amino_acids"}, {"score": 0.004307099985737249, "phrase": "different_approaches"}, {"score": 0.004003660777805554, "phrase": "well_studied_simplified_lattice"}, {"score": 0.003988350601221769, "phrase": "hydrophobic"}, {"score": 0.003958108446617345, "phrase": "polar"}, {"score": 0.0037215192436590772, "phrase": "twofold_result"}, {"score": 0.0034725269588525534, "phrase": "hp_sequence"}, {"score": 0.003154012038613403, "phrase": "innovative_algorithm"}, {"score": 0.003046621804854539, "phrase": "exact_approaches"}, {"score": 0.0029656229252935417, "phrase": "lattice_protein_model"}, {"score": 0.0028100102841877835, "phrase": "heavily_pruned_exhaustive_search"}, {"score": 0.002522791642460087, "phrase": "optimal_results"}, {"score": 0.002465161736207254, "phrase": "standard_hp_sequences"}, {"score": 0.002145942273032774, "phrase": "useful_tool"}], "paper_keywords": ["algorithms", " automata", " strings"], "paper_abstract": "Protein Structure Prediction (PSP) is the problem of predicting the three-dimensional native structure of a protein given its primary structure, i.e., the corresponding sequence of amino acids. Different approaches have been proposed to model this problem, and this research explores the prediction of optimal structures using the well studied simplified lattice Hydrophobic and Polar (HP) model-in particular, on the 2D square lattice. We present a twofold result. First, we devise a new upper bound for the number of contacts achievable by an HP sequence, and show that it is in several cases more stringent than the upper bound previously known in literature. Then, we present an innovative algorithm that outperforms the state of the art in exact approaches for the prediction of optimal structures in lattice protein model, for 2D square lattices. The algorithm, called minwalk and based on a heavily pruned exhaustive search, also outperforms the state of the art in non-exact approaches in several cases. Due to this algorithm, it is now possible to prove optimal results in the square 2D lattice, for standard HP sequences of size up to 80 elements, which were only best-known-results previously. Furthermore, we provide the degeneracy (i.e. all optimal solutions) of such benchmark sequences, which was unknown in literature. These results can be a useful tool to foster advances in further research.", "paper_title": "An Effective Exact Algorithm and a New Upper Bound for the Number of Contacts in the Hydrophobic-Polar Two-Dimensional Lattice Model", "paper_id": "WOS:000322509400004"}