{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "patent_citations"}, {"score": 0.049558064870310475, "phrase": "citation_impact"}, {"score": 0.004583579470330216, "phrase": "rich_literature"}, {"score": 0.004292212137716459, "phrase": "patent_citation_analysis"}, {"score": 0.0035826234811610316, "phrase": "patent-cited_papers"}, {"score": 0.003466780226380516, "phrase": "standard_bibliometric_indicators"}, {"score": 0.003429001377800258, "phrase": "comparable_publications"}, {"score": 0.0028460640294160383, "phrase": "highly_cited_papers"}, {"score": 0.002285527382381719, "phrase": "citation_rates"}, {"score": 0.0021049977753042253, "phrase": "bandwagon_effects"}], "paper_keywords": ["Nanoscience", " Nanotechnology", " Patent citations", " Citation impact", " Science-technology linkage"], "paper_abstract": "There is a rich literature on how science and technology are related to each other. Patent citation analysis is amongst the most frequently used to tool to track the strengths of links. In this paper we explore the relationship between patent citations and citation impact in nanoscience. Our observations indicate that patent-cited papers perform better in terms of standard bibliometric indicators than comparable publications that are not linked to technology in this way. More specifically, we found that articles cited in patents are more likely to be cited also by other papers. The share of highly cited papers is the most striking result. Instead of the average of 4% of all papers, 13.8% of the papers cited once or twice in patents fall into this category and even 23.5% of the papers more frequently cited in patents receive citation rates far above the standard. Our analyses further demonstrate the presence and the relevance of bandwagon effects driving the development of science and technology.", "paper_title": "Can applied science be 'good science'? Exploring the relationship between patent citations and citation impact in nanoscience", "paper_id": "WOS:000282048200011"}