{"auto_keywords": [{"score": 0.039976303937712954, "phrase": "polynomial_time"}, {"score": 0.012073054122279724, "phrase": "statistical_distance"}, {"score": 0.00481495049065317, "phrase": "time_hierarchies"}, {"score": 0.004771672073078768, "phrase": "sampling_distributions."}, {"score": 0.004581660953729745, "phrase": "lot_more_power"}, {"score": 0.0045404698551856125, "phrase": "sampling_algorithms"}, {"score": 0.003929391999210588, "phrase": "k_elements"}, {"score": 0.003415681637907093, "phrase": "arbitrary-size_domains"}, {"score": 0.002675571068567923, "phrase": "communication_problem"}, {"score": 0.0026157259734105, "phrase": "noisy_channel"}, {"score": 0.0025572160146590623, "phrase": "latter_problem"}, {"score": 0.002488724764295623, "phrase": "list-decodable_code"}, {"score": 0.0021049977753042253, "phrase": "new_construction"}], "paper_keywords": ["time hierarchies", " sampling", " distributions", " list-decodable codes"], "paper_abstract": "We show that \"a little more time gives a lot more power to sampling algorithms.\" We prove that for every constant k >= 2, every polynomial time bound t, and every polynomially small epsilon, there exists a family of distributions on k elements that can be sampled exactly in polynomial time but cannot be sampled within statistical distance 1 - 1/k - epsilon in time t. This implies the following general time hierarchy for sampling distributions on arbitrary-size domains such as {0, 1}(n): For every polynomial time bound t and every constant epsilon > 0, there exists a family of distributions that can be sampled exactly in polynomial time but cannot be sampled within statistical distance 1 - epsilon in time t. Our proof involves reducing the problem to a communication problem over a certain type of noisy channel. To solve the latter problem we use a type of list-decodable code for a setting where there is no bound on the number of errors but each error gives more information than an erasure. This type of code can be constructed using certain known traditional list-decodable codes, but we give a new construction that is elementary, self-contained, and tailored to this setting.", "paper_title": "TIME HIERARCHIES FOR SAMPLING DISTRIBUTIONS", "paper_id": "WOS:000344753500008"}