{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "percolation_model"}, {"score": 0.004777917315737992, "phrase": "mobile_ad-hoc_networks._mobile_ad-hoc_networks"}, {"score": 0.00445712058827745, "phrase": "better_service"}, {"score": 0.004031238480458909, "phrase": "battle_fields"}, {"score": 0.00398478333092707, "phrase": "search-and-rescue_operations"}, {"score": 0.0036178264212372497, "phrase": "random_network"}, {"score": 0.0034672240102960644, "phrase": "mobile_nodes"}, {"score": 0.002802941205762953, "phrase": "other's_transmission_range"}, {"score": 0.0027813397260607487, "phrase": "extensive_monte_carlo_simulations"}, {"score": 0.002644920521740564, "phrase": "network's_topology"}, {"score": 0.0025942468561537682, "phrase": "critical_transmission_range"}, {"score": 0.0025151755329660837, "phrase": "percolation_threshold"}, {"score": 0.0023550410480905727, "phrase": "real_manets"}, {"score": 0.0023099082804523044, "phrase": "physical_terms"}, {"score": 0.0022308329460335985, "phrase": "efficient_protocols"}, {"score": 0.002171202123281881, "phrase": "disaster_survival"}, {"score": 0.002129584983647679, "phrase": "utmost_importance"}, {"score": 0.0021049977753042253, "phrase": "practical_applications"}], "paper_keywords": ["Percolation", " random networks", " mobile ad-hoc networks", " scalling"], "paper_abstract": "Mobile ad-hoc networks (MANETs) are random, self-configurable and rapidly-deployable networks. The main goal of developing the MANETs is not only obtaining better service, but also having networks that can serve insituations in which no other means of communications can operate. Examples include networks that are used in battle fields, in search-and-rescue operations, and networks of sensors. We propose a percolation model for studying the properties of the MANETs. The model is based on a random network of sites, distributed in space, which represent the mobile nodes. Two nodes are linked if they are within each other's transmission ranges. A node may be lost or become inactive if, for example, it runs out of energy (provided by its batteries). A link can be lost if, for example, one of its two end nodes moves outside of the other's transmission range. Extensive Monte Carlo simulations are carried out to study the properties of the model. The network's topology is characterized by a critical transmission range, which is the analogue of the percolation threshold. It is shown that not only can the model take into account several important features of the real MANETs and explain them in physical terms, but also leads to the development of efficient protocols for self-configuration, adaptability, and disaster survival, which are of utmost importance to the practical applications.", "paper_title": "A PERCOLATION MODEL OF MOBILE AD-HOC NETWORKS", "paper_id": "WOS:000273425100001"}