{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adaptive_user_interfaces"}, {"score": 0.043134211261042776, "phrase": "intermediate_levels"}, {"score": 0.004660453113061494, "phrase": "possible_adverse_effects"}, {"score": 0.004478308876320956, "phrase": "in-vehicle_telematic_system"}, {"score": 0.0035766032751309677, "phrase": "simple_driving_simulator"}, {"score": 0.0034995881411519925, "phrase": "telematic_system"}, {"score": 0.0034366728236876016, "phrase": "adaptivity_levels"}, {"score": 0.0029830992938695007, "phrase": "user's_age"}, {"score": 0.002887210021573995, "phrase": "user's_involvement"}, {"score": 0.0027943943921568456, "phrase": "fully_adaptive_system"}, {"score": 0.002675252546913683, "phrase": "unfamiliar_situations"}, {"score": 0.0026271183900983767, "phrase": "aui"}, {"score": 0.002579847272930948, "phrase": "cognitive_workload"}, {"score": 0.002347378595930709, "phrase": "routine_and_non-routine_tasks"}, {"score": 0.002182881082103045, "phrase": "adverse_effects"}, {"score": 0.002151388538895855, "phrase": "non-routine_situations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Adaptive user interface", " Levels of adaptivity", " Task frequency"], "paper_abstract": "The paper examines the positive and the possible adverse effects of adaptive user interfaces (AUIs) in the context of an in-vehicle telematic system as a function of four factors: (I) four different levels of adaptivity (ranging from manual to fully adaptive with intermediate levels); (2) different tasks; (3) routine (familiar) and non-routine (unfamiliar) situations; and (4) different user age groups. Both experiments included three sessions during which participants drove a simple driving simulator and performed tasks with the telematic system at one of the adaptivity levels. We measured task performance times and lane position variance. Adaptivity was not always equally beneficial, and its benefits depended on a number of factors, including the frequency in which the tasks were performed, the user's age, the difficulty of the task and the user's involvement in the task. In familiar, routine situations, a fully adaptive system was beneficial for all participants, particularly older ones. In unfamiliar situations, to which the AUI was not adjusted, cognitive workload increased substantially, adversely affecting performance. Intermediate levels of adaptivity keep users involved in the task and help them become more proficient when performing both routine and non-routine tasks. However, intermediate levels of adaptivity should also be implemented with care, because they may also have adverse effects when users encounter non-routine situations. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Benefits and costs of adaptive user interfaces", "paper_id": "WOS:000279067300005"}