{"auto_keywords": [{"score": 0.039624636080800406, "phrase": "pedestrian_detection"}, {"score": 0.00481495049065317, "phrase": "local_features"}, {"score": 0.004739773204474094, "phrase": "human_classification"}, {"score": 0.004415675459182871, "phrase": "first_fundamental_step"}, {"score": 0.0042452552248398445, "phrase": "video_surveillance"}, {"score": 0.004178935413340453, "phrase": "smart_vehicles"}, {"score": 0.0041136473765874815, "phrase": "intersection_traffic_analysis"}, {"score": 0.003832198214757852, "phrase": "experimental_study"}, {"score": 0.0029781530607129653, "phrase": "mit_cbcl_data"}, {"score": 0.00290855128461017, "phrase": "'intitut_national_de_recherche_en_informatique_et_automatique"}, {"score": 0.0026045914281028473, "phrase": "experimental_results"}, {"score": 0.002464709648714996, "phrase": "radial_basis_function_kernel_svm"}, {"score": 0.00242614912681392, "phrase": "hog"}, {"score": 0.0023694065215394593, "phrase": "quadratic_kernel_svm"}, {"score": 0.002224510044064184, "phrase": "quadratic_kernel_svm."}], "paper_keywords": [""], "paper_abstract": "Detecting pedestrians accurately is the first fundamental step for many computer vision applications such as video surveillance, smart vehicles, intersection traffic analysis and so on. The authors present an experimental study on pedestrian detection using state-of-the-art local feature extraction and support vector machine (SVM) classifiers. The performance of pedestrian detection using region covariance, histogram of oriented gradients ( HOG) and local receptive fields (LRF) feature descriptors is experimentally evaluated. The experiments are performed on the DaimlerChrysler benchmarking data set, the MIT CBCL data set and 'Intitut National de Recherche en Informatique et Automatique (INRIA) data set. All can be publicly accessed. The experimental results show that region covariance features with radial basis function kernel SVM and HOG features with quadratic kernel SVM outperform the combination of LRF features with quadratic kernel SVM. Furthermore, the results reveal that both covariance and HOG features perform very well in the context of pedestrian detection.", "paper_title": "Performance evaluation of local features in human classification and detection", "paper_id": "WOS:000262497800006"}