{"auto_keywords": [{"score": 0.03930915258206547, "phrase": "system_requirements"}, {"score": 0.015719716506582538, "phrase": "four-variable_model"}, {"score": 0.015122747851992014, "phrase": "physical_processes"}, {"score": 0.01193093582206767, "phrase": "acceptable_software_behaviors"}, {"score": 0.009365730963086492, "phrase": "acceptability_condition"}, {"score": 0.003907586297783078, "phrase": "acceptable_behaviors"}, {"score": 0.0037738708560271354, "phrase": "physical_environment"}, {"score": 0.0031845067058084583, "phrase": "undesirable_system_behaviors"}, {"score": 0.0029443683459283955, "phrase": "expected_results"}, {"score": 0.002663620639539737, "phrase": "demonic_calculus"}, {"score": 0.002594880866651459, "phrase": "undesirable_system_or_software_behaviors"}, {"score": 0.002347378595930709, "phrase": "mathematical_characterization"}, {"score": 0.0023168823213024856, "phrase": "least_restrictive_software_specification"}, {"score": 0.0021607883988873492, "phrase": "software_requirements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Safety-critical", " Four-variable model", " Implementability of requirements", " Tolerances on requirements", " Demonic calculus of relations"], "paper_abstract": "Many safety-critical computer systems are required to monitor and control physical processes. The four-variable model, which has been used successfully in industry for almost four decades, helps to clarify the behaviors of, and the boundaries between the physical processes, input/output devices, and software. In this model, the acceptable behaviors of the software are constrained by the physical environment, system requirements, and input/output devices. If acceptable software behaviors are possible, then the system requirements are said to be implementable with respect to these constraints. The only acceptability condition proposed in the literature deems as acceptable software behaviors that can lead to undesirable system behaviors, in particular, nondeterministic system behaviors that for the same input sometimes do not produce any results and some other times produce expected results. In this sense, the acceptability condition can be seen as angelic. In this paper we strengthen the acceptability condition using the demonic calculus of relations such that no undesirable system or software behaviors are allowed and prove a necessary and sufficient implementability condition for the system requirements. As a byproduct, we also obtain a mathematical characterization of the least restrictive software specification, which, for all intents and purposes, can play the role of the software requirements. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Implementability of requirements in the four-variable model", "paper_id": "WOS:000368556700007"}