{"auto_keywords": [{"score": 0.049041758855779556, "phrase": "brain-cortex_anatomy"}, {"score": 0.043628703965110475, "phrase": "semantic_consistency"}, {"score": 0.033946973968416505, "phrase": "intrinsic_consistency"}, {"score": 0.00481495049065317, "phrase": "semantic_dependencies"}, {"score": 0.004784909348794283, "phrase": "consistency_management"}, {"score": 0.004579780586951551, "phrase": "semantic_web"}, {"score": 0.004466519142879166, "phrase": "software_agents"}, {"score": 0.004301834610818624, "phrase": "explicit_representation_and_consistency_requirements"}, {"score": 0.003990385737207714, "phrase": "explicit_identification"}, {"score": 0.003953068310598579, "phrase": "relationship_properties"}, {"score": 0.003487489029588045, "phrase": "knowledge_base_updates"}, {"score": 0.0032858981413454802, "phrase": "realistic_representation"}, {"score": 0.003066945490483524, "phrase": "ontological_modeling_ties"}, {"score": 0.0029722900280316216, "phrase": "sound_principles"}, {"score": 0.0028895932204402986, "phrase": "idea_possibilities"}, {"score": 0.0024547897375637308, "phrase": "incremental_consistency"}, {"score": 0.0023864566654035924, "phrase": "successive_updates"}, {"score": 0.002327310963701377, "phrase": "explicit_representation"}, {"score": 0.0021789194955896102, "phrase": "knowledge_base"}, {"score": 0.0021450029487459403, "phrase": "model's_semantic_consistency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["ontology consistency", " ontology maintenance", " dependencies between concepts or relationships"], "paper_abstract": "Objective: In the context of the Semantic Web, ontologies have to be usable by software agents as well as by humans. Therefore, they must meet explicit representation and consistency requirements. This article describes a method for managing the semantic consistency of an ontology of brain-cortex anatomy. Method: The methodology relies on the explicit identification of the relationship properties and of the dependencies that might exist among concepts or relationships. These dependencies have to be respected for insuring the semantic consistency of the model. We propose a method for automatically generating all the dependent items. As a consequence, knowledge base updates are easier and safer. Result: Our approach is composed of three main steps: (1) providing a realistic representation, (2) ensuring the intrinsic consistency of the model and (3) checking its incremental consistency. The corner stone of ontological modeling ties in the expressiveness of the model and in the sound principles that structure it. This part defines the idea possibilities of the ontology and is called realism of representation. Regardless of how well a model represents reality, the intrinsic consistency of a model corresponds to its tack of contradiction. This step is particularly important as soon as dependencies between relationships or concepts have to be fulfilled. Eventually, the incremental consistency encompasses the respect of the two previous criteria during the successive updates of the ontology. Conclusion: The explicit representation of dependencies among concepts and relationships in an ontology can be helpfully used to assist in the management of the knowledge base and to ensure the model's semantic consistency. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Using semantic dependencies for consistency management of an ontology of brain-cortex anatomy", "paper_id": "WOS:000246657200004"}