{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "pattern_cluster_analysis"}, {"score": 0.004619027561771169, "phrase": "pattern_discovery"}, {"score": 0.0045765783794477505, "phrase": "previously_unknown_regularities"}, {"score": 0.004431041346291019, "phrase": "useful_tool"}, {"score": 0.004390312150344245, "phrase": "categorical_data_analysis"}, {"score": 0.003929689573550262, "phrase": "discovered_patterns"}, {"score": 0.003752275718257509, "phrase": "data_set"}, {"score": 0.0035663245542174224, "phrase": "new_method"}, {"score": 0.002896535621940078, "phrase": "pattern_cluster"}, {"score": 0.0027275289970185015, "phrase": "data_cluster"}, {"score": 0.0025447065763362984, "phrase": "distance_measure"}, {"score": 0.002407290605654707, "phrase": "existing_common_ones"}, {"score": 0.0023522423291484212, "phrase": "pattern_clusters"}, {"score": 0.0021344259291927914, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "synthetic_and_real_data"}], "paper_keywords": ["pattern discovery", " contingency table", " residual", " chi-square test", " categorical data analysis"], "paper_abstract": "In data mining and knowledge discovery, pattern discovery extracts previously unknown regularities in the data and is a useful tool for categorical data analysis. However, the number of patterns discovered is often overwhelming. It is difficult and time consuming to 1) interpret the discovered patterns and 2) use them to further analyze the data set. To overcome these problems, this paper proposes a new method that clusters patterns and their associated data simultaneously. When patterns are clustered, the data containing the patterns are also clustered, and the relation between patterns and data is made explicit. Such an explicit relation allows the user, on one hand, to further analyze each pattern cluster via its associated data cluster and, on the other hand, to interpret why a data cluster is formed via its corresponding pattern cluster. Since the effectiveness of clustering mainly depends on the distance measure, several distance measures between patterns and their associated data are proposed. Their relationships to the existing common ones are discussed. Once pattern clusters and their associated data clusters are obtained, each of them can be further analyzed individually. To evaluate the effectiveness of the proposed approach, experimental results on synthetic and real data are reported.", "paper_title": "Simultaneous pattern and data clustering for pattern cluster analysis", "paper_id": "WOS:000256017300004"}