{"auto_keywords": [{"score": 0.04948338335655932, "phrase": "tourism_destination_choice"}, {"score": 0.0447441845968768, "phrase": "wom"}, {"score": 0.033313288781801835, "phrase": "isfahan"}, {"score": 0.015335169854421389, "phrase": "planned_behavior"}, {"score": 0.010859312625802912, "phrase": "ewom_and_tpb_constructs"}, {"score": 0.010178793967731388, "phrase": "behavioral_control"}, {"score": 0.008809120219552578, "phrase": "significant_impact"}, {"score": 0.007641384312077421, "phrase": "online_travel_communities"}, {"score": 0.00481495049065317, "phrase": "electronic_word"}, {"score": 0.004488946121663966, "phrase": "consumer_trust"}, {"score": 0.004345149964724958, "phrase": "television_advertising"}, {"score": 0.004195418010131832, "phrase": "significant_competitive_advantage"}, {"score": 0.004112175423546628, "phrase": "hospitality_and_tourism_industry"}, {"score": 0.0038624981944755813, "phrase": "new_ways"}, {"score": 0.0035827424231607784, "phrase": "electronic_wom"}, {"score": 0.00347657813672945, "phrase": "planned_behaviour"}, {"score": 0.00327356326590461, "phrase": "structural_equation_modeling_procedure"}, {"score": 0.002902304851882577, "phrase": "research_model"}, {"score": 0.0028021527740710508, "phrase": "online_communities"}, {"score": 0.002725885758233, "phrase": "findings_-_findings"}, {"score": 0.0027054473441439422, "phrase": "online_wom_communications"}, {"score": 0.0026384167183586015, "phrase": "subjective_norms"}, {"score": 0.0025537472239953807, "phrase": "travel_experience"}, {"score": 0.00242266141176955, "phrase": "previous_research"}, {"score": 0.0022078225715967616, "phrase": "marketing_research"}, {"score": 0.0021476967767071233, "phrase": "tourism_industry"}, {"score": 0.0021049977753042253, "phrase": "new_dimension"}], "paper_keywords": ["Iran", " Tourism", " Consumer behaviour", " Electronic word of mouth", " Theory of planned behavior", " Internet"], "paper_abstract": "Purpose - In an environment in which there has been a reduction in consumer trust of both organizations and advertising, as well as a decrease in television advertising, word of mouth (WOM) offers a way to obtain a significant competitive advantage. WOM is especially important in the hospitality and tourism industry, whose intangible products are difficult to evaluate prior to their consumption. When WOM becomes digital, the large-scale, anonymous, ephemeral nature of the Internet induces new ways of capturing, analyzing, interpreting, and managing the influence that one consumer may have on another. The purpose of this paper is to investigate the impact of electronic WOM (eWOM) on a tourism destination choice, using the theory of planned behaviour (TPB). Further, an effort was employed to determine the effect of past travel experience on using eWOM and TPB constructs. Design/methodology/approach - A structural equation modeling procedure was applied to the examination of the influences of eWOM on attitudes towards visiting Isfahan, subjective norms, perceived behavioral control, and travel intention. Analysis of variance (ANOVA) was utilised in order to analysing the relations between these constructs and past travel experience. The research model was tested empirically using a sample of 296 inbound tourists who had experience within the online communities and travelled to Isfahan during the period of research. Findings - Findings indicate that online WOM communications have a significant impact on attitudes toward visiting Isfahan, subjective norms, perceived behavioral control, and intention to travel. In addition, travel experience has a significant impact on using eWOM and TPB constructs. Practical implications - The paper suggests that eWOM activity is more complex than previous research has argued. Managers should consider various eWOM facets and try to motivate tourists for participating in online travel communities and to build online travel communities with characteristics such usefulness and ease of use. Originality/value - There has been a lot of marketing research on eWOM but none has focused on covering eWOM in tourism industry and its impact on tourism destination choice by adding new dimension of eWOM to the theory of planned behavior. This paper seeks to fill this gap.", "paper_title": "The impact of electronic word of mouth on a tourism destination choice Testing the theory of planned behavior (TPB)", "paper_id": "WOS:000312470700004"}