{"auto_keywords": [{"score": 0.04771533004845802, "phrase": "unrooted_unordered_labeled_trees"}, {"score": 0.041469740173514034, "phrase": "edit_distance"}, {"score": 0.004787966206092959, "phrase": "unordered_trees"}, {"score": 0.0038668462001710314, "phrase": "minimum-cost_sequence"}, {"score": 0.0034762161444101608, "phrase": "np"}, {"score": 0.003266201217790818, "phrase": "new_algorithm"}, {"score": 0.003070086433952691, "phrase": "specific_graph_coloring"}, {"score": 0.0029681091946289757, "phrase": "small_components"}, {"score": 0.0025638362414466278, "phrase": "proposed_distance"}, {"score": 0.0023827927890399357, "phrase": "large_synthetic_and_real_world"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Edit distance", " Graph matching", " Unrooted tree", " Unordered tree"], "paper_abstract": "We consider the problem of matching unrooted unordered labeled trees, which refers to the task of evaluating the distance between trees. One of the most famous formalizations of this problem is the computation of the edit distance defined as the minimum-cost sequence of edit operations that transform one tree into another. Unfortunately, this problem has been proved to be NP-complete. In this paper, we propose a new algorithm to measure distance between unrooted unordered labeled trees. This algorithm uses a specific graph coloring to decompose the trees into small components (stars and bistars). Then, it determines a distance between two trees by computing the edit distance between their components. We prove that the proposed distance is a pseudo-metric and we analyze its time complexity. Our experimental evaluations on large synthetic and real world datasets confirm our analytical results and suggest that the distance we propose is accurate and its algorithm is scalable. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Coloring based approach for matching unrooted and/or unordered trees", "paper_id": "WOS:000317451100012"}