{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fluorescence_microscope_images"}, {"score": 0.04970018005584556, "phrase": "online_journal_articles"}, {"score": 0.004739056045644449, "phrase": "graphical_models"}, {"score": 0.004627441072541506, "phrase": "extensive_interest"}, {"score": 0.004447201233380302, "phrase": "biological_data"}, {"score": 0.004290969772225093, "phrase": "online_literature"}, {"score": 0.004273951631010383, "phrase": "present_special_challenges"}, {"score": 0.004189863767755212, "phrase": "first_steps"}, {"score": 0.0038390240716280302, "phrase": "biological_literature"}, {"score": 0.003808619097554076, "phrase": "panel_types"}, {"score": 0.0037040785566765954, "phrase": "different_techniques"}, {"score": 0.0034619440946558186, "phrase": "slif_system"}, {"score": 0.003197200793408836, "phrase": "subcellular_patterns"}, {"score": 0.003097043800165555, "phrase": "pretrained_classifier"}, {"score": 0.0030602966787192745, "phrase": "image_features"}, {"score": 0.0029409171055888804, "phrase": "separate_panel"}, {"score": 0.0023346234464901978, "phrase": "probabilistic_graphical_model"}, {"score": 0.0022524395393089544, "phrase": "structured_information"}, {"score": 0.0021049977753042253, "phrase": "significant_improvement"}], "paper_keywords": [""], "paper_abstract": "Motivation: There is extensive interest in automating the collection, organization and analysis of biological data. Data in the form of images in online literature present special challenges for such efforts. The first steps in understanding the contents of a figure are decomposing it into panels and determining the type of each panel. In biological literature, panel types include many kinds of images collected by different techniques, such as photographs of gels or images from microscopes. We have previously described the SLIF system (http://slif.cbi.cmu.edu) that identifies panels containing fluorescence microscope images among figures in online journal articles as a prelude to further analysis of the subcellular patterns in such images. This system contains a pretrained classifier that uses image features to assign a type (class) to each separate panel. However, the types of panels in a figure are often correlated, so that we can consider the class of a panel to be dependent not only on its own features but also on the types of the other panels in a figure. Results: In this article, we introduce the use of a type of probabilistic graphical model, a factor graph, to represent the structured information about the images in a figure, and permit more robust and accurate inference about their types. We obtain significant improvement over results for considering panels separately.", "paper_title": "Improved recognition of figures containing fluorescence microscope images in online journal articles using graphical models", "paper_id": "WOS:000253246300017"}