{"auto_keywords": [{"score": 0.025965448137665322, "phrase": "group_fusion"}, {"score": 0.00481495049065317, "phrase": "ligand-based_virtual_fragment_screening"}, {"score": 0.004754447398742591, "phrase": "comparative_case_study"}, {"score": 0.004519908617935935, "phrase": "current_study"}, {"score": 0.004388450908826472, "phrase": "ligand-based_virtual_screening"}, {"score": 0.0043516809917794495, "phrase": "lbvs"}, {"score": 0.0042250123967577284, "phrase": "small_fragment-like_biologically_active_molecules"}, {"score": 0.0041194351307673556, "phrase": "different_consensus_scoring_approaches"}, {"score": 0.003883194688426525, "phrase": "retrospective_virtual_screening_studies"}, {"score": 0.0038343546245999285, "phrase": "fragment-like_ligands"}, {"score": 0.003465036432323081, "phrase": "complete_fragment_affinity_data"}, {"score": 0.003421437601439154, "phrase": "experimentally_determined_ligands"}, {"score": 0.00266693888510356, "phrase": "multiple_actives"}, {"score": 0.0025892330566358503, "phrase": "different_similarity_descriptors"}, {"score": 0.0024926348205500715, "phrase": "first_time"}, {"score": 0.002461241017147324, "phrase": "different_combinations"}, {"score": 0.002419995316129757, "phrase": "similarity_fusion_approaches"}, {"score": 0.002280990744438186, "phrase": "virtual_screening_enrichments"}, {"score": 0.0022522565004588113, "phrase": "single_chemical_similarity_search_methods"}, {"score": 0.0021228663458966813, "phrase": "similarity_fusion"}, {"score": 0.0021049977753042253, "phrase": "prospective_ligand-based_virtual_fragment_screening"}], "paper_keywords": [""], "paper_abstract": "In the current study we have evaluated the applicability of ligand-based virtual screening (LBVS) methods for the identification of small fragment-like biologically active molecules using different similarity descriptors and different consensus scoring approaches. For this purpose, we have evaluated the performance of 14 chemical similarity descriptors in retrospective virtual screening studies to discriminate fragment-like ligands of three membrane-bound receptors from fragments that are experimentally determined to have no affinity for these proteins (true inactives). We used a complete fragment affinity data set of experimentally determined ligands and inactives for two G protein-coupled receptors (GPCRs), the histamine H-1 receptor (H1R) and the histamine H-4 receptor (H4R), and one ligand-gated ion channel (LGIC), the serotonin receptor (5-HT(3)AR), to validate our retrospective virtual screening studies. We have exhaustively tested consensus scoring strategies that combine the results of multiple actives (group fusion) or combine different similarity descriptors (similarity fusion), and for the first time systematically evaluated different combinations of group fusion and similarity fusion approaches. Our studies show that for these three case study protein targets both consensus scoring approaches can increase virtual screening enrichments compared to single chemical similarity search methods. Our cheminformatics analyses recommend to use a combination of both group fusion and similarity fusion for prospective ligand-based virtual fragment screening.", "paper_title": "Combinatorial Consensus Scoring for Ligand-Based Virtual Fragment Screening: A Comparative Case Study for Serotonin 5-HT(3)A, Histamine H-1, and Histamine H-4 Receptors", "paper_id": "WOS:000355382200012"}