{"auto_keywords": [{"score": 0.027968915173580168, "phrase": "service_provision"}, {"score": 0.00481495049065317, "phrase": "consumer-to-consumer_channel"}, {"score": 0.004284755353695709, "phrase": "modern_digital_technology"}, {"score": 0.004181839414007266, "phrase": "legal_dissemination"}, {"score": 0.0038876302202924644, "phrase": "mobile_phones"}, {"score": 0.003831310632470526, "phrase": "portable_media_players"}, {"score": 0.003721098220825489, "phrase": "optimal_channel_structure"}, {"score": 0.0036671822784770463, "phrase": "corresponding_pricing"}, {"score": 0.003579046565851265, "phrase": "digital_content_distribution"}, {"score": 0.0034760655218366, "phrase": "business_value"}, {"score": 0.002875027551180213, "phrase": "price_discrimination"}, {"score": 0.0027651847105654363, "phrase": "higher_level"}, {"score": 0.0025207920578878894, "phrase": "dual-channel_pricing_flexibility"}, {"score": 0.002125612498781805, "phrase": "dual-channel_distribution"}], "paper_keywords": ["B2C", " C2C", " channel strategy", " digital content", " dual channel", " pricing", " service"], "paper_abstract": "Although the online business-to-consumer (B2C) channel is the primary selling channel for digital content (e.g., videos, images, and music), modern digital technology has made possible the legal dissemination of such content over the consumer-to-consumer (C2C) channel through personal computing devices, such as PCs, mobile phones, and portable media players. This paper investigates the optimal channel structure and the corresponding pricing and service strategies for digital content distribution in order to understand the business value of introducing the C2C channel alongside the prevailing B2C channel. We identify conditions under which it is more profitable to use both B2C and C2C channels simultaneously (i.e., the dual-channel distribution). In such cases, the seller performs price discrimination among consumers but provides them with a higher level of service. Our analysis further characterizes the benefits of service provision. We show that service provision can increase the dual-channel pricing flexibility, reduce the seller's B2C channel dependence, and allow the seller to tolerate higher C2C channel redistribution costs. Finally, in examining the effect of a competitively determined B2C channel price on optimal channel strategy, we find that the seller prefers a dual-channel distribution under higher B2C channel prices.", "paper_title": "Optimal Digital Content Distribution Strategy in the Presence of the Consumer-to-Consumer Channel", "paper_id": "WOS:000266257100009"}