{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "sponsored_search"}, {"score": 0.009801447938180446, "phrase": "location_biases"}, {"score": 0.004764648644792333, "phrase": "online_advertisement's_clickthrough_rate"}, {"score": 0.004552648949390462, "phrase": "ad_selection_strategies"}, {"score": 0.004200319352919505, "phrase": "commercial_results"}, {"score": 0.003929843413153981, "phrase": "user's_browsing_behavior"}, {"score": 0.003861596041315646, "phrase": "click_analysis"}, {"score": 0.003715579364728729, "phrase": "ad_clickthrough_rates"}, {"score": 0.003663857375787215, "phrase": "user's_query"}, {"score": 0.0036382660173943393, "phrase": "ad_placement"}, {"score": 0.0036128527616772848, "phrase": "search_engine_result_pages"}, {"score": 0.0034038593017883295, "phrase": "result_page"}, {"score": 0.003064013732721966, "phrase": "existing_click_models"}, {"score": 0.003010757286626405, "phrase": "appropriate_query"}, {"score": 0.002958423758207526, "phrase": "expectation_maximization"}, {"score": 0.0028765701985514294, "phrase": "augmented_models"}, {"score": 0.0028564621282167685, "phrase": "click_signals"}, {"score": 0.002787181295054319, "phrase": "commercial_search_engine"}, {"score": 0.002562123444678208, "phrase": "standard_evaluation_metrics"}, {"score": 0.0023968838023247533, "phrase": "significant_improvements"}, {"score": 0.0021878600131802453, "phrase": "varying_behavioral_patterns"}, {"score": 0.0021049977753042253, "phrase": "user_search_behavior"}], "paper_keywords": ["Algorithms", " Experimentation", " Measurement", " Click model", " sponsored search", " contextual factors", " clickthrough", " Bayesian inference", " query log"], "paper_abstract": "An online advertisement's clickthrough rate provides a fundamental measure of its quality, which is widely used in ad selection strategies. Unfortunately, ads placed in contexts where they are rarely viewed-or where users are unlikely to be interested in commercial results-may receive few clicks regardless of their quality. In this article, we model the variability of a user's browsing behavior for the purpose of click analysis and prediction in sponsored search. Our model incorporates several important contextual factors that influence ad clickthrough rates, including the user's query and ad placement on search engine result pages. We formally model these factors with respect to the list of ads displayed on a result page, the probability that the user will initiate browsing of this list, and the persistence of the user in browsing the list. We incorporate these factors into existing click models by augmenting them with appropriate query and location biases. Using expectation maximization, we learn the parameters of these augmented models from click signals recorded in the logs of a commercial search engine. To evaluate the performance of the models and to compare them with state-of-the-art performance, we apply standard evaluation metrics, including log-likelihood and perplexity. Our evaluation results indicate that, through the incorporation of query and location biases, significant improvements can be achieved in predicting browsing and click behavior in sponsored search. In addition, we explore the extent to which these biases actually reflect varying behavioral patterns. Our observations confirm that correlations exist between the biases and user search behavior.", "paper_title": "Location- and Query-Aware Modeling of Browsing and Click Behavior in Sponsored Search", "paper_id": "WOS:000351446900008"}