{"auto_keywords": [{"score": 0.004791676486479079, "phrase": "imprecise-chance_constrained_input-output_orientation_model"}, {"score": 0.004531939887970372, "phrase": "different_data"}, {"score": 0.0044020386017739575, "phrase": "classic_dea"}, {"score": 0.004034162628397924, "phrase": "realistic_situation"}, {"score": 0.003975898839397212, "phrase": "imprecise_and_uncertain_information"}, {"score": 0.0038900709793274484, "phrase": "measurement_errors"}, {"score": 0.0038712501705283234, "phrase": "data_entry_errors"}, {"score": 0.0037784980723513193, "phrase": "present_investigation"}, {"score": 0.003723912937652509, "phrase": "realistic_decision_problem"}, {"score": 0.0036969156926443727, "phrase": "fuzzy_constraints"}, {"score": 0.00367902594962837, "phrase": "uncertain_information"}, {"score": 0.0036083312829917067, "phrase": "mpss"}, {"score": 0.0035648266669315943, "phrase": "imprecise-chance_constrained_dea_model"}, {"score": 0.0034457902688895268, "phrase": "chance-constrained_input-output_orientation_dea_model"}, {"score": 0.003314591878914152, "phrase": "fuzziness_and_probability_concepts"}, {"score": 0.0032905522869970004, "phrase": "data_errors"}, {"score": 0.003266686474506641, "phrase": "probabilistic_results"}, {"score": 0.003157574001576437, "phrase": "irregular_estimate"}, {"score": 0.003119492127330197, "phrase": "imprecise_chance"}, {"score": 0.0031119308723997333, "phrase": "constrained_model"}, {"score": 0.002921624656622664, "phrase": "stochastic_data"}, {"score": 0.002824005136794786, "phrase": "real_situation"}, {"score": 0.002756274776033678, "phrase": "managers'_ideas"}, {"score": 0.002703258785745222, "phrase": "decision_makers"}, {"score": 0.0026771333996253783, "phrase": "current_study"}, {"score": 0.0026192683039329987, "phrase": "fuzzy_probabilistic_constraints"}, {"score": 0.0026002584975729514, "phrase": "deterministic_equivalent_form"}, {"score": 0.0022259513905243497, "phrase": "empirical_example"}, {"score": 0.0021463059926199054, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data envelopment analysis (DEA)", " Most productive scale size (MPSS)", " Imprecise chance-constrained input-output orientation model"], "paper_abstract": "Varieties of data envelopment analysis (DEA) models have been formulated to assess performance of decision making units (DMUs) in various fields with different data such as: deterministic, interval, fuzzy, etc. Classic DEA requires that values of all inputs and outputs are known exactly. However, this assumption may not be true, since in practice, data can not be precisely measured. Furthermore, a realistic situation is no longer realistic when imprecise and uncertain information are neglected to analyze efficiency of DMUs and measurement errors and data entry errors, etc. For these reasons, in this present investigation, we deal with a realistic decision problem that contains fuzzy constraints and uncertain information (stochastic data) that most productive scale size (MPSS) is estimated in imprecise-chance constrained DEA model. Moreover, intention of this research is to develop and solve a chance-constrained input-output orientation DEA model in which even the chance factors associated with the constraints are not specified precisely. Fuzziness and probability concepts allow the data errors and provide probabilistic results. Hence, if the data is quite imprecise, and also an irregular estimate is needed, the imprecise chance constrained model might be fancied. It is worth stressing that, in practice, data is imprecise. However, uncertainty does n't only relate to stochastic data. Hence, fuzziness and randomness are required to be considering in a real situation, simultaneously. Other advantage of our research is to impose managers' ideas, by considering the tolerances allowed by decision makers. In this current study, a methodology is taken for conversion of fuzzy probabilistic constraints into the deterministic equivalent form. It is worth stressing that, the process of conversion deals first with randomness and then with fuzziness. One it can first deal with fuzziness and then randomness. However, the results will be the same. This is because of the concepts that the involvement of randomness and fuzziness are independent in the model. At last, an empirical example highlights the application of the model then some conclusions are drawn and directions for future research are suggested. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Estimating most productive scale size with imprecise-chance constrained input-output orientation model in data envelopment analysis", "paper_id": "WOS:000304687100023"}