{"auto_keywords": [{"score": 0.04776974719693073, "phrase": "feedback_experience"}, {"score": 0.00481495049065317, "phrase": "video_technology"}, {"score": 0.004441059405327222, "phrase": "numerous_issues"}, {"score": 0.004342430078306461, "phrase": "assessment-related_feedback"}, {"score": 0.004041238873048836, "phrase": "paper_questionnaire_data"}, {"score": 0.0038290829316346654, "phrase": "main_issues"}, {"score": 0.003044455555031339, "phrase": "brief_feedback_videos"}, {"score": 0.002910545717767559, "phrase": "new_online_resource"}, {"score": 0.0025660347613972573, "phrase": "asset_resource"}, {"score": 0.002543043781904587, "phrase": "generic_feedback_provision"}, {"score": 0.002262209824105154, "phrase": "common_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Video feedback", " Feed-forward", " Web 2.0", " Technology-assisted learning", " Assessment"], "paper_abstract": "There are numerous issues surrounding the provision of assessment-related feedback in Higher Education, which in recent years have been highlighted in the National Student Survey. In this paper questionnaire data from staff and students at the University of Reading are used to confirm the main issues encountered with feedback, namely problems of time efficiency for staff, lack of engagement by students with feedback and issues with the timeliness and quality of feedback received. Therefore we explored the potential of technology, specifically video, to address these issues by enabling staff to produce brief feedback videos for students. The videos were housed within a new online resource, 'ASSET, and were used to investigate whether use of this technology could enhance the feedback experience for both staff and students. A pilot of the ASSET resource for generic feedback provision found that it was considered advantageous by staff and students. Moreover, the use of video was also shown to resolve many of the common problems of feedback in relation to quality and engagement of students. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The use of video technology for providing feedback to students: Can it enhance the feedback experience for staff and students?", "paper_id": "WOS:000298524300035"}