{"auto_keywords": [{"score": 0.04411400524709545, "phrase": "lcsh"}, {"score": 0.00469500313566324, "phrase": "current_information_environment"}, {"score": 0.00452063603944825, "phrase": "digital_resources"}, {"score": 0.004271100220705305, "phrase": "library_of_congress_subject_headings"}, {"score": 0.004035282762331904, "phrase": "effective_and_efficient_subject-based_organization"}, {"score": 0.0036476222647061243, "phrase": "digital_environment"}, {"score": 0.0031544754107802413, "phrase": "structural_characteristics"}, {"score": 0.0028332303659245085, "phrase": "effective_subject_access_tool"}, {"score": 0.00264296841319955, "phrase": "syntactic_and_hierarchical_structures"}, {"score": 0.002481085648977413, "phrase": "networked_environment"}, {"score": 0.0022709326810964386, "phrase": "provisional_future_directions"}, {"score": 0.0021317885325570604, "phrase": "viable_system"}, {"score": 0.0021049977753042253, "phrase": "digital_and_networked_resources"}], "paper_keywords": [""], "paper_abstract": "With the current information environment characterized by the proliferation of digital resources, including collaboratively created and shared resources, Library of Congress Subject Headings (LCSH) is facing the challenges of effective and efficient subject-based organization and retrieval of digital resources. To explore the feasibility of utilizing LCSH in a digital environment, we might need to revisit its basic characteristics. The objectives of our study were to analyze LCSH in both syntactic and relational structures, to discover the structural characteristics of LCSH, and to identify problems and issues for the feasibility of LCSH as an effective subject access tool. This study reports and discusses issues raised by the syntactic and hierarchical structures of LCSH that present challenges to its use in a networked environment. Given the results of this study, we recommend a number of provisional future directions for the development of LCSH towards further becoming a viable system for digital and networked resources.", "paper_title": "Revisiting the Syntactical and Structural Analysis of Library of Congress Subject Headings for the Digital Environment", "paper_id": "WOS:000276370500003"}