{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "broadband_internet_access"}, {"score": 0.004219427915728972, "phrase": "broadband_internet"}, {"score": 0.003998380230709541, "phrase": "broadband_deployment"}, {"score": 0.0038074544783102226, "phrase": "basic_concepts"}, {"score": 0.0035553221885904467, "phrase": "network_architectures"}, {"score": 0.003319830633865628, "phrase": "train-based_network"}, {"score": 0.0030101325901285537, "phrase": "user_packets"}, {"score": 0.002951739421935396, "phrase": "access_network"}, {"score": 0.002598816536641781, "phrase": "europe"}, {"score": 0.002573424607574822, "phrase": "north_america"}, {"score": 0.0021891781017389783, "phrase": "technical_perspective"}, {"score": 0.0021049977753042253, "phrase": "internet_access"}], "paper_keywords": ["Broadband Internet", " Trains", " FAMOUS", " Architecture"], "paper_abstract": "We present a survey of approaches for providing broadband Internet access to trains. We examine some of the barriers that hinder the use of broadband Internet on trains and then discuss some of the opportunities for broadband deployment to trains. This survey considers some of the basic concepts for providing broadband Internet access and then reviews associated network architectures. The review of network architectures shows that we can subdivide networks for providing broadband Internet access to trains into the train-based network, the access network-for connecting the train to the service provider(s)-and the aggregation network-for collecting user packets generated in the access network for transmission to the Internet. Furthermore, our review shows that the current trend is to provide Internet access to passengers on trains using IEEE 802.11; however, a clear method for connecting trains to the global Internet has yet to emerge. A summary of implementation efforts in Europe and North America serves to highlight some of the schemes that have been used thus far to connect trains to the Internet. We conclude by discussing some of the models developed, from a technical perspective, for testing the viability of deploying Internet access to trains.", "paper_title": "A Survey on Methods for Broadband Internet Access on Trains", "paper_id": "WOS:000277777000004"}