{"auto_keywords": [{"score": 0.04743819316689626, "phrase": "web_browsers"}, {"score": 0.01227518980986629, "phrase": "private_browsing_mode"}, {"score": 0.011535105531289645, "phrase": "web_browser"}, {"score": 0.00481495049065317, "phrase": "windows_system"}, {"score": 0.004604271739916253, "phrase": "internet_technology"}, {"score": 0.004509120242098446, "phrase": "essential_applications"}, {"score": 0.004286109357236311, "phrase": "important_role"}, {"score": 0.004247910389657671, "phrase": "portable_operating_system"}, {"score": 0.004123012124092743, "phrase": "online_editor"}, {"score": 0.004037765953523501, "phrase": "online_storage_repository"}, {"score": 0.003849452105837052, "phrase": "large_number"}, {"score": 0.0036808626034099973, "phrase": "increasingly_important_issue"}, {"score": 0.0032859724984346966, "phrase": "surfers'_private_information"}, {"score": 0.003256657868307919, "phrase": "surfing_habits"}, {"score": 0.003095398328922842, "phrase": "browsing_histories"}, {"score": 0.0030495020877548324, "phrase": "users'_computers"}, {"score": 0.00301327406964098, "phrase": "malicious_attacks"}, {"score": 0.002968591879288644, "phrase": "private_browsing_mode_mechanisms"}, {"score": 0.002915844417747579, "phrase": "user's_behavior"}, {"score": 0.002541309185654501, "phrase": "extremely_serious_threat"}, {"score": 0.002518621016346282, "phrase": "private_security"}, {"score": 0.002503607929521596, "phrase": "web_users"}, {"score": 0.0024517616471854717, "phrase": "windows_xp"}, {"score": 0.0023372432551797013, "phrase": "firefox"}, {"score": 0.002188442250414479, "phrase": "anti-forensics_manners"}], "paper_keywords": ["Web security", " Private browsing", " Malicious", " Anti-forensics"], "paper_abstract": "Recently, due to the advance and development of Internet technology and its development, web browsers have become essential applications. A web browser is not only used to surf the Internet, but also plays an important role as a portable operating system. For example, many users edit documents via an online editor and store the documents in an online storage repository. All those tasks are done with the help of a web browser. This results in a large number of attacks on web browsers. Therefore, the security of web browsers has become an increasingly important issue in recent years. Traditionally, when a user surfs on the Internet, his interaction with the browser is recorded. This scenario is called public browsing mode. Through attacking web browsers, attackers can obtain access to surfers' private information, including surfing habits and passwords. The attackers are able to do this as web browsers always leave cookies, browsing histories and caches on the users' computers. To avoid malicious attacks, many web browsers have developed private browsing mode mechanisms. In private browsing mode, a user's behavior is not traced and his private information is retained as well. However, these mechanisms still create files such as bookmarks. Most importantly, the files downloaded through a web browser will be saved to disk unless the user deletes them himself. This is an extremely serious threat to the private security of web users. We designed a mechanism in Windows XP that observes the behaviors and patterns related to the creation and deletion of files in Firefox while in private browsing mode. We then focused on the files which were not deleted, and cleared them by means of anti-forensics manners. In other words, the web browsers can be made comprehensively secure with our mechanism.", "paper_title": "Web security in a windows system as PrivacyDefender in private browsing mode", "paper_id": "WOS:000350572900009"}