{"auto_keywords": [{"score": 0.04979721041705589, "phrase": "system_design"}, {"score": 0.013945568094679318, "phrase": "proposed_method"}, {"score": 0.011872215473181782, "phrase": "recursive_cbr_process"}, {"score": 0.01142847472639761, "phrase": "ontological_guidelines"}, {"score": 0.009472008624901662, "phrase": "retrieval_step"}, {"score": 0.00481495049065317, "phrase": "based_reasoning"}, {"score": 0.004661176995136095, "phrase": "preference_modeling"}, {"score": 0.0045122922461952805, "phrase": "case-based_reasoning"}, {"score": 0.00448576773946101, "phrase": "cbr"}, {"score": 0.00438105507792004, "phrase": "cbr_processes"}, {"score": 0.004191291301774421, "phrase": "integrated_cbr_process"}, {"score": 0.004142084961822865, "phrase": "system_engineering_principles"}, {"score": 0.003531474887552889, "phrase": "uncertainty_and_designer_preferences"}, {"score": 0.0034388111429203222, "phrase": "requirements_definition"}, {"score": 0.0032223742018434856, "phrase": "cbr_process"}, {"score": 0.0028044130672242695, "phrase": "available_similarity_measures"}, {"score": 0.0027469703311742647, "phrase": "research_scope"}, {"score": 0.002690701018745317, "phrase": "sufficient_panel"}, {"score": 0.002620040660435039, "phrase": "system_engineering"}, {"score": 0.00259690091805822, "phrase": "aeronautic_domain"}, {"score": 0.002455009746748708, "phrase": "retrieval_algorithm"}, {"score": 0.0024333239726872604, "phrase": "software_prototype"}, {"score": 0.002286781334850213, "phrase": "engineering_design"}, {"score": 0.0022070310530794097, "phrase": "flexible_constraints"}, {"score": 0.002181069180139225, "phrase": "designer_preferences"}, {"score": 0.002130056082139311, "phrase": "similar_solutions"}, {"score": 0.0021049977753042253, "phrase": "even_if_similarity_measures"}], "paper_keywords": ["Case-Based Reasoning", " Design", " Ontology", " Preferences", " Retrieval", " System Engineering"], "paper_abstract": "This paper addresses the fulfillment of requirements related to case-based reasoning (CBR) processes for system design. Considering that CBR processes are well suited for problem solving, the proposed method concerns the definition of an integrated CBR process in line with system engineering principles. After the definition of the requirements that the approach has to fulfill, an ontology is defined to capitalize knowledge about the design within concepts. Based on the ontology, models are provided for requirements and solutions representation. Next, a recursive CBR process, suitable for system design, is provided. Uncertainty and designer preferences as well as ontological guidelines are considered during the requirements definition, the compatible cases retrieval, and the solution definition steps. This approach is designed to give flexibility within the CBR process as well as to provide guidelines to the designer. Such questions as the following are conjointly treated: how to guide the designer to be sure that the requirements are correctly defined and suitable for the retrieval step, how to retrieve cases when there are no available similarity measures, and how to enlarge the research scope during the retrieval step to obtain a sufficient panel of solutions. Finally, an example of system engineering in the aeronautic domain illustrates the proposed method. A testbed has been developed and carried out to evaluate the performance of the retrieval algorithm and a software prototype has been developed in order to test the approach. The outcome of this work is a recursive CBR process suitable to engineering design and compatible with standards. Requirements are modeled by means of flexible constraints, where the designer preferences are used to express the flexibility. Similar solutions can be retrieved even if similarity measures between features are not available. Simultaneously, ontological guidelines are used to guide the process and to aid the designer to express her/his preferences.", "paper_title": "Case- based reasoning and system design: An integrated approach based on ontology and preference modeling", "paper_id": "WOS:000332882000003"}