{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "underwater_vehicle"}, {"score": 0.017445183260764625, "phrase": "tactics_manager"}, {"score": 0.01210158052317402, "phrase": "engagement-level_simulation"}, {"score": 0.00644078051214953, "phrase": "fuzzy_logic"}, {"score": 0.006393801393374833, "phrase": "tactical_decision_making"}, {"score": 0.006148937296732309, "phrase": "light_torpedo"}, {"score": 0.005482260241953833, "phrase": "tactical_decision"}, {"score": 0.004947730686370567, "phrase": "python"}, {"score": 0.00479147041454407, "phrase": "fuzzy-logic-based_tactical_decision"}, {"score": 0.004585212379675535, "phrase": "complex_and_complicated_weapon_system"}, {"score": 0.004188583059712052, "phrase": "concept_design"}, {"score": 0.0041579627441997, "phrase": "mass_production"}, {"score": 0.004047583252380616, "phrase": "trial-and-error_instances"}, {"score": 0.0038261310307416475, "phrase": "engineering-level_simulation"}, {"score": 0.003661275004971829, "phrase": "tactical_and_operational_effectiveness"}, {"score": 0.003279445150771808, "phrase": "evasion_methods"}, {"score": 0.002973503319954633, "phrase": "submarine_model"}, {"score": 0.0027493746632009557, "phrase": "lua"}, {"score": 0.002663208600887875, "phrase": "tactics_description"}, {"score": 0.002573424607574822, "phrase": "python_file"}, {"score": 0.0024866599295898517, "phrase": "simulation_results"}, {"score": 0.0024563849242113605, "phrase": "implemented_fuzzy_python_tactic_description_file"}, {"score": 0.0023969335711112555, "phrase": "submarine_survival"}, {"score": 0.002321787726770895, "phrase": "fundamental_research"}, {"score": 0.0022935154199244688, "phrase": "artificial_intelligence"}, {"score": 0.002276717177453959, "phrase": "tactical_decision_making_method"}, {"score": 0.00220533188459562, "phrase": "fuzzy-based_tactics_description_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy decision making", " Tactics manager", " Underwater vehicle", " Modeling and simulation", " Torpedo evasion", " Python scripting", " DEVS"], "paper_abstract": "An underwater vehicle such as a submarine or a torpedo is a complex and complicated weapon system composed of various systems and subsystems. Usually, it takes around 10 years, a substantial amount of money, and many research and development resources to complete the development of an underwater vehicle, right from the concept design to the mass production. Recently, in order to reduce the number of trial-and-error instances required for verifying the operation of an underwater vehicle, modeling and simulation (M&S) has been investigated and applied to an engineering-level simulation to analyze the performance of a system and a subsystem and to an engagement-level simulation to analyze the tactical and operational effectiveness. In this paper, we introduce a method for applying fuzzy logic to the tactical decision making of an underwater vehicle in an engagement-level simulation. In the scenario of an engagement between a light torpedo pursuing a submarine and the submarine attempting to evade the attack, the evasion methods for the submarine are modeled in fuzzy logic after tacticalization. For the simulation, we modeled a light torpedo and a submarine on the basis of DEVS (Discrete Event System Specification). Further, when a tactical decision had to be taken, the submarine model calls the tactics manager implemented outside of the model and passes its own state variables, which are necessary for tactical decision making, to the tactics manager. The tactics manager used in the tactical decision making process supports Lua and the Python scripting languages and is self-implemented. The tactics description of the submarine was implemented using Python scripting grammar and stored as a Python file (*.py) to be inputted to the tactics manager. As the simulation results, we present the implemented fuzzy Python tactic description file of the submarine evasion tactics and the possibilities of submarine survival according to the tactics as a comparison. Finally, as the fundamental research on the application of artificial intelligence to the tactical decision making method of the model used in the engagement-level simulation, this work suggests the fuzzy-based tactics description method and presents the detailed procedures for the various actions, and their adopting effectiveness. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Torpedo evasion simulation of underwater vehicle using fuzzy-logic-based tactical decision making in script tactics manager", "paper_id": "WOS:000303281600041"}