{"auto_keywords": [{"score": 0.05007652773010767, "phrase": "cyber-physical_system"}, {"score": 0.04120728054749015, "phrase": "cps"}, {"score": 0.00457138247462329, "phrase": "physical_processes"}, {"score": 0.004302680891412643, "phrase": "social_life"}, {"score": 0.0042656009036320585, "phrase": "wireless_sensor_networks"}, {"score": 0.004138309011478741, "phrase": "vital_part"}, {"score": 0.003997458586709491, "phrase": "major_driving_factors"}, {"score": 0.003962998498942111, "phrase": "cps_applications"}, {"score": 0.0038115535592184438, "phrase": "nascent_technology"}, {"score": 0.0033909518548844047, "phrase": "technology_integration"}, {"score": 0.0033039560332995136, "phrase": "computing_resources"}, {"score": 0.00327545462323687, "phrase": "sensor_networks"}, {"score": 0.0031365819432206004, "phrase": "healthcare_applications"}, {"score": 0.0029392020223716966, "phrase": "comprehensive_taxonomy"}, {"score": 0.0028390477456009568, "phrase": "different_components"}, {"score": 0.0021604924928015283, "phrase": "relevant_systems"}], "paper_keywords": [""], "paper_abstract": "Cyber-physical system (CPS) is an integration of physical processes with computation and communication. It has the ability to add more intelligence to social life. Wireless sensor networks (WSN) can be a vital part of CPS as strong sensing capability is one of the major driving factors for CPS applications. CPS is still considered to be a nascent technology, and there are many challenges yet to be addressed. A few CPS applications in healthcare have been proposed to date, and they lack the flexibility of technology integration, such as integration of computing resources with sensor networks. This paper presents a survey of CPS in healthcare applications that have been proposed to date by academia as well as industry. A comprehensive taxonomy is also provided that characterizes and classifies different components and methods that are required for the application of CPS in healthcare. The taxonomy not only highlights the similarities and differences of the state-of-the-art technologies utilized in CPS for healthcare from the perspective of WSN and Cloud Computing but also identifies the areas that require further research. It is expected that this taxonomy and its mapping to relevant systems will be highly useful for further development of CPS for healthcare.", "paper_title": "Review of Cyber-Physical System in Healthcare", "paper_id": "WOS:000335675700001"}