{"auto_keywords": [{"score": 0.03386647630924817, "phrase": "nais_community"}, {"score": 0.012484710982743941, "phrase": "bise_community"}, {"score": 0.00481495049065317, "phrase": "information_systems_engineering"}, {"score": 0.004715702140552199, "phrase": "information_systems"}, {"score": 0.004507594400447103, "phrase": "present_reflection"}, {"score": 0.00435375504298636, "phrase": "common_object"}, {"score": 0.004234503277921603, "phrase": "german"}, {"score": 0.0038957429132649175, "phrase": "other's_strengths"}, {"score": 0.0036595438031512217, "phrase": "bise_researchers'_topics"}, {"score": 0.003559199464487982, "phrase": "practical_relevance"}, {"score": 0.0034615969985956866, "phrase": "numerous_bise_researchers"}, {"score": 0.00342568771304873, "phrase": "strong_contributions"}, {"score": 0.003378385493203297, "phrase": "research_quality"}, {"score": 0.0033201720993656734, "phrase": "top-ranked_journals"}, {"score": 0.003086396772496527, "phrase": "enrollment_numbers"}, {"score": 0.0029705677977833857, "phrase": "mutual_understanding"}, {"score": 0.0027137301650680175, "phrase": "bise_community's_main_publication_outlet"}, {"score": 0.002639251247218711, "phrase": "community's_ability"}, {"score": 0.002461852774571558, "phrase": "bise_insiders"}, {"score": 0.002272501735900584, "phrase": "valuable_hints"}, {"score": 0.002241087008892355, "phrase": "nais_scholars"}, {"score": 0.002164432930854161, "phrase": "traditional_strength"}], "paper_keywords": ["Information Systems", " Business and Information Systems Engineering", " BISE", " Past", " Present", " Future", " Critical Reflection", " Industry Connections"], "paper_abstract": "Although both communities share a common object of research, the Business and Information Systems Engineering (BISE) community from the German-speaking countries and the North American Information Systems (NAIS) community have developed quite differently. In our opinion, each community has the opportunity to learn from the other's strengths to mitigate its own weaknesses. The BISE community promotes connections with industry and draws substantial funding from there. BISE researchers' topics are attractive to students and ensure the practical relevance of publications. Due to various reasons, numerous BISE researchers struggle with strong contributions to theory, research quality, and publications in top-ranked journals. While this obviously is a strength of the NAIS community, we observe that the NAIS community struggles with its industry connections and enrollment numbers. What the global IS/BISE community needs is a more intense discourse that increases mutual understanding, creates awareness for the need to complement one another, and ensures that this opportunity is seized. Organized along the history of the BISE community's main publication outlet, this paper offers insights into the community's ability to fully engage with industry and how this ability was maintained over time. Based thereon, we as BISE insiders would like to give recommendations on how the NAIS community can mitigate some of its weaknesses. These recommendations are intended to complement the valuable hints already provided by NAIS scholars. They also intend to make insights into the traditional strength of the BISE community available when discussing the global IS/BISE community's future.", "paper_title": "Business and Information Systems Engineering: A Complementary Approach to Information Systems - What We Can Learn from the Past and May Conclude from Present Reflection on the Future", "paper_id": "WOS:000307845900003"}