{"auto_keywords": [{"score": 0.04880247283985043, "phrase": "addressee_detection"}, {"score": 0.00481495049065317, "phrase": "study_of_multimodal_addressee_detection"}, {"score": 0.004777917315737992, "phrase": "human-human-computer_interaction"}, {"score": 0.004388796812234033, "phrase": "dialogue_system"}, {"score": 0.004338239182984759, "phrase": "multiple_users"}, {"score": 0.0039085400187964196, "phrase": "multimodal_scenario"}, {"score": 0.0037170399498025215, "phrase": "multiparty_dialogue_system"}, {"score": 0.0036038701178581403, "phrase": "multiple_modalities"}, {"score": 0.003548579306515579, "phrase": "single_modality"}, {"score": 0.0034672240102960644, "phrase": "relative_importance"}, {"score": 0.0033486631403337555, "phrase": "key_individual_features"}, {"score": 0.0032216622984027558, "phrase": "energy-based_acoustic_features"}, {"score": 0.003087500254099842, "phrase": "speech_recognition"}, {"score": 0.0030637124954859657, "phrase": "system_state"}, {"score": 0.00297037471252423, "phrase": "visual_and_beamforming_features"}, {"score": 0.0026551731045904854, "phrase": "situational_attractor"}, {"score": 0.0024669814850296146, "phrase": "interactive_assistant"}, {"score": 0.002410363090950055, "phrase": "open_space"}, {"score": 0.0021213575697367148, "phrase": "ongoing_development"}], "paper_keywords": ["Addressee detection", " beamforming", " dialogue system", " head pose", " human-human-computer", " multimodal", " multiparty", " prosody", " speech recognition"], "paper_abstract": "The goal of addressee detection is to answer the question, \"Are you talking to me?\" When a dialogue system interacts with multiple users, it is crucial to detect when a user is speaking to the system as opposed to another person. We study this problem in a multimodal scenario, using lexical, acoustic, visual, dialogue state, and beamforming information. Using data from a multiparty dialogue system, we quantify the benefits of using multiple modalities over using a single modality. We also assess the relative importance of the various modalities, as well as of key individual features, in estimating the addressee. We find that energy-based acoustic features are by far the most important, that information from speech recognition and system state is useful as well, and that visual and beamforming features provide little additional benefit. While we find that head pose is affected by whom the speaker is addressing, it yields little nonredundant information due to the system acting as a situational attractor. Our findings would be relevant to multiparty, open-world dialogue systems in which the agent plays an active, conversational role, such as an interactive assistant deployed in a public, open space. For these scenarios, our study suggests that acoustic, lexical, and system-state information is an effective and practical combination of modalities to use for addressee detection. We also consider how our analyses might be affected by the ongoing development of more realistic, natural dialogue systems.", "paper_title": "A Study of Multimodal Addressee Detection in Human-Human-Computer Interaction", "paper_id": "WOS:000359583000015"}