{"auto_keywords": [{"score": 0.04103590613212116, "phrase": "cvd"}, {"score": 0.03650410528415331, "phrase": "condition_classes"}, {"score": 0.015719385753351977, "phrase": "condition_class_space"}, {"score": 0.015585458017737546, "phrase": "continuous_value_discretization"}, {"score": 0.015452653420360504, "phrase": "rough_set_theory"}, {"score": 0.015060887653696368, "phrase": "information_system"}, {"score": 0.004551647527068771, "phrase": "incumbent_effect"}, {"score": 0.004120435930514554, "phrase": "decision_attributes"}, {"score": 0.00403221710768334, "phrase": "concomitant_granularity"}, {"score": 0.003634262647873338, "phrase": "object_classification"}, {"score": 0.00319141242685261, "phrase": "subsequent_condition_classes"}, {"score": 0.0028267701593809877, "phrase": "related_decision_outcomes"}, {"score": 0.0027781870000242004, "phrase": "inexactness_incumbent"}, {"score": 0.002387083859537412, "phrase": "rst_methodology"}, {"score": 0.0023257824499250653, "phrase": "novel_exposition"}, {"score": 0.0022174469839432013, "phrase": "rst-related_reducts"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "The granularity of an information system has an incumbent effect on the efficacy of the analysis from many machine learning algorithms. An information system contains a universe of objects characterized and categorized by condition and decision attributes. To manage the concomitant granularity, a level of continuous value discretization (CVD) is often undertaken. In the case of the rough set theory (RST) methodology for object classification, the granularity contributes to the grouping of objects into condition classes with the same condition attribute values. This article exposits the effect of a level of CVD on the subsequent condition classes constructed, with the introduction of the condition class space-the domain within which the condition classes exist. This domain elucidates the association of the condition classes to the related decision outcomes-reflecting the inexactness incumbent when a level of CVD is undertaken. A series of measures is defined that quantify this association. Throughout this study and without loss of generality, the findings are made through the RST methodology. This further offers a novel exposition of the relationship between all the condition attributes and the RST-related reducts (subsets of condition attributes). (c) 2006 Wiley Periodicals, Inc.", "paper_title": "An introduction of the condition class space with continuous value discretization and rough set theory", "paper_id": "WOS:000235296500004"}