{"auto_keywords": [{"score": 0.03771465750530587, "phrase": "growth_dynamics"}, {"score": 0.015211900959328395, "phrase": "artificial_embryogenies"}, {"score": 0.009313395854378676, "phrase": "final_phenotype"}, {"score": 0.00481495049065317, "phrase": "heterochrony"}, {"score": 0.004606479650820579, "phrase": "developmental_dynamics"}, {"score": 0.004489046493029801, "phrase": "evolutionary_algorithms"}, {"score": 0.004154332348800334, "phrase": "new_kinds"}, {"score": 0.003844478919573134, "phrase": "available_embryogenies"}, {"score": 0.0027469703311742647, "phrase": "heterochrony_framework"}, {"score": 0.002706659627293686, "phrase": "alberch"}, {"score": 0.0026867410464012998, "phrase": "gould"}, {"score": 0.002551231922794106, "phrase": "paleobiology"}, {"score": 0.002431525473795068, "phrase": "real_biological_organisms"}, {"score": 0.002258212866482022, "phrase": "simple_experiments"}, {"score": 0.0021049977753042253, "phrase": "rather_different_growth_dynamics"}], "paper_keywords": ["Artificial embryogeny", " heterochrony", " genetic programming", " neutral mutations", " developmental trajectories"], "paper_abstract": "Artificial embryogenies are an extension to evolutionary algorithms, in which genotypes specify a process to grow phenotypes. This approach has become rather popular recently, with new kinds of embryogenies being increasingly reported in the literature. Nevertheless, it is still difficult to analyze and compare the available embryogenies, especially if they are based on very different paradigms. We propose a method to analyze embryogenies based on growth dynamics, and how evolution is able to change them (heterochrony). We define several quantitative measures that allow us to establish the variation in growth dynamics that an embryogeny can create, the degree of change in growth dynamics caused by mutations, and the degree to which an embryogeny allows mutations to change the growth of a genotype, but without changing the final phenotype reached. These measures are based on an heterochrony framework, due to Alberch, Gould, Oster, & Wake (1979 Size and shape in ontogeny and phylogeny, Paleobiology, 5(3), 296-317) that is used in real biological organisms. The measures are general enough to be applied to any embryogeny, and can be easily computed from simple experiments. We further illustrate how to compute these measures by applying them to two simple embryogenies. These embryogenies exhibit rather different growth dynamics, and both allow for mutations that changed growth without affecting the final phenotype.", "paper_title": "Heterochrony and Artificial Embryogeny: A Method for Analyzing Artificial Embryogenies Based on Developmental Dynamics", "paper_id": "WOS:000264023000001"}