{"auto_keywords": [{"score": 0.04749648116003423, "phrase": "itc"}, {"score": 0.011464259056832548, "phrase": "internal_and_external_learning_competencies"}, {"score": 0.009906296749962924, "phrase": "internal_and_external_learning_competency"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004597754207658615, "phrase": "information_technology_competency"}, {"score": 0.004058826900076531, "phrase": "survey_data"}, {"score": 0.003966162568548304, "phrase": "structural_equation"}, {"score": 0.0035335154419206634, "phrase": "critical_role"}, {"score": 0.0030476702431093687, "phrase": "-effect_relation"}, {"score": 0.0028303313661029597, "phrase": "organizational_learning_research"}, {"score": 0.0027784560880013886, "phrase": "key_antecedent"}, {"score": 0.0025565086943850337, "phrase": "csi."}, {"score": 0.002266765479420981, "phrase": "competitive_advantage"}, {"score": 0.002225196379204285, "phrase": "complementary_strategic_capabilities"}, {"score": 0.0021049977753042253, "phrase": "firm_performance"}], "paper_keywords": ["Information technology", " Commercial success of innovation", " External learning competency", " Internal learning competency"], "paper_abstract": "Purpose - The purpose of this paper is to analyze the impact of information technology competency (ITC) on internal and external learning competency and the relations among ITC, internal and external learning competency and the commercial success of innovation (CSI) Design/methodology/approach - The paper uses survey data from 186 companies. Through structural equation modeling the paper assesses the links between ITC, internal and external learning competency and the CSI. Findings - First, this study finds that ITC plays a critical role in internal and external learning competencies. Second, internal and external learning competencies are directly related to the CSI. Third, internal and external learning competencies mediate the relation between ITC and the CSI. Research limitations/implications - The research is cross-sectional, so cause-effect relation cannot be definitively inferred from the results. Originality/value - This study contributes to organizational learning research, identifying a key antecedent of internal and external learning competencies - ITC - and analyzing the link between internal and external learning competencies and the CSI. Moreover, this study is relevant to IT literature because it shows that ITC, on its own, is insufficient to generate and maintain a competitive advantage. Firms need complementary strategic capabilities such as learning competencies to strengthen the effect of ITC on firm performance.", "paper_title": "IT competency and the commercial success of innovation", "paper_id": "WOS:000341781200003"}