{"auto_keywords": [{"score": 0.04190040646301332, "phrase": "base_classifier"}, {"score": 0.00842032530433776, "phrase": "query_instance"}, {"score": 0.006606857835330019, "phrase": "training_data"}, {"score": 0.00481495049065317, "phrase": "meta-des"}, {"score": 0.0046457802872573025, "phrase": "dynamic_ensemble_selection_systems"}, {"score": 0.0038986150699604504, "phrase": "local_regions"}, {"score": 0.003856971411867688, "phrase": "feature_space"}, {"score": 0.0034394269654205094, "phrase": "novel_dynamic_ensemble_selection_framework"}, {"score": 0.003342280102112269, "phrase": "five_distinct_sets"}, {"score": 0.00323625520042892, "phrase": "different_criterion"}, {"score": 0.0030779528295407925, "phrase": "input_samples"}, {"score": 0.0027841357057119317, "phrase": "input_instance"}, {"score": 0.002744510304340939, "phrase": "generalization_phase"}, {"score": 0.002327310963701377, "phrase": "high_degree"}, {"score": 0.0022453451864218477, "phrase": "experimental_results"}, {"score": 0.0022133711375320244, "phrase": "proposed_meta-learning_framework"}, {"score": 0.0021507795710951384, "phrase": "current_state-of-the-art_dynamic_ensemble_selection_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ensemble of classifiers", " Dynamic ensemble selection", " Meta-learning", " Classifier competence"], "paper_abstract": "Dynamic ensemble selection systems work by estimating the level of competence of each classifier from a pool of classifiers. Only the most competent ones are selected to classify a given test sample. This is achieved by defining a criterion to measure the level of competence of a base classifier, such as, its accuracy in local regions of the feature space around the query instance. However, using only one criterion about the behavior of a base classifier is not sufficient to accurately estimate its level of competence. In this paper, we present a novel dynamic ensemble selection framework using meta-learning. We propose five distinct sets of meta-features, each one corresponding to a different criterion to measure the level of competence of a classifier for the classification of input samples. The meta-features are extracted from the training data and used to train a meta-classifier to predict whether or not a base classifier is competent enough to classify an input instance. During the generalization phase, the meta-features are extracted from the query instance and passed down as input to the meta-classifier. The meta-classifier estimates, whether a base classifier is competent enough to be added to the ensemble. Experiments are conducted over several small sample size classification problems, i.e., problems with a high degree of uncertainty due to the lack of training data. Experimental results show that the proposed meta-learning framework greatly improves classification accuracy when compared against current state-of-the-art dynamic ensemble selection techniques. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "META-DES: A dynamic ensemble selection framework using meta-learning", "paper_id": "WOS:000349504700026"}