{"auto_keywords": [{"score": 0.04973325992892519, "phrase": "speakapps"}, {"score": 0.03737634241271663, "phrase": "development_process"}, {"score": 0.00481495049065317, "phrase": "online_oral_language_learning_environment"}, {"score": 0.0047113960612140335, "phrase": "purpose_-_the_purpose"}, {"score": 0.003958937342925219, "phrase": "open_source"}, {"score": 0.00393032656248792, "phrase": "techno-pedagogical_solution"}, {"score": 0.0038457240885563146, "phrase": "online_oral_language_production"}, {"score": 0.003138609109371368, "phrase": "qualitative_teaching_scenarios"}, {"score": 0.003070996252787868, "phrase": "delphi_analysis"}, {"score": 0.0030267296900520217, "phrase": "findings_-_language_learners"}, {"score": 0.002897710777957041, "phrase": "synchronous_communication_tools"}, {"score": 0.002855934865505357, "phrase": "language_learning_contexts"}, {"score": 0.0027943943921568456, "phrase": "usability_features"}, {"score": 0.0023303871145705954, "phrase": "open_content"}, {"score": 0.0021049977753042253, "phrase": "action-oriented_approach"}], "paper_keywords": ["User-centred design", " Computer-assisted language learning", " Synchronous communication", " Language learning"], "paper_abstract": "Purpose - The purpose of this paper is to report on SpeakApps, a major collaborative computer-assisted language learning project, developed based on an open source techno-pedagogical solution to facilitate online oral language production and interaction. Design/methodology/approach - A mixed method approach was incorporated as part of the development process which included a comprehensive literature and practice review, user requirement survey of 815 learner, 61 pilot studies with 7,180 students, construction of qualitative teaching scenarios and a Delphi analysis. Findings - Language learners have limited experience of using synchronous communication tools within language learning contexts. Improving usability features within the Open Educational Resources supported the notion of sustainability and that the provision of the mechanism to indicate quality were vital to support the integrity of open content. Originality/value - The paper provides an overview of the operationalisation of an action-oriented approach to language learning which manifested as a design for learning development process. It illustrates the breadth of issues raised from technical to pedagogical when teacher and learner agency are central for development and sustainability.", "paper_title": "Designing the online oral language learning environment SpeakApps", "paper_id": "WOS:000355669600003"}