{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "relative_reasoning_rules"}, {"score": 0.04921457158686006, "phrase": "combinatorial_explosion"}, {"score": 0.004670896353428476, "phrase": "biodegradation_pathway_prediction"}, {"score": 0.004342430078306461, "phrase": "rule-based_expert_system"}, {"score": 0.004263972370406983, "phrase": "plausible_biodegradation_pathways"}, {"score": 0.004212453011596424, "phrase": "organic_compounds"}, {"score": 0.0041112665381266315, "phrase": "iterative_application"}, {"score": 0.003964007795174772, "phrase": "biodegradation_pathways"}, {"score": 0.0037529131348732715, "phrase": "known_biotransformation_pathways"}, {"score": 0.0036627245728600073, "phrase": "biotransformation_priorities"}, {"score": 0.0029066973917258655, "phrase": "predicted_biotransformations"}, {"score": 0.002636956926079255, "phrase": "external_validation"}, {"score": 0.0023346234464901978, "phrase": "relative_reasoning"}, {"score": 0.0021049977753042253, "phrase": "predicted_transformation_products"}], "paper_keywords": [""], "paper_abstract": "Motivation: The University of Minnesota Pathway Prediction System (UM-PPS) is a rule-based expert system to predict plausible biodegradation pathways for organic compounds. However, iterative application of these rules to generate biodegradation pathways leads to combinatorial explosion. We use data from known biotransformation pathways to rationally determine biotransformation priorities (relative reasoning rules) to limit this explosion. Results: A total of 112 relative reasoning rules were identified and implemented. In one prediction step, i.e. as per one generation predicted, the use of relative reasoning decreases the predicted biotransformations by over 25 for 50 compounds used to generate the rules and by about 15 for an external validation set of 47 xenobiotics, including pesticides, biocides and pharmaceuticals. The percentage of correctly predicted, experimentally known products remains at 75 when relative reasoning is used. The set of relative reasoning rules identified, therefore, effectively reduces the number of predicted transformation products without compromising the quality of the predictions.", "paper_title": "Data-driven extraction of relative reasoning rules to limit combinatorial explosion in biodegradation pathway prediction", "paper_id": "WOS:000258959600016"}