{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sami"}, {"score": 0.013232443031557956, "phrase": "missing_node_identification_problem"}, {"score": 0.004654826737377134, "phrase": "missing_node_problem"}, {"score": 0.004478308876320956, "phrase": "important_area"}, {"score": 0.004435230698216773, "phrase": "social_network_research"}, {"score": 0.0039685202936462815, "phrase": "missing_members"}, {"score": 0.003911367220315185, "phrase": "social_network_structure"}, {"score": 0.0037811784409635023, "phrase": "previous_works"}, {"score": 0.0036201167891046046, "phrase": "specific_users"}, {"score": 0.0032389001343643064, "phrase": "user_demographic_information"}, {"score": 0.00320770578058916, "phrase": "users'_historical_behavior"}, {"score": 0.002869793011316547, "phrase": "sami-a"}, {"score": 0.002592369213499121, "phrase": "previous_missing_node_algorithms"}, {"score": 0.0023644936731468252, "phrase": "specific_problem_instances"}, {"score": 0.002263639474937039, "phrase": "best_algorithm"}, {"score": 0.002230984431056064, "phrase": "best_variation"}, {"score": 0.0021049977753042253, "phrase": "oasca"}], "paper_keywords": ["Algorithms", " Social networks", " K-means", " Missing nodes"], "paper_abstract": "An important area of social network research is identifying missing information which is not visible or explicitly represented in the network. Recently, the missing node identification problem was introduced where missing members in the social network structure must be identified. However, previous works did not consider the possibility that information about specific users (nodes) within the network may be known and could be useful in solving this problem. Assuming such information such as user demographic information and users' historical behavior in the network is known, more effective algorithms for the missing node identification problem could potentially be developed. In this paper, we present three algorithms, SAMI-A, SAMI-C and SAMI-N, which leverage this type of information to perform significantly better than previous missing node algorithms. However, as each of these algorithms and the parameters within these algorithms often perform better in specific problem instances, a mechanism is needed to select the best algorithm and the best variation within that algorithm. Towards this challenge, we also present OASCA, a novel online selection algorithm. We present results that detail the success of the algorithms presented within this paper.", "paper_title": "SAMI: an algorithm for solving the missing node problem using structure and attribute information", "paper_id": "WOS:000366196300029"}