{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reputation_systems"}, {"score": 0.017532025795168056, "phrase": "defense_mechanisms"}, {"score": 0.0073217346497422885, "phrase": "existing_reputation_systems"}, {"score": 0.004553128404612054, "phrase": "metric_encapsulating_reputation"}, {"score": 0.004096635798793164, "phrase": "accurate_assessment"}, {"score": 0.003825849505589868, "phrase": "unprecedented_community_size"}, {"score": 0.003778566972399296, "phrase": "potentially_adversarial_environments"}, {"score": 0.0034634973175137486, "phrase": "analysis_framework"}, {"score": 0.003357435261066107, "phrase": "general_decomposition"}, {"score": 0.0030965805992969027, "phrase": "design_choices"}, {"score": 0.0027172101552870973, "phrase": "peer-to-peer_domain"}, {"score": 0.0021049977753042253, "phrase": "existing_or_future_reputation_systems"}], "paper_keywords": ["Design", " Reliability", " Security", " Theory", " Reputation", " trust", " incentives", " peer-to-peer", " attacks", " collusion", " attack mitigation", " defense techniques"], "paper_abstract": "Reputation systems provide mechanisms to produce a metric encapsulating reputation for a given domain for each identity within the system. These systems seek to generate an accurate assessment in the face of various factors including but not limited to unprecedented community size and potentially adversarial environments. We focus on attacks and defense mechanisms in reputation systems. We present an analysis framework that allows for the general decomposition of existing reputation systems. We classify attacks against reputation systems by identifying which system components and design choices are the targets of attacks. We survey defense mechanisms employed by existing reputation systems. Finally, we analyze several landmark systems in the peer-to-peer domain, characterizing their individual strengths and weaknesses. Our work contributes to understanding (1) which design components of reputation systems are most vulnerable, (2) what are the most appropriate defense mechanisms and (3) how these defense mechanisms can be integrated into existing or future reputation systems to make them resilient to attacks.", "paper_title": "A Survey of Attack and Defense Techniques for Reputation Systems", "paper_id": "WOS:000273219500001"}