{"auto_keywords": [{"score": 0.041212910961789084, "phrase": "information_services"}, {"score": 0.00481495049065317, "phrase": "information_providers"}, {"score": 0.004750178261675602, "phrase": "purpose_-_citizens_advice_bureau"}, {"score": 0.00468627674660237, "phrase": "hebrew"}, {"score": 0.004592016716046632, "phrase": "referral_service"}, {"score": 0.004439097815805505, "phrase": "easy_access"}, {"score": 0.0043793594257092805, "phrase": "citizenship_rights"}, {"score": 0.004233492114255375, "phrase": "shil"}, {"score": 0.003956113993518042, "phrase": "shil_volunteers"}, {"score": 0.003837273003552065, "phrase": "theoretical_foundations"}, {"score": 0.003671865026158296, "phrase": "everyday_life_problems"}, {"score": 0.003647067922514714, "phrase": "foster"}, {"score": 0.0035135796774865696, "phrase": "bates"}, {"score": 0.00338493754743055, "phrase": "qualitative_method"}, {"score": 0.003305540152273746, "phrase": "different_shil_branches"}, {"score": 0.0030163012350270025, "phrase": "findings_-_findings"}, {"score": 0.0029657283589953148, "phrase": "sur"}, {"score": 0.0025028412246758994, "phrase": "different_aspects"}, {"score": 0.00237861522566195, "phrase": "organizational_and_administrative_aspects"}, {"score": 0.0023625233416109917, "phrase": "shil."}, {"score": 0.0021049977753042253, "phrase": "great_importance"}], "paper_keywords": ["Information seeking", " Volunteering", " Information referral services", " Information source selection", " Information retrieval", " Information services"], "paper_abstract": "Purpose - Citizens Advice Bureau (SHIL in Hebrew) is an information and referral service dedicated to serving the needs of citizens by providing easy access to information about citizenship rights and obligations. Many people turn to the offices of SHIL either for help or to volunteer as advisors. This study seeks to examine the information seeking behavior of SHIL volunteers supplying information services to citizens. Design/methodology/approach - The theoretical foundations of the study are based on two existing models of information searching related to everyday life problems, Foster's non-linear model of information seeking behavior and Bates's berry-picking approach. This research employs a qualitative method. A total of 35 advisors in different SHIL branches were interviewed and the content of the interviews was analyzed, mapped and organized into categories by using concepts and terms revealed in the data. Findings - Findings show that volunteers at SUR, search information in a way that integrates the two models mentioned above, the berry-picking model and the non-linear model. In addition, findings point to difficulties that the advisors face in solving problems of the clients. These difficulties are connected with the different aspects relating to the flow of information both within and outside the organization and with organizational and administrative aspects at SHIL. Originality/value - The information seeking behavior of volunteers acting as providers of information services has yet to be investigated at length and the understanding of their information behavior can be of value, since volunteering carries great importance in a democracy.", "paper_title": "Volunteers acting as information providers to citizens", "paper_id": "WOS:000306536300006"}