{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "spatio-temporal_access_control"}, {"score": 0.004676895436217523, "phrase": "mobile_application_technology"}, {"score": 0.004412494693940597, "phrase": "commercial_and_public_sectors"}, {"score": 0.004236321075918639, "phrase": "spatio-temporal_information"}, {"score": 0.004162978902905443, "phrase": "better_services"}, {"score": 0.003557283483525861, "phrase": "spatio-temporal_access_control_models"}, {"score": 0.003093054709625219, "phrase": "practical_framework"}, {"score": 0.0029867619862229853, "phrase": "spatio-temporal_policies"}, {"score": 0.002850682396853918, "phrase": "practical_viability"}, {"score": 0.002817639725689939, "phrase": "spatio-temporal_authorization_models"}, {"score": 0.002720785798036066, "phrase": "possible_solutions"}, {"score": 0.0021672995161145276, "phrase": "alloy_constraint_solver"}], "paper_keywords": ["Spatio-temporal access control", " Policy enforcement"], "paper_abstract": "Mobile application technology is quickly evolving and being progressively utilized in the commercial and public sectors. Such applications make use of spatio-temporal information to provide better services and functionalities. Authorization to such services often depends on the credentials of the user and also on the location and time. Although researchers have proposed spatio-temporal access control models for such applications, not much has been done with respect to enforcement of spatio-temporal access control. Towards this end, we provide a practical framework that allows one to enforce spatio-temporal policies in mobile applications. Our policy enforcement mechanism illustrates the practical viability of spatio-temporal authorization models and discusses potential challenges with possible solutions. Specifically, we propose an architecture for enforcing spatio-temporal access control and demonstrate its feasibility by developing a prototype. We also provide a number of protocols for granting and revoking access and formally analyze these protocols using the Alloy constraint solver to provide assurance that our proposed approach is indeed secure.", "paper_title": "Enforcing spatio-temporal access control in mobile applications", "paper_id": "WOS:000333023600005"}