{"auto_keywords": [{"score": 0.047299230081432365, "phrase": "youth_programme"}, {"score": 0.04685104062438759, "phrase": "madrid"}, {"score": 0.00481495049065317, "phrase": "musical_performances"}, {"score": 0.004294052530714228, "phrase": "young_audiences'_experiences"}, {"score": 0.0040854526743211396, "phrase": "primary_and_secondary_students"}, {"score": 0.0038676325043529524, "phrase": "classical_music"}, {"score": 0.003829290275367182, "phrase": "dance_performances"}, {"score": 0.003264872488939969, "phrase": "meaning_construction"}, {"score": 0.0031845067058084583, "phrase": "different_types"}, {"score": 0.0030600032877646263, "phrase": "research_design"}, {"score": 0.002955050521440921, "phrase": "follow-up_lessons"}, {"score": 0.0028966970007550798, "phrase": "individual_open-ended_interviews"}, {"score": 0.0028394925080958205, "phrase": "group_interviews"}, {"score": 0.0027834145465170292, "phrase": "teachers'_perspectives"}, {"score": 0.0026745503978347143, "phrase": "audience_members"}, {"score": 0.0025571463140118805, "phrase": "students'_learning"}, {"score": 0.0025317627242523104, "phrase": "students'_perspectives"}, {"score": 0.002408565679880478, "phrase": "social_expectations"}, {"score": 0.002268598551466928, "phrase": "young_people's_expectations"}], "paper_keywords": [""], "paper_abstract": "In order to understand the characteristics of young audiences' experiences, a study was carried out that focused on primary and secondary students who attended a youth programme in Madrid that provided opera, classical music and dance performances. The study did not investigate its artistic or instructional features. Instead, it aimed at comprehending the meanings attributed by children and adolescents to all the aspects of the performances; on what influenced that meaning construction; and on the different types of learning that took place. The research design included the observation of performances and follow-up lessons in schools, individual open-ended interviews with teachers and group interviews with students. Teachers' perspectives were analysed in relation to their previous experiences as audience members, to their pedagogical approaches, and to their expectations about students' learning. Students' perspectives were analysed in relation to school, family and social expectations, and in relation with their own experience. The findings suggest that young people's expectations were influenced by their social context but could vary after attending the performances, depending on their teachers' pedagogical approaches, which were crucial in the meaning attributed to the experience.", "paper_title": "Attending Musical Performances: Teachers' and Students' Expectations and Experiences at a Youth Programme in Madrid", "paper_id": "WOS:000280284100005"}