{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "different_types"}, {"score": 0.004471530397729526, "phrase": "purposive_review"}, {"score": 0.003738973626996355, "phrase": "distinct_criteria"}, {"score": 0.0034720284451902083, "phrase": "disciplinary_narratives"}, {"score": 0.0030686679245324837, "phrase": "considerable_ambiguity"}, {"score": 0.002867098884583832, "phrase": "particular_concern"}, {"score": 0.002814454488050123, "phrase": "heightened_assessment_culture"}, {"score": 0.0026953359825383646, "phrase": "resource_allocation"}, {"score": 0.002518227743688769, "phrase": "interdisciplinary_endeavors"}, {"score": 0.0024116163689723354, "phrase": "varied_nature"}, {"score": 0.0021049977753042253, "phrase": "science_policy_makers"}], "paper_keywords": ["Publishing", " Epistemology", " Documentation"], "paper_abstract": "Purpose - The purpose of this paper is to identify criteria for and definitions of disciplinarity, and how they differ between different types of literature. Design/methodology/approach - This synthesis is achieved through a purposive review of three types of literature: explicit conceptualizations of disciplinarity; narrative histories of disciplines; and operationalizations of disciplinarity. Findings - Each angle of discussing disciplinarity presents distinct criteria. However, there are a few common axes upon which conceptualizations, disciplinary narratives, and measurements revolve: communication, social features, topical coherence, and institutions. Originality/value - There is considerable ambiguity in the concept of a discipline. This is of particular concern in a heightened assessment culture, where decisions about funding and resource allocation are often discipline-dependent (or focussed exclusively on interdisciplinary endeavors). This work explores the varied nature of disciplinarity and, through synthesis of the literature, presents a framework of criteria that can be used to guide science policy makers, scientometricians, administrators, and others interested in defining, constructing, and evaluating disciplines.", "paper_title": "The kaleidoscope of disciplinarity", "paper_id": "WOS:000359056200009"}