{"auto_keywords": [{"score": 0.044222651518052894, "phrase": "css"}, {"score": 0.009800039987626064, "phrase": "physician_narratives"}, {"score": 0.008651271282531311, "phrase": "manual_chart_review"}, {"score": 0.007124245831735181, "phrase": "ae"}, {"score": 0.005359621499430011, "phrase": "mcr"}, {"score": 0.00481495049065317, "phrase": "computerized_surveillance"}, {"score": 0.004745965928357563, "phrase": "adverse_events"}, {"score": 0.0045612889352793584, "phrase": "different_adverse_event"}, {"score": 0.004447509888681154, "phrase": "inpatient_adverse_drug_events"}, {"score": 0.004367973309172735, "phrase": "hospital-associated_infections"}, {"score": 0.003726398477619122, "phrase": "results_css"}, {"score": 0.0035426543993952184, "phrase": "similar_number"}, {"score": 0.003065938050346064, "phrase": "coded_format"}, {"score": 0.0028418430688995247, "phrase": "discharge_summaries"}, {"score": 0.0027608464122374924, "phrase": "aes"}, {"score": 0.0027113815712365924, "phrase": "physician_narrative"}, {"score": 0.002672454243212711, "phrase": "emergency_department_reports"}, {"score": 0.002634084319025334, "phrase": "general_consult_notes"}, {"score": 0.002406415352892016, "phrase": "css_false_positives"}, {"score": 0.0022711207841260767, "phrase": "css._conclusion"}, {"score": 0.002238500096284007, "phrase": "information_source"}, {"score": 0.0022143417457627006, "phrase": "different_surveillance_methods"}, {"score": 0.0021049977753042253, "phrase": "natural_language_processing"}], "paper_keywords": [""], "paper_abstract": "Objective To understand how the source of information affects different adverse event (AE) surveillance methods. Design Retrospective analysis of inpatient adverse drug events (ADEs) and hospital-associated infections (HAIs) detected by either a computerized surveillance system (CSS) or manual chart review (MCR). Measurement Descriptive analysis of events detected using the two methods by type of AE, type of information about the AE, and sources of the information. Results CSS detected more HAIs than MCR (92% vs 34%); however, a similar number of ADEs was detected by both systems (52% vs 51%). The agreement between systems was greater for HAIs than ADEs (26% vs 3%). The CSS missed events that did not have information in coded format or that were described only in physician narratives. The MCR detected events missed by CSS using information in physician narratives. Discharge summaries were more likely to contain information about AEs than any other type of physician narrative, followed by emergency department reports for HAIs and general consult notes for ADEs. Some ADEs found by MCR were detected by CSS but not verified by a clinician. Limitations Inability to distinguish between CSS false positives and suspected AEs for cases in which the clinician did not document their assessment in the CSS. Conclusion The effect that information source has on different surveillance methods depends on the type of AE. Integrating information from physician narratives with CSS using natural language processing would improve the detection of ADEs more than HAIs.", "paper_title": "Comparison of computerized surveillance and manual chart review for adverse events", "paper_id": "WOS:000292061700022"}