{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "management_practices"}, {"score": 0.04960770684597511, "phrase": "retail_performance"}, {"score": 0.03819434349215999, "phrase": "simulation_models"}, {"score": 0.028626573660621945, "phrase": "different_levels"}, {"score": 0.004404658750724105, "phrase": "low_levels"}, {"score": 0.00419195822011581, "phrase": "real_life"}, {"score": 0.004150661689086371, "phrase": "retail_operations"}, {"score": 0.003853583126988071, "phrase": "discrete-event_and_agent-based_modelling_and_simulation_approaches"}, {"score": 0.0034047882921717913, "phrase": "new_research_question"}, {"score": 0.00320826350799124, "phrase": "real_world"}, {"score": 0.0025924443774713473, "phrase": "appropriate_level"}, {"score": 0.0025289662786567896, "phrase": "particular_case_study"}, {"score": 0.002223039450439376, "phrase": "retail_branch_simulation_model"}, {"score": 0.002168586864007222, "phrase": "model_accuracy"}, {"score": 0.002147180332779021, "phrase": "meaningful_results"}], "paper_keywords": ["discrete-event simulation", " agent-based simulation", " retail productivity", " management practices", " shopping behaviour", " customer satisfaction"], "paper_abstract": "Models to understand the impact of management practices on retail performance are often simplistic and assume low levels of noise and linearity. Of course, in real life, retail operations are dynamic, nonlinear and complex. To overcome these limitations, we investigate discrete-event and agent-based modelling and simulation approaches. The joint application of both approaches allows us to develop simulation models that are heterogeneous and more life-like, though poses a new research question: When developing such simulation models one still has to abstract from the real world, however, ideally in such a way that the 'essence' of the system is still captured. The question is how much detail is needed to capture this essence, as simulation models can be developed at different levels of abstraction. In the literature the appropriate level of abstraction for a particular case study is often more of an art than a science. In this paper, we aim to study this question more systematically by using a retail branch simulation model to investigate which level of model accuracy obtains meaningful results for practitioners. Our results show the effects of adding different levels of detail and we conclude that this type of study is very valuable to gain insight into what is really important in a model.", "paper_title": "Towards the development of a simulator for investigating the impact of people management practices on retail performance", "paper_id": "WOS:000208736600001"}