{"auto_keywords": [{"score": 0.04373688068808024, "phrase": "cognitive_characteristics"}, {"score": 0.009634470880833938, "phrase": "intensive_tasks"}, {"score": 0.009301446982527313, "phrase": "successful_task_fulfillment"}, {"score": 0.00855552936301259, "phrase": "cognitive_load"}, {"score": 0.006626309825079498, "phrase": "matchmaking_framework"}, {"score": 0.0065681238646004255, "phrase": "conceptual_models"}, {"score": 0.00481495049065317, "phrase": "cognitive_and_qualitative_matchmaking"}, {"score": 0.0046477357199085035, "phrase": "successful_task_performance"}, {"score": 0.0040347380310668994, "phrase": "organizational_developments"}, {"score": 0.0039815737219022675, "phrase": "growing_complexity"}, {"score": 0.003929107176349023, "phrase": "customer_orientation"}, {"score": 0.003775803846431323, "phrase": "quality_requirements"}, {"score": 0.0033955105098235345, "phrase": "supply_quality_factors"}, {"score": 0.0027700855441353165, "phrase": "quality_factors"}, {"score": 0.002615156460073562, "phrase": "task_fulfillment"}, {"score": 0.002512990657100351, "phrase": "dynamic_models"}, {"score": 0.0021809311689473493, "phrase": "key_concepts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Cognitive characteristics", " Knowledge intensive tasks", " Matchmaking", " Object-Role Modeling", " System dynamics", " Quality factors"], "paper_abstract": "Two main ingredients related to successful task performance are cognition and quality. Supply and demand of these concepts for knowledge intensive tasks are studied in this paper to fuel successful task fulfillment. Cognitive characteristics are supplied by actors performing tasks. Organizational developments such as growing complexity and increasing customer orientation may increase cognitive load. Stakeholders of tasks have quality requirements. These requirements may be affected if actors experience an increase in cognitive load. It is observed that knowledge intensive tasks demand cognitive characteristics and supply quality factors. Actors supply cognition and stakeholders demand quality. The gap between supply and demand can be bridged by introducing several models. These models consist of a matchmaking framework, conceptual models, and dynamic models. The matchmaking framework shows how supply and demand of cognitive characteristics or quality factors can be matched. Relations and roles of the concepts involved in task fulfillment are mapped out by the conceptual models. The dynamic models show causes that have effects on the supply of cognitive characteristics and the level of quality. These insights in the relations and dependencies between cognition and quality increase our understanding of the key concepts for successful task fulfillment. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Statics and dynamics of cognitive and qualitative matchmaking in task fulfillment", "paper_id": "WOS:000284511100009"}