{"auto_keywords": [{"score": 0.04733190377720631, "phrase": "australian_law_schools"}, {"score": 0.03947447987613364, "phrase": "top_law_journals"}, {"score": 0.012811375745116083, "phrase": "research_productivity"}, {"score": 0.010683199024748, "phrase": "academic_rank"}, {"score": 0.004647442352794694, "phrase": "junior_academics"}, {"score": 0.004329630571352367, "phrase": "academic_seniority"}, {"score": 0.003378385493203297, "phrase": "particular_attention"}, {"score": 0.003091767402370757, "phrase": "novel_identification_strategy"}, {"score": 0.002897109710213723, "phrase": "heteroscedastic_covariance_restriction"}, {"score": 0.0028293966058473476, "phrase": "internal_instrumental_variable"}, {"score": 0.002259883463607508, "phrase": "greater_impact"}, {"score": 0.002130056082139311, "phrase": "total_citations"}, {"score": 0.0021049977753042253, "phrase": "common_citation_indices"}], "paper_keywords": ["Academic rank", " Research productivity", " Australia", " Law"], "paper_abstract": "This study examines the relationship between academic seniority and research productivity through a study of a sample of academics at Australian law schools. To measure research productivity, we use both publications in top law journals, variously defined, and citation metrics. A feature of the study is that we pay particular attention to addressing the endogeneity of academic rank. To do so, we use a novel identification strategy, proposed by Lewbel (Journal of Business and Economic Statistics 30:67-80, 2012), which utilises a heteroscedastic covariance restriction to construct an internal instrumental variable. Our main finding is that once endogeneity of academic rank is addressed, more senior academics at Australian law schools do not publish more articles in top law journals (irrespective of how top law journals are defined) than their less senior colleagues. However, Professors continue to have greater impact than Lecturers when research productivity is measured in terms of total citations and common citation indices, such as the h-index and g-index.", "paper_title": "Are more senior academics really more research productive than junior academics? Evidence from Australian law schools", "paper_id": "WOS:000321852600002"}