{"auto_keywords": [{"score": 0.03466574457254795, "phrase": "day-night_cycles"}, {"score": 0.00481495049065317, "phrase": "uneven_cycles"}, {"score": 0.004765482708043842, "phrase": "real_world_events"}, {"score": 0.004620093797504386, "phrase": "fundamental_to_human_language_and_embodied_cognition"}, {"score": 0.003956784357357341, "phrase": "spatial_concepts"}, {"score": 0.003855849747095327, "phrase": "temporal_intervals"}, {"score": 0.0037381083634085424, "phrase": "new_aspect"}, {"score": 0.003168079471049896, "phrase": "specific_time_points"}, {"score": 0.002931569771634119, "phrase": "diurnal_cycle"}, {"score": 0.0028715299874549245, "phrase": "light_levels"}, {"score": 0.0028127163745564777, "phrase": "event-based_time"}, {"score": 0.0022515427907343092, "phrase": "specific_clock_times"}, {"score": 0.002126907587540404, "phrase": "novel_aspect"}, {"score": 0.0021049977753042253, "phrase": "cyclic_time"}], "paper_keywords": ["Cognitive maps", " evolution of language", " Lingodroids", " robots", " temporal concepts"], "paper_abstract": "Time and space are fundamental to human language and embodied cognition. In our early work we investigated how Lingodroids, robots with the ability to build their own maps, could evolve their own geopersonal spatial language. In subsequent studies we extended the framework developed for learning spatial concepts and words to learning temporal intervals. This paper considers a new aspect of time, the naming of concepts like morning, afternoon, dawn, and dusk, which are events that are part of day-night cycles, but are not defined by specific time points on a clock. Grounding of such terms refers to events and features of the diurnal cycle, such as light levels. We studied event-based time in which robots experienced day-night cycles that varied with the seasons throughout a year. Then we used meet-at tasks to demonstrate that the words learned were grounded, where the times to meet were morning and afternoon, rather than specific clock times. The studies show how words and concepts for a novel aspect of cyclic time can be grounded through experience with events rather than by times as measured by clocks or calendars.", "paper_title": "Long Summer Days: Grounded Learning of Words for the Uneven Cycles of Real World Events", "paper_id": "WOS:000308962100003"}