{"auto_keywords": [{"score": 0.048013867577183116, "phrase": "deverbal_nominalizations"}, {"score": 0.0100468628955595, "phrase": "spanish"}, {"score": 0.009615851508821358, "phrase": "denotative_distinction"}, {"score": 0.00481495072903252, "phrase": "nominalizations"}, {"score": 0.004265354774450696, "phrase": "result_nominalizations"}, {"score": 0.003675517796014622, "phrase": "automatic_classification_system"}, {"score": 0.003440166097491567, "phrase": "theoretical_hypotheses"}, {"score": 0.0033651019362620866, "phrase": "semantic_distinction"}, {"score": 0.0031845067058084583, "phrase": "machine_learning_techniques"}, {"score": 0.0029805015010906013, "phrase": "first_tool"}, {"score": 0.002286781334850213, "phrase": "different_models"}, {"score": 0.0022492129111567824, "phrase": "different_realistic_scenarios"}, {"score": 0.002200077887697072, "phrase": "knowledge_resources"}, {"score": 0.002175913488493802, "phrase": "natural_language_processors"}, {"score": 0.0021049977753042253, "phrase": "good_results"}], "paper_keywords": [""], "paper_abstract": "This article deals with deverbal nominalizations in Spanish; concretely, we focus on the denotative distinction between event and result nominalizations. The goals of this work is twofold: first, to detect the most relevant features for this denotative distinction; and, second, to build an automatic classification system of deverbal nominalizations according to their denotation. We have based our study on theoretical hypotheses dealing with this semantic distinction and we have analyzed them empirically by means of Machine Learning techniques which are the basis of the ADN-Classifier. This is the first tool that aims to automatically classify deverbal nominalizations in event, result, or underspecified denotation types in Spanish. The ADN-Classifier has helped us to quantitatively evaluate the validity of our claims regarding deverbal nominalizations. We set up a series of experiments in order to test the ADN-Classifier with different models and in different realistic scenarios depending on the knowledge resources and natural language processors available. The ADN-Classifier achieved good results (87.20% accuracy).", "paper_title": "Empirical Methods for the Study of Denotation in Nominalizations in Spanish", "paper_id": "WOS:000311172500005"}