{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "continuing_value_model"}, {"score": 0.04968898347890439, "phrase": "small_and_medium-sized_spanish_enterprises"}, {"score": 0.038948090958912586, "phrase": "jennergren_model"}, {"score": 0.034449797995279155, "phrase": "productive_assets"}, {"score": 0.004546970518808189, "phrase": "discounted_cash-flow_method"}, {"score": 0.0044549056501745074, "phrase": "residual_value"}, {"score": 0.004418601451254075, "phrase": "continuing_value"}, {"score": 0.004346874334971379, "phrase": "significant_percentage"}, {"score": 0.004293840838533456, "phrase": "enterprise's_value"}, {"score": 0.004138575034269399, "phrase": "time_horizon"}, {"score": 0.004054745478848129, "phrase": "jennergren"}, {"score": 0.003751331782523201, "phrase": "gordon_model"}, {"score": 0.0028744731986533076, "phrase": "spanish_ncae_classification"}, {"score": 0.0028510114763213596, "phrase": "national_classification_of_economic_activities"}, {"score": 0.0025628355581338563, "phrase": "useful_lives"}, {"score": 0.0025211567863488962, "phrase": "spanish_corporation_tax_law_amortisation_and_depreciation_tables"}, {"score": 0.002220257443705344, "phrase": "accelerated_depreciation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Enterprise valuation", " Continuing value", " Discounted cash-flows"], "paper_abstract": "By far, the most widely used enterprise valuation method in business practice is the discounted cash-flow method. Thus, the residual value or continuing value accounts for a significant percentage of the enterprise's value and will depend on the length of the time horizon. In 2006, Jennergren developed a continuing value model based on one of the methods most commonly used for calculating this value, the Gordon model. The Jennergren model extends the analysis of this model and aims to have it implemented more strictly, taking into account two main parameters, capital expenditures and tax savings due to the depreciation of productive assets. In this study the Jennergren model has been applied to small and medium-sized Spanish enterprises with turnover ranging from 2 to 50 million euros over the period 2005-2008. These enterprises have also been differentiated by industry, using the Spanish NCAE classification (National Classification of Economic Activities). The information used was taken from the SABI (Iberian Balance Sheet Analysis System) database. The resulting economic lives of the productive assets of each industry were compared to the useful lives shown in the Spanish Corporation Tax Law Amortisation and Depreciation tables. It was found that most estimates are within the range established by law. In those cases where this assumption is not met, it is usually due to accelerated depreciation over the limits strictly permitted under law. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Application of the continuing value model to small and medium-sized Spanish enterprises", "paper_id": "WOS:000315863300029"}