{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "knowledge_communities"}, {"score": 0.009024916317812735, "phrase": "successful_knowledge_communities"}, {"score": 0.004720606036240263, "phrase": "group_collaboration"}, {"score": 0.004515004397496303, "phrase": "useful_level"}, {"score": 0.0035600143547053287, "phrase": "formal_organizations"}, {"score": 0.0034386894664467003, "phrase": "aggregate_superior_performance"}, {"score": 0.0034047882921717913, "phrase": "informal_knowledge_communities"}, {"score": 0.003371220210416809, "phrase": "computer_science"}, {"score": 0.002862648127577722, "phrase": "differential_success"}, {"score": 0.0026973310437053573, "phrase": "broad_range"}, {"score": 0.0025289662786567896, "phrase": "marked_contrast"}, {"score": 0.0021365562685368767, "phrase": "better_understanding"}, {"score": 0.0021049977753042253, "phrase": "inter-organizational_collaborative_network_structures"}], "paper_keywords": ["Knowledge communities", " Innovation", " Dynamic clustering"], "paper_abstract": "A useful level of analysis for the study of innovation may be what we call \"knowledge communities''-intellectually cohesive, organic inter-organizational forms. Formal organizations like firms are excellent at promoting cooperation, but knowledge communities are superior at fostering collaboration-the most important process in innovation. Rather than focusing on what encourages performance in formal organizations, we study what characteristics encourage aggregate superior performance in informal knowledge communities in computer science. Specifically, we explore the way knowledge communities both draw on past knowledge, as seen in citations, and use rhetoric, as found in writing, to seek a basis for differential success. We find that when using knowledge successful knowledge communities draw from a broad range of sources and are extremely flexible in changing and adapting. In marked contrast, when using rhetoric successful knowledge communities tend to use very similar vocabularies and language that does not move or adapt over time and is not unique or esoteric compared to the vocabulary of other communities. A better understanding of how inter-organizational collaborative network structures encourage innovation is important to understanding what drives innovation and how to promote it.", "paper_title": "Innovating knowledge communities An analysis of group collaboration and competition in science and technology", "paper_id": "WOS:000276499500016"}