{"auto_keywords": [{"score": 0.050071131531681135, "phrase": "small_sample_size_problem"}, {"score": 0.04029743945712652, "phrase": "lda"}, {"score": 0.015079698986874277, "phrase": "face_recognition"}, {"score": 0.00471503739362446, "phrase": "generalized_discriminant_analysis"}, {"score": 0.00444612502361583, "phrase": "person's_images"}, {"score": 0.004317450843594688, "phrase": "new_image"}, {"score": 0.004174929128880472, "phrase": "correct_cluster"}, {"score": 0.0038711548651825917, "phrase": "linear_discriminant_analysis"}, {"score": 0.003696460568091852, "phrase": "dimension_reduction"}, {"score": 0.003634901808509402, "phrase": "cluster_structure"}, {"score": 0.0034708317974593106, "phrase": "optimization_problem"}, {"score": 0.0034418037573506837, "phrase": "covariance_matrices"}, {"score": 0.0029837589912490026, "phrase": "sample_size"}, {"score": 0.002511522462767081, "phrase": "generalized_singular_value_decomposition"}, {"score": 0.002438699976481979, "phrase": "nonsingularity_requirement"}, {"score": 0.0023481578019624843, "phrase": "recognition_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["face recognition", " linear discriminant analysis", " generalized singular value decomposition", " dimension reduction", " classification"], "paper_abstract": "The goal of face recognition is to distinguish persons via their facial images. Each person's images form a cluster, and a new image is recognized by assigning it to the correct cluster. Since the images are very high-dimensional, it is necessary to reduce their dimension. Linear discriminant analysis (LDA) has been shown to be effective at dimension reduction while preserving the cluster structure of the data. It is classically defined as an optimization problem involving covariance matrices that represent the scatter within and between clusters. The requirement that one of these matrices be nonsingular restricts its application to datasets in which the dimension of the data does not exceed the sample size. For face recognition, however, the dimension typically exceeds the number of images in the database, resulting in what is referred to as the small sample size problem. Recently, the applicability of LDA has been extended by using the generalized singular value decomposition (GSVD) to circumvent the nonsingularity requirement, thus making LDA directly applicable to face recognition data. Our experiments confirm that LDA/GSVD solves the small sample size problem very effectively as compared with other current methods. (c) 2005 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Solving the small sample size problem in face recognition using generalized discriminant analysis", "paper_id": "WOS:000233604000011"}