{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "ict-based_learning_technologies"}, {"score": 0.04872396874382181, "phrase": "first_systematic_approach"}, {"score": 0.03742492801557293, "phrase": "evaluation_framework"}, {"score": 0.004619356874848538, "phrase": "inclusive_ict-based_learning_technologies"}, {"score": 0.004361526027730043, "phrase": "companion_paper"}, {"score": 0.004278807087784626, "phrase": "evaluation_approach"}, {"score": 0.004118026552723285, "phrase": "existing_technologies"}, {"score": 0.004052823656906696, "phrase": "disabled_learners"}, {"score": 0.003925486550801027, "phrase": "technology_provision"}, {"score": 0.003826492478418294, "phrase": "technology_use"}, {"score": 0.003802135020791801, "phrase": "user_outcomes"}, {"score": 0.003670904035061963, "phrase": "increasing_participation"}, {"score": 0.003589753165698119, "phrase": "desired_learning_outcomes"}, {"score": 0.0026414854705971553, "phrase": "network_project"}, {"score": 0.0026079240853929555, "phrase": "multistage_process"}, {"score": 0.002517848060827062, "phrase": "ict"}, {"score": 0.002438581238635582, "phrase": "resulting_framework"}, {"score": 0.0023694065215394593, "phrase": "first_time"}, {"score": 0.002354302193867031, "phrase": "clear_evaluation_framework"}, {"score": 0.0022875127203850027, "phrase": "existing_ict-based_learning_technologies"}, {"score": 0.0021664698544866753, "phrase": "design_and_development_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Evaluation methodologies", " Lifelong learning", " Disability studies", " Cross-cultural projects"], "paper_abstract": "This paper presents the first systematic approach to evaluation of inclusive ICT-based learning technologies and ICT-based learning technologies for disabled people. The first systematic approach to classification of these technologies is presented in a companion paper. The aims of the evaluation approach can be summarised as follows. 1. Evaluating various features of existing technologies from the perspectives of disabled learners and other stakeholders, comparing technologies and identifying gaps in technology provision. 2. Evaluating the impact of technology use on user outcomes, including barriers to learning, selfconfidence, motivation, increasing participation in learning activities and achievement of desired learning outcomes. The evaluation framework comprises three main components: 1. Aims which specify the purpose(s) of the evaluation or what it is intended to achieve. 2. Principles which provide a framework and context in which the evaluation should be carried out and, in particular, specify the constraints, rules and factors to be taken into account. 3. Methodologies which specify the approaches used to carry out the evaluation taking account of the principles in order to achieve the aims. Development of the evaluation framework took place as part of a network project and involved a multistage process, including cycles of discussion, comment and validation using ICT based learning technologies used in the 16 partner countries. The resulting framework has several important applications in terms of establishing for the first time a clear evaluation framework which can be used to discuss and evaluate existing ICT-based learning technologies for disabled people, identify gaps in provision or the need for modifications and support the design and development process for new technologies. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluation framework for ICT-based learning technologies for disabled people", "paper_id": "WOS:000341675100004"}