{"auto_keywords": [{"score": 0.027978270756557195, "phrase": "pmm_based_estimates"}, {"score": 0.00481495049065317, "phrase": "set-up_time_models"}, {"score": 0.004729475149001848, "phrase": "model_based_estimates"}, {"score": 0.004708343335530363, "phrase": "set-up_time"}, {"score": 0.004676821688240648, "phrase": "general_setting"}, {"score": 0.004412285905508977, "phrase": "total_time"}, {"score": 0.004256954849375382, "phrase": "orderly_fashion"}, {"score": 0.003909522412849035, "phrase": "required_time"}, {"score": 0.0036635094136329167, "phrase": "qualitative_understanding"}, {"score": 0.003487222504700868, "phrase": "set-up_time_estimate"}, {"score": 0.00345609074800888, "phrase": "input_data"}, {"score": 0.0032971365838445005, "phrase": "higher_estimates"}, {"score": 0.0032750316642798654, "phrase": "second_model"}, {"score": 0.003238517900104576, "phrase": "approximation_guarantees"}, {"score": 0.003180938052232752, "phrase": "worst_possible_time"}, {"score": 0.0031313934668702305, "phrase": "different_models"}, {"score": 0.0030482430937467013, "phrase": "popular_models"}, {"score": 0.0030210183919894998, "phrase": "partial_markov_model"}, {"score": 0.002888488567436329, "phrase": "reasonable_system"}, {"score": 0.0028180886703743, "phrase": "irm"}, {"score": 0.0027741761880779535, "phrase": "worst_case_estimate"}, {"score": 0.002688395038874601, "phrase": "actual_set-up_time"}, {"score": 0.002541741549046619, "phrase": "special_metrics"}, {"score": 0.0025021277555259715, "phrase": "disk_drives"}, {"score": 0.0024466025982664776, "phrase": "finite_metric_spaces"}, {"score": 0.0024030688146716938, "phrase": "independent_interest"}, {"score": 0.0023339685523621903, "phrase": "j.b._kelly_u.b._kelly"}, {"score": 0.0023235154832953885, "phrase": "hypermetric"}, {"score": 0.002282166507956957, "phrase": "o._shisha"}, {"score": 0.0021479597698614373, "phrase": "concave_functions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["performance analysis", " metric spaces", " storage systems"], "paper_abstract": "We consider model based estimates for set-up time. The general setting we are interested in is the following: given a disk and a sequence of read/write requests to certain locations. we would like to know the total time of transitions (set-up time) when these requests arc served in an orderly fashion. The problem becomes nontrivial when we have, as is typically the case, only the counts of requests to each location rather then the whole input, and WE can only hope to estimate the required time. Models that estimate set-up time have beer suggested and heavily used as far back as the sixties. However, not much theory exists to enable a qualitative understanding of such models. To this end we introduce several properties such as (i) super-additivity which means that the set-up time estimate decreased as the input data is refined (ii) monotonicity which means that more activity produces more set-up time, (iii) Dominance which means that one model always produces higher estimates than a second model and (iv) approximation guarantees for the estimate with respect to the worst possible time, by which we can study different models. We provide criteria for super-additivity and monotonicity to hold for popular models such as the Partial Markov model (PMM). The criteria show that the estimate produced by these models will be monotone for any reasonable system. We also show that the independent reference model (IRM) based estimate functions as a worst case estimate if the sense that the estimate is guaranteed to be at least half of the actual set-up time. We also show that it dominates the PMM based estimates. Using our criteria we prove that PMM based estimates are always super additive when applied to the special metrics that correspond to seek times of disk drives. To establish our theoretical results we use the theory of finite metric spaces, and enroute show a result of independent interest in that theory, which is a strengthening of a theorem of J.B. Kelly U.B. Kelly, Hypermetric spaces and metric transforms, in: O. Shisha (Ed.), Inequalities [11, 1972, pp. 149-158] about the properties of metrics that are formed by concave functions on the line. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Analysis of set-up time models: A metric perspective", "paper_id": "WOS:000258203300016"}