{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_pattern_recognition"}, {"score": 0.049751826735385404, "phrase": "abnormal_eye_movements"}, {"score": 0.032159686603040416, "phrase": "proposed_method"}, {"score": 0.004126434472502474, "phrase": "good_diagnosis"}, {"score": 0.004000978459274141, "phrase": "abnormal_eye_movement"}, {"score": 0.003572621286677047, "phrase": "pattern_recognition"}, {"score": 0.00349979888845939, "phrase": "better_diagnosis"}, {"score": 0.0033933295645859015, "phrase": "real_data"}, {"score": 0.0031790442889277864, "phrase": "new_method"}, {"score": 0.0030090929255598485, "phrase": "previous_works"}, {"score": 0.0026138115448726567, "phrase": "multi-output_system"}, {"score": 0.0025342267883803255, "phrase": "single-output_systems"}, {"score": 0.002482517733720377, "phrase": "different_parameters"}, {"score": 0.0024152058731908544, "phrase": "intelligent_algorithm"}, {"score": 0.002309685725922145, "phrase": "adaline_network"}, {"score": 0.002262547875929931, "phrase": "multilayer_neural_network"}, {"score": 0.0022394779739807204, "phrase": "nn"}, {"score": 0.002208765537836048, "phrase": "sugeno_fuzzy_inference_system"}, {"score": 0.002186112321301671, "phrase": "sf."}, {"score": 0.002163682878218085, "phrase": "comparison_results"}, {"score": 0.0021049977753042253, "phrase": "intelligent_algorithms"}], "paper_keywords": ["Neural networks", " Fuzzy systems", " Pattern recognition", " Eye movements"], "paper_abstract": "A doctor could say that a patient is sick while he/she is healthy or could say that the patient is healthy while he/she is sick, by mistake. So it is important to generate a system that can give a good diagnosis, in this case for abnormal eye movements. An abnormal eye movement is when the patient wants to move the eye to up or down and the eye does not move or the eye moves to other place. In this paper, a method for the pattern recognition is used to provide a better diagnosis for patients related with the abnormal eye movements. The real data of signals of two eye movements (up and down) of patients are obtained using a mindset ms-100 system. A new method that uses one intelligent algorithm for online pattern recognition is proposed. The difference between the proposed method and the previous works is that, in other works, both behaviors (up and down) are trained with one intelligent algorithm, while in this work, up behavior is trained with one intelligent algorithm and down behavior is trained with other intelligent algorithm; it is because the multi-output system can always be decomposed into a collection of single-output systems with the advantage to use different parameters for each one if necessary. The intelligent algorithm used by the proposed method could be any of the following: the adaline network denoted as AN, the multilayer neural network denoted as NN, or the Sugeno fuzzy inference system denoted as SF. So the comparison results of the proposed method using each of the intelligent algorithms for online pattern recognition of two eye movements are presented.", "paper_title": "A method for online pattern recognition of abnormal eye movements", "paper_id": "WOS:000314844300019"}