{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "transitive_closure"}, {"score": 0.047430118218564125, "phrase": "expressive_power"}, {"score": 0.0154278230191577, "phrase": "navigational_query_languages"}, {"score": 0.015312565222620566, "phrase": "unlabeled_graphs"}, {"score": 0.014420520533256662, "phrase": "binary_relations"}, {"score": 0.012691532637949473, "phrase": "diversity_relation"}, {"score": 0.011860733890097784, "phrase": "path_queries"}, {"score": 0.004232702713825967, "phrase": "identity_relation"}, {"score": 0.004200724305692705, "phrase": "richer_languages"}, {"score": 0.0030196821790309165, "phrase": "boolean_queries"}, {"score": 0.002940487679224863, "phrase": "multiple_input_relations"}, {"score": 0.002497470177389344, "phrase": "basic_language"}, {"score": 0.0022972306948217548, "phrase": "limited_expressive_power"}, {"score": 0.0022284577808744316, "phrase": "earlier_work"}, {"score": 0.0021049977753042253, "phrase": "complete_understanding"}], "paper_keywords": ["Boolean query", " Transitive closure", " Relation algebra", " Unlabeled graph", " Expressiveness"], "paper_abstract": "Several established and novel applications motivate us to study the expressive power of navigational query languages on graphs, which represent binary relations. Our basic language has only the operators union and composition, together with the identity relation. Richer languages can be obtained by adding other features such as intersection, difference, projection and coprojection, converse, and the diversity relation. The expressive power of the languages thus obtained cannot only be evaluated at the level of path queries (queries returning binary relations), but also at the level of Boolean or yes/no queries (expressed by the nonemptiness of an expression). For the languages considered above, adding transitive closure augments the expressive power not only at the level of path queries but also at the level of Boolean queries, for the latter provided that multiple input relations are allowed. This is no longer true in the context of unlabeled graphs (i.e., in the case where there is only one input relation), however. In this paper, we prove that this is indeed not the case for the basic language to which none, one, or both of projection and the diversity relation are added, a surprising result given the limited expressive power of these languages. In combination with earlier work (Fletcher et al. 2011, 2012), this result yields a complete understanding of the impact of transitive closure on the languages under consideration.", "paper_title": "The impact of transitive closure on the expressiveness of navigational query languages on unlabeled graphs", "paper_id": "WOS:000347691500007"}