{"auto_keywords": [{"score": 0.04973919369807266, "phrase": "social_media"}, {"score": 0.007152368807539886, "phrase": "social_support"}, {"score": 0.006952034426939291, "phrase": "facebook"}, {"score": 0.006805318374431615, "phrase": "youtube"}, {"score": 0.006733139631830709, "phrase": "flickr"}, {"score": 0.006009041027475033, "phrase": "social_media_users"}, {"score": 0.004326987090971404, "phrase": "active_participation"}, {"score": 0.004190438004831167, "phrase": "influential_factors"}, {"score": 0.004145882022189891, "phrase": "dynamic_and_eager_participation"}, {"score": 0.003902165732101058, "phrase": "anonymous_others"}, {"score": 0.0038332390893263844, "phrase": "information-sharing_activities"}, {"score": 0.003569504278913414, "phrase": "twitter"}, {"score": 0.003419943984098415, "phrase": "ten_factors"}, {"score": 0.002965229277927781, "phrase": "major_motivation_theories"}, {"score": 0.002780783274864117, "phrase": "users'_information_sharing"}, {"score": 0.002525347599743456, "phrase": "different_information_content"}, {"score": 0.0024984517279573906, "phrase": "different_purposes"}, {"score": 0.0024281181691350085, "phrase": "social_media_developers"}, {"score": 0.0022770057597574734, "phrase": "appropriate_types"}], "paper_keywords": ["information seeking", " motivation"], "paper_abstract": "The success or failure of social media is highly dependent on the active participation of its users. In order to examine the influential factors that inspire dynamic and eager participation, this study investigates what motivates social media users to share their personal experiences, information, and social support with anonymous others. A variety of information-sharing activities in social media, including creating postings, photos, and videos in 5 different types of social media: Facebook, Twitter, Delicious, YouTube, and Flickr, were observed. Ten factors: enjoyment, self-efficacy, learning, personal gain, altruism, empathy, social engagement, community interest, reciprocity, and reputation, were tested to identify the motivations of social media users based on reviews of major motivation theories and models. Findings from this study indicate that all of the 10 motivations are influential in encouraging users' information sharing to some degree and strongly correlate with one another. At the same time, motivations differ across the 5 types of social media, given that they deliver different information content and serve different purposes. Understanding such differences in motivations could benefit social media developers and those organizations or institutes that would like to use social media to facilitate communication among their community members; appropriate types of social media could be chosen that would fit their own purposes and they could develop strategies that would encourage their members to contribute to their communities through social media.", "paper_title": "Motivations for sharing information and social support in social media: A comparative analysis of Facebook, Twitter, Delicious, YouTube, and Flickr", "paper_id": "WOS:000361184500006"}