{"auto_keywords": [{"score": 0.04961049691122095, "phrase": "topical_terms"}, {"score": 0.03789439700787632, "phrase": "topical_term"}, {"score": 0.035620716932052585, "phrase": "topical_term_description_models"}, {"score": 0.00481495049065317, "phrase": "description_model"}, {"score": 0.004721162131188487, "phrase": "sentiment_classification"}, {"score": 0.004133940019630129, "phrase": "documentary-level_sentiment_classification"}, {"score": 0.0037834649508375544, "phrase": "global_document_classification"}, {"score": 0.002843372121209168, "phrase": "whole_document_classification"}, {"score": 0.0025262061502713683, "phrase": "state-of-art_results"}, {"score": 0.0024891269874339553, "phrase": "publicly_available_movie_review_corpus"}, {"score": 0.0024525907271610104, "phrase": "chinese_digital_product_review_corpus"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sentiment classification", " Topical term", " Topical Term Description Model", " Maximum spanning tree"], "paper_abstract": "Sentiment classification is used to identify whether the opinion expressed in a document is positive or negative. In this paper, we present an approach to do documentary-level sentiment classification by modeling description of topical terms. The motivation of this work stems from the observation that the global document classification will benefit greatly by examining the way of a topical term to give opinion in its local sentence context. Two sentence-level sentiment description models, namely positive and negative Topical Term Description Models, are constructed for each topical term. When analyzing a document, the Topical Term Description Models generate divergence to support the classification of its sentiment at the sentence-level which in turn can be used to decide the whole document classification collectively. The results of the experiments prove that our proposed method is effective. It is also shown that our results are comparable to the state-of-art results on a publicly available movie review corpus and a Chinese digital product review corpus. This is quite encouraging to us and motivates us to have further investigation on the development of a more effective topical term related description model in the future. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Document sentiment classification by exploring description model of topical terms", "paper_id": "WOS:000284670200016"}