{"auto_keywords": [{"score": 0.04522772553528959, "phrase": "incomplete_fissures"}, {"score": 0.014267335348106192, "phrase": "severe_diseases"}, {"score": 0.009793004851580264, "phrase": "average_distances"}, {"score": 0.004733653184536719, "phrase": "vessels"}, {"score": 0.004673531099726869, "phrase": "bronchi"}, {"score": 0.004575053987970206, "phrase": "pulmonary_lobes"}, {"score": 0.004497762477097628, "phrase": "clinical_practice"}, {"score": 0.004201381218977942, "phrase": "automated_segmentation_approach"}, {"score": 0.004095323392273661, "phrase": "marker-based_watershed_transformation"}, {"score": 0.0038253590626087237, "phrase": "cost_image"}, {"score": 0.003776750773624222, "phrase": "watershed_transformation"}, {"score": 0.0035883942463601688, "phrase": "pulmonary_vessels"}, {"score": 0.003542786326740931, "phrase": "lobar_markers"}, {"score": 0.003423969509052361, "phrase": "automatically_labeled_bronchial_tree"}, {"score": 0.0030908254851076005, "phrase": "recently_published_method"}, {"score": 0.0029491324941225356, "phrase": "reference_segmentation"}, {"score": 0.002550842302473891, "phrase": "publically_available_data"}, {"score": 0.0021049977753042253, "phrase": "segmentation_quality"}], "paper_keywords": ["Fissure segmentation", " lung lobe segmentation"], "paper_abstract": "Segmentation of the pulmonary lobes is relevant in clinical practice and particularly challenging for cases with severe diseases or incomplete fissures. In this work, an automated segmentation approach is presented that performs a marker-based watershed transformation on computed tomography (CT) scans to subdivide the lungs into lobes. A cost image for the watershed transformation is computed by combining information from fissures, bronchi, and pulmonary vessels. The lobar markers are calculated by an analysis of the automatically labeled bronchial tree. By integration of information from several anatomical structures the segmentation is made robust against incomplete fissures. For evaluation the method was compared to a recently published method on 20 CT scans with no or mild disease. The average distances to the reference segmentation were 0.69, 0.67, and 1.21 mm for the left major, right major, and right minor fissure, respectively. In addition the results were submitted to LOLA11, an international lung lobe segmentation challenge with publically available data including cases with severe diseases. The average distances to the reference for the 55 CT scans provided by LOLA11 were 0.98, 3.97, and 3.09 mm for the left major, right major, and right minor fissure. Moreover, an analysis of the relation between segmentation quality and fissure completeness showed that the method is robust against incomplete fissures.", "paper_title": "Automatic Segmentation of the Pulmonary Lobes From Chest CT Scans Based on Fissures, Vessels, and Bronchi", "paper_id": "WOS:000314367100007"}