{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "knowledge_receivers"}, {"score": 0.015196469076324378, "phrase": "domain_knowledge"}, {"score": 0.008060462665734111, "phrase": "specific_domain_knowledge"}, {"score": 0.00481495049065317, "phrase": "growing_complexity"}, {"score": 0.004768104290288521, "phrase": "document_contents"}, {"score": 0.0046986841646790315, "phrase": "significant_increase"}, {"score": 0.004366387782457736, "phrase": "traditional_knowledge_extraction_schemes"}, {"score": 0.004302791070310513, "phrase": "complete_documents"}, {"score": 0.0042517436446972735, "phrase": "proposed_model"}, {"score": 0.003978866233891427, "phrase": "component-based_knowledge"}, {"score": 0.0032554492909625653, "phrase": "important_implicit_knowledge"}, {"score": 0.003024909947609294, "phrase": "knowledge_components"}, {"score": 0.0024624103660827695, "phrase": "proposed_methodology"}, {"score": 0.0024264776194357993, "phrase": "web-based_knowledge_component_extraction_system"}, {"score": 0.00229914226836813, "phrase": "taiwan_logistics_yearbooks"}, {"score": 0.0021784745589727246, "phrase": "verification_results"}, {"score": 0.0021361800485636823, "phrase": "developed_system"}, {"score": 0.0021049977753042253, "phrase": "high-performance_knowledge_component_extraction_system"}], "paper_keywords": ["component-based knowledge", " knowledge management", " knowledge component extraction"], "paper_abstract": "With the growing complexity of document contents and the significant increase of domain knowledge, it is difficult for knowledge receivers to understand specific domain knowledge. However, traditional knowledge extraction schemes usually provide complete documents to knowledge receivers and much time is required for knowledge receivers to acquire domain knowledge. The concept of component-based knowledge is to divide documents into several knowledge components corresponding to more specific domains, which can be used to reduce the time required for the knowledge receivers to search the specific domain knowledge. Moreover, since the figures and tables in a document usually contain the important implicit knowledge expressed within the document, the aim of this research is to extract the knowledge components from documents (e.g. industry yearbooks) on the basis of figures and tables. In this research, a knowledge component extraction model with two algorithms, namely the keyword mapping algorithm and sentence mapping algorithm, is developed. In order to demonstrate the applicability of the proposed methodology, a web-based knowledge component extraction system is also established based on the proposed model. Furthermore, Taiwan Logistics Yearbooks are applied as examples to evaluate the proposed model. The verification results show that the developed system is a high-performance knowledge component extraction system. As a whole, this research provides an approach for knowledge receivers to efficiently and accurately acquire domain knowledge.", "paper_title": "A knowledge component extraction technology using figures and tables", "paper_id": "WOS:000318153800001"}