{"auto_keywords": [{"score": 0.03880856748832835, "phrase": "sh"}, {"score": 0.03838107109538265, "phrase": "tilde_wa"}, {"score": 0.012421268726184442, "phrase": "web-based_applications"}, {"score": 0.00800497002992683, "phrase": "data_analysis"}, {"score": 0.004631210802518759, "phrase": "autonomic_computing"}, {"score": 0.0045264063398024945, "phrase": "growing_complexity"}, {"score": 0.004474892876386379, "phrase": "holistic_approach"}, {"score": 0.003999951967118758, "phrase": "performance_failures"}, {"score": 0.003981671255692865, "phrase": "unavailability_scenarios"}, {"score": 0.003725764777417227, "phrase": "self-healing_framework"}, {"score": 0.003407265514532704, "phrase": "recovery_actions"}, {"score": 0.0033377071254140052, "phrase": "small_aspect-oriented_programming_agent"}, {"score": 0.003262078764268653, "phrase": "application_source_code"}, {"score": 0.003239725108882075, "phrase": "adaptive_and_selective_algorithms"}, {"score": 0.0031159081999910694, "phrase": "statistical_correlation"}, {"score": 0.003059284964048687, "phrase": "server_response_time"}, {"score": 0.0029490976406067694, "phrase": "performance_anomaly"}, {"score": 0.0029088053471312495, "phrase": "performance_anomalies"}, {"score": 0.002765706963477273, "phrase": "recovery_procedure"}, {"score": 0.002623605602890015, "phrase": "performance_impact"}, {"score": 0.0025759055233912998, "phrase": "tilde_wa._two_benchmarking_applications"}, {"score": 0.002552380856361981, "phrase": "dynamic_workloads"}, {"score": 0.0025348780944761755, "phrase": "different_types"}, {"score": 0.002344687536424102, "phrase": "end_users"}, {"score": 0.0022446762407019216, "phrase": "false_alarm"}, {"score": 0.0021637652812890678, "phrase": "significant_performance_overhead"}, {"score": 0.002114680567432181, "phrase": "response_time_delay"}], "paper_keywords": ["Reliability", " Self-healing", " autonomic computing", " Web applications", " fault tolerance", " performance"], "paper_abstract": "The complexity of systems is considered an obstacle to the progress of the IT industry. Autonomic computing is presented as the alternative to cope with the growing complexity. It is a holistic approach, in which the systems are able to configure, heal, optimize, and protect by themselves. Web-based applications are an example of systems where the complexity is high. The number of components, their interoperability, and workload variations are factors that may lead to performance failures or unavailability scenarios. The occurrence of these scenarios affects the revenue and reputation of businesses that rely on these types of applications. In this article, we present a self-healing framework for Web-based applications (SH (o) over tilde WA). SH (o) over tilde WA is composed by several modules, which monitor the application, analyze the data to detect and pinpoint anomalies, and execute recovery actions autonomously. The monitoring is done by a small aspect-oriented programming agent. This agent does not require changes to the application source code and includes adaptive and selective algorithms to regulate the level of monitoring. The anomalies are detected and pinpointed by means of statistical correlation. The data analysis detects changes in the server response time and analyzes if those changes are correlated with the workload or are due to a performance anomaly. In the presence of performance anomalies, the data analysis pinpoints the anomaly. Upon the pinpointing of anomalies, SH (o) over tilde WA executes a recovery procedure. We also present a study about the detection and localization of anomalies, the accuracy of the data analysis, and the performance impact induced by SH (o) over tilde WA. Two benchmarking applications, exercised through dynamic workloads, and different types of anomaly were considered in the study. The results reveal that (1) the capacity of SH (o) over tilde WA to detect and pinpoint anomalies while the number of end users affected is low; (2) SH (o) over tilde WA was able to detect anomalies without raising any false alarm; and (3) SH (o) over tilde WA does not induce a significant performance overhead (throughput was affected in less than 1%, and the response time delay was no more than 2 milliseconds).", "paper_title": "SH(o)over-tildeWA: A Self-Healing Framework for Web-Based Applications", "paper_id": "WOS:000353435100004"}