{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adverse_selection"}, {"score": 0.012719068503061405, "phrase": "potential_referee"}, {"score": 0.004586531354697466, "phrase": "potential_worker"}, {"score": 0.004202223763361474, "phrase": "wrong_decision"}, {"score": 0.003775803846431323, "phrase": "finite_sequence"}, {"score": 0.0037392451233558234, "phrase": "review_processes"}, {"score": 0.00323134923196813, "phrase": "reviewer's_ability"}, {"score": 0.0031845067058084583, "phrase": "review's_complexity"}, {"score": 0.0029892206557359836, "phrase": "agency_theory"}, {"score": 0.0029458777184930896, "phrase": "journal_editor"}, {"score": 0.00259554612218815, "phrase": "optimal_contract"}, {"score": 0.0024963543716522087, "phrase": "right_incentives"}, {"score": 0.002231747358665628, "phrase": "proportional_increment"}, {"score": 0.002199363362666037, "phrase": "reviewer_factor"}], "paper_keywords": [""], "paper_abstract": "Adverse selection occurs when a firm signs a contract with a potential worker but his/her key skills are still not known at that time, which leads the employer to make a wrong decision. In this article, we study the example of adverse selection of reviewers when a potential referee whose ability is his private information faces a finite sequence of review processes for several scholarly journals, one after the other. Our editor's problem is to design a system that guarantees that each manuscript is reviewed by a referee if and only if the reviewer's ability matches the review's complexity. As is typically the case in solving problems of adverse selection in agency theory, the journal editor offers a menu of contracts to the potential referee, from which the reviewer chooses the contract that is best for him given his ability. The optimal contract will be the one that provides the right incentives to match the complexity of the review and the ability of the reviewer. The payment of contracts is made through a proportional increment of the reviewer factor, which measures the importance of reviewers to their field.", "paper_title": "Adverse selection of reviewers", "paper_id": "WOS:000354476600013"}