{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "poisson_variables"}, {"score": 0.02134782710044168, "phrase": "linear_combination"}, {"score": 0.004775726266706856, "phrase": "multivariate_statistical_process_control"}, {"score": 0.0045843245695654875, "phrase": "p_poisson_quality_characteristics"}, {"score": 0.004491506786670695, "phrase": "new_multivariate_control_chart"}, {"score": 0.004311456736121202, "phrase": "lcp"}, {"score": 0.0040713749949601915, "phrase": "control_limit"}, {"score": 0.003828912548622257, "phrase": "desired_in-control_arl."}, {"score": 0.0036903962975894634, "phrase": "new_control"}, {"score": 0.0029100272315053253, "phrase": "univariate_poisson_charts"}, {"score": 0.002827740707723551, "phrase": "lcp_control_chart"}, {"score": 0.0025211567863488962, "phrase": "integer_values"}, {"score": 0.002275557501858879, "phrase": "vast_majority"}, {"score": 0.002220257443705344, "phrase": "process_shifts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Control chart", " Poisson", " Genetic algorithms", " Multivariate SPC"], "paper_abstract": "In this paper we analyze the monitoring of p Poisson quality characteristics simultaneously, developing a new multivariate control chart based on the linear combination of the Poisson variables, the LCP control chart. The optimization of the coefficients of this linear combination (and control limit) for minimizing the out-of-control ARL is constrained by the desired in-control ARL. In order to facilitate the use of this new control chart the optimization is carried out employing user-friendly Windows(C) software, which also makes a comparison of performance between this chart and other schemes based on monitoring a set of Poisson variables; namely a control chart on the sum of the variables (MP chart), a control chart on their maximum (MX chart) and an optimized set of univariate Poisson charts (Multiple scheme). The LCP control chart shows very good performance. First, the desired in-control ARL (ARL(0)) is perfectly matched because the linear combination of Poisson variables is not constrained to integer values, which is an advantage over the rest of charts, which cannot in general match the required ARL(0) value. Second, in the vast majority of cases this scheme signals process shifts faster than the rest of the charts. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Optimal linear combination of Poisson variables for multivariate statistical process control", "paper_id": "WOS:000326610000020"}