{"auto_keywords": [{"score": 0.03253855146857074, "phrase": "filter_criteria"}, {"score": 0.007826751202462888, "phrase": "target_graphs"}, {"score": 0.007650669607227419, "phrase": "candidate_graphs"}, {"score": 0.00481495049065317, "phrase": "user_characteristics"}, {"score": 0.004706305193222972, "phrase": "visual_querying"}, {"score": 0.004663533386096864, "phrase": "information_systems"}, {"score": 0.004414907432703781, "phrase": "information_discovery"}, {"score": 0.0042178318724732005, "phrase": "user_interactions"}, {"score": 0.003956558420993431, "phrase": "displayed_data"}, {"score": 0.0036944890904337833, "phrase": "users'_performance"}, {"score": 0.0036441884295335502, "phrase": "visual_exploration_system"}, {"score": 0.00349734405943853, "phrase": "large_set"}, {"score": 0.003418327319110734, "phrase": "visual_filtering_criteria"}, {"score": 0.003221111762383486, "phrase": "pay-off_matrix"}, {"score": 0.003177235604998673, "phrase": "time_limit"}, {"score": 0.0029396242707327986, "phrase": "correct_identifications"}, {"score": 0.002610043728801011, "phrase": "users'_preference"}, {"score": 0.0021049977753042253, "phrase": "data_and_user_characteristics"}], "paper_keywords": ["visual querying", " graphic displays", " interactive visualisation", " information filtering", " cognitive style"], "paper_abstract": "Information systems increasingly provide options for visually inspecting data during the process of information discovery and exploration. Little research has dealt so far with user interactions with these systems, and specifically with the effects of characteristics of the displayed data and the user on performance with such systems. The study reports an experiment on users' performance with a visual exploration system. Participants had to identify target graphs within a large set of candidate graphs by using visual filtering criteria that differed in their efficiency for reducing the number of candidate graphs. A pay-off matrix and a time limit served to motivate users to select filter criteria efficiently. Performance was measured as the number of correct identifications of target graphs within a time-limit, and the number, type and position of filter criteria selected for the search. Efficiency was somewhat biased by users' preference to select filter criteria sequentially, starting from the left to the right. Rational and experiential cognitive styles affected performance, and they interacted with learning and the types of filter criteria chosen. The study shows that not only visual search tools can be used effectively but also that data and user characteristics affect task performance with such systems.", "paper_title": "The effect of user characteristics on the efficiency of visual querying", "paper_id": "WOS:000296581200010"}