{"auto_keywords": [{"score": 0.041725522589024386, "phrase": "geocast_problem"}, {"score": 0.00481495049065317, "phrase": "geocasting_problem"}, {"score": 0.004773476989344654, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.004531997388646422, "phrase": "mobile_ad-hoc_network"}, {"score": 0.004302680891412643, "phrase": "bounded_speed"}, {"score": 0.004120435930514554, "phrase": "topological_stability"}, {"score": 0.003634262647873338, "phrase": "stable_connection"}, {"score": 0.0030166226457616616, "phrase": "monodimensional_space"}, {"score": 0.0028267701593809877, "phrase": "geocasting_algorithms"}, {"score": 0.0024606422183102382, "phrase": "exact_bounds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mobile ad-hoc networks", " Mobile distributed computing", " Geocast", " Geocast solvability vs. speed of movement", " Speed of movement vs. cost of the solution", " Distributed systems"], "paper_abstract": "We present a model of a mobile ad-hoc network in which nodes can move arbitrarily on the plane with some bounded speed. We show that without any assumption on some topological stability, it is impossible to solve the geocast problem deterministically despite connectivity and no matter how slowly the nodes move. Moreover, even if each node maintains a stable connection with each of its neighbors for some period of time, it is impossible to solve the geocast problem if nodes move too fast. Additionally, we give a tradeoff lower bound which shows that the faster the nodes can move on a monodimensional space, the more costly it would be to solve the geocast problem. We provide geocasting algorithms for the case where nodes move in one dimension and also when they can move on the plane (i.e., in two dimensions). We prove correctness of our algorithms by giving exact bounds on the speed of movement. Our analysis helps understand the impact of speed of nodes, firstly, on geocasting solvability and, secondly, on the cost of geocasting. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "The impact of mobility on the geocasting problem in mobile ad-hoc networks: Solvability and cost", "paper_id": "WOS:000288056200003"}