{"auto_keywords": [{"score": 0.0342937278694813, "phrase": "decision_support"}, {"score": 0.027549440013098052, "phrase": "acute_bronchitis"}, {"score": 0.015719716506582538, "phrase": "clinical_decision_support"}, {"score": 0.013378645986075268, "phrase": "non-indicated_prescriptions"}, {"score": 0.008576949745972194, "phrase": "antibiotic_prescriptions"}, {"score": 0.008442260762304652, "phrase": "upper_respiratory_tract_infection"}, {"score": 0.004173244935967375, "phrase": "electronic_warnings"}, {"score": 0.0038390240716280302, "phrase": "common_type"}, {"score": 0.003808619097554076, "phrase": "non-indicated_prescription"}, {"score": 0.0034073030552032304, "phrase": "clinician_report"}, {"score": 0.0033803056981691866, "phrase": "decision-support_use"}, {"score": 0.003353521531649663, "phrase": "generalized_estimating_equations"}, {"score": 0.003197200793408836, "phrase": "antibiotic_prescription_receipt"}, {"score": 0.0030481444896915504, "phrase": "results_clinician_use"}, {"score": 0.0028601252251285, "phrase": "antibiotic_prescribing"}, {"score": 0.0025180781216911246, "phrase": "antibiotic_prescription"}, {"score": 0.0023532890136269986, "phrase": "increased_use"}, {"score": 0.0023346234464901978, "phrase": "decision-support_systems"}, {"score": 0.0023069016803337365, "phrase": "relatively_fewer_non-indicated_antibiotic_prescriptions"}, {"score": 0.002225691463551672, "phrase": "secular_upward_trend"}, {"score": 0.002208035721125305, "phrase": "non-indicated_antibiotic_prescribing"}, {"score": 0.002147333949483224, "phrase": "overall_effect"}, {"score": 0.0021049977753042253, "phrase": "important_role"}], "paper_keywords": [""], "paper_abstract": "Objective Antibiotics are commonly recognized as non-indicated for acute bronchitis and upper respiratory tract infection (URI), yet their widespread use persists. Clinical decision support in the form of electronic warnings is hypothesized to prevent non-indicated prescriptions. The purpose of this study was to identify the effect of clinical decision support on a common type of non-indicated prescription. Materials and methods Using National Ambulatory Medical Care Survey data from 2006 to 2010, ambulatory visits with a primary diagnosis of acute bronchitis or URI and orders for antibiotic prescriptions were identified. Visits were classified on the basis of clinician report of decision-support use. Generalized estimating equations were used to assess the effect of decision support on likelihood of antibiotic prescription receipt, controlling for patient, provider, and practice characteristics. Results Clinician use of decision support increased sharply between 2006 (16% of visits) and 2010 (55%). Antibiotic prescribing for acute bronchitis and URI increased from similar to 35% of visits in 2006 to similar to 45% by 2010. Use of decision support was associated with a 19% lower likelihood of receiving an antibiotic prescription, controlling for patient, provider, and practice characteristics. Discussion In spite of the increased use of decision-support systems and the relatively fewer non-indicated antibiotic prescriptions resulting from the use of decision support, a secular upward trend in non-indicated antibiotic prescribing offset these improvements. Conclusions The overall effect of decision support suggests an important role for technology in reducing non-indicated prescriptions. Decision support alone may not be sufficient to eliminate non-indicated prescriptions given secular trends.", "paper_title": "Impact of clinical decision support on receipt of antibiotic prescriptions for acute bronchitis and upper respiratory tract infection", "paper_id": "WOS:000343776700022"}