{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_political_participation"}, {"score": 0.02285543581662551, "phrase": "news_consumption"}, {"score": 0.009940533353292515, "phrase": "online_political_behavior"}, {"score": 0.00837076103615198, "phrase": "internal_political_efficacy"}, {"score": 0.007839696732522494, "phrase": "different_news_sources"}, {"score": 0.004545675105321216, "phrase": "independent_predictor"}, {"score": 0.0036703791815812328, "phrase": "second_objective"}, {"score": 0.00338037259057507, "phrase": "university_students"}, {"score": 0.002831894638104635, "phrase": "online_participation"}, {"score": 0.0024821782596371536, "phrase": "semipublic_and_private_news_sources"}, {"score": 0.0024416087858984644, "phrase": "greater_internal_efficacy"}, {"score": 0.0024116690200017402, "phrase": "ci"}, {"score": 0.0022577559526646904, "phrase": "greater_propensity"}, {"score": 0.002166607745253829, "phrase": "potential_importance"}, {"score": 0.0021049977753042253, "phrase": "online_political_engagement"}], "paper_keywords": ["personality", " online political participation", " news consumption", " internal political efficacy"], "paper_abstract": "Openness to experience is known to be an independent predictor of online political behavior, although the degree to which this relationship is influenced by other factors has not been tested. One objective of this study was to test whether the relationship between openness to experience and the propensity to engage in online political participation is mediated by internal political efficacy and hours spent consuming news. The second objective was to determine if a preference for different news sources would be related to a willingness to participate in online political behavior. University students (n = 419) were assessed on willingness to engage in online political participation, hours dedicated to news consumption, preference for different news sources, and internal political efficacy. Our results showed that openness to experience was related to a willingness to engage in online participation, and this was mediated by hours spent consuming news and internal political efficacy (95% confidence interval [CI] = [.0048, .32]). A preference for both semipublic and private news sources was related to greater internal efficacy (95% CI = [.2347, 1.4799]), which was in turn related to a greater propensity to engage in online political participation. These findings highlight the potential importance of news consumption for a propensity toward online political engagement.", "paper_title": "The Relationship Between Openness to Experience and Willingness to Engage in Online Political Participation Is Influenced by News Consumption", "paper_id": "WOS:000351051900004"}