{"auto_keywords": [{"score": 0.0327048684145304, "phrase": "bpel_code"}, {"score": 0.00481495049065317, "phrase": "unstructured_workflow_processes"}, {"score": 0.004780183091824403, "phrase": "readable_bpel."}, {"score": 0.0045933810497156705, "phrase": "graphical_workflow_model"}, {"score": 0.0045108906244892165, "phrase": "workflow_nets"}, {"score": 0.004256703909255889, "phrase": "de-facto_standard"}, {"score": 0.0041200448395938526, "phrase": "increasing_number"}, {"score": 0.0040168495790596295, "phrase": "ibm"}, {"score": 0.0038179283509963695, "phrase": "powerful_language"}, {"score": 0.0037903372565399824, "phrase": "bpel"}, {"score": 0.0036026484429137998, "phrase": "trained_eye"}, {"score": 0.003350480663660326, "phrase": "flow_construct"}, {"score": 0.0031960852616842207, "phrase": "right_construct"}, {"score": 0.0031272381208680613, "phrase": "graphical_interface"}, {"score": 0.003037736332283186, "phrase": "graphical_representations"}, {"score": 0.0030048355421601705, "phrase": "direct_reflection"}, {"score": 0.0027242666160349938, "phrase": "rich_theory"}, {"score": 0.002704554429386671, "phrase": "petri_nets"}, {"score": 0.0025518995025917176, "phrase": "bpmn"}, {"score": 0.0024968892298940157, "phrase": "bpel."}, {"score": 0.0023135565762161005, "phrase": "netherlands"}, {"score": 0.002255431275670053, "phrase": "cpn_tools"}], "paper_keywords": ["BPEL4WS", " Petri nets", " workflow management", " business process management"], "paper_abstract": "This paper presents WorkflowNet2BPEL4WS a tool to automatically map a graphical workflow model expressed in terms of Workflow Nets (WF-nets) onto BPEL. The Business Process Execution Language for Web Services (BPEL) has emerged as the de-facto standard for implementing processes and is supported by an increasing number of systems (cf. the IBM WebSphere Choreographer and the Oracle BPEL Process Manager). While being a powerful language, BPEL is difficult to use. Its XML representation is very verbose and only readable for the trained eye. It offers many constructs and typically things can be implemented in many ways, e.g., using links and the flow construct or using sequences and switches. As a result only experienced users are able to select the right construct. Some vendors offer a graphical interface that generates BPEL code. However, the graphical representations are a direct reflection of the BPEL code and not easy to use by end-users. Therefore, we provide a mapping from WF-nets to BPEL. This mapping builds on the rich theory of Petri nets and can also be used to map other languages (e.g., UML, EPC, BPMN, etc.) onto BPEL. To evaluate WorkflowNet2BPEL4WS we used more than 100 processes modeled using Protos (the most widely used business process modeling tool in the Netherlands), automatically converted these into CPN Tools, and applied our mapping. The results of these evaluation are very encouraging and show the applicability of our approach.", "paper_title": "WorkflowNet2BPEL4WS: A tool for translating unstructured workflow processes to readable BPEL", "paper_id": "WOS:000243131600009"}