{"auto_keywords": [{"score": 0.030942053697592193, "phrase": "local_optimal_stack_configurations"}, {"score": 0.00481495049065317, "phrase": "stable_local_optimal_rna_secondary_structures"}, {"score": 0.004455272634364756, "phrase": "multiple_alternate_structures"}, {"score": 0.004381749459671914, "phrase": "different_biological_functions"}, {"score": 0.004309434349688514, "phrase": "biologically_functional_structures"}, {"score": 0.004238307626560739, "phrase": "low_free_energies"}, {"score": 0.0038567860860362745, "phrase": "current_states"}, {"score": 0.00370981613076245, "phrase": "conformational_space"}, {"score": 0.003668859054928118, "phrase": "feasible_rna_secondary_structures"}, {"score": 0.0033757067564871494, "phrase": "rna_secondary_structure"}, {"score": 0.003283272764794988, "phrase": "energetically_favorable_helical_regions"}, {"score": 0.003088702479841264, "phrase": "putative_stacks"}, {"score": 0.0030376623293574905, "phrase": "rna_secondary_structures"}, {"score": 0.0029544572689681934, "phrase": "reduced_conformational_space"}, {"score": 0.002857605453835429, "phrase": "feasible_rna_structures"}, {"score": 0.0027031706928674092, "phrase": "possible_local_optimal_stack_configurations"}, {"score": 0.002585638506308606, "phrase": "fast_heuristic_algorithm"}, {"score": 0.002542890176213921, "phrase": "energy_barriers"}, {"score": 0.002140400526572388, "phrase": "benchmark_results"}], "paper_keywords": [""], "paper_abstract": "Motivation: Many RNAs, such as riboswitches, can fold into multiple alternate structures and perform different biological functions. These biologically functional structures usually have low free energies in their local energy landscapes and are very stable such that they cannot easily jump out of the current states and fold into other stable conformations. The conformational space of feasible RNA secondary structures is prohibitively large, and accurate prediction of functional structure conformations is challenging. Because the stability of an RNA secondary structure is determined predominantly by energetically favorable helical regions (stacks), we propose to use configurations of putative stacks to represent RNA secondary structures. By considering a reduced conformational space of local optimal stack configurations instead of all feasible RNA structures, we first present an algorithm for enumerating all possible local optimal stack configurations. In addition, we present a fast heuristic algorithm for approximating energy barriers encountered during folding pathways between each pair of local optimal stack configurations and finding all the stable local optimal structures. Results: Benchmark tests have been conducted on several RNA riboswitches, whose alternate secondary structures have been experimentally verified. The benchmark results show that our method can successfully predict the native 'on' and 'off' secondary structures, and better rank them compared with other state-of-art approaches.", "paper_title": "Finding stable local optimal RNA secondary structures", "paper_id": "WOS:000296099300010"}