{"auto_keywords": [{"score": 0.03637557639052407, "phrase": "backup_supplier"}, {"score": 0.004496402246090618, "phrase": "backup_supply"}, {"score": 0.004230998366716307, "phrase": "disruption_probability"}, {"score": 0.00413767314434795, "phrase": "order_quantity"}, {"score": 0.004077394032903726, "phrase": "make-to-order_contract"}, {"score": 0.003661275004971829, "phrase": "supply_disruption"}, {"score": 0.0031767199435197243, "phrase": "different_optimal_solutions"}, {"score": 0.0030847461428168614, "phrase": "supply_uncertainties"}, {"score": 0.003054681986032532, "phrase": "disruption_risks"}, {"score": 0.0030101325901285537, "phrase": "vital_role"}, {"score": 0.0028244513779243107, "phrase": "recurrent_uncertainty"}, {"score": 0.0021049977753042253, "phrase": "order_contract"}], "paper_keywords": ["Make-to-order", " Supply uncertainties", " Supply disruption", " Backup supplier", " Decision-making under risk"], "paper_abstract": "As more supply chains are becoming dependent upon suppliers, Me need and the value of a backup supply is increasingly evident. The purpose of this paper is to help a buyer determine the order quantity of a make-to-order contract with the backup Supplier When the main suppliers recurrent uncertainties and possible disruptions are taken into consideration. We show that (1) if no supply disruption is considered, the buyer would rather order less from the backup supplier than that when the risks are decoupled; (2) bundling and decoupling the risks can result in different optimal solutions, and the properties of supply uncertainties and disruption risks play a vital role in the following two ways: (i) with the increase of the recurrent uncertainty, it is better for the buyer to order less front the backup supplier, which is opposite to the decision suggested by the stand-by contract in the literature; (ii) with the increase of the disruption probability, the buyer should order more from the backup supplier. And (3) under the make-to-order contract, bundling the risks can lead to under utilization of the backup supplier when the disruption probability is small enough, but may result in. over utilization of the backup supplier when the probability is large.", "paper_title": "MAKE-TO-ORDER CONTRACT WITH A BACKUP SUPPLIER UNDER RECURRENT SUPPLY UNCERTAINTIES AND DISRUPTION RISKS", "paper_id": "WOS:000272566800008"}