{"auto_keywords": [{"score": 0.024526380879275406, "phrase": "chile"}, {"score": 0.01116102744744266, "phrase": "uk"}, {"score": 0.00481495049065317, "phrase": "small_group_face-to-face_collaborative_scaffolding"}, {"score": 0.0043760766185257025, "phrase": "wenger"}, {"score": 0.004248869786808024, "phrase": "socio-cultural_practice"}, {"score": 0.004173603566828364, "phrase": "vygotsky"}, {"score": 0.004064750457737759, "phrase": "lave"}, {"score": 0.004045068727683462, "phrase": "rogoff"}, {"score": 0.0037157201349604222, "phrase": "spontaneous_response"}, {"score": 0.003278447235176858, "phrase": "necessary_part"}, {"score": 0.003011328068286321, "phrase": "collaborative_learning_community"}, {"score": 0.0028032928749970026, "phrase": "digital_tools"}, {"score": 0.00259793885118959, "phrase": "digital_system"}, {"score": 0.002506562885555113, "phrase": "face-to-face_collaboration"}, {"score": 0.0021239335561699106, "phrase": "greater_interaction"}, {"score": 0.0021049977753042253, "phrase": "class_members"}], "paper_keywords": ["Cooperative/collaborative learning", " Improving classroom teaching", " Learning environments", " Pedagogical issues", " Teaching/learning strategies"], "paper_abstract": "There is a wealth of evidence that collaboration between learners can enhance the outcomes for all concerned. This supports the theorization of learning as a socio-cultural practice, framed by Vygotsky and developed by other researchers such as Rogoff, Lave and Wenger. However, there is also evidence that working collaboratively may not be a spontaneous response to working in a group, and that teaching learners how to collaborate, and in particular how to work together to negotiate meaning, is a necessary part of the process of learning collaboratively which can enhance outcomes further. A question for the computer supported collaborative learning community then arises as to whether learning to collaborate can be scaffolded through the use of digital tools, and what such tools might look like. This paper reports on the design of a digital system that aims to support the practice of face-to-face collaboration on open-ended tasks. Findings from trials of the system in classrooms in the UK and Chile show that the model is welcomed both by teachers and pupils, and met its objectives of ensuring greater interaction between class members who did not normally work together, and involvement of all individuals in discussion based activities. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Technology as small group face-to-face Collaborative Scaffolding", "paper_id": "WOS:000263701900015"}