{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "socially_responsible_agents"}, {"score": 0.035290101094512666, "phrase": "emotional_attachment"}, {"score": 0.0046659637258752535, "phrase": "emotional_decision-making"}, {"score": 0.004441059405327222, "phrase": "virtual_humans"}, {"score": 0.0038985392250620483, "phrase": "emerging_psychological_theories"}, {"score": 0.0037948184359488284, "phrase": "human-like_emotional_decision-making"}, {"score": 0.003693846909452865, "phrase": "central_role"}, {"score": 0.003628024127607343, "phrase": "next_action"}, {"score": 0.003406713877432236, "phrase": "emotion_appraisal"}, {"score": 0.0033011569787033297, "phrase": "important_impulse"}, {"score": 0.00295008998986066, "phrase": "future_consequences"}, {"score": 0.002833035775182696, "phrase": "simulation_evaluation"}, {"score": 0.0021723899772112423, "phrase": "user_feedback"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["emotional decision-making", " affective computing", " virtual humans", " robots", " interaction"], "paper_abstract": "Our goal is to create socially responsible agents, either robots or virtual humans. In this paper, we present an integration of emotions, attachment, and learning in emotional decision-making to achieve this goal. Based on emerging psychological theories, we aim at building human-like emotional decision-making, where emotions play a central role in selecting the next action to be performed by the agent. Here, we present our own approach for emotion appraisal where we use emotional attachment as an important impulse for determining the intensities of emotions. Emotions in their turn are used to calculate the emotional attachment toward the users and for learning to predict future consequences. We report on the results of a simulation evaluation where we assess the influence of emotions, attachment, and learning on decision-making. It is our strong belief that by giving an agent the ability to have emotions and to feel empathy and emotional attachment toward others, we will ultimately give this agent the ability to learn and improve its social behavior skills through interactions with the users and through user feedback. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Toward socially responsible agents: integrating attachment and learning in emotional decision-making", "paper_id": "WOS:000319003500020"}