{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "learning_and"}, {"score": 0.004655285779819366, "phrase": "future_urban_road_traffic_management"}, {"score": 0.004500891637057374, "phrase": "socially_relevant_problem"}, {"score": 0.003910595307634916, "phrase": "decentralized_manner"}, {"score": 0.00357395617690842, "phrase": "autonomous_vehicles"}, {"score": 0.0034166271604770576, "phrase": "coordination_facility"}, {"score": 0.0031223774204093713, "phrase": "possible_scenario"}, {"score": 0.0028857130140890787, "phrase": "multiagent_learning"}, {"score": 0.00266693888510356, "phrase": "reservation-based_intersection"}, {"score": 0.0024234059612683032, "phrase": "traffic_flow"}, {"score": 0.002264982416465872, "phrase": "reservation-based_intersections"}, {"score": 0.0021896891011033105, "phrase": "entire_network"}, {"score": 0.0021049977753042253, "phrase": "travel_times"}], "paper_keywords": [""], "paper_abstract": "Future urban road traffic management is an example of a socially relevant problem that can be modeled as a large-scale, open, distributed system, composed of many autonomous interacting agents, which need to be controlled in a decentralized manner. In this context, advanced, reservation-based, intersection control-where autonomous vehicles controlled entirely by agents interact with a coordination facility that controls an intersection, to avoid collisions and minimize delays-will be a possible scenario in the near future. In this article, we seize the opportunities for multiagent learning offered by such a scenario, studying i) how vehicles, when approaching a reservation-based intersection, can coordinate their actions in order to improve their crossing times, and therefore, speed up the traffic flow through the intersection, and ii) how a set of reservation-based intersections can cooperatively act over an entire network of intersections in order to minimize travel times.", "paper_title": "LEARNING AND COORDINATION FOR AUTONOMOUS INTERSECTION CONTROL", "paper_id": "WOS:000288117100001"}