{"auto_keywords": [{"score": 0.04012094358903039, "phrase": "gold_standard"}, {"score": 0.01421296265993305, "phrase": "different_normalization_methods"}, {"score": 0.012311253168518738, "phrase": "current_approach"}, {"score": 0.010661242552357729, "phrase": "normalization_method"}, {"score": 0.00811558223441736, "phrase": "performance_parameters"}, {"score": 0.00481495049065317, "phrase": "rna-seq_normalization_methods"}, {"score": 0.004611959213131437, "phrase": "rna-seq_technology"}, {"score": 0.004452228677941085, "phrase": "effective_normalization_methods"}, {"score": 0.004417487764326481, "phrase": "rna-seq_data"}, {"score": 0.0041653916552844535, "phrase": "gene_expression_measurements"}, {"score": 0.004100620365805411, "phrase": "different_technology"}, {"score": 0.004021065055449586, "phrase": "real-time_reverse_transcription_polymerase_chain_reaction"}, {"score": 0.003912279410161422, "phrase": "microarray"}, {"score": 0.003491894048789576, "phrase": "measurement_error"}, {"score": 0.003128798520531889, "phrase": "exact_quality"}, {"score": 0.003092200512475624, "phrase": "normalized_rna-seq_measurements"}, {"score": 0.002870129049173444, "phrase": "rna-seq"}, {"score": 0.0022680085357731196, "phrase": "proposed_approach"}, {"score": 0.0022414566728770767, "phrase": "five_existing_rna-seq_normalization_methods"}, {"score": 0.0021551702945512494, "phrase": "microarray_quality_control"}, {"score": 0.0021383149182448544, "phrase": "sequencing_quality_control"}], "paper_keywords": [""], "paper_abstract": "Motivation: Further advancement of RNA-Seq technology and its application call for the development of effective normalization methods for RNA-Seq data. Currently, different normalization methods are compared and validated by their correlations with a certain gold standard. Gene expression measurements generated by a different technology or platform such as Real-time reverse transcription polymerase chain reaction (qRT-PCR) or Microarray are usually used as the gold standard. Although the current approach is intuitive and easy to implement, it becomes statistically inadequate when the gold standard is also subject to measurement error (ME). Furthermore, the current approach is not informative, because the correlation of a normalization method with a certain gold standard does not provide much information about the exact quality of the normalized RNA-Seq measurements. Results: We propose to use the system of ME models based on qRT-PCR, Microarray and RNA-Seq gene expression data to compare and validate RNA-Seq normalization methods. This approach does not assume the existence of a gold standard. The performance of a normalization method can be characterized by a group of parameters of the system, which are referred to as the performance parameters, and these performance parameters can be consistently estimated. Different normalization methods can thus be compared by comparing their corresponding estimated performance parameters. We applied the proposed approach to compare five existing RNA-Seq normalization methods using the gene expression data of two RNA samples from the microArray Quality Control and Sequencing Quality Control projects and gained much insight about the pros and cons of these methods.", "paper_title": "Systematic comparison of RNA-Seq normalization methods using measurement error models", "paper_id": "WOS:000309881200004"}