{"auto_keywords": [{"score": 0.04469413353991945, "phrase": "dps"}, {"score": 0.011449546539361928, "phrase": "inter-physician_communication_training"}, {"score": 0.01132154947907311, "phrase": "medical_students"}, {"score": 0.004925509642766203, "phrase": "dps."}, {"score": 0.004614867204809923, "phrase": "modern_medicine"}, {"score": 0.004550029253278477, "phrase": "medical_curricula"}, {"score": 0.004486098156258553, "phrase": "identifiable_part"}, {"score": 0.004360906420260988, "phrase": "inter-physician_communication_skills"}, {"score": 0.004097595199141165, "phrase": "dutch_government"}, {"score": 0.004039995317682942, "phrase": "educational_computer_program"}, {"score": 0.003983201879164145, "phrase": "virtual_patients"}, {"score": 0.003949508242904001, "phrase": "wide_variety"}, {"score": 0.003927203683176278, "phrase": "medical_conditions"}, {"score": 0.0039050245929822354, "phrase": "different_clinical_settings"}, {"score": 0.0038719896823446592, "phrase": "different_time_frames"}, {"score": 0.0037852512654732223, "phrase": "suitable_method"}, {"score": 0.0037320255482878365, "phrase": "inter-physician_communication"}, {"score": 0.0034966325163550177, "phrase": "dps'_usability"}, {"score": 0.003457231940068194, "phrase": "dps._methods"}, {"score": 0.003211695083676408, "phrase": "different_medical_institutions"}, {"score": 0.0031131208154718867, "phrase": "virtual_patient"}, {"score": 0.0029920129598858545, "phrase": "treatment_plan"}, {"score": 0.002966678750599945, "phrase": "electronic_referral_form"}, {"score": 0.0026486377767219794, "phrase": "dps_program"}, {"score": 0.0025892330566358503, "phrase": "educational_format"}, {"score": 0.0025673005153462707, "phrase": "multiple_questionnaires"}, {"score": 0.0025097154697345096, "phrase": "significant_progression"}, {"score": 0.002495521662819317, "phrase": "students'_feeling"}, {"score": 0.0024534188907003726, "phrase": "different_aspects"}, {"score": 0.002202742267484358, "phrase": "nowadays_this_form"}, {"score": 0.002141134176057931, "phrase": "regular_basis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["communication training", " patient simulations", " computer-based training"], "paper_abstract": "Purpose: Clear and adequate communication between physicians is essential in modern medicine. Nevertheless, the medical curricula in The Netherlands lack an identifiable part in their education concerning inter-physician communication training. To train medical students in inter-physician communication skills using the Dynamic Patient Simulator (R) (DPS), the Academic Medical Center at the University of Amsterdam and the Leiden University Medical Center joined in a 2-year project sponsored by the Dutch government. DPS is an educational computer program to create and simulate virtual patients with a wide variety of medical conditions in different clinical settings and over different time frames. To evaluate whether DPS is a suitable method for training medical students in inter-physician communication, we assessed if medical students felt that they had improved their inter-collegial communication skills after the pilot with DPS. Besides, we inquired students on DPS' usability and their satisfaction with DPS. Methods: We first developed and implemented 20 patient simulations in DPS to be practiced upon by two students asynchronously during a week. These students were situated in different medical institutions, geographically spread over The Netherlands and had to treat the virtual patient as a team supported by DPS. The students had to report their findings and treatment plan in the electronic referral form of DPS. A total of 134 students participated in the pilot. To evaluate inter-physician communication training using DPS we conducted a survey amongst these students who were entering their internships. The evaluation focused on self-assessment of their communication skills, usability of the DPS program, and their satisfaction with DPS as educational format, using multiple questionnaires. Discussion: The outcome of the evaluation showed significant progression in students' feeling of improvement of their skills in different aspects concerning the referral of a patient after participating in the pilot. Besides, students evaluated the usability of DPS positive and were highly satisfied with the education in inter-physician communication training using DPS. Based on these outcomes, nowadays this form of training is incorporated in the curricula on a regular basis. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Training inter-physician communication using the dynamic patient simulator((R))", "paper_id": "WOS:000246320500002"}