{"auto_keywords": [{"score": 0.045757345554595, "phrase": "optimal_plan"}, {"score": 0.04024998824811082, "phrase": "original_planning_task"}, {"score": 0.00481495049065317, "phrase": "satplan_tool"}, {"score": 0.0047527118741586055, "phrase": "highly_competitive_method"}, {"score": 0.004706558938775242, "phrase": "parallel_step-optimal_plans"}, {"score": 0.003960972732123083, "phrase": "solution_length"}, {"score": 0.0036040894858791793, "phrase": "model_checking"}, {"score": 0.0035114053248663335, "phrase": "novel_abstraction_technique"}, {"score": 0.0033548872248104814, "phrase": "exponentially_smaller_state_spaces"}, {"score": 0.0029933487820771217, "phrase": "almost_all_benchmarks"}, {"score": 0.0029642298956837764, "phrase": "international_planning_competitions"}, {"score": 0.0027591477674456227, "phrase": "satplan."}, {"score": 0.00270571457262874, "phrase": "theoretical_point"}, {"score": 0.002644678812707061, "phrase": "interesting_phenomenon"}, {"score": 0.002551549856604905, "phrase": "cnf"}, {"score": 0.0024858445890050614, "phrase": "cnf_encodings"}, {"score": 0.0024456516553345966, "phrase": "abstracted_planning_task"}, {"score": 0.0023672002840029517, "phrase": "shortest_resolution_refutation"}, {"score": 0.0022468671200629024, "phrase": "fundamental_weakness"}, {"score": 0.002160640052461594, "phrase": "declarative_transition-systems"}, {"score": 0.002105087425657878, "phrase": "sat"}], "paper_keywords": [""], "paper_abstract": "Planning as satisfiability, as implemented in, for instance, the SATPLAN tool, is a highly competitive method for finding parallel step-optimal plans. A bottleneck in this approach is to prove the absence of plans of a certain length. Specifically, if the optimal plan has n steps, then it is typically very costly to prove that there is no plan of length n-1. We pursue the idea of leading this proof within solution length preserving abstractions (over-approximations) of the original planning task. This is promising because the abstraction may have a much smaller state space; related methods are highly successful in model checking. In particular, we design a novel abstraction technique based on which one can, in several widely used planning benchmarks, construct abstractions that have exponentially smaller state spaces while preserving the length of an optimal plan. Surprisingly, the idea turns out to appear quite hopeless in the context of planning as satisfiability. Evaluating our idea empirically, we run experiments on almost all benchmarks of the international planning competitions up to IPC 2004, and find that even hand-made abstractions do not tend to improve the performance of SATPLAN. Exploring these findings from a theoretical point of view, we identify an interesting phenomenon that may cause this behavior. We compare various planning-graph based CNF encodings phi of the original planning task with the CNF encodings phi(sigma) of the abstracted planning task. We prove that, in many cases, the shortest resolution refutation for phi(sigma) can never be shorter than that for phi. This suggests a fundamental weakness of the approach, and motivates further investigation of the interplay between declarative transition-systems, over-approximating abstractions, and SAT encodings.", "paper_title": "Friends or Foes? On Planning as Satisfiability and Abstract CNF Encodings", "paper_id": "WOS:000273253100001"}