{"auto_keywords": [{"score": 0.004524348699657099, "phrase": "n_participants"}, {"score": 0.003927203683176278, "phrase": "group_communication"}, {"score": 0.0038610400240820307, "phrase": "real_society"}, {"score": 0.0037959868107895053, "phrase": "verification_site"}, {"score": 0.0034867406208212146, "phrase": "practical_solution"}, {"score": 0.0030433302702291116, "phrase": "threshold_signature"}, {"score": 0.002958281631770322, "phrase": "verification_group"}, {"score": 0.0028756028995504035, "phrase": "previous_works"}, {"score": 0.0028111220617485985, "phrase": "wang_et_al"}, {"score": 0.0027325449069867222, "phrase": "chang_et_al"}, {"score": 0.0027017308406240563, "phrase": "'s_scheme"}, {"score": 0.0024257447861185813, "phrase": "verification_party"}, {"score": 0.0023313149689465386, "phrase": "group_members"}, {"score": 0.0021049977753042253, "phrase": "share_distribution_center"}], "paper_keywords": [""], "paper_abstract": "The (t, n) threshold signature scheme can delegate the signing capability to all n participants in a group, and at least t participants can cooperatively sign a message on behalf of the group, where t <= n. For the group communication in the real society, the verification site also needs to be restricted in its associated access privileges. Therefore, this paper proposes a practical solution to the (t, n) threshold untraceable signature with (k, l) verification scheme, which requires that k out of I verifiers or more can verify the threshold signature on behalf of the verification group. Compared with the previous works, such as Wang et al.'s scheme and Chang et al.'s scheme, our proposed scheme is more practical and expansible. Our scheme allows each group to be both a signing party and a verification party, and the shadows of all group members are no need to be redistributed after the initialization has been finished. In addition, the share distribution center (SDC) is not required in our scheme.", "paper_title": "A practical solution to the (t, n) threshold untraceable signature with (k, l) verification scheme", "paper_id": "WOS:000240542600101"}