{"auto_keywords": [{"score": 0.00565823251153436, "phrase": "improved_algorithms"}, {"score": 0.004903654904354368, "phrase": "previous_best_deterministic_algorithm"}, {"score": 0.00481495049065317, "phrase": "important_class"}, {"score": 0.004762202897268383, "phrase": "np-hard_problems"}, {"score": 0.004556901872357751, "phrase": "recently_developed_techniques"}, {"score": 0.004506968388996092, "phrase": "parameterized_algorithms"}, {"score": 0.004360412703519539, "phrase": "greedy_localization"}, {"score": 0.0036352070472201086, "phrase": "improved_algorithmic_methods"}, {"score": 0.0035755653799043, "phrase": "existing_and_new_techniques"}, {"score": 0.00325555555110395, "phrase": "deterministic_algorithm"}, {"score": 0.00280496585980086, "phrase": "new_randomized_algorithm"}, {"score": 0.0024569466759289055, "phrase": "previous_best_randomized_algorithm"}], "paper_keywords": [""], "paper_abstract": "Matching and packing problems have formed an important class of NP-hard problems. There have been a number of recently developed techniques for parameterized algorithms for these problems, including greedy localization, color-coding plus dynamic programming, and randomized divide-and-conquer. In this paper, we provide further theoretical study on the structures of these problems, and develop improved algorithmic methods that combine existing and new techniques to obtain improved algorithms for matching and packing problems. For the 3-SET PACKING problem, we present a deterministic algorithm of time O* (4.61(3k)), which significantly improves the previous best deterministic algorithm of time O* (12.8(3k)). For the 3-D MATCHING problem, we develop a new randomized algorithm of running time O* (2.32(3k)) and a new deterministic algorithm of running time O* (2.77(3k)). Our randomized algorithm improves the previous best randomized algorithm of running time O* (2.52(3k)), and our deterministic algorithm significantly improves the previous best deterministic algorithm of running time O* (12.8(3k)). Our results also imply improved algorithms for various triangle packing problems in graphs.", "paper_title": "Greedy localization and color-coding: Improved matching and packing algorithms", "paper_id": "WOS:000241482800008"}