{"auto_keywords": [{"score": 0.03217160122346607, "phrase": "smart_card"}, {"score": 0.015719716506582538, "phrase": "smart-card-based_password-authenticated_key_agreement"}, {"score": 0.015530559745360033, "phrase": "distributed_systems"}, {"score": 0.014617876061259454, "phrase": "smart-card-based_password_authentication"}, {"score": 0.004031699976413366, "phrase": "remote_client"}, {"score": 0.0038862297330905836, "phrase": "valid_smart_card"}, {"score": 0.0038154673253945003, "phrase": "corresponding_password"}, {"score": 0.003700371064796848, "phrase": "successful_authentication"}, {"score": 0.003438058620195309, "phrase": "key_establishment_protocol"}, {"score": 0.002931569771634119, "phrase": "pre-computed_data"}, {"score": 0.0027403605798830984, "phrase": "different_data"}, {"score": 0.0026576091519087065, "phrase": "different_time_slots"}, {"score": 0.0021049977753042253, "phrase": "security_threats"}], "paper_keywords": ["Authentication", " key exchange", " offline-dictionary attack", " online-dictionary attack", " smart card"], "paper_abstract": "This paper initiates the study of two specific security threats on smart-card-based password authentication in distributed systems. Smart-card-based password authentication is one of the most commonly used security mechanisms to determine the identity of a remote client, who must hold a valid smart card and the corresponding password to carry out a successful authentication with the server. The authentication is usually integrated with a key establishment protocol and yields smart-card-based password-authenticated key agreement. Using two recently proposed protocols as case studies, we demonstrate two new types of adversaries with smart card: 1) adversaries with pre-computed data stored in the smart card, and 2) adversaries with different data (with respect to different time slots) stored in the smart card. These threats, though realistic in distributed systems, have never been studied in the literature. In addition to point out the vulnerabilities, we propose the countermeasures to thwart the security threats and secure the protocols.", "paper_title": "Further Observations on Smart-Card-Based Password-Authenticated Key Agreement in Distributed Systems", "paper_id": "WOS:000340282400011"}