{"auto_keywords": [{"score": 0.04885877600670675, "phrase": "organizational_learning"}, {"score": 0.03166181073351053, "phrase": "information_capital"}, {"score": 0.017770306063261826, "phrase": "information_behavior"}, {"score": 0.009809955769396195, "phrase": "information_value"}, {"score": 0.004549063619065006, "phrase": "recent_literature"}, {"score": 0.004123781267600542, "phrase": "healthcare_industry"}, {"score": 0.004060350364088702, "phrase": "emerging_economy"}, {"score": 0.0035866734383189396, "phrase": "parsimonious_and_plausible_empirical_model"}, {"score": 0.003441352119167824, "phrase": "contextual_variables"}, {"score": 0.003336225354214798, "phrase": "full-time_medical_staff"}, {"score": 0.0032510749712864454, "phrase": "taiwan"}, {"score": 0.0028567126120064546, "phrase": "model_fit"}, {"score": 0.002783783619459147, "phrase": "sem"}, {"score": 0.0027126684113045756, "phrase": "mediating_role"}, {"score": 0.0021714122348552747, "phrase": "healthcare_organizations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information capital", " Organizational learning (OL)", " Information behaviors and value (IBV)"], "paper_abstract": "This work draws on recent literature concerning information capital and organizational learning to explore how this may affect information behavior and value (IBV) of the healthcare industry in an emerging economy. Whether organizational learning mediates the relationships between information capital and both information behavior and information value (IBV) is also examined. Additionally, a parsimonious and plausible empirical model is proposed to examine the links among contextual variables. Data are collected from full-time medical staff of medical centers in Taiwan, including physicians and nurses. To clarify the relationships among these variables, structural equation modeling (SEM) is conducted to examine the model fit and three hypotheses. The SEM results clearly demonstrate the mediating role of organizational learning in the impact of information capital on both information behavior and information value. Consequently, organizational learning leads to appropriate information behavior and information value (that is, information sharing and information integrity, respectively) only when integrated with organizational learning and information capital for healthcare organizations. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Information behavior and value creation potential of information capital: Mediating role of organizational learning", "paper_id": "WOS:000264182800055"}