{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rehandling-free_intra-block_remarshaling_plan"}, {"score": 0.0046240999614456605, "phrase": "intra-block_remarshaling"}, {"score": 0.004544629724830453, "phrase": "container_terminal"}, {"score": 0.004339293854115301, "phrase": "export_containers"}, {"score": 0.004048483412089098, "phrase": "designated_target_bays"}, {"score": 0.0036907133026806327, "phrase": "predetermined_order"}, {"score": 0.0029281780903782284, "phrase": "remarshaling_task"}, {"score": 0.0027795345823932406, "phrase": "remarshaling_operations"}, {"score": 0.00270023138867066, "phrase": "multiple_stacking_cranes"}, {"score": 0.0023363141951290526, "phrase": "intra-block_remarshaling_plan"}, {"score": 0.0021049977753042253, "phrase": "stacking_cranes"}], "paper_keywords": ["Multiple crane scheduling", " Container terminal", " Intra-block remarshaling", " Simulated annealing"], "paper_abstract": "Intra-block remarshaling in a container terminal refers to the task of rearranging the export containers, which are usually scattered around within a block, into designated target bays within the same block. Since the containers must be loaded onto a ship following a predetermined order, the rearrangement should be performed in such a way that the containers to be loaded first are placed on top of those to be loaded later in order to avoid rehandling. To minimize the time required to complete a remarshaling task, rehandling should also be avoided during the remarshaling operations. Moreover, when multiple stacking cranes are used for the remarshaling, the interference between cranes should be minimized. This paper presents a method to efficiently search for an intra-block remarshaling plan which is free from rehandling during both the loading operation and remarshaling, and which minimizes the interference between the stacking cranes.", "paper_title": "Generating a rehandling-free intra-block remarshaling plan for an automated container yard", "paper_id": "WOS:000288222000007"}