{"auto_keywords": [{"score": 0.0497090303722539, "phrase": "energy_usage"}, {"score": 0.012292176908785236, "phrase": "different_sites"}, {"score": 0.00481495049065317, "phrase": "grid_computing_environments"}, {"score": 0.00464976086880886, "phrase": "new_level"}, {"score": 0.004507667881645218, "phrase": "energy_costs"}, {"score": 0.00440394242852293, "phrase": "server_rooms"}, {"score": 0.004352974291381376, "phrase": "comparable_to_hardware_costs"}, {"score": 0.004171065188039856, "phrase": "rising_cost"}, {"score": 0.0037125240439927114, "phrase": "grid_system"}, {"score": 0.0036411406244705557, "phrase": "different_ownerships"}, {"score": 0.0034618794528555063, "phrase": "total_energy_usage"}, {"score": 0.0030572112793962004, "phrase": "traditional_high_performance_computing_systems"}, {"score": 0.0029867619862229853, "phrase": "computing_nodes"}, {"score": 0.0029292922955739963, "phrase": "communication_links"}, {"score": 0.002884111441153185, "phrase": "different_nodes"}, {"score": 0.0025867180355950816, "phrase": "nash_bargaining_solution"}, {"score": 0.0023380300046435187, "phrase": "desired_qos_level"}, {"score": 0.002293014162421338, "phrase": "proposed_algorithm"}, {"score": 0.0022141537427057363, "phrase": "robust_performance"}, {"score": 0.0021799789348982516, "phrase": "performance_prediction_information"}, {"score": 0.002163089417146551, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Scheduling", " Grid computing", " Game theory"], "paper_abstract": "Energy usage and its associated costs have taken on a new level of significance in recent years. Globally, energy costs that include the cooling of server rooms are now comparable to hardware costs, and these costs are on the increase with the rising cost of energy. As a result, there are efforts worldwide to design more efficient scheduling algorithms. Such scheduling algorithm for grids is further complicated by the fact that the different sites in a grid system are likely to have different ownerships. As such, it is not enough to simply minimize the total energy usage in the grid; instead one needs to simultaneously minimize energy usage between all the different providers in the grid. Apart from the multitude of ownerships of the different sites, a grid differs from traditional high performance computing systems in the heterogeneity of the computing nodes as well as the communication links that connect the different nodes together. In this paper, we propose a cooperative, power-aware game theoretic solution to the job scheduling problem in grids. We discuss our cooperative game model and present the structure of the Nash Bargaining Solution. Our proposed scheduling scheme maintains a specified Quality of Service (QoS) level and minimizes energy usage between all the providers simultaneously; energy usage is kept at a level that is sufficient to maintain the desired QoS level. Further, the proposed algorithm is fair to all users, and has robust performance against inaccuracies in performance prediction information. Crown Copyright (C) 2009 Published by Elsevier Inc. All rights reserved.", "paper_title": "Cooperative power-aware scheduling in grid computing environments", "paper_id": "WOS:000273835800002"}