{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "common_intervals"}, {"score": 0.0120924902867584, "phrase": "k_permutations"}, {"score": 0.005945475381245072, "phrase": "nested_common_intervals"}, {"score": 0.005856934075184855, "phrase": "arbitrary_k."}, {"score": 0.004606144014398635, "phrase": "maximal_nested_common_intervals"}, {"score": 0.004561468495520688, "phrase": "n_elements"}, {"score": 0.0044934449515131, "phrase": "t._uno"}, {"score": 0.004466519142879166, "phrase": "m._yagiura"}, {"score": 0.004321273059270048, "phrase": "efficient_algorithm"}, {"score": 0.00396050388346298, "phrase": "genome_comparison"}, {"score": 0.0037972380063356972, "phrase": "specific_algorithmic_approach"}, {"score": 0.003776464491506579, "phrase": "k"}, {"score": 0.0035541200911490614, "phrase": "common_and_efficient_algorithmic_framework"}, {"score": 0.003459191419478298, "phrase": "set_p"}, {"score": 0.0033465923623290034, "phrase": "global_representation"}, {"score": 0.002976019715894587, "phrase": "irreducible_common_intervals"}, {"score": 0.002958159666874001, "phrase": "same-sign_common_intervals"}, {"score": 0.002819073586200239, "phrase": "conserved_intervals"}, {"score": 0.002776961266279729, "phrase": "irreducible_conserved_intervals"}, {"score": 0.0021433882705962034, "phrase": "best_known_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Permutation", " Genome", " Algorithm", " Common intervals", " Conserved intervals", " Nested common intervals"], "paper_abstract": "Common intervals of K permutations over the same set of n elements were firstly investigated by T. Uno and M. Yagiura (2000) [23], who proposed an efficient algorithm to find common intervals when K = 2. Several particular classes of intervals have been defined since then, e.g. conserved intervals and nested common intervals, with applications mainly in genome comparison. Each such class, including common intervals, led to the development of a specific algorithmic approach for K = 2, and except for nested common intervals for its extension to an arbitrary K. In this paper, we propose a common and efficient algorithmic framework for finding different types of common intervals in a set P of K permutations, with arbitrary K. Our generic algorithm is based on a global representation of the information stored in P, called the MinMax-profile of P, and an efficient data structure, called an LR-stack, that we introduce here. We show that common intervals (and their subclasses of irreducible common intervals and same-sign common intervals), nested common intervals (and their subclass of maximal nested common intervals) as well as conserved intervals (and their subclass of irreducible conserved intervals) may be obtained by appropriately setting the parameters of our algorithm in each case. All the resulting algorithms run in 0 (Kn + N) time and need 0 (n) additional space, where N is the number of solutions. The algorithms for nested common intervals and maximal nested common intervals are new for K > 2, in the sense that no other algorithm has been given so far to solve the problem with the same complexity, or better. The other algorithms are as efficient as the best known algorithms. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "MinMax-profiles: A unifying view of common intervals, nested common intervals and conserved intervals of K permutations", "paper_id": "WOS:000339702600009"}