{"auto_keywords": [{"score": 0.004300830853119242, "phrase": "therapeutic_potential"}, {"score": 0.0035565113234273926, "phrase": "cancer_cells"}, {"score": 0.0033096502887394233, "phrase": "non-conserved_loop"}, {"score": 0.0031927032309210534, "phrase": "ecd"}, {"score": 0.002940626369102927, "phrase": "site-directed_mutation"}, {"score": 0.002836679611901583, "phrase": "molecular_modeling"}, {"score": 0.0027789349951704177, "phrase": "new_model"}, {"score": 0.0026532596852754525, "phrase": "crystal_structure"}, {"score": 0.0024311346712789553, "phrase": "complex_model"}, {"score": 0.0024062532032402533, "phrase": "computational_design"}, {"score": 0.0021487685525986094, "phrase": "rational_molecular_basis"}, {"score": 0.0021267708018655493, "phrase": "affinity_improvement"}, {"score": 0.0021049977753042253, "phrase": "mechanism_investigation"}], "paper_keywords": ["ErbB2", " Epitope loop", " Internalizing antibody", " Docking", " Inhibitory mechanism"], "paper_abstract": "Anti-ErbB2 antibodies are well researched for the therapy of ErbB2-overexpressing tumors. The therapeutic potential and efficacy of these antibodies are closely related to their affinities to ErbB2. Previously we reported that an anti-ErbB2 antibody A21 targeting a conformational epitope comprising several loops in ErbB2 extracellular subdomain I and II could inhibit the proliferation of ErbB2-overexpressing cancer cells in vitro and in vivo. Here we found that another structureless and non-conserved loop in subdomain I of ErbB2 extracellular domain (ECD) was important for binding to A21, and then the antigen-contact sites on A21 were determined by site-directed mutation. The loop was constructed by molecular modeling, and a new model of A21-ErbB2 complex was generated by docking using the crystal structure of the scfv A21 and the model of ErbB2 ECD with the loop built. Based on the complex model, computational design for A21 affinity improvement was performed to enhance its affinity to ErbB2. Two mutants with about 1.7-fold improvement in affinity were obtained. Our study provided a rational molecular basis for affinity improvement and mechanism investigation of A21.", "paper_title": "Interactions between anti-ErbB2 antibody A21 and the ErbB2 extracellular domain provide a basis for improving A21 affinity", "paper_id": "WOS:000273684100004"}