{"auto_keywords": [{"score": 0.04263334351221677, "phrase": "abstract_description"}, {"score": 0.01307357579582478, "phrase": "euler_diagram"}, {"score": 0.010819026113413512, "phrase": "vertex-labelled_graph"}, {"score": 0.00481495049065317, "phrase": "general_euler_diagram_drawing"}, {"score": 0.0046432244185370605, "phrase": "wide_variety"}, {"score": 0.00429828390000229, "phrase": "automated_euler_diagram_drawing"}, {"score": 0.004144908086646161, "phrase": "euler_diagram_generation_problem"}, {"score": 0.0035677736570659813, "phrase": "euler_diagrams"}, {"score": 0.0034560481756572632, "phrase": "six_typically_considered_well-formedness_conditions"}, {"score": 0.0031129269142224194, "phrase": "dual_graph"}, {"score": 0.0029610472910087176, "phrase": "arbitrary_plane"}, {"score": 0.002816556934231128, "phrase": "specific_embeddings"}, {"score": 0.0027407299369891502, "phrase": "appropriate_duals"}, {"score": 0.0025716240685409513, "phrase": "drawn_euler_diagram"}, {"score": 0.002423931101340771, "phrase": "well-formedness_condition"}, {"score": 0.0022032826616250325, "phrase": "euler"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Euler diagrams", " Venn diagrams", " Graph drawing", " Information visualization"], "paper_abstract": "Euler diagrams are used in a wide variety of areas for representing information about relationships between collections of objects. Recently, several techniques for automated Euler diagram drawing have been proposed, contributing to the Euler diagram generation problem: given an abstract description, draw an Euler diagram with that description and which possesses certain properties, sometimes called well-formedness conditions. We present the first fully formalized, general framework that permits the embedding of Euler diagrams that possess any collection of the six typically considered well-formedness conditions. Our method first converts the abstract description into a vertex-labelled graph. An Euler diagram can then be formed, essentially by finding a dual graph of such a graph. However, we cannot use an arbitrary plane embedding of the vertex-labelled graph for this purpose. We identify specific embeddings that allow the construction of appropriate duals. From these embeddings, we can also identify precisely which properties the drawn Euler diagram will possess and 'measure' the number of times that each well-formedness condition is broken. We prove that every abstract description can be embedded using our method. Moreover, we identify exactly which (large) class of Euler diagrams can be generated. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A graph theoretic approach to general Euler diagram drawing", "paper_id": "WOS:000272123800007"}