{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "organizational_networks"}, {"score": 0.030037685936341246, "phrase": "sf_property"}, {"score": 0.014823346091290025, "phrase": "command_networks"}, {"score": 0.0046848707075530256, "phrase": "scale-free_distributions"}, {"score": 0.004160435626849478, "phrase": "sf_distributions"}, {"score": 0.004066498558415824, "phrase": "evolving_hierarchical_tree_network_model"}, {"score": 0.0036944890904337833, "phrase": "extreme_homogeneity"}, {"score": 0.003660879039645457, "phrase": "extreme_heterogeneity"}, {"score": 0.0035781807623238905, "phrase": "traditional_degree_distribution"}, {"score": 0.0031917943932454314, "phrase": "randomly_selected_node"}, {"score": 0.002993887707344862, "phrase": "network_size"}, {"score": 0.0028731719610706214, "phrase": "large-scale_networks"}, {"score": 0.0027573101010593863, "phrase": "hierarchical_tree"}, {"score": 0.0024147474002390763, "phrase": "real_organization_networks"}, {"score": 0.002244277924422011, "phrase": "sf_degree_distribution"}, {"score": 0.0022238315004700607, "phrase": "sf_cumulative-outdegree_distribution"}, {"score": 0.0021049977753042253, "phrase": "extreme_situations"}], "paper_keywords": ["Complex networks", " Cumulative-outdegree distribution", " Degree distribution", " Hierarchical organization", " Scale-free networks"], "paper_abstract": "This paper discusses chain of command networks that are most likely to exhibit the scale-free (SF) property in organizational networks, explaining why organizational networks do not show SF distributions. We propose an evolving hierarchical tree network model without explicit preferential attachment. The model simulates several kinds of chain of command networks with the span of control ranging from extreme homogeneity to extreme heterogeneity. In addition to traditional degree distribution, a new kind of cumulative-outdegree distribution p(K (cum) =k (cum) ) is introduced and discussed that gives a probability that a randomly selected node has exactly k (cum) children nodes. Theoretical analysis and simulation results show that even if the network size is large enough to meet the demand of large-scale networks, the SF property can emerge only when a hierarchical tree lies in two extreme situations: (1) the exact same span of control exists at all levels of an organization; (2) the node outdegree (i.e. span of control) distribution obeys a power-law distribution. The empirical investigations show that real organization networks are between the two extreme situations. This is why organizational networks in reality do not show an SF degree distribution or SF cumulative-outdegree distribution. This finding shows that the SF property is the consequence of extreme situations, even though it is very common in nature and in society. In fact, the SF property is of no value in the study of problems in organizations.", "paper_title": "Why organizational networks in reality do not show scale-free distributions", "paper_id": "WOS:000272530200002"}