{"auto_keywords": [{"score": 0.04520513221478601, "phrase": "newsharvester"}, {"score": 0.00481495049065317, "phrase": "task_performance"}, {"score": 0.004660088610495924, "phrase": "news-writing_task"}, {"score": 0.004510184935928004, "phrase": "knowledge_work"}, {"score": 0.004352123742308589, "phrase": "users'_uncertainty"}, {"score": 0.004287903986946197, "phrase": "test-bed_system"}, {"score": 0.004237208239631876, "phrase": "news_research"}, {"score": 0.004088674329188, "phrase": "information_gathering"}, {"score": 0.003910278811774747, "phrase": "simple_feature"}, {"score": 0.0038755411593867284, "phrase": "text_extracts"}, {"score": 0.0038411109150557504, "phrase": "source_locations"}, {"score": 0.0035341028694769036, "phrase": "previous_ethnographic_study"}, {"score": 0.0033101397746161843, "phrase": "standard_drag"}, {"score": 0.003251552926963083, "phrase": "information_gathering_mechanisms"}, {"score": 0.0028269905110337094, "phrase": "near-complete_report"}, {"score": 0.002188136252410142, "phrase": "research_and_writing_tasks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["information behaviour", " writing", " PIM", " journalism", " system evaluation"], "paper_abstract": "Part of the challenge of designing systems to support knowledge work is to do so in a way which is sympathetic to users' uncertainty. NewsHarvester is a test-bed system designed to support news research and writing in a way that accommodates uncertainty in relation to information gathering. It does this using 'drag-and-link'; a simple feature by which text extracts copied from source locations are appended with hyperlinks to force the re-display of the source. We describe the rationale for using drag-and-link within NewHarvester based on a previous ethnographic study of journalists, describe its implementation within NewsHarvester, and report a user-evaluation which compared drag-and-link with printing and standard drag-and-drop as information gathering mechanisms. We found that users wanted to relocate information they had not previously identified as useful in order to include it in their report, to better understand the context of information already extracted, and as part of a more serendipitous search for information to add to a near-complete report. Users also considered drag-and-link an easier method for gathering information than printing, and considered that drag-and-link made it easier to relocate information. They also considered that drag-and-link promoted more flexible and dynamic working and increased user enjoyment. An assessment of the quality of their work showed a trend that favoured drag-and-link over the other two methods, although this was not statistically significant. We conclude that drag-and-link improves user-experience during research and writing tasks in the face of information gathering uncertainty. (c) 2008 Elsevier Ltd. All. rights reserved.", "paper_title": "Uncertainty-tolerant design: Evaluating task performance and drag-and-link information gathering for a news-writing task", "paper_id": "WOS:000256494000002"}