{"auto_keywords": [{"score": 0.04065057449949541, "phrase": "bad_partition"}, {"score": 0.00481495049065317, "phrase": "still_frontal_faces"}, {"score": 0.004456717971917794, "phrase": "good_partition"}, {"score": 0.004185289462328125, "phrase": "base_verification_rate"}, {"score": 0.004026505114417176, "phrase": "false_accept_rate"}, {"score": 0.00376293585033711, "phrase": "average_difficulty"}, {"score": 0.0036026773719603044, "phrase": "vr"}, {"score": 0.0034325187732054093, "phrase": "ugly_partition"}, {"score": 0.0030858947334838145, "phrase": "base_performance"}, {"score": 0.0029400959763737364, "phrase": "top_performers"}, {"score": 0.0026430660986106955, "phrase": "subject_aging"}, {"score": 0.0026049517737353365, "phrase": "subject_\"recognizability"}, {"score": 0.0025673856614952854, "phrase": "subject_recognizability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Face recognition", " Challenge problem"], "paper_abstract": "The Good, the Bad, and the Ugly Face Challenge Problem was created to encourage the development of algorithms that are robust to recognition across changes that occur in still frontal faces. The Good, the Bad, and the Ugly consists of three partitions. The Good partition contains pairs of images that are considered easy to recognize. The base verification rate (VR) is 0.98 at a false accept rate (FAR) of 0.001. The Bad partition contains pairs of images of average difficulty to recognize. For the Bad partition, the VR is 0.80 at a FAR of 0.001. The Ugly partition contains pairs of images considered difficult to recognize, with a VR of 0.15 at a FAR of 0.001. The base performance is from fusing the output of three of the top performers in the FRVT 2006. The design of the Good, the Bad, and the Ugly controls for posevariation, subject aging, and subject \"recognizability.\" Subject recognizability is controlled by having the same number of images of each subject in every partition. This implies that the differences in performance among the partitions are a result of how a face is presented in each image. Published by Elsevier B.V.", "paper_title": "The Good, the Bad, and the Ugly Face Challenge Problem", "paper_id": "WOS:000304181000006"}