{"auto_keywords": [{"score": 0.04725836981129389, "phrase": "useful_chemical_information"}, {"score": 0.00481495049065317, "phrase": "chemical_relationships"}, {"score": 0.004497410940849537, "phrase": "small-molecule_libraries"}, {"score": 0.004363058588000252, "phrase": "libraries'_molecules"}, {"score": 0.004200724305692705, "phrase": "structural_descriptors"}, {"score": 0.004121826934975274, "phrase": "important_advance"}, {"score": 0.003953409087444568, "phrase": "new_methods"}, {"score": 0.003908678575537341, "phrase": "small-molecule_screening_data"}, {"score": 0.0038352452380298464, "phrase": "advanced_hit-picking_protocols"}, {"score": 0.003748937184382714, "phrase": "economic_optimization_algorithms"}, {"score": 0.0034226302212225206, "phrase": "private_data"}, {"score": 0.0033455764382772754, "phrase": "useful_chemical_data"}, {"score": 0.00330770035909988, "phrase": "chemical_structures"}, {"score": 0.0031724417545242315, "phrase": "adme_prediction_models"}, {"score": 0.0031127970604842375, "phrase": "information_theory"}, {"score": 0.002907184330345933, "phrase": "new_strategy"}, {"score": 0.0027671619871474764, "phrase": "anonymized_scaffold_networks"}, {"score": 0.0026338658998573752, "phrase": "chemical_data"}, {"score": 0.0026040262154057607, "phrase": "also_sufficiently_blinding_structures"}, {"score": 0.0021782296784218923, "phrase": "collaborative_analysis"}, {"score": 0.002121056250381627, "phrase": "specific_projects"}, {"score": 0.0021049977753042253, "phrase": "screening_technology"}], "paper_keywords": [""], "paper_abstract": "In this study, we propose a new, secure method of sharing useful chemical information from small-molecule libraries, without revealing the structures of the libraries' molecules. Our method shares the relationship between molecules rather than structural descriptors. This is an important advance because, over the past few years, several groups have developed and published new methods of analyzing small-molecule screening data. These methods include advanced hit-picking protocols, promiscuous active filters, economic optimization algorithms, and screening visualizations, which can identify patterns in the data that might otherwise be overlooked. Application of these methods to private data requires finding strategies for sharing useful chemical data without revealing chemical structures. This problem has been examined in the context of ADME prediction models, with results from information theory suggesting it is impossible to share useful chemical information without revealing structures. In contrast, we present a new strategy for encoding the relationships between molecules instead of their structures, based on anonymized scaffold networks and trees, that safely shares enough chemical information to be useful in analyzing chemical data, while also sufficiently blinding structures from discovery. We present the details of this encoding, an analysis of the usefulness of the information it conveys, and the security of the structures it encodes. This approach makes it possible to share data across institutions, and may securely enable collaborative analysis that can yield insight into both specific projects and screening technology as a whole.", "paper_title": "Sharing Chemical Relationships Does Not Reveal Structures", "paper_id": "WOS:000330542800005"}