{"auto_keywords": [{"score": 0.046400324443240264, "phrase": "network_lifetime"}, {"score": 0.015719716506582538, "phrase": "intelligent_routing_protocols"}, {"score": 0.008615419072698118, "phrase": "wireless_sensor_networks"}, {"score": 0.003944112858235306, "phrase": "new_ideas"}, {"score": 0.0035390378585554547, "phrase": "routing_protocols"}, {"score": 0.0034395119150793787, "phrase": "reinforcement_learning"}, {"score": 0.002690975370565776, "phrase": "representative_routing_algorithms"}, {"score": 0.002178400923036365, "phrase": "computational_intelligence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Intelligent routing protocols", " Reinforcement learning", " Ant colony optimization", " Fuzzy logic", " Genetic algorithm", " Neural networks"], "paper_abstract": "This paper surveys intelligent routing protocols which contribute to the optimization of network lifetime in wireless sensor networks (WSNs). Different from other surveys on routing protocols for WSNs, this paper first puts forward new ideas on the definition of network lifetime. Then, with a view to prolonging network lifetime, it discusses the routing protocols based on such intelligent algorithms as reinforcement learning (RL), ant colony optimization (ACO), fuzzy logic (FL), genetic algorithm (GA), and neural networks (NNs). Intelligent algorithms provide adaptive mechanisms that exhibit intelligent behavior in complex and dynamic environments like WSNs. Inspired by such an idea, some intelligent routing protocols have recently been designed for WSNs. Under each category, it discusses the representative routing algorithms and further analyzes the performance of network lifetime defined in three aspects. This paper intends to give assistance in the optimization of network lifetime in WSNs, together with offering a guide for the collaboration between WSNs and computational intelligence (C). 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A survey on intelligent routing protocols in wireless sensor networks", "paper_id": "WOS:000330908700018"}