{"auto_keywords": [{"score": 0.04787636758356028, "phrase": "voronoi_diagram"}, {"score": 0.009867227247302601, "phrase": "power_diagram"}, {"score": 0.009765092628360214, "phrase": "weighted_points"}, {"score": 0.007604966285242198, "phrase": "three-dimensional_spheres"}, {"score": 0.006815929394576174, "phrase": "data_structure"}, {"score": 0.0042692243768616455, "phrase": "cell_complexes"}, {"score": 0.0041157230882412615, "phrase": "delaunay"}, {"score": 0.003946960862020283, "phrase": "simplicial_complexes"}, {"score": 0.0033910448175165004, "phrase": "euclidean_distance_metric"}, {"score": 0.0032180376288035296, "phrase": "radial_edge_data_structure"}, {"score": 0.0027790254309734428, "phrase": "dual_structure"}, {"score": 0.002172266188075892, "phrase": "guaranteed_query_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["topology", " Voronoi diagram of spheres", " Delaunay triangulation", " regular triangulation", " radial edge data structure", " simplex", " complex"], "paper_abstract": "It is well-known that the Voronoi diagram of points and the power diagram for weighted points, such as spheres, are cell complexes, and their respective dual structures, i.e. the Delaunay triangulation and the regular triangulation, are simplicial complexes. Hence, the topologies of these diagrams are usually stored in their dual complexes using a very compact data structure of arrays. The topology of the Voronoi diagram of three-dimensional spheres in the Euclidean distance metric, on the other hand, is stored in a radial edge data structure which is not as compact as the data structure used for the Voronoi diagram of points and the power diagram for weighted points. In this paper, we define a dual structure of the Voronoi diagram of three-dimensional spheres called a quasi-triangulation and present its important properties. Based on the properties of a quasi-triangulation, we propose a data structure, called an interworld data structure, based on arrays to compactly store the topology of the quasi-triangulation with a guaranteed query performance. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Quasi-triangulation and interworld data structure in three dimensions", "paper_id": "WOS:000240056300008"}