{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "simplicial_and_non-simplicial_meshes"}, {"score": 0.004697308822154191, "phrase": "guaranteed_validity"}, {"score": 0.004515004397496303, "phrase": "unified_formulation"}, {"score": 0.0037593414153801394, "phrase": "invalid_elements"}, {"score": 0.0033879628186273625, "phrase": "invalid_element"}, {"score": 0.003114283314285167, "phrase": "triangular_faces"}, {"score": 0.0024306105794630246, "phrase": "ball_boundaries"}, {"score": 0.002394719113232821, "phrase": "proposed_method"}, {"score": 0.0023130151703068444, "phrase": "difficult_example_problems"}, {"score": 0.002278856202878812, "phrase": "severe_grid_deformations"}, {"score": 0.00216858686400722, "phrase": "grid_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["mesh deformation", " dynamic meshes", " fluid-structure interaction", " coupled problems", " aeroelasticity", " ball-vertex method"], "paper_abstract": "In this paper we present a unified formulation that embraces the problem of deformation of simplicial and non-simplicial, structured and unstructured, two and three dimensional meshes. The method is formulated so as to avoid, by construction, the generation of invalid elements. At first, we show that in all cases above, invalid elements are generated by the same collapse mechanism. Specifically, an invalid element is formed when a mesh vertex leaves its ball, i.e. the polyhedral cavity formed by all triangular faces (in three dimensions) or edges (in two dimensions) that are edge-connected to the vertex. Next, we show that, in all cases above, collapse of elements is avoided by connecting with a spring each vertex in the grid with its normal projection on the ball boundaries. The proposed method is demonstrated on a number of difficult example problems denoted by severe grid deformations, and with the help of a variety of grid types. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A unified approach to the deformation of simplicial and non-simplicial meshes in two and three dimensions with guaranteed validity", "paper_id": "WOS:000247424400027"}