{"auto_keywords": [{"score": 0.02765071126697575, "phrase": "giant_component"}, {"score": 0.015719716506582538, "phrase": "random_geometric_networks"}, {"score": 0.011017306734188732, "phrase": "transmission_radii"}, {"score": 0.010875494509572894, "phrase": "power_law_distribution"}, {"score": 0.004783669072241243, "phrase": "information_dissemination"}, {"score": 0.004645386985559481, "phrase": "corresponding_graph"}, {"score": 0.004394952560839036, "phrase": "transmission_radius"}, {"score": 0.004316843493504269, "phrase": "distributed_communication_algorithms"}, {"score": 0.004260906498835763, "phrase": "ad-hoc_radio_communication_model"}, {"score": 0.004164747937210838, "phrase": "network_connections"}, {"score": 0.004104076015958861, "phrase": "node_v"}, {"score": 0.0038953958723049287, "phrase": "background_noise"}, {"score": 0.003819895395081285, "phrase": "random_geometric_graphs"}, {"score": 0.0036792371574197826, "phrase": "rigorous_study"}, {"score": 0.003661275004971829, "phrase": "classical_communication_problem"}, {"score": 0.0036493488022676006, "phrase": "distributed_gossiping"}, {"score": 0.0035611274762076183, "phrase": "initial_local_knowledge"}, {"score": 0.0035379628447303703, "phrase": "network_nodes"}, {"score": 0.003239549357111286, "phrase": "probability_density_function"}, {"score": 0.0030847461428168614, "phrase": "simple_broadcasting_algorithm"}, {"score": 0.0026286425834985494, "phrase": "directed_path"}, {"score": 0.002410675868935487, "phrase": "randomized_algorithm"}, {"score": 0.0023949767758212506, "phrase": "broadcast_message"}, {"score": 0.0022071340749607714, "phrase": "clear_advantages"}, {"score": 0.0021784745589727246, "phrase": "energy_efficient_radio_networks"}, {"score": 0.002171367890092581, "phrase": "low_average_transmission_radius"}, {"score": 0.0021049977753042253, "phrase": "uniform_low_transmission_power"}], "paper_keywords": [""], "paper_abstract": "We analyze information dissemination in random geometric networks, which consist of n nodes placed uniformly at random in the square . In the corresponding graph two nodes u and v are connected by a (directed) edge, i.e., u is an (incoming) neighbor of v, if and only if the distance between u and v is smaller than the transmission radius assigned to u. In order to study the performance of distributed communication algorithms in such networks, we adopt here the ad-hoc radio communication model with no collision detection mechanism available. In this model the topology of network connections is not known in advance. Also a node v is capable of receiving a message from its neighbor u if u is the only (incoming) neighbor transmitting in a given step. Otherwise a collision occurs prompting interference that is not distinguishable from the background noise in the network. First, we consider networks modeled by random geometric graphs in which all nodes have the same radius , where delta is a sufficiently large constant. In such networks, we provide a rigorous study of the classical communication problem of distributed gossiping (all-to-all communication). We examine various scenarios depending on initial local knowledge and capabilities of network nodes. We show that in many cases an asymptotically optimal distributed O(D)-time gossiping is feasible, where D stands for the diameter of the network. Later, we consider networks in which the transmission radii of the nodes vary according to a power law distribution, i.e., any node is assigned a transmission radius r > r (min) according to probability density function rho(r) similar to r (-alpha) . More precisely, , where and with delta being a large constant. In this case, we develop a simple broadcasting algorithm that runs in time O(log log n) (i.e., O(D)) always surely, and we show that this result is asymptotically optimal. Finally, we consider networks in which any node is assigned a transmission radius r > c according to the probability density function rho(r) = (alpha-1)c (alpha-1) r (-alpha) , where alpha is a constant from the same range as before and c is a constant. In this model the graph is usually not strongly connected, however, there is one giant component with Omega(n) nodes, and there is a directed path from each node of this giant component to every other node in the graph. We assume that the message which has to be disseminated is placed initially in one of the nodes of the giant component, and every node is aware of its own position in . Then, we show that there exists a randomized algorithm which delivers the broadcast message to all nodes in the network in time O(D . (log log n)(2)), almost always surely, where D stands for the diameter of the giant component of the graph. One can conclude from our studies that setting the transmission radii of the nodes according to a power law distribution brings clear advantages. In particular, one can design energy efficient radio networks with low average transmission radius, in which broadcasting can be performed exponentially faster than in the (extensively studied) case where all nodes have the uniform low transmission power.", "paper_title": "Fast message dissemination in random geometric networks", "paper_id": "WOS:000314532300001"}