{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "body_postures"}, {"score": 0.004725385523804256, "phrase": "unconstrained_ecg_measurements"}, {"score": 0.003353521531649663, "phrase": "linear_discriminant_analysis"}, {"score": 0.003229741076887151, "phrase": "radial_basis_function"}, {"score": 0.003125175084962886, "phrase": "artificial_neural_networks"}, {"score": 0.002953711377604328, "phrase": "rbf_kernel"}, {"score": 0.002912331664922248, "phrase": "highest_performance"}, {"score": 0.002552946390854313, "phrase": "ecg_data"}, {"score": 0.002470237978694949, "phrase": "unconstrained_manner"}, {"score": 0.002280333649167796, "phrase": "developed_system"}, {"score": 0.002196077907454079, "phrase": "obstructive_apnea_detection"}, {"score": 0.0021551222226685648, "phrase": "sleep_quality_or_sleep_stages"}, {"score": 0.0021049977753042253, "phrase": "body_posture_detection"}], "paper_keywords": ["Bedsore", " body posture detection", " capacitive sensors", " QRS morphology"], "paper_abstract": "We developed and tested a system for estimating body postures on a bed using unconstrained measurements of electrocardiogram (ECG) signals using 12 capacitively coupled electrodes and a conductive textile sheet. Thirteen healthy subjects participated in the experiment. After detecting the channels in contact with the body among the 12 electrodes, the features were extracted on the basis of the morphology of the QRS (Q wave, R wave, and S wave of ECG) complex using three main steps. The features were applied to linear discriminant analysis, support vector machines with linear and radial basis function (RBF) kernels, and artificial neural networks (one and two layers), respectively. SVM with RBF kernel had the highest performance with an accuracy of 98.4% for estimation of four body postures on the bed: supine, right lateral, prone, and left lateral. Overall, although ECG data were obtained from few sensors in an unconstrained manner, the performance was better than the results that have been reported to date. The developed system and algorithm can be applied to the obstructive apnea detection and analyses of sleep quality or sleep stages, as well as body posture detection for the management of bedsores.", "paper_title": "Estimation of Body Postures on Bed Using Unconstrained ECG Measurements", "paper_id": "WOS:000327394200002"}