{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "content_personalization"}, {"score": 0.049521347818116, "phrase": "user_interfaces"}, {"score": 0.04279339019139431, "phrase": "personalized_user_interfaces"}, {"score": 0.04231365345404785, "phrase": "transportation_interactive_systems"}, {"score": 0.04021776617821063, "phrase": "transportation_ontology"}, {"score": 0.004257360656055417, "phrase": "new_application"}, {"score": 0.0037201996003549246, "phrase": "semi-automatic_generation"}, {"score": 0.003447035529485425, "phrase": "user_interface"}, {"score": 0.0032315723330399375, "phrase": "domain_application"}, {"score": 0.0030833537429977797, "phrase": "interface_container_presentation"}, {"score": 0.0021805201234139475, "phrase": "model-driven_engineering"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ontology", " User interface", " Human-computer interaction", " Model-driven architecture", " Transportation"], "paper_abstract": "Ontologies have been largely exploited in many domains and studies. In this paper, we present a new application of a domain ontology for generating personalized user interfaces for transportation interactive systems. The concepts, relationships and axioms of transportation ontology are exploited during the semi-automatic generation of personalized user interfaces. Personalization deals with the capacity of adaptation of a user interface, reflecting what is known about the user and the domain application. It can be performed on the interface container presentation (e.g., layout, colors, sizes) and in the content provided in their input/output (e.g., data, information, document). In this paper, the transportation ontology is used to provide the content personalization. This paper presents the ontology and how it is used for the personalization of user interfaces for developing transportation interactive systems by model-driven engineering. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Transportation ontology definition and application for the content personalization of user interfaces", "paper_id": "WOS:000316522900035"}