{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "independent_component_analysis"}, {"score": 0.004563028873351776, "phrase": "blind_source_separation"}, {"score": 0.003935892934907777, "phrase": "spectral_data"}, {"score": 0.003780286517897356, "phrase": "associated_linear_unmixing_algorithms"}, {"score": 0.0033718991936259038, "phrase": "linear_combination"}, {"score": 0.0033045378860812403, "phrase": "end-member_spectra"}, {"score": 0.003131393466870228, "phrase": "mutually_statistically_independent_random_sources"}, {"score": 0.002869115451202179, "phrase": "new_approach"}, {"score": 0.0027929100418926725, "phrase": "noca"}, {"score": 0.0025935941070969575, "phrase": "experimental_results"}, {"score": 0.002524688179363081, "phrase": "proposed_noca"}, {"score": 0.002441118140830714, "phrase": "anomaly_detection"}, {"score": 0.0024084679931209514, "phrase": "hyperspectral_imagery"}, {"score": 0.0023603078194781965, "phrase": "ica_approach"}], "paper_keywords": [""], "paper_abstract": "Independent Component Analysis (ICA) has shown success in blind source separation. Its applications to remotely sensed images have been investigated recently. In this approach, a Linear Spectral Mixture (LSM) model is used to characterize spectral data. This model and the associated linear unmixing algorithms are based on the assumption that the spectrum for a given pixel in an image is a linear combination of the end-member spectra. The assumption that the abundances are mutually statistically independent random sources requires the separating matrix to be unitary. This paper considers a new approach, the Non Orthogonal Component Analysis (NOCA), which enables to relax this assumption. The experimental results demonstrate that the proposed NOCA provides a more effective technique for anomaly detection in hyperspectral imagery than the ICA approach. In particular, we highlight the fact that the difference between the performances of the two approaches increases when the number of bands decreases.", "paper_title": "Non Orthogonal Component Analysis: Application to anomaly detection", "paper_id": "WOS:000241489100109"}