{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ludwig_von_bertalanffy's_\"general_systemology"}, {"score": 0.03458969141050206, "phrase": "\"general_systemology"}, {"score": 0.00436890075128947, "phrase": "ludwig_von_bertalanffy"}, {"score": 0.0042734067085669885, "phrase": "first_masterminds"}, {"score": 0.004179991181159956, "phrase": "\"general_system_theory"}, {"score": 0.0036445446531633368, "phrase": "non-german_speaking_audience"}, {"score": 0.003135564707433078, "phrase": "comprehensive_insight"}, {"score": 0.0030942116765996426, "phrase": "diverse_roots"}, {"score": 0.0030131300857849054, "phrase": "bertalanffy"}, {"score": 0.0025241429061867633, "phrase": "\"general_crisis"}, {"score": 0.0023101951336207955, "phrase": "\"organismic\"_theoretical_biology"}, {"score": 0.0021809311689473493, "phrase": "organic_growth"}, {"score": 0.002123730137917387, "phrase": "general_theory"}, {"score": 0.0021049977753042253, "phrase": "\"open_systems"}], "paper_keywords": ["Ludwig von Bertalanffy", " perspectivism", " organismic biology", " theoretical biology", " general system theory", " systemology"], "paper_abstract": "Ludwig von Bertalanffy was one of the first masterminds and advocates of a \"general system theory\". Trained in philosophy and in history of arts, he also concerned himself with biology. His early works in those fields, most of the time unknown to the non-German speaking audience, are essential in order to understand the genesis and the meanings of his \"general system theory\", which we prefer to describe as a \"general systemology\". We here examine them and provide a comprehensive insight into the diverse roots of the concepts that led Bertalanffy to his later achievements. This paper is thereby devoted to the scientific, philosophical and ideological sources of his \"theory\", as well as to the motivations and logic which governed its genesis. Our study concentrates particularly on the following points: the context of \"general crisis\" in which he developed his intellectual schemes; his \"perspectivist\" philosophy of knowledge; his elaboration of an \"organismic\" theoretical biology; his non-reductionist approach to the problem of mathematization of biology and his theory of organic growth; and his sketch of a general theory of \"open systems\" as nucleus and way of legitimising a \"general systemology\".", "paper_title": "On the history of Ludwig von Bertalanffy's \"General Systemology\", and on its relationship to cybernetics - Part I: elements on the origins and genesis of Ludwig von Bertalanffy's \"General Systemology\"", "paper_id": "WOS:000245718700003"}