{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "autonomous_mobile_robots"}, {"score": 0.004502943680955863, "phrase": "physical_connections"}, {"score": 0.004364310576600359, "phrase": "different_ways"}, {"score": 0.003991196463806465, "phrase": "performance_costs"}, {"score": 0.0038167308978417306, "phrase": "physically_larger_self-assembled_entity"}, {"score": 0.003382704886584695, "phrase": "connected_robots"}, {"score": 0.0032347516831068715, "phrase": "single_collective_entity"}, {"score": 0.0031350397225314262, "phrase": "real_world_experiments"}, {"score": 0.0030794433253250476, "phrase": "crossing_task"}, {"score": 0.0021049977753042253, "phrase": "real_robots"}], "paper_keywords": ["Self-assembly", " All-terrain navigation", " Cooperation", " Autonomous robots", " Modular robots", " Swarm robotics"], "paper_abstract": "Robots are said to be capable of self-assembly when they can autonomously form physical connections with each other. By examining different ways in which a system can use self-assembly (i.e., different strategies), we demonstrate and quantify the performance costs and benefits of (i) acting as a physically larger self-assembled entity, (ii) letting the system choose when and if to self-assemble, (iii) coordinating the sensing and actuation of the connected robots so that they respond to the environment as a single collective entity. Our analysis is primarily based on real world experiments in a hill crossing task. The configuration of the hill is not known by the robots in advance-the hill can be present or absent, and can vary in steepness and orientation. In some configurations, the robots can overcome the hill more quickly by navigating individually, while other configurations require the robots to self-assemble to overcome the hill. We demonstrate the applicability of our self-assembly strategies to two other tasks-hole crossing and robot rescue-for which we present further proof-of-concept experiments with real robots.", "paper_title": "Self-assembly strategies in a group of autonomous mobile robots", "paper_id": "WOS:000276203800004"}