{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large_human_movement_fields"}, {"score": 0.004630755876583033, "phrase": "animal_or_human_being"}, {"score": 0.004565529359523792, "phrase": "fundamental_building_block"}, {"score": 0.0043443560029027195, "phrase": "new_technologies"}, {"score": 0.004119211418949265, "phrase": "relatively_low_cost"}, {"score": 0.004003925104720979, "phrase": "different_sampling_properties"}, {"score": 0.003864326375679274, "phrase": "data_mining"}, {"score": 0.0037561467438280175, "phrase": "good_proportion"}, {"score": 0.0033766722372180003, "phrase": "data_set"}, {"score": 0.003201516237269705, "phrase": "large_movement_fields"}, {"score": 0.0031118336364156516, "phrase": "prime_referential_dimension"}, {"score": 0.0030788521585190802, "phrase": "space-time_patterns"}, {"score": 0.0029294877178473017, "phrase": "cyclic_time"}, {"score": 0.002699627613420169, "phrase": "spatio-temporal_activity"}, {"score": 0.0026146595609362715, "phrase": "different_levels"}, {"score": 0.002333586381274878, "phrase": "fundamental_tenet"}, {"score": 0.0021967433763351884, "phrase": "comprehending_pattern"}, {"score": 0.0021049977753042253, "phrase": "specific_example_visualizations"}], "paper_keywords": ["Multi-scale and multi-form visualization", " ringmap", " movement", " generalization", " space, time and activity", " tracking"], "paper_abstract": "The timeline or track of any individual, mobile, sentient organism, whether animal or human being, represents a fundamental building block in understanding the interactions of such entities with their environment and with each other. New technologies have emerged to capture the (x, y, t) dimension of such timelines in large volumes and at relatively low cost, with various degrees of precision and with different sampling properties. This has proved a catalyst to research on data mining and visualizing such movement fields. However, a good proportion of this research can only infer, implicitly or explicitly, the activity of the individual at any point in time. This paper in contrast focuses on a data set in which activity is known. It uses this to explore ways to visualize large movement fields of individuals, using activity as the prime referential dimension for investigating space-time patterns. Visually central to the paper is the ringmap, a representation of cyclic time and activity, that is itself quasi spatial and is directly linked to a variety of visualizations of other dimensions and representations of spatio-temporal activity. Conceptually central is the ability to explore different levels of generalization in each of the space, time and activity dimensions, and to do this in any combination of the (s, t, a) phenomena. The fundamental tenet for this approach is that activity drives movement, and logically it is the key to comprehending pattern. The paper discusses these issues, illustrates the approach with specific example visualizations and invites critiques of the progress to date. Information Visualization (2008) 7, 198-209. doi: 10.1057/palgrave.ivs.9500184", "paper_title": "Activities, ringmaps and geovisualization of large human movement fields", "paper_id": "WOS:000270092700003"}