{"auto_keywords": [{"score": 0.050078487022614894, "phrase": "requirements_knowledge"}, {"score": 0.04073657088368252, "phrase": "rke"}, {"score": 0.039132029261874965, "phrase": "empirical_study"}, {"score": 0.004161553532799662, "phrase": "human_agents"}, {"score": 0.0038419751490849133, "phrase": "software_architecting_tasks"}, {"score": 0.003378385493203297, "phrase": "banking_domain"}, {"score": 0.0032067276476968032, "phrase": "university-level_course"}, {"score": 0.003140524241432171, "phrase": "overall_results"}, {"score": 0.00303319936111073, "phrase": "higher-quality_software_architectures"}, {"score": 0.0028392545452904762, "phrase": "specific_areas"}, {"score": 0.0028097829999199596, "phrase": "architecture_design"}, {"score": 0.002761340122199076, "phrase": "architecture-development_process"}, {"score": 0.0026949162013161078, "phrase": "rke_and_non-rke_architects"}, {"score": 0.002630085891013006, "phrase": "possible_implications"}, {"score": 0.002419393934835993, "phrase": "\"mixed_methods"}, {"score": 0.002280423827531483, "phrase": "architectural_assessment_instrument"}, {"score": 0.00221781065048839, "phrase": "quantitative_analysis"}, {"score": 0.002171979107594173, "phrase": "software_architecture"}, {"score": 0.002119702106867801, "phrase": "new_threads"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": ["Software Architecture", " requirements knowledge and experience", " software quality", " architectural assessment instrument", " Attribute Driven Design (ADD) method", " hiring and training", " software engineering curriculum", " architecture and requirements technology", " quantitative and qualitative research", " empirical study"], "paper_abstract": "Whereas the relationship between Requirements Engineering and Software Architecture (SA) has been studied increasingly in recent years in terms of methods. notations, representations, tools, development paradigms and project experiences, that in terms of the human agents conducting these processes has not been explored scientifically. This paper describes the impact of requirements knowledge and experience (RKE) on software architecting tasks. Specifically, it describes air exploratory, empirical study involving, 15 architecting teams, approximately evenly split between those teams with RKE and those Without. Each team developed its own system architecture from the same given set of requirements in the banking domain. The subjects were all final year undergraduate or graduate students enrolled in a University-level course on software architectures. The overall results Of this Study suggest that architects with RKE develop higher-quality software architectures than those without. and that they have fewer architecture-development problems than did the architects without RKE. This paper identifies specific areas of both architecture design as well as the architecture-development process where the differences manifest between the RKE and non-RKE architects. The paper also describes the possible implications of the findings oil the areas of hiring and training, pedagogy, and technology. The empirical study was carried Out using the \"mixed methods\" approach, involving both quantitative and qualitative aspects of the investigation. A bi-product of this study is an architectural assessment instrument (included in the Appendix) for quantitative analysis of the quality of a software architecture. This paper also describes some new threads for future work. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Software architecting without requirements knowledge and experience: What are the repercussions?", "paper_id": "WOS:000259128100004"}