{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "incomplete_information_system"}, {"score": 0.04799755018493269, "phrase": "rough_sets"}, {"score": 0.027954699458887226, "phrase": "continuous-valued_attributes"}, {"score": 0.006005853844331211, "phrase": "knowledge_reduction"}, {"score": 0.004709193603747991, "phrase": "rough_set_technique"}, {"score": 0.004232875294230749, "phrase": "nominal_datasets"}, {"score": 0.003527550673371394, "phrase": "relative_discernible_measure"}, {"score": 0.003404244237372396, "phrase": "underlying_concept"}, {"score": 0.003128336741911927, "phrase": "underlying_concepts"}, {"score": 0.0029133627624098064, "phrase": "heuristic_algorithm"}, {"score": 0.002874726518572154, "phrase": "fuzzy_reduct"}, {"score": 0.0028492532869274743, "phrase": "initial_data"}, {"score": 0.002811464848641341, "phrase": "main_contribution"}, {"score": 0.0027252240573281163, "phrase": "underlying_relationship"}, {"score": 0.002482013330276732, "phrase": "proposed_method"}, {"score": 0.00241658945942583, "phrase": "continuous_data"}, {"score": 0.0022404162042797262, "phrase": "generalized_model"}, {"score": 0.0021813467128927347, "phrase": "numerical_example"}], "paper_keywords": [""], "paper_abstract": "Many methods based on rough sets to deal with incomplete information system have been proposed in recent years. However, they are only suitable for the nominal datasets. So far only a few methods based on rough sets to deal with incomplete information system with continuous-valued attributes have been proposed. In this paper we propose one generalized model of rough sets to reduce continuous-valued attributes and learn some rules in an incomplete information system. The definition of a relative discernible measure is firstly proposed, which is the underlying concept to redefine the concepts of knowledge reduction such as the reduct and core. We extend a number of underlying concepts of knowledge reduction (such as the reduct and core), and finally propose a heuristic algorithm to generate fuzzy reduct from initial data. The main contribution of this paper is that the underlying relationship between the reduct and core of rough sets is proved to be still correct after our extension. The advantage of the proposed method is that instead of preprocessing continuous data by discretization or fuzzification, we can reduce an incomplete information system with continuous-valued attributes directly based on the generalized model of rough sets, Finally a numerical example is given to show the feasibility of our proposed method.", "paper_title": "Learning from an incomplete information system with continuous-valued attributes by a rough set technique", "paper_id": "WOS:000238282100059"}