{"auto_keywords": [{"score": 0.04878556281654673, "phrase": "network_coding"}, {"score": 0.030713062266142403, "phrase": "special_case"}, {"score": 0.00481495049065317, "phrase": "wiretap_network"}, {"score": 0.004354841111644036, "phrase": "input_links"}, {"score": 0.004237138632255772, "phrase": "full_capacity"}, {"score": 0.0037971749182744334, "phrase": "information_security"}, {"score": 0.0029666322924554274, "phrase": "secret_sharing"}, {"score": 0.0029396242707327986, "phrase": "classical_cryptography"}, {"score": 0.0028082176224611542, "phrase": "secure_linear_network_codes"}, {"score": 0.0023927516438886445, "phrase": "fixed_size"}, {"score": 0.0021049977753042253, "phrase": "controlled_amount"}], "paper_keywords": ["Algebraic coding", " cryptography", " multicast", " network coding", " secret sharing", " wiretap channel"], "paper_abstract": "In the paradigm of network coding, the nodes in a network are allowed to encode the information received from the input links. With network coding, the full capacity of the network can be utilized. In this paper, we propose a model, call the wiretap network, that incorporates information security with network coding. In this model, a collection of subsets of the channels in the network is given, and a wiretapper is allowed to access any one (but not more than one) of these subsets without being able to obtain any information about the message transmitted. Our model includes secret sharing in classical cryptography as a special case. We present a construction of secure linear network codes that can be used provided a certain graph-theoretic condition is satisfied. We also prove the necessity of this condition for the special case that the wiretapper may choose to access any subset of channels of a fixed size. The optimality of our code construction is established for this special case. Finally, we extend our results to the scenario when the wiretapper is allowed to obtain a controlled amount of information about the message.", "paper_title": "Secure Network Coding on a Wiretap Network", "paper_id": "WOS:000285842100031"}