{"auto_keywords": [{"score": 0.015564784465999947, "phrase": "spherical_wavelets"}, {"score": 0.014378269177275612, "phrase": "shape_representation"}, {"score": 0.013149765377961873, "phrase": "spatial_locations"}, {"score": 0.004695900553353526, "phrase": "novel_multiscale_shape_representation"}, {"score": 0.0046143132145381955, "phrase": "spherical_wavelet_transform"}, {"score": 0.00443308765153716, "phrase": "multiple_scales"}, {"score": 0.004280338430265144, "phrase": "deep_brain_structures"}, {"score": 0.004227064760262924, "phrase": "caudate_nucleus"}, {"score": 0.004101886428528311, "phrase": "shape_variations"}, {"score": 0.004040688646993605, "phrase": "needed_scale"}, {"score": 0.0038721890530859578, "phrase": "analysis_framework"}, {"score": 0.003729335910488339, "phrase": "global_shape"}, {"score": 0.0036921366375716005, "phrase": "single_scale"}, {"score": 0.0035292625231068517, "phrase": "limited_dataset"}, {"score": 0.0034678739196681795, "phrase": "multiscale_parametric_model"}, {"score": 0.0033905067962602515, "phrase": "compact_set"}, {"score": 0.003136952589428254, "phrase": "spectral_graph"}, {"score": 0.0030823667846259836, "phrase": "prior_probability_distribution"}, {"score": 0.0029984960344766705, "phrase": "different_scales"}, {"score": 0.0029095936591723645, "phrase": "parametric_active_surface_evolution"}, {"score": 0.0027602925235474317, "phrase": "optimization_method"}, {"score": 0.0026919067120537055, "phrase": "fine_manner"}, {"score": 0.00236855721165372, "phrase": "reconstruction_task"}, {"score": 0.0022078225715967616, "phrase": "oversmooth_data"}, {"score": 0.0021857667493036786, "phrase": "segmentation_task"}, {"score": 0.0021262403223013242, "phrase": "active_shape_model_algorithm"}, {"score": 0.0021049977753042253, "phrase": "finer_shape_details"}], "paper_keywords": ["brain structures", " schizophrenia", " segmentation", " shape representation", " wavelets"], "paper_abstract": "This paper presents a novel multiscale shape representation and segmentation algorithm based on the spherical wavelet transform. This work is motivated by the need to compactly and accurately encode variations at multiple scales in the shape representation in order to drive the segmentation and shape analysis of deep brain structures, such as the caudate nucleus or the hippocampus. Our proposed shape representation can be optimized to compactly encode shape variations in a population at the needed scale and spatial locations, enabling the construction of more descriptive, nonglobal, nonuniform shape probability priors to be included in the segmentation and shape analysis framework. In particular, this representation addresses the shortcomings of techniques that learn a global shape prior at a single scale of analysis and cannot represent fine, local variations in a population of shapes in the presence of a limited dataset. Specifically, our technique defines a multiscale parametric model of surfaces belonging to the same population using a compact set of spherical wavelets targeted to that population. We further refine the shape representation by separating into groups wavelet coefficients that describe independent global and/or local biological variations in the population,- using spectral graph partitioning. We then learn a prior probability distribution induced over each group to explicitly encode these variations at different scales and spatial locations. Based on this representation, we derive a parametric active surface evolution using the multiscale prior coefficients as parameters for our optimization procedure to naturally include the prior for segmentation. Additionally, the optimization method can be applied in a coarse-to-fine manner. We apply our algorithm to two different brain structures, the caudate nucleus and the hippocampus, of interest in the study of schizophrenia. We show: 1) a reconstruction task of a test set to validate the expressiveness of our multiscale prior and 2) a segmentation task. In the reconstruction task, our results show that for a given training set size, our algorithm significantly improves the approximation of shapes in a testing set over the Point Distribution Model, which tends to oversmooth data. In the segmentation task, our validation shows our algorithm is computationally efficient and outperforms the Active Shape Model algorithm, by capturing finer shape details.", "paper_title": "Multiscale 3-D shape representation and segmentation using spherical wavelets", "paper_id": "WOS:000245599200016"}