{"auto_keywords": [{"score": 0.028918836564422505, "phrase": "manual_mode"}, {"score": 0.027820611961401606, "phrase": "autonomous_mode"}, {"score": 0.00481495049065317, "phrase": "spinal_cord"}, {"score": 0.004736045157669388, "phrase": "assistive_robot"}, {"score": 0.004658426838467567, "phrase": "small_dual_cohort_pilot_study"}, {"score": 0.004552237452269549, "phrase": "sci"}, {"score": 0.004403874076980828, "phrase": "wheelchair-mounted_robotic_arm"}, {"score": 0.004067910470129423, "phrase": "upper_limb_extremities"}, {"score": 0.003807529003314843, "phrase": "-place_iadl_tasks"}, {"score": 0.003732702104052828, "phrase": "users_post-sci"}, {"score": 0.0036836332308340923, "phrase": "irb_guidelines"}, {"score": 0.0032269483581856737, "phrase": "baseline_characteristics"}, {"score": 0.002707620139970122, "phrase": "comparable_task_completion_times"}, {"score": 0.002459660938061167, "phrase": "user's_level"}, {"score": 0.0024112587007106535, "phrase": "three-week_study"}, {"score": 0.002387415084371473, "phrase": "manual_mode_users"}, {"score": 0.002363806685815014, "phrase": "pronounced_learning_effect"}, {"score": 0.0023249757987087055, "phrase": "mean_task_completion_time"}, {"score": 0.002271679416337276, "phrase": "auto_mode_users"}, {"score": 0.002183134868203192, "phrase": "qualitative_feedback"}, {"score": 0.002168715943767454, "phrase": "quantitative_results"}, {"score": 0.002147265537489893, "phrase": "system_design"}, {"score": 0.0021049977753042253, "phrase": "better_performance_and_satisfaction_outcomes"}], "paper_keywords": ["Assistive robotics", " disability", " human-robot interaction", " spinal cord injury (SCI)", " user study"], "paper_abstract": "We report a small dual cohort pilot study with traumatic spinal cord injured (SCI) subjects designed to investigate the utility of a wheelchair-mounted robotic arm for these subjects. The UCF-MANUS, a vision-based 6DOF assistive robotic arm, has been designed to aid individuals with upper limb extremities to complete tasks of daily living that they would otherwise be unable to complete themselves. Pick-and-place IADL tasks were designed and ten (10) users post-SCI were selected under IRB guidelines to be trained and tested with the system for 1 to 2 h weekly over a period of three weeks. During this time, they controlled the robot either through a manual or an autonomous (supervised) mode of operation. Baseline characteristics (pre-study), quantitative performance metrics (during study), and psychometrics (post-study) were obtained and statistically analyzed to test a set of hypotheses related to performance and satisfaction with the two control modes. At the end of the study, both the autonomous and the manual mode had comparable task completion times while user effort required for operating the robot in autonomous mode was significantly less than that for the manual mode. However, the autonomous mode failed to commensurately raise the user's level of satisfaction. Over the three-week study, the manual mode users showed a pronounced learning effect in terms of reducing mean task completion time and number of commands while the auto mode users showed improvement in terms of reduction of variability. Based on qualitative feedback and quantitative results, possible directions for system design are presented to concurrently achieve better performance and satisfaction outcomes.", "paper_title": "How Autonomy Impacts Performance and Satisfaction: Results From a Study With Spinal Cord Injured Subjects Using an Assistive Robot", "paper_id": "WOS:000298299000001"}