{"auto_keywords": [{"score": 0.04957466661795797, "phrase": "social_network_data"}, {"score": 0.007152368807539886, "phrase": "privacy_protection_method"}, {"score": 0.004590820632326585, "phrase": "social_network_services"}, {"score": 0.00408151656213826, "phrase": "structural_information"}, {"score": 0.004064117897000019, "phrase": "statistical_analysis"}, {"score": 0.0035560167242229333, "phrase": "proposed_method"}, {"score": 0.0030847461428168614, "phrase": "social_network"}, {"score": 0.0029565620771207003, "phrase": "content_information"}, {"score": 0.002328434471939886, "phrase": "privacy_attacks"}, {"score": 0.002196342933346204, "phrase": "information_loss"}, {"score": 0.0021387992835532367, "phrase": "anonymized_social_network_data"}, {"score": 0.0021049977753042253, "phrase": "extensive_experiments"}], "paper_keywords": ["privacy", " social network", " data publication", " k-anonymity"], "paper_abstract": "Recently, social network services are rapidly growing and this trend is expected to continue in the future. Social network data can be published for various purposes such as statistical analysis and population studies. When social network data are published, however, the privacy of some people may be disclosed. The most straightforward manner to preserve privacy in social network data is to remove the identifiers of persons from the social network data. However, an adversary can infer the identity of a person in the social network by using his/her background knowledge, which consists of content information such as the age, sex, or address of the person and structural information such as the number of persons having a relationship with the person. In this paper, we propose a privacy protection method for social network data. The proposed method anonymizes social network data to prevent privacy attacks that use both content and structural information, while minimizing the information loss or distortion of the anonymized social network data. Through extensive experiments, we verify the effectiveness and applicability of the proposed method.", "paper_title": "A Privacy Protection Method for Social Network Data against Content/Degree Attacks", "paper_id": "WOS:000299588600017"}