{"auto_keywords": [{"score": 0.049707293588616405, "phrase": "physician_feedback"}, {"score": 0.015419639988206255, "phrase": "medical_literature_retrieval"}, {"score": 0.015301194423796127, "phrase": "case_queries"}, {"score": 0.00481495049065317, "phrase": "medical_thesauri"}, {"score": 0.004300310127339099, "phrase": "literature_articles"}, {"score": 0.004040211152784802, "phrase": "state-of-the-art_general_retrieval_methods"}, {"score": 0.003781005930058317, "phrase": "divergence_retrieval_model"}, {"score": 0.0037519951049571165, "phrase": "dirichlet"}, {"score": 0.0036648265911110164, "phrase": "state-of-the-art_general_retrieval_method"}, {"score": 0.0034973757768821546, "phrase": "mesh"}, {"score": 0.0034700069041302003, "phrase": "umls_thesauri"}, {"score": 0.00337650257503995, "phrase": "test_collection"}, {"score": 0.00331125524068286, "phrase": "imageclef_medical_case_retrieval_challenge"}, {"score": 0.0032094634756436595, "phrase": "well-tuned_state-of-the-art_general_retrieval_model"}, {"score": 0.0029453365339797933, "phrase": "proposed_methods"}, {"score": 0.002865929543375884, "phrase": "imageclef_test_collection"}, {"score": 0.0027995677499976406, "phrase": "best_collection"}, {"score": 0.0026299995767138304, "phrase": "small_evaluation_set_size"}, {"score": 0.00243237365704391, "phrase": "clinical_setting"}, {"score": 0.0024134449026937586, "phrase": "conclusion_medical_case-based_literature_retrieval"}, {"score": 0.002311933249234786, "phrase": "unique_challenges"}, {"score": 0.0022495644368875686, "phrase": "state-of-the-art_general_retrieval_models"}, {"score": 0.0021049977753042253, "phrase": "new_task-specific_retrieval_models"}], "paper_keywords": [""], "paper_abstract": "Objective This paper presents a study of methods for medical literature retrieval for case queries, in which the goal is to retrieve literature articles similar to a given patient case. In particular, it focuses on analyzing the performance of state-of-the-art general retrieval methods and improving them by the use of medical thesauri and physician feedback. Materials and Methods The Kullback-Leibler divergence retrieval model with Dirichlet smoothing is used as the state-of-the-art general retrieval method. Pseudorelevance feedback and term weighing methods are proposed by leveraging MeSH and UMLS thesauri. Evaluation is performed on a test collection recently created for the ImageCLEF medical case retrieval challenge. Results Experimental results show that a well-tuned state-of-the-art general retrieval model achieves a mean average precision of 0.2754, but the performance can be improved by over 40% to 0.3980, through the proposed methods. Discussion The results over the ImageCLEF test collection, which is currently the best collection available for the task, are encouraging. There are, however, limitations due to small evaluation set size. The analysis shows that further refinement of the methods is necessary before they can be really useful in a clinical setting. Conclusion Medical case-based literature retrieval is a critical search application that presents a number of unique challenges. This analysis shows that the state-of-the-art general retrieval models are reasonably good for the task, but the performance can be significantly improved by developing new task-specific retrieval models that incorporate medical thesauri and physician feedback.", "paper_title": "Leveraging medical thesauri and physician feedback for improving medical literature retrieval for case queries", "paper_id": "WOS:000307934600024"}