{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_permission_structure"}, {"score": 0.012695244357335721, "phrase": "permission_structure"}, {"score": 0.010531088772560235, "phrase": "conjunctive_approach"}, {"score": 0.004662705558154439, "phrase": "cooperative_game"}, {"score": 0.004372442291178139, "phrase": "maximal_gain"}, {"score": 0.004332471656145115, "phrase": "minimal_cost"}, {"score": 0.0037402558657576124, "phrase": "hierarchical_organization"}, {"score": 0.00327356326590461, "phrase": "cooperation_possibilities"}, {"score": 0.002985988377995789, "phrase": "fuzzy_permission_structures"}, {"score": 0.002461472107682778, "phrase": "direct_relations"}, {"score": 0.002183938718432764, "phrase": "indirect_relations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Cooperative game", " Shapley value", " Fuzzy set", " Fuzzy order"], "paper_abstract": "A cooperative game consists of a set of players and a characteristic function which determines the maximal gain or minimal cost that every subset of players can achieve when they decide to cooperate, regardless of the actions that the other players take. A permission structure over the set of players describes a hierarchical organization where there are players who need permission from certain other players before they are allowed to cooperate with others. Various assumptions can be made about how a permission structure affects the cooperation possibilities. In the conjunctive approach it is assumed that each player needs permission from all his superiors. This paper deals with fuzzy permission structures in the conjunctive approach. In this model, players could depend partially on other players, that is, they may have certain degree of autonomy. First, we define a value for games with fuzzy permission structure that only takes into account the direct relations among players and provide a characterization for this value. Finally, we study a value for games with fuzzy permission structure which takes account of the indirect relations among players. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Games with fuzzy permission structure: A conjunctive approach", "paper_id": "WOS:000338390100033"}