{"auto_keywords": [{"score": 0.046406428866983235, "phrase": "proposed_algorithm"}, {"score": 0.007740489563401459, "phrase": "pattern_reduction"}, {"score": 0.006939670903374905, "phrase": "previous_approaches"}, {"score": 0.006190343151117599, "phrase": "computation_time"}, {"score": 0.005660483797930007, "phrase": "training_process"}, {"score": 0.004604023526673226, "phrase": "simple_but_fast_codebook_generation_algorithm"}, {"score": 0.003661382948704217, "phrase": "input_vectors"}, {"score": 0.003380791705551809, "phrase": "final_solutions"}, {"score": 0.0032004205378150354, "phrase": "redundant_computations"}, {"score": 0.003152915289414825, "phrase": "later_iterations"}, {"score": 0.0026480044868438875, "phrase": "codeword_displacement"}, {"score": 0.0024694010306202073, "phrase": "cosines"}, {"score": 0.0022016885701010088, "phrase": "standard_gla"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Vector quantization", " Codebook generation", " Pattern reduction"], "paper_abstract": "In this paper, we present a simple but fast codebook generation algorithm, called PREGLA (Pattern Reduction Enhanced GLA). The proposed algorithm is fundamentally different from the previous approaches in that the previous approaches focus on reducing the size of the codebook whereas the proposed algorithm focuses on using pattern reduction to reduce the computation time. The proposed algorithm is motivated by the observation that input vectors that are \"static\" during the training process can be considered as part of the final solutions and thus can be compressed and removed to eliminate the redundant computations at the later iterations of the training process. To evaluate the performance of the proposed algorithm, we compare the proposed algorithm with \"efficient\" state-of-the-art GLA or GLA-based algorithms such as Codeword Displacement, Nearest Partition Set Search, Fast Vector Quantization Algorithm, Law of Cosines, and standard GLA. Our experimental results indicate that the proposed algorithm can reduce the computation time from 29.45% up to about 77.98% compared to those of standard GLA and other fast GLA-based algorithms alone. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A fast VQ codebook generation algorithm via pattern reduction", "paper_id": "WOS:000265727400001"}