{"auto_keywords": [{"score": 0.03986629341595467, "phrase": "tcd"}, {"score": 0.036625492030282626, "phrase": "critical_distance"}, {"score": 0.030020517971905462, "phrase": "short_cracks"}, {"score": 0.015719709579057044, "phrase": "critical_distances"}, {"score": 0.00952854167274304, "phrase": "critical_stress"}, {"score": 0.008956908962365373, "phrase": "experimental_data"}, {"score": 0.008059160858961927, "phrase": "stress_intensity"}, {"score": 0.004676173016967478, "phrase": "shape_memory_alloys"}, {"score": 0.004508286991825192, "phrase": "stress_concentrations"}, {"score": 0.004267643450023782, "phrase": "first_time"}, {"score": 0.0035153544006182834, "phrase": "stress_concentration"}, {"score": 0.003401431460601017, "phrase": "material_property"}, {"score": 0.0031845067058084583, "phrase": "linear_model"}, {"score": 0.0030143100083252516, "phrase": "non-linear_behaviour"}, {"score": 0.002780958897911242, "phrase": "sma_niti"}, {"score": 0.0026613618933208467, "phrase": "finite_element_model"}, {"score": 0.0026419338604879404, "phrase": "elastic_material_behaviour"}, {"score": 0.0025190541346053405, "phrase": "crack_length"}, {"score": 0.002500662348528587, "phrase": "notch_geometry"}, {"score": 0.0024106932919085097, "phrase": "prediction_errors"}], "paper_keywords": ["shape memory alloy", " fracture", " theory of critical distances", " finite element model", " short cracks", " R-curve"], "paper_abstract": "Components made from shape memory alloys (SMAs) such as nitinol often fail from stress concentrations and defects such as notches and cracks. It is shown here for the first time that these failures can be predicted using the theory of critical distances (TCDs), a method which has previously been used to study fracture and fatigue in other materials. The TCD uses the stress at a certain distance ahead of the notch to predict the failure of the material due to the stress concentration. The critical distance is believed to be a material property which is related to the microstructure of the material. The TCD is simply applied to a linear model of the material without the need to model the complication of its non-linear behaviour. The non-linear behaviour of the material at fracture is represented in the critical stress. The effect of notches and short cracks on the fracture of SMA NiTi was studied by analysing experimental data from the literature. Using a finite element model with elastic material behaviour, it is shown that the TCD can predict the effect of crack length and notch geometry on the critical stress and stress intensity for fracture, with prediction errors of less than 5%. The value of the critical distance obtained for this material was L=90m; this may be related to its grain size. The effects of short cracks on stress intensity were studied. It was shown that the same value of the critical distance (L=90m) could estimate the experimental data for both notches and short cracks.", "paper_title": "Can the theory of critical distances predict the failure of shape memory alloys?", "paper_id": "WOS:000291277300001"}