{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "nonfunctional_design_verification"}, {"score": 0.004753670676591174, "phrase": "embedded_software_systems"}, {"score": 0.0046632033374901715, "phrase": "model-based_design_verification"}, {"score": 0.004458722048888919, "phrase": "functional_and_nonfunctional_requirements"}, {"score": 0.0043181530164057135, "phrase": "mathematically_well-founded_theories"}, {"score": 0.003998531873723384, "phrase": "industrial_modeling_tools"}, {"score": 0.0037024804835018373, "phrase": "nonfunctional_verification_approaches"}, {"score": 0.003215295260684715, "phrase": "largely_ad_hoc"}, {"score": 0.003054450075234415, "phrase": "overarching_problem"}, {"score": 0.00299622333197717, "phrase": "functional_and_nonfunctional_verification"}, {"score": 0.0029203055813347874, "phrase": "widely_different_representations"}, {"score": 0.002535779689260244, "phrase": "latest_research"}], "paper_keywords": [""], "paper_abstract": "In model-based design verification, software models are checked against functional and nonfunctional requirements. Many of the mathematically well-founded theories developed for functional verification suffer from limitations (poor integration with industrial modeling tools and inability to scale to larger, more complicated systems) that restrict their practical adoption. Nonfunctional verification approaches, because of their inherent subjectivity (\"what does it mean for a system to be modifiable?\"), remain largely ad hoc and manual. There is also another overarching problem in that functional and nonfunctional verification take place on widely different representations of the system making it difficult to ensure that these representations are consistent with each other. This chapter highlights the latest research done into (1) a practical, formal, coverage-based functional verification approach called instrumentation-based verification, (2) quality attribute reasoning, a semiautomated, nonfunctional verification theory, and (3) an integrated functional and nonfunctional verification approach for model-based development.", "paper_title": "Functional and Nonfunctional Design Verification for Embedded Software Systems", "paper_id": "WOS:000291320500006"}