{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conceptual_design"}, {"score": 0.009420769552589657, "phrase": "cognitive_processes"}, {"score": 0.004672953146379813, "phrase": "creative_process"}, {"score": 0.004508048086020253, "phrase": "customer_needs"}, {"score": 0.004096082254543022, "phrase": "new_ideas"}, {"score": 0.003789137457228946, "phrase": "design_support_methods"}, {"score": 0.0034220655476652683, "phrase": "design_ideas"}, {"score": 0.0028586409810976367, "phrase": "design_entities"}, {"score": 0.002708399936381754, "phrase": "protocol_analysis"}, {"score": 0.002445767214680791, "phrase": "creative_patterns"}, {"score": 0.002416589459425828, "phrase": "stimulating_relationships"}, {"score": 0.0022758279600841014, "phrase": "creative_design_behavior"}, {"score": 0.0021049977753042253, "phrase": "design_process"}], "paper_keywords": ["Analogy, Cognitive Model, Cognitive Process, Conceptual Design, Protocol Analysis", " Stimulation"], "paper_abstract": "Conceptual design is a creative process Designers create functions to satisfy customer needs and behaviors and forms to fulfill their functions Although cognitive processes are at the center in developing new ideas, they are rarely taken into account in research and development of design support methods and systems. It is conceivable that if one understands how cognitive processes are stimulated to generate design ideas, then more effective methods and tools can be developed to support conceptual design In this article, a cognitive model of conceptual design is developed to capture the relationships among design entities. design operations, and cognitive processes A protocol analysis is performed to evaluate the model. and a cognitive experiment carried out to study the creative patterns and stimulating relationships. The results show that designers exhibit patterns of creative design behavior, and that these patterns can be captured and instilled into the design process to promote creativity", "paper_title": "Creative patterns and stimulation in conceptual design", "paper_id": "WOS:000277188000005"}