{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "boolean_grammars"}, {"score": 0.0073197529662824825, "phrase": "boolean_grammar"}, {"score": 0.005920423094682899, "phrase": "normal_form"}, {"score": 0.004681758542328565, "phrase": "boolean"}, {"score": 0.00437302709192313, "phrase": "promising_extension"}, {"score": 0.004338076511024884, "phrase": "context-free_grammars"}, {"score": 0.004217925382695912, "phrase": "rule_bodies"}, {"score": 0.004068302313449334, "phrase": "novel_semantics"}, {"score": 0.003845994935767022, "phrase": "key_idea"}, {"score": 0.003694652993546994, "phrase": "logic_programming"}, {"score": 0.003592258384936271, "phrase": "so-called_well-founded_semantics"}, {"score": 0.003437036036889996, "phrase": "\"correct\"_approach"}, {"score": 0.003010347277067459, "phrase": "least_fixed-point"}, {"score": 0.002722634472231842, "phrase": "new_semantics"}, {"score": 0.0024133533748653033, "phrase": "main_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "Boolean grammars [A. Okhotin, Boolean grammars, Information and Computation 194 (1) (2004) 19-48] are a promising extension of context-free grammars that supports conjunction and negation in rule bodies. In this paper, we give a novel semantics for Boolean grammars which applies to all such grammars, independently of their syntax. The key idea of our proposal comes from the area of negation in logic programming, and in particular from the so-called well-founded semantics which is widely accepted in this area to be the \"correct\" approach to negation. We show that for every Boolean grammar there exists a distinguished (three-valued) interpretation of the non-terminal symbols, which satisfies all the rules of the grammar and at the same time is the least fixed-point of an operator associated with the grammar. Then, we demonstrate that every Boolean grammar can be transformed into an equivalent (under the new semantics) grammar in normal form. Based on this normal form, we propose an O(n(3)) algorithm for parsing that applies to any such normalized Boolean grammar. In summary, the main contribution of this paper is to provide a semantics which applies to all Boolean grammars while at the same time retaining the complexity of parsing associated with this type of grammars. (c) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Well-founded semantics for Boolean grammars", "paper_id": "WOS:000268965600003"}