{"auto_keywords": [{"score": 0.03818988992284084, "phrase": "openid_providers"}, {"score": 0.00481495049065317, "phrase": "reputation_management"}, {"score": 0.004776297980616768, "phrase": "openid._openid"}, {"score": 0.004718897469501381, "phrase": "open_standard"}, {"score": 0.0046621835537196754, "phrase": "decentralized_authentication_mechanism"}, {"score": 0.00419823857480455, "phrase": "single_identifier"}, {"score": 0.0041144374213500715, "phrase": "interesting_added-value"}, {"score": 0.00398380712846857, "phrase": "different_services"}, {"score": 0.003780286517897356, "phrase": "new_account"}, {"score": 0.003459191419478298, "phrase": "end_users"}, {"score": 0.0033223686422055834, "phrase": "service_provider"}, {"score": 0.003216804708106142, "phrase": "personal_information"}, {"score": 0.0031398318568608505, "phrase": "reputation_management_solution"}, {"score": 0.0030646951765987414, "phrase": "openid_protocol"}, {"score": 0.0027150658583211746, "phrase": "reputation_framework"}, {"score": 0.0023762535034673017, "phrase": "different_service_providers"}, {"score": 0.0023287359930308864, "phrase": "users'_experience"}, {"score": 0.002300681752315682, "phrase": "openid._besides"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Single Sign-On", " Reputation", " OpenID", " User-centric", " Identity management"], "paper_abstract": "OpenID is an open standard providing a decentralized authentication mechanism to end users. It is based on a unique URL (Uniform Resource Locator) or XRI (Extensible Resource Identifier) as identifier of the user. This fact of using a single identifier confers this approach an interesting added-value when users want to get access to different services in the Internet, since users do not need to create a new account on every website they are visiting. However, OpenID providers are normally used as a point to store certain personal attributes of the end users too, which might be of interest for any service provider willing to make profit from collecting that personal information. The definition of a reputation management solution integrated as part of the OpenID protocol can help users to determine whether a given service provider is more or less reliable before interacting with it and transferring their private information. This paper is providing the definition of a reputation framework that can be applied to the OpenID SSO (Single Sign-On) standard solution. It also defines how the protocol itself can be enhanced so OpenID providers can collect (and provide) recommendations from (to) users regarding different service providers and thus enhancing the users' experience when using OpenID. Besides the definition, a set of tests has been performed validating the feasibility of the framework. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Towards the integration of reputation management in OpenID", "paper_id": "WOS:000331162800002"}