{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "sentiment_analysis"}, {"score": 0.004768378525561471, "phrase": "semi-supervised_learning"}, {"score": 0.004737579882204798, "phrase": "multi-dimensional_classifiers"}, {"score": 0.004616352597792864, "phrase": "computational_study"}, {"score": 0.004425909662226326, "phrase": "broad_field"}, {"score": 0.004270888854681611, "phrase": "sentiment_polarity_classification"}, {"score": 0.004148084083511323, "phrase": "positive_or_negative_sentiment"}, {"score": 0.004107935669507044, "phrase": "subjectivity_classification"}, {"score": 0.0038003739322536156, "phrase": "real-world_problem"}, {"score": 0.00318967782444942, "phrase": "multi-label_learning_techniques"}, {"score": 0.0029795342727066696, "phrase": "first_time"}, {"score": 0.002922069655177295, "phrase": "novel_multidimensional_classification_paradigm"}, {"score": 0.002893753089970741, "phrase": "sentiment_analysis_domain"}, {"score": 0.0028104345972072534, "phrase": "different_target_variables"}, {"score": 0.002711842889248926, "phrase": "potential_statistical_relations"}, {"score": 0.0025829353063908256, "phrase": "huge_amount"}, {"score": 0.002566215899764421, "phrase": "unlabelled_information"}, {"score": 0.0024601402359002056, "phrase": "multidimensional_classification_framework"}, {"score": 0.002436289099444074, "phrase": "semi-supervised_domain"}, {"score": 0.002246292543825748, "phrase": "recognition_rates"}, {"score": 0.0021464286727045623, "phrase": "future_sentiment_analysis_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Sentiment Analysis", " Multi-dimensional classification", " Multi-dimensional class Bayesian network classifiers", " Semi-supervised learning", " EM algorithm"], "paper_abstract": "Sentiment Analysis is defined as the computational study of opinions, sentiments and emotions expressed in text. Within this broad field, most of the work has been focused on either Sentiment Polarity classification, where a text is classified as having positive or negative sentiment, or Subjectivity classification, in which a text is classified as being subjective or objective. However, in this paper, we consider instead a real-world problem in which the attitude of the author is characterised by three different (but related) target variables: Subjectivity, Sentiment Polarity, Will to Influence, unlike the two previously stated problems, where there is only a single variable to be predicted. For that reason, the (uni-dimensional) common approaches used in this area yield to suboptimal solutions to this problem. Somewhat similar happens with multi-label learning techniques which cannot directly tackle this problem. In order to bridge this gap, we propose, for the first time, the use of the novel multidimensional classification paradigm in the Sentiment Analysis domain. This methodology is able to join the different target variables in the same classification task so as to take advantage of the potential statistical relations between them. In addition, and in order to take advantage of the huge amount of unlabelled information available nowadays in this context, we propose the extension of the multidimensional classification framework to the semi-supervised domain. Experimental results for this problem show that our semi-supervised multi-dimensional approach outperforms the most common Sentiment Analysis approaches, concluding that our approach is beneficial to improve the recognition rates for this problem, and in extension, could be considered to solve future Sentiment Analysis problems. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Approaching Sentiment Analysis by using semi-supervised learning of multi-dimensional classifiers", "paper_id": "WOS:000305659800013"}