{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "robotic_autonomous_agents"}, {"score": 0.0046834372388970405, "phrase": "joint_application"}, {"score": 0.0045765783794477505, "phrase": "robotics_and_web_services"}, {"score": 0.004270347498153512, "phrase": "new_integrated_framework"}, {"score": 0.004002972723329302, "phrase": "robotic_systems"}, {"score": 0.003911578552479064, "phrase": "real_world"}, {"score": 0.0031333949463567554, "phrase": "robotic_domain"}, {"score": 0.0026651772919894534, "phrase": "new_framework"}, {"score": 0.0026163210719740847, "phrase": "robotic_agents"}, {"score": 0.0024636239664210433, "phrase": "software_agents"}, {"score": 0.002396179086883187, "phrase": "additional_information"}, {"score": 0.002363150587804677, "phrase": "web_logical_world"}, {"score": 0.0023305762840188145, "phrase": "intelligent_administration"}, {"score": 0.0022458849724980904, "phrase": "different_environments"}, {"score": 0.002164264600379492, "phrase": "practical_problems"}, {"score": 0.0021049977753042253, "phrase": "traffic_control_application"}], "paper_keywords": ["Robots", " Autonomous agents", " Artificial Intelligence", " Web services", " Ontologies"], "paper_abstract": "In this paper a joint application of Artificial Intelligence (AI), robotics and Web services is described. The aim of the work presented here was to create a new integrated framework that keeps advantage on one side of the sensing and exploring capabilities of the robotic systems that work in the real world and, on the other side, of the information available via Web. Robots are conceived like (semi-)autonomous systems able to explore and manipulate a portion of their environment in order to find and collect information and data. On the other hand, the Web, that in a robotic domain is usually considered like a channel of communication (e.g. tele-operation, tele-manipulation), here is conceived also like a source of knowledge. This allows to define a new framework able to manage robotic agents in order to get precise, real-time information from the real world. Besides, software agents may search for and get additional information from the Web logical world. The intelligent administration of these services can be applied in different environments and leads to optimize procedures and solve practical problems. To this end a traffic control application has been defined and a simplified test-case implemented. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "An intelligent framework to manage robotic autonomous agents", "paper_id": "WOS:000288343900118"}