{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tunnel_surveillance_application"}, {"score": 0.0046928556063004214, "phrase": "integrated_solution"}, {"score": 0.004344755264641137, "phrase": "practical_constraints"}, {"score": 0.004307700591183651, "phrase": "real-time_operation"}, {"score": 0.004270960586542813, "phrase": "poor_imaging_conditions"}, {"score": 0.0041984140090404985, "phrase": "decentralized_architecture"}, {"score": 0.003988055287053139, "phrase": "non-overlapping_cameras"}, {"score": 0.003598317040926701, "phrase": "previous_camera"}, {"score": 0.003477029725200912, "phrase": "computational_load"}, {"score": 0.0031505544969981096, "phrase": "adaboost_cascade"}, {"score": 0.0030705342386533083, "phrase": "composite_confidence_score"}, {"score": 0.002746549549029177, "phrase": "identification_problem"}, {"score": 0.0026767629720554397, "phrase": "compact_binary_'vehicle_fingerprint"}, {"score": 0.0026312238938540787, "phrase": "minimal_bandwidth"}, {"score": 0.002373767863833987, "phrase": "'tracking-by-identification'_yields"}, {"score": 0.0021973099304606076, "phrase": "general_multi-camera_framework"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Vehicle detection", " Multi-camera tracking", " AdaBoost", " Tunnel surveillance"], "paper_abstract": "This paper presents an integrated solution for the problem of detecting, tracking and identifying vehicles in a tunnel surveillance application, taking into account practical constraints including real-time operation, poor imaging conditions, and a decentralized architecture. Vehicles are followed through the tunnel by a network of non-overlapping cameras. They are detected and tracked in each camera and then identified, i.e. matched to any of the vehicles detected in the previous camera (s). To limit the computational load, we propose to reuse the same set of Haar-features for each of these steps. For the detection, we use an AdaBoost cascade. Here we introduce a composite confidence score, integrating information from all stages of the cascade. A subset of the features used for detection is then selected, optimizing for the identification problem. This results in a compact binary 'vehicle fingerprint', requiring minimal bandwidth. Finally, we show that the same subset of features can also be used effectively for tracking. This Haar-features based 'tracking-by-identification' yields surprisingly good results on standard datasets, without the need to update the model online. The general multi-camera framework is validated using three tunnel surveillance videos. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Efficient multi-camera vehicle detection, tracking, and identification in a tunnel surveillance application", "paper_id": "WOS:000303430200007"}