{"auto_keywords": [{"score": 0.04963913874714364, "phrase": "geodesic_control"}, {"score": 0.015719716506582538, "phrase": "flexible_objects"}, {"score": 0.004661868629458321, "phrase": "effective_and_intuitive_method"}, {"score": 0.004597754207658615, "phrase": "flexible_models"}, {"score": 0.004309968592440261, "phrase": "easy_task"}, {"score": 0.004231089088705995, "phrase": "high_dimensionality"}, {"score": 0.0041154571996523505, "phrase": "low_dimensionality"}, {"score": 0.003616108223034427, "phrase": "core_idea"}, {"score": 0.0034528025626422154, "phrase": "flexible_object"}, {"score": 0.003358368814209542, "phrase": "geodesic_line"}, {"score": 0.0027784560880013886, "phrase": "\"furoshiki_wrapping"}, {"score": 0.0023091093387071593, "phrase": "different_combinations"}, {"score": 0.002164264600379492, "phrase": "computer_animation"}, {"score": 0.0021049977753042253, "phrase": "virtual_reality_systems"}], "paper_keywords": [""], "paper_abstract": "We propose an effective and intuitive method for controlling flexible models such as ropes and cloth. Automating manipulation of such flexible objects is not an easy task due to the high dimensionality of the objects and the low dimensionality of the control. In order to cope with this problem, we introduce a method called Geodesic Control, which greatly helps to manipulate flexible objects. The core idea is to decrease the degrees of freedom of the flexible object by moving it along the geodesic line of the object that it is interacting with. By repeatedly applying this control, users can easily synthesize animations of twisting and knotting a piece of rope or wrapping a cloth around an object. We show examples of \"furoshiki wrapping\", in which an object is wrapped by a cloth by a series of maneuvers based on Geodesic Control. As our representation can abstract such maneuvers well, the procedure designed by a user can be re-applied for different combinations of cloth and an object. The method is applicable not only for computer animation but also for 3D computer games and virtual reality systems.", "paper_title": "Manipulation of Flexible Objects by Geodesic Control", "paper_id": "WOS:000306181100013"}