{"auto_keywords": [{"score": 0.04840510140756549, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.015719834271734075, "phrase": "pcm"}, {"score": 0.009255820318013936, "phrase": "witness_anonymity"}, {"score": 0.00459186790405058, "phrase": "extensive_research_work"}, {"score": 0.004276390289178831, "phrase": "anonymity_issue"}, {"score": 0.0040943214728975845, "phrase": "secure_routing"}, {"score": 0.004062057297453209, "phrase": "data_forwarding"}, {"score": 0.0038737214010638745, "phrase": "increasing_interest"}, {"score": 0.003522749900725601, "phrase": "challenging_problem"}, {"score": 0.00344007531836105, "phrase": "anonymous_sources"}, {"score": 0.003190817088774159, "phrase": "malicious_or_selfish_users"}, {"score": 0.003066945490483524, "phrase": "distinct_users"}, {"score": 0.002947868524740683, "phrase": "malicious_or_selfish_user"}, {"score": 0.0027450280220853137, "phrase": "malicious_user"}, {"score": 0.0027126012542151015, "phrase": "multiple_invalid_claims"}, {"score": 0.0023613726075968986, "phrase": "proper_and_efficient_executions"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["privacy-preserving", " misbehavior detection", " mobile ad hoc networks"], "paper_abstract": "Although extensive research work has been undertaken to secure mobile ad hoc networks, till recently, researchers began to pay attention to the anonymity issue, and this issue was investigated mainly in terms of secure routing and data forwarding. We indicate that, in mobile ad hoc networks, there is an increasing interest in providing anonymity for the witnesses, i.e., those users who share their knowledge in detecting either malicious or selfish users. On the other hand, it is also a challenging problem to prevent the misuse of anonymous sources. In this paper, we propose the PlainClothesMan (PCM) protocol to provide anonymity for the witness who helps identify malicious or selfish users. Once there are more than a certain number of claims from distinct users against the same user, she is identified as a malicious or selfish user. Moreover, in PCM, the misuse of the witness anonymity is prevented in such a way that any malicious user who broadcasts multiple invalid claims against the same user for the same reason can be identified. Two exemplary scenarios are designed and simulated to model the necessities of witness anonymity in mobile ad hoc networks. Simulation results show that witness anonymity is very important for ensuring proper and efficient executions of fundamental functionalities of mobile ad hoc networks, e.g., certificate revocation and fairness, and PCM is both effective and efficient in providing such a type of anonymity. Copyright (C) 2009 John Wiley & Sons, Ltd.", "paper_title": "PCM: a privacy-preserving detection mechanism in mobile ad hoc networks", "paper_id": "WOS:000277157600006"}