{"auto_keywords": [{"score": 0.04080884345935393, "phrase": "inhibitor_series"}, {"score": 0.004245476558619167, "phrase": "histone_deacetylase"}, {"score": 0.003743102131902864, "phrase": "protein_receptor"}, {"score": 0.003682100144121148, "phrase": "active_site"}, {"score": 0.0034859114764790953, "phrase": "catalyst"}, {"score": 0.003373101013123386, "phrase": "training_set"}, {"score": 0.003318108914777263, "phrase": "structurally_aligned_inhibitor_series"}, {"score": 0.0027691111795848183, "phrase": "sybyl"}, {"score": 0.002709045632654716, "phrase": "pls_module"}, {"score": 0.002508867228980776, "phrase": "simultaneous_mapping"}, {"score": 0.0024143815950383647, "phrase": "selected_inhibitor_structure"}, {"score": 0.002187402374176248, "phrase": "test_sets"}, {"score": 0.0021399277552314067, "phrase": "prediction_accuracy"}], "paper_keywords": ["3D-QSAR", " CoMFA", " CoMSIA", " Catalyst", " GOLD", " Consensus QSAR"], "paper_abstract": "Three consensus 3D-QSAR (c-3D-QSAR) models were built for 38, 34, and 78 inhibitors of beta-secretase, histone deacetylase, and farnesyltransferase, respectively. To build an individual 3D-QSAR model, the structures of an inhibitor series are aligned through docking of a protein receptor into the active site using the program GOLD. CoMFA, CoMSIA, and Catalyst are then performed for the training set of each structurally aligned inhibitor series to obtain a 3D-QSAR model. Since the consensus in features identified is high for the same pharmacophore features selected for building a 3D-QSAR model by a 3D-QSAR method, a c-3D-QSAR model for each inhibitor series is constructed by combining the pharmacophore features selected for building the 3D-QSAR model using the SYBYL spread sheet and PLS module. Each c-3D-QSAR pharmacophore model built was examined visually and compared with that obtained by simultaneous mapping of the corresponding 3D-QSAR pharmacophores built onto a selected inhibitor structure. It was found that the c-3D-QSAR model built for an inhibitor series improves not only the overall prediction statistics for both training and test sets but also the prediction accuracy for some less active inhibitors of the series.", "paper_title": "Developing consensus 3D-QSAR and pharmacophore models for several beta-secretase, farnesyl transferase and histone deacetylase inhibitors", "paper_id": "WOS:000299769700026"}