{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "camera_views"}, {"score": 0.015617698762345191, "phrase": "live_broadcasting"}, {"score": 0.015516332655365372, "phrase": "sport_events"}, {"score": 0.0046437283535486545, "phrase": "technical_director"}, {"score": 0.00446384610114756, "phrase": "best_camera_shots"}, {"score": 0.0044199701363984495, "phrase": "available_video_sources"}, {"score": 0.004376523540676604, "phrase": "challenging_task"}, {"score": 0.0038616499489536123, "phrase": "great_amount"}, {"score": 0.003384754649268796, "phrase": "broadcasting_organizations"}, {"score": 0.0032858160838749196, "phrase": "system_multicamba"}, {"score": 0.003221463787552773, "phrase": "live_broadcasting_task"}, {"score": 0.0028420886366761094, "phrase": "location-dependent_queries"}, {"score": 0.0026782730431380913, "phrase": "line_real-image_processing_techniques"}, {"score": 0.00242590924077914, "phrase": "real-time_data"}, {"score": 0.002394104138423188, "phrase": "real_objects"}, {"score": 0.0022860268828044134, "phrase": "high-level_semantic_features"}, {"score": 0.0021470954708827125, "phrase": "experimental_results"}], "paper_keywords": ["Content selection in run-time", " Mobile multi-camera management", " Location-aware systems"], "paper_abstract": "For a Technical Director (TD) in charge of a live broadcasting, selecting the best camera shots among the available video sources is a challenging task, even more now that the number of cameras (some of them mobile, or attached to moving objects) in the broadcasting of sport events is increasing. So, the TD needs to manage a great amount of continuously changing information to quickly select the camera whose view should be broadcasted. Besides, the better the decisions made by the TD, the more interesting the content for the audience. Therefore, the development of systems that could help the TD with the selection of camera views is demanded by broadcasting organizations. In this paper, we present the system MultiCAMBA that helps TDs in the live broadcasting task by allowing them to indicate in run-time their interest in certain kind of shots, and the system will show the cameras that are able to provide them. To achieve this task, the system manages location-dependent queries generated according to the interests of the TD. Moreover, to avoid the use of costly on line real-image processing techniques over the camera views, such real camera views are recreated in a 3D engine by using the information contained in a 3D model of the scenario. This model is updated continuously with real-time data retrieved from the real objects and cameras in the scenario. In this way, the system extracts high-level semantic features of 2D projections of the 3D reconstruction of the camera views. We present a prototype of the system and experimental results that show the feasibility of our proposal.", "paper_title": "MultiCAMBA: a system for selecting camera views in live broadcasting of sport events using a dynamic 3D model", "paper_id": "WOS:000354898800021"}