{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fpga"}, {"score": 0.004757643419056999, "phrase": "real-time_speech_recognition"}, {"score": 0.004617328272121826, "phrase": "spiking_neural_networks"}, {"score": 0.004322967486451877, "phrase": "digital_and_analog_hardware"}, {"score": 0.004220624516321415, "phrase": "classic_neural_networks"}, {"score": 0.00407161650109722, "phrase": "application_driven_digital_hardware_exploration"}, {"score": 0.00374399358035391, "phrase": "recurrent_neural_network"}, {"score": 0.002790867657645595, "phrase": "neural_networks"}, {"score": 0.0026760974046034854, "phrase": "real-time_processing"}, {"score": 0.002597012212823168, "phrase": "leaky_integrate-and-fire_membranes"}, {"score": 0.002387758958649797, "phrase": "large_hardware_design_space"}, {"score": 0.0023592715993204796, "phrase": "spiking_neural_network"}, {"score": 0.002262209824105154, "phrase": "existing_architectures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["liquid state machine", " spiking neural network", " FPGA", " speech recognition"], "paper_abstract": "Hardware implementations of Spiking Neural Networks are numerous because they are well suited for implementation in digital and analog hardware, and outperform classic neural networks. This work presents an application driven digital hardware exploration where we implement real-time, isolated digit speech recognition using a Liquid State Machine. The Liquid State Machine is a recurrent neural network of spiking neurons where only the output layer is trained. First we test two existing hardware architectures which we improve and extend, but that appears to be too fast and thus area consuming for this application. Next, we present a scalable, serialized architecture that allows a very compact implementation of spiking neural networks that is still fast enough for real-time processing. All architectures Support leaky integrate-and-fire membranes with exponential synaptic models. This work shows that there is actually a large hardware design space of Spiking Neural Network hardware that can be explored. Existing architectures have only spanned part of it. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Compact hardware liquid state machines on FPGA for real-time speech recognition", "paper_id": "WOS:000255238800043"}