{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_motions"}, {"score": 0.04350641237861327, "phrase": "human_motion"}, {"score": 0.0047797212183363835, "phrase": "realistic_virtual_bodies"}, {"score": 0.004744748477093856, "phrase": "recent_advances"}, {"score": 0.004675565200598801, "phrase": "data-driven_animation"}, {"score": 0.0045736684402340275, "phrase": "compelling_characters"}, {"score": 0.00454019648854141, "phrase": "impressive_levels"}, {"score": 0.004457579615095599, "phrase": "data-driven_techniques"}, {"score": 0.004296809240805996, "phrase": "original_motion"}, {"score": 0.004187718090913465, "phrase": "high_complexity"}, {"score": 0.004111488691642256, "phrase": "better_understanding"}, {"score": 0.00391969808162005, "phrase": "great_value"}, {"score": 0.0038061298318563925, "phrase": "appealing_virtual_characters"}, {"score": 0.003778253716938922, "phrase": "realistic_motion"}, {"score": 0.0036285315458900284, "phrase": "thirty_actors"}, {"score": 0.003261547125192671, "phrase": "perceptual_experiments"}, {"score": 0.0030414140732789186, "phrase": "individual's_different_gaits"}, {"score": 0.0027946649584841754, "phrase": "body_motion"}, {"score": 0.0027437235598539904, "phrase": "dancing_motions"}, {"score": 0.002539689093411356, "phrase": "different_motion"}, {"score": 0.0024933837962398267, "phrase": "average_motions"}, {"score": 0.0023164335087514252, "phrase": "caucasian_european"}, {"score": 0.002282588233957493, "phrase": "asian"}, {"score": 0.0021205548157547495, "phrase": "caucasian_actors"}], "paper_keywords": ["human animation", " perception", " motion capture"], "paper_abstract": "Recent advances in rendering and data-driven animation have enabled the creation of compelling characters with impressive levels of realism. While data-driven techniques can produce animations that are extremely faithful to the original motion, many challenging problems remain because of the high complexity of human motion. A better understanding of the factors that make human motion recognizable and appealing would be of great value in industries where creating a variety of appealing virtual characters with realistic motion is required. To investigate these issues, we captured thirty actors walking, jogging and dancing, and applied their motions to the same virtual character (one each for the males and females). We then conducted a series of perceptual experiments to explore the distinctiveness and attractiveness of these human motions, and whether characteristic motion features transfer across an individual's different gaits. Average faces are perceived to be less distinctive but more attractive, so we explored whether this was also true for body motion. We found that dancing motions were most easily recognized and that distinctiveness in one gait does not predict how recognizable the same actor is when performing a different motion. As hypothesized, average motions were always amongst the least distinctive and most attractive. Furthermore, as 50% of participants in the experiment were Caucasian European and 50% were Asian Korean, we found that the latter were as good as or better at recognizing the motions of the Caucasian actors than their European counterparts, in particular for dancing males, whom they also rated more highly for attractiveness.", "paper_title": "Evaluating the Distinctiveness and Attractiveness of Human Motions on Realistic Virtual Bodies", "paper_id": "WOS:000326923200048"}