{"auto_keywords": [{"score": 0.046258503538949974, "phrase": "zadeh"}, {"score": 0.00481495049065317, "phrase": "sonar_data"}, {"score": 0.0041211075804202905, "phrase": "map_building"}, {"score": 0.004092695445765521, "phrase": "autonomous_mobile_robots"}, {"score": 0.0036384794303356413, "phrase": "linguistic_descriptions"}, {"score": 0.0035884582625234297, "phrase": "fuzzy_rules"}, {"score": 0.003551392586900308, "phrase": "main_difference"}, {"score": 0.0030814613175385703, "phrase": "probabilistic_approaches"}, {"score": 0.0029662917511334604, "phrase": "previous_fuzzy_models"}, {"score": 0.0029356335847783195, "phrase": "controlled_experimentation"}, {"score": 0.0029052913631676435, "phrase": "real_robot"}, {"score": 0.0027677775883341556, "phrase": "qualitative_and_quantitative_comparison"}, {"score": 0.002739165532192527, "phrase": "estimated_maps"}, {"score": 0.002701474449898187, "phrase": "probabilistic_approach"}, {"score": 0.0026735459686033627, "phrase": "previous_fuzzy_method"}, {"score": 0.0026459054525234706, "phrase": "new_antonyms-based_fuzzy_approach"}, {"score": 0.00254697318939512, "phrase": "antonyms-based_approach"}, {"score": 0.0022717738872652013, "phrase": "low_resolution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Computing with perceptions", " Robotic mapping", " Antonyms", " Fuzzy maps", " Occupancy grid", " Sonar-sensors"], "paper_abstract": "This work, inspired by the idea of \"Computing with Words and Perceptions\" proposed by Zadeh in [57,59], focuses on how to transform measurements into perceptions [22] for the problem of map building by Autonomous Mobile Robots. We propose to model the perceptions obtained from sonar-sensors as two grid maps: one for obstacles and another for empty-spaces. The rules used to build and integrate these maps are expressed by linguistic descriptions and modeled by fuzzy rules. The main difference of this approach from other studies reported in the literature is that the method presented here is based on the hypothesis that the concepts \"occupied\" and \"empty\" are antonyms rather than complementary (as it happens in probabilistic approaches), or independent (as it happens in the previous fuzzy models). Controlled experimentation with a real robot in three representative indoor environments has been performed and the results presented. We offer a qualitative and quantitative comparison of the estimated maps obtained by the probabilistic approach, the previous fuzzy method and the new antonyms-based fuzzy approach. It is shown that the maps obtained with the antonyms-based approach are better defined, capture better the shape of the walls and of the empty-spaces, and contain less errors due to rebounds and short-echoes. Furthermore, in spite of noise and low resolution inherent to the sonar-sensors used, the maps obtained are accurate and-tolerant to imprecision. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Approximate robotic mapping from sonar data by modeling perceptions with antonyms", "paper_id": "WOS:000281979600005"}