{"auto_keywords": [{"score": 0.041435594524021443, "phrase": "cloud_paradigm"}, {"score": 0.004814981956239168, "phrase": "sla"}, {"score": 0.004750527930368202, "phrase": "broker_for_cloud_infrastructures"}, {"score": 0.003777800904236079, "phrase": "non_commercial_contexts"}, {"score": 0.0035794251590584563, "phrase": "volunteer_computing"}, {"score": 0.003406713877432236, "phrase": "mix_nodes"}, {"score": 0.00333097896868937, "phrase": "potentially_any_owners"}, {"score": 0.003256922225995089, "phrase": "high_computational_resources"}, {"score": 0.0030307927228223883, "phrase": "first_step"}, {"score": 0.002910545717767559, "phrase": "service_level_agreement_facilities"}, {"score": 0.0027950561494657633, "phrase": "main_issues"}, {"score": 0.00257760787870709, "phrase": "service_level_requirements"}, {"score": 0.0024864612830452254, "phrase": "framework_core_architecture"}, {"score": 0.0024202176034746337, "phrase": "architecture's_modules"}, {"score": 0.0022118619998034742, "phrase": "behavioural_viewpoints"}, {"score": 0.002143247921132179, "phrase": "early_implementation_prototype"}, {"score": 0.0021049977753042253, "phrase": "real_testing_environment"}], "paper_keywords": ["Cloud computing", " Cloud@Home", " SLA", " QoS", " Resource brokering"], "paper_abstract": "The breakthrough of Cloud comes from its service oriented perspective where everything, including the infrastructure, is provided \"as a service\". This model is really attractive and convenient for both providers and consumers, as a consequence the Cloud paradigm is quickly growing and widely spreading, also in non commercial contexts. In such a scenario, we propose to incorporate some elements of volunteer computing into the Cloud paradigm through the Cloud@Home solution, involving into the mix nodes and devices provided by potentially any owners or administrators, disclosing high computational resources to contributors and also allowing to maximize their utilization. This paper presents and discusses the first step towards Cloud@Home: providing quality of service and service level agreement facilities on top of unreliable, intermittent Cloud providers. Some of the main issues and challenges of Cloud@Home, such as the monitoring, management and brokering of resources according to service level requirements are addressed through the design of a framework core architecture. All the tasks committed to the architecture's modules and components, as well as the most relevant component interactions, are identified and discussed from both the structural and the behavioural viewpoints. Some encouraging experiments on an early implementation prototype deployed in a real testing environment are also documented in the paper.", "paper_title": "An SLA-based Broker for Cloud Infrastructures", "paper_id": "WOS:000315565500001"}