{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "routing_policy"}, {"score": 0.03309727757176553, "phrase": "system_reliability"}, {"score": 0.015425482772094134, "phrase": "time_threshold"}, {"score": 0.013967501136462284, "phrase": "minimum_transmission_time"}, {"score": 0.009648718328485595, "phrase": "minimal_paths"}, {"score": 0.004546755482549647, "phrase": "lead_time"}, {"score": 0.004418287966422041, "phrase": "quickest_path_problem"}, {"score": 0.003773680962197766, "phrase": "logistics_networks"}, {"score": 0.003253791343615811, "phrase": "multistate_network"}, {"score": 0.003087017178815267, "phrase": "specified_amount"}, {"score": 0.002845883666777154, "phrase": "solution_procedure"}, {"score": 0.00263612191603326, "phrase": "network_administrator"}, {"score": 0.002488985155689794, "phrase": "second_priority_pairs"}, {"score": 0.0024301229420875155, "phrase": "second_one"}, {"score": 0.0023613185213421173, "phrase": "transmission_duty"}, {"score": 0.002327648608736437, "phrase": "first_one"}], "paper_keywords": ["System reliability", " Routing policy", " Priority", " Two minimal paths", " Time threshold", " Multistate network"], "paper_abstract": "Two attributes, the capacity and the lead time, are involved in the quickest path problem which finds a path with the minimum transmission time. The capacity of each edge is assumed to be deterministic in this problem. However, in many real-life networks such as computer, telecommunication, logistics networks, etc., each edge should be multistate due to failure, maintenance, etc. Such a network is named a multistate network. Hence, the minimum transmission time through a multistate network is not fixed. We evaluate the system reliability that a specified amount of data can be sent through a pair of minimal paths simultaneously within the time threshold. A solution procedure is first proposed to calculate it. In order to boost the system reliability, the network administrator decides the routing policy in advance to indicate the first and the second priority pairs of minimal paths. The second one will be responsible for the transmission duty if the first one fails. According to the routing policy, the system reliability can be subsequently computed. The case to transmit data through more than two minimal paths can be extended easily. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A method to evaluate the routing policy with two minimal paths within time threshold", "paper_id": "WOS:000296214900083"}