{"auto_keywords": [{"score": 0.03445564019371514, "phrase": "key_issues"}, {"score": 0.03375448230524438, "phrase": "strategic_management"}, {"score": 0.00481495049065317, "phrase": "strategic_description"}, {"score": 0.004714023408114857, "phrase": "spanish_largest_firms"}, {"score": 0.004300453431933622, "phrase": "in-depth_examination"}, {"score": 0.0042102651938187114, "phrase": "map_site"}, {"score": 0.004007083686875716, "phrase": "well-developed_web_site"}, {"score": 0.002793874145713024, "phrase": "content_analysis"}, {"score": 0.002735194789581153, "phrase": "web_pages"}, {"score": 0.0021501863832966966, "phrase": "better_identification"}], "paper_keywords": ["Web pages", " Internet", " Strategic management", " Large firms", " Spain"], "paper_abstract": "The need for this study lies in the assumption that an in-depth examination of the map site of a firm that has a well-developed web site can provide patterns about its corporate strategy through all the elements surrounding the organisation, and even a primary source for benchmarking. This technique has made it possible to identify the key issues in the strategic management of the most excellent large Spanish firms and also to describe trends in this sense. The methodology used consisted in a content analysis of the web pages of the lbex35 companies of the Spanish Stock Market. Rather than focusing on the breakdown of businesses developed by each corporation, it was thought more appropriate to assess their respective corporate principles, as this would allow a better identification of the underlying managerial, organisational and strategic realities of these organisations. As a conclusion we can say that thanks to this technique, it has been possible to identify the key issues in the strategic management of the most excellent large Spanish firms. Additionally, it is shown how this way of working can be generalised to any group of enterprises. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Web pages as a tool for a strategic description of the Spanish largest firms", "paper_id": "WOS:000277850800006"}