{"auto_keywords": [{"score": 0.041036783232546746, "phrase": "quality_assessment"}, {"score": 0.010326085349943332, "phrase": "aed"}, {"score": 0.00481495049065317, "phrase": "medical_records"}, {"score": 0.004774324145784758, "phrase": "emergency_trauma_care"}, {"score": 0.004556901872357751, "phrase": "medical_trauma_record"}, {"score": 0.004046923261950549, "phrase": "important_data_source"}, {"score": 0.004012751049253625, "phrase": "health-_care_professionals"}, {"score": 0.0038789122930433305, "phrase": "third_parties"}, {"score": 0.003287482882222731, "phrase": "trauma_record"}, {"score": 0.0030586736004285216, "phrase": "trauma_care"}, {"score": 0.002994449398035894, "phrase": "medical_record"}, {"score": 0.002833689453299307, "phrase": "information_demands"}, {"score": 0.002603012037901889, "phrase": "information_technology"}, {"score": 0.0025810006125483835, "phrase": "great_power"}, {"score": 0.00229164285862567, "phrase": "recording_process"}, {"score": 0.0021049977753042253, "phrase": "direct_patient_care"}], "paper_keywords": ["completeness", " medical record", " information technology", " emergency trauma care"], "paper_abstract": "The medical trauma record, produced in the Accident & Emergency Departments (AEDs) receives much attention from both health- care professionals and parties interested in quality of care. While it is an important data source for health- care professionals in their everyday work, and for quality assessment by third parties, the (paper) medical record is usually negatively evaluated because of incompleteness. In this article, we show that completeness is relative to the purpose for which the record is used. We distinguish two contexts in which the trauma record is used: the primary- care process at the AED, and assessment and monitoring of trauma care. Incompleteness of the medical record is valued differently in these contexts. Especially with regard to the information demands of quality assessment, and more specifically the national trauma registry, the work processes in the AED have not evolved sufficiently as yet. Information technology has great power to improve completeness and to facilitate quality assessment, but it cannot solve the problem of incompleteness in itself. One solution we propose is to restructure the recording process by introducing a clerk. This clerk could also be a nurse or physician who is temporarily released from direct patient care.", "paper_title": "Completeness of medical records in emergency trauma care and an IT-based strategy for improvement", "paper_id": "WOS:000248007000008"}