{"auto_keywords": [{"score": 0.047389436084135865, "phrase": "articulated_body"}, {"score": 0.004139850082354509, "phrase": "simultaneous_coverage"}, {"score": 0.004103212598803194, "phrase": "almost_every_point"}, {"score": 0.003942299471749811, "phrase": "suggested_setup"}, {"score": 0.003527550673371394, "phrase": "bundle_adjustment_procedure"}, {"score": 0.003374094774912924, "phrase": "feature_visibility"}, {"score": 0.002965684305115369, "phrase": "distinguishable_features"}, {"score": 0.0029263562233195423, "phrase": "proposed_algorithm"}, {"score": 0.0027989800906333784, "phrase": "gauss-newton_method"}, {"score": 0.002761856557698856, "phrase": "geometric_errors"}, {"score": 0.0026652435674846095, "phrase": "chameleon's_eyes"}, {"score": 0.002321665383971456, "phrase": "rigid_body"}, {"score": 0.0022404162042797262, "phrase": "additional_two_degrees"}], "paper_keywords": ["Tracking in 3D", " Occlusions", " Pose estimation", " Mirror as virtual camera"], "paper_abstract": "We present a system that tracks an articulated body performing 3D movement with occlusions using a combination of cameras and mirrors. By integrating cameras and mirrors we get a simultaneous coverage of almost every point on the target and avoid occlusions. The suggested setup is much simpler and easier to handle compared to the equivalent, camera-based setup. Our tracking algorithm is model-based, and errors in the model are treated using the bundle adjustment procedure. In order to deal with the problem of feature visibility, each feature is set to be valid or invalid based on the model and on its expected appearance; this ensures that the system always tracks a set of distinguishable features. The proposed algorithm was able to track targets in 3D using the Gauss-Newton method to minimize geometric errors. We tested our setup by tracking the chameleon's eyes. Tracking the eyes of a chameleon can be considered as the estimation of the 3D pose of an articulated body, where the head of the chameleon is considered as a rigid body, and each of the two eyes has additional two degrees of freedom. The algorithm proposed can be easily expanded to cope with more complex objects.", "paper_title": "Recovery of 3D animal motions using cameras and mirrors", "paper_id": "WOS:000282095900006"}