{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "phase_error"}, {"score": 0.006537799971171054, "phrase": "sampling_circuit"}, {"score": 0.004441377465024458, "phrase": "circuit_parameters"}, {"score": 0.004249332848326785, "phrase": "impulse_responses"}, {"score": 0.003920049436883885, "phrase": "ntn_phase_response"}, {"score": 0.0038573081851680656, "phrase": "internal_sampling_circuitry"}, {"score": 0.003749908582313067, "phrase": "default_sampling-circuit_configuration"}, {"score": 0.003501322813520807, "phrase": "oscilloscope's_phase_response"}, {"score": 0.003431384878608803, "phrase": "sampling-circuit_component_values"}, {"score": 0.0031020367403802773, "phrase": "fractional_uncertainty"}, {"score": 0.003040050100579337, "phrase": "model_parameters"}, {"score": 0.002907992115184249, "phrase": "upper_and_lower_bounds"}, {"score": 0.002504374718975704, "phrase": "type_b_evaluation"}, {"score": 0.0023287359930308864, "phrase": "standard_uncertainty"}, {"score": 0.0022365262201954643, "phrase": "first_time"}, {"score": 0.0022095803687183107, "phrase": "important_practical_uses"}, {"score": 0.0021479597698614373, "phrase": "phase_calibration"}, {"score": 0.0021049977753042253, "phrase": "large_signal_network_analyzers"}], "paper_keywords": ["uncertainty", " phase error", " sampling oscilloscope"], "paper_abstract": "This paper discusses the dependence of the phase error on the 50 GHz bandwidth oscilloscope's sampling circuitry. We give the definition of the phase error as the difference between the impulse responses of the NTN (nose-to-nose) estimate and the true response of the sampling circuit. We develop a method to predict the NTN phase response arising from the internal sampling circuitry of the oscilloscope. For the default sampling-circuit configuration that we examine, our phase error is approximately 7.03 degrees at 50 GHz. We study the sensitivity of the oscilloscope's phase response to parametric changes in sampling-circuit component values. We develop procedures to quantify the sensitivity of the phase error to each component and to a combination of components that depend on the fractional uncertainty in each of the model parameters as the same value, +/- 10%. We predict the upper and lower bounds of phase error, that is, we vary all of the circuit parameters simultaneously in such a way as to increase the phase error, and then vary all of the circuit parameters to decrease the phase error. Based on Type B evaluation, this method qualifies the impresses of all parameters of the sampling circuit and gives the value of standard uncertainty, 1.34 degrees. This result is developed at the first time and has important practical uses. It can be used for phase calibration in the 50 GHz bandwidth large signal network analyzers ( LSNAs).", "paper_title": "Accurate and robust estimation of phase error and its uncertainty of 50 GHz bandwidth sampling circuit", "paper_id": "WOS:000251020500009"}