{"auto_keywords": [{"score": 0.04368739674895728, "phrase": "completion_time"}, {"score": 0.04221552420026915, "phrase": "energy_consumption"}, {"score": 0.03275097241605011, "phrase": "sub-optimal_solution"}, {"score": 0.00481495049065317, "phrase": "distributed_sensor_networks"}, {"score": 0.004783852487938866, "phrase": "sensor_networks"}, {"score": 0.004646366831056171, "phrase": "fast_processing"}, {"score": 0.0043830840694466, "phrase": "base_station"}, {"score": 0.004312622975366676, "phrase": "distributed_computing"}, {"score": 0.004229556887896042, "phrase": "sensor_network"}, {"score": 0.0037635782112965662, "phrase": "task_modules"}, {"score": 0.0035616743422949766, "phrase": "entire_task_execution"}, {"score": 0.0034704317267505035, "phrase": "optimization_problem"}, {"score": 0.003348764681887211, "phrase": "optimal_static_allocation"}, {"score": 0.003210446135114967, "phrase": "faster_algorithm"}, {"score": 0.0029126002350975634, "phrase": "energy_savings"}, {"score": 0.002599763359352916, "phrase": "optimal_solution"}, {"score": 0.002566215899764421, "phrase": "average_energy"}, {"score": 0.002366110899738696, "phrase": "centralized_execution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Reliability", " Distributed computing", " Sensor network", " Module allocation", " Optimization", " A* algorithm"], "paper_abstract": "Sensor networks are increasingly being used for applications which require fast processing of data, Such as multimedia processing and collaboration among sensors to relay observed data to a base station (BS). Distributed computing can be used on a sensor network to reduce the completion time of a task (an application) and distribute the energy consumption equitably across all sensors, so that certain sensors do not die out faster than the others. The distribution of task modules to sensors should consider not only the time and energy savings, but must also improve reliability of the entire task execution. We formulate the above as an optimization problem, and use the A* algorithm with improvements to determine an optimal static allocation of modules among a set of sensors. We also suggest a faster algorithm, called the greedy A* algorithm, if a sub-optimal solution is sufficient. Both algorithms have been Simulated, and the results have been compared in terms of energy savings, decrease in completion time of the task, and the deviation of the sub-optimal solution from the optimal one. The sub-optimal solution required 8%-35% less computation, at the cost of 2.5%-15% deviation from the optimal solution in terms of average energy spent per sensor node. Both the A* and greedy A* algorithms have been shown to distribute energy consumption more uniformly across sensors than centralized execution. The greedy A* algorithm is found to be scalable, as the number of evaluations in determining the allocation increases linearly with the number of sensors. (C) 2008 Published by Elsevier Inc.", "paper_title": "A state-space search approach for optimizing reliability and cost of execution in distributed sensor networks", "paper_id": "WOS:000261775800002"}