{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scanning_keyboards"}, {"score": 0.020239452270811163, "phrase": "user_errors"}, {"score": 0.005588946682199257, "phrase": "error_distributions"}, {"score": 0.004626041906722018, "phrase": "augmentative_communication_aids"}, {"score": 0.0045734359584500206, "phrase": "severe_speech"}, {"score": 0.004343982746943174, "phrase": "experience_and_intuition_of_designers_and_user_model"}, {"score": 0.004149666468555799, "phrase": "design_process"}, {"score": 0.00409073644076669, "phrase": "practical_usefulness"}, {"score": 0.003775803846431323, "phrase": "keyboard_users"}, {"score": 0.003606811438631612, "phrase": "appropriate_time"}, {"score": 0.00346513764367632, "phrase": "wrong_key"}, {"score": 0.003377004149966635, "phrase": "users'_text_entry_time"}, {"score": 0.003281695962914803, "phrase": "empirical_observations"}, {"score": 0.0032258028932822228, "phrase": "state_transition_model"}, {"score": 0.0032073835392641627, "phrase": "user_behavior"}, {"score": 0.003189069023374276, "phrase": "user-keyboard_interaction"}, {"score": 0.0030725394664628475, "phrase": "physical_and_cognitive_state"}, {"score": 0.003028859354852274, "phrase": "particular_instant"}, {"score": 0.002639791376760904, "phrase": "error_probabilities"}, {"score": 0.0024856483031965118, "phrase": "keyboard_design"}, {"score": 0.002401632317461758, "phrase": "frequently_used_key_pairs"}, {"score": 0.002353937539098277, "phrase": "minimum_distance"}, {"score": 0.0021911838824228676, "phrase": "user_model"}, {"score": 0.0021724238169888456, "phrase": "design_principles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["augmentative communication", " soft keyboards", " scanning input methods", " focus distance", " timing errors", " selection errors"], "paper_abstract": "Scanning keyboards are used as augmentative communication aids by persons with severe speech and motion impairments. Literature reports two approaches for the design of scanning keyboards; design based on the experience and intuition of designers and user model based design methods. None of these approaches, however, considers user errors in the design process, potentially limiting the practical usefulness of the designs. We have performed experiments in order to study user errors on scanning keyboards. We have found that two types of errors affect performance of scanning keyboard users significantly, namely (a) timing error that occurs when a user fails to select a key at the appropriate time and (b) selection error that occurs when the user selects a wrong key. These errors have been found to increase users' text entry time by as high as 65% and 35%, respectively. Based on empirical observations, we have developed a state transition model of user behavior during user-keyboard interaction. The model comprises of four states, each of which represents the physical and cognitive state of the user at particular instant of the interaction. The transitions are caused by users' physical, cognitive and perceptual activities. We have found that the errors could be explained as caused due to the problems in making the transitions properly. In addition to explaining errors, the model has helped us to predict distribution of error probabilities with respect to the distance between keys. We have used the model predicted error distributions to develop principles for scanning keyboard design that aim to reduce user errors. The principles state that the frequently used key pairs should be placed apart by a minimum distance, which has been obtained from the error distributions, in order to reduce errors. The method and results of the study, the user model and the design principles are presented in this paper. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "User errors on scanning keyboards: Empirical study, model and design principles", "paper_id": "WOS:000256629800013"}