{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-agent_system"}, {"score": 0.01354829520063015, "phrase": "mas"}, {"score": 0.004772593750252861, "phrase": "heuristic_computing"}, {"score": 0.004407690586271672, "phrase": "cognitive_science"}, {"score": 0.004235793609579307, "phrase": "research_effort"}, {"score": 0.003964007795174772, "phrase": "voluntarily_trust_relationship"}, {"score": 0.00344087639309216, "phrase": "separate_agent_systems"}, {"score": 0.0033805214040814233, "phrase": "confined_frameworks"}, {"score": 0.0032774280543222843, "phrase": "individual_students"}, {"score": 0.0029212075318449616, "phrase": "multi-agent_blackboard_architecture_forms"}, {"score": 0.00278237555651743, "phrase": "core_architecture"}, {"score": 0.002592100731070259, "phrase": "agent_teams"}, {"score": 0.0023307492812556204, "phrase": "functional_blocks"}, {"score": 0.0022297712188622293, "phrase": "decomposed_goals"}, {"score": 0.0021331586055770447, "phrase": "formative_work"}, {"score": 0.0021049977753042253, "phrase": "foundation_layers"}], "paper_keywords": ["ATLAS", " autonomy", " intelligent agents", " teaming", " trust"], "paper_abstract": "Heuristic computing has consolidated into two streams of research (personification software and smart products) [1]. Cognitive Science is one of these fields and is attracting research effort based on Multi-Agent System (MAS). This research requires the formation of a voluntarily trust relationship in order for collaboration to occur, otherwise the imposed goal(s) may be aborted or fail completely [2,3]. An Agent Transportation Layer Adaption System (ATLAS) communications framework has been constructed to pass messages between separate agent systems. Discussion about confined frameworks have recently been extended to enable individual students associated with our Knowledge-Based and Intellingent Information and Engineering Systems (KES) Centre to fast track the development of their research concepts. A Plug 'n' Play concept based on a multi-agent blackboard architecture forms the basis of this research. This paper highlights the core architecture, we believe is required for Multi-Agent System (MAS) developers to achieve such flexibility. Agent teams can provide the ability to adapt and dynamically organize. The model described, concentrates on the blackboard design constructs to represents all functional blocks required to automate the processes required to complete any decomposed goals. Discussion in this paper is limited to the formative work within the foundation layers of that framework.", "paper_title": "Interoperability within Multi-Agent System", "paper_id": "WOS:000264443700008"}