{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chaotic_pattern_recognition_neural_network"}, {"score": 0.004139028737420222, "phrase": "new_model"}, {"score": 0.0040186038781533946, "phrase": "chaotic_neural_networks"}, {"score": 0.003844478919573134, "phrase": "basic_model"}, {"score": 0.0036508108698357932, "phrase": "adachi's_neural_network"}, {"score": 0.0033288399506044763, "phrase": "adnn's_control_system"}, {"score": 0.003126224853287381, "phrase": "eigenvalue_computations"}, {"score": 0.0030576885787607796, "phrase": "lyapunov_exponent"}, {"score": 0.002860938351029155, "phrase": "desirable_property"}, {"score": 0.002618104519194264, "phrase": "finite_periodicity"}, {"score": 0.002343271162668978, "phrase": "transient_phase"}, {"score": 0.002317423416027688, "phrase": "retrieval_process"}, {"score": 0.0022498783454674254, "phrase": "adachi's_dataset"}, {"score": 0.0022168460543913787, "phrase": "real-life_pr_problem"}, {"score": 0.0021049977753042253, "phrase": "new_research_avenues"}], "paper_keywords": [""], "paper_abstract": "Traditional pattern recognition (PR) systems work with the model that the object to be recognized is characterized by a set of features, which are treated as the inputs. In this paper, we propose a new model for PR, namely one that involves chaotic neural networks (CNNs). To achieve this, we enhance the basic model proposed by Adachi (Neural Netw 10:83-98, 1997), referred to as Adachi's Neural Network (AdNN), which though dynamic, is not chaotic. We demonstrate that by decreasing the multiplicity of the eigenvalues of the AdNN's control system, we can effectively drive the system into chaos. We prove this result here by eigenvalue computations and the evaluation of the Lyapunov exponent. With this premise, we then show that such a Modified AdNN (M-AdNN) has the desirable property that it recognizes various input patterns. The way that this PR is achieved is by the system essentially sympathetically \"resonating\" with a finite periodicity whenever these samples (or their reasonable resemblances) are presented. In this paper, we analyze the M-AdNN for its periodicity, stability and the length of the transient phase of the retrieval process. The M-AdNN has been tested for Adachi's dataset and for a real-life PR problem involving numerals. We believe that this research also opens a host of new research avenues.", "paper_title": "Periodicity and stability issues of a chaotic pattern recognition neural network", "paper_id": "WOS:000248383000002"}