{"auto_keywords": [{"score": 0.015348176114949515, "phrase": "sensor_nodes"}, {"score": 0.011981289897310683, "phrase": "incremental_checkpointing"}, {"score": 0.011419491654324872, "phrase": "page_protection_hardware"}, {"score": 0.00481495049065317, "phrase": "mmu-less_incremental_checkpointing"}, {"score": 0.0047379542803396915, "phrase": "critical_safety_applications"}, {"score": 0.0046621835537196754, "phrase": "valuable_information"}, {"score": 0.004164516065972361, "phrase": "sensor_node"}, {"score": 0.0040978781692373005, "phrase": "node_reliability"}, {"score": 0.004064958518350867, "phrase": "network_availability"}, {"score": 0.0038417798012011155, "phrase": "full_checkpointing"}, {"score": 0.003558294449586273, "phrase": "checkpoint_overhead"}, {"score": 0.0034452601929727752, "phrase": "dirty_pages"}, {"score": 0.003229815147800001, "phrase": "previous_incremental_checkpointings"}, {"score": 0.002896274285996145, "phrase": "checkpoint_memory_data_unit"}, {"score": 0.002759279370360986, "phrase": "incremental_checkpoint_file_format"}, {"score": 0.0026500668745484957, "phrase": "sensor_network_characteristics"}, {"score": 0.002555496221408012, "phrase": "sos"}, {"score": 0.002494279207996077, "phrase": "performance_evaluation"}, {"score": 0.0023287359930308864, "phrase": "appropriate_incremental_checkpointing"}, {"score": 0.0021566565951738658, "phrase": "mmu-less_wsns"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Checkpointing", " Incremental checkpointing", " SOS"], "paper_abstract": "For some critical safety applications, sensor nodes embed valuable information, and they should be able to operate unattended and unfailing for several months or years. One promising solution is to adopt a checkpointing that periodically saves the state of a sensor node, thereby maintaining node reliability and network availability. Thus, this study first shows the design and implementation of a full checkpointing for WSNs. However, checkpointing is expensive. Therefore, incremental checkpointing was previously proposed to eliminate the checkpoint overhead by relying on the page protection hardware to identify dirty pages. Because sensor nodes are resource-constrained and do not equip with the page protection hardware, previous incremental checkpointings cannot be directly applied. To address this issue, this paper proposes three incremental checkpointings for WSNs. These three methods differ in the granularity of the checkpoint memory data unit and module execution overhead. In addition, we designed an incremental checkpoint file format that simultaneously supports proposed three different incremental checkpointings and accommodates them with sensor network characteristics. We implemented the full and three incremental checkpointings on SOS in the mica2 sensor motes. A performance evaluation of the three incremental checkpointings is presented. We also discuss and evaluate a method for selecting the appropriate incremental checkpointing. To the best of our knowledge, this study is the first to design and implement incremental checkpointing in MMU-less WSNs. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Surviving sensor node failures by MMU-less incremental checkpointing", "paper_id": "WOS:000329273400006"}