{"auto_keywords": [{"score": 0.04556230169092199, "phrase": "hesitant_fuzzy_linguistic_term_sets"}, {"score": 0.00481495049065317, "phrase": "group_decision_making_problems"}, {"score": 0.004226949670141375, "phrase": "consecutive_linguistic_terms"}, {"score": 0.004133055661437163, "phrase": "new_model"}, {"score": 0.004096082254543022, "phrase": "qualitative_settings"}, {"score": 0.0038985392250620483, "phrase": "single_term"}, {"score": 0.0034841647157189985, "phrase": "non-consecutive_linguistic_terms"}, {"score": 0.003361069456060196, "phrase": "extended_hesitant_fuzzy_linguistic_term_sets"}, {"score": 0.002963390095037466, "phrase": "complex_decision_model"}, {"score": 0.0029236680654022664, "phrase": "basic_operation"}, {"score": 0.0028076592725295646, "phrase": "mathematical_properties"}, {"score": 0.0026600905156986317, "phrase": "group_decision_making"}, {"score": 0.0025892330566358503, "phrase": "aggregation_operators"}, {"score": 0.002387758958649797, "phrase": "real_numbers"}, {"score": 0.002366361492754389, "phrase": "linguistic_terms"}, {"score": 0.002313701040445819, "phrase": "new_group_decision"}, {"score": 0.0022520496048464406, "phrase": "corresponding_processes"}, {"score": 0.0021821915946356168, "phrase": "practical_application"}, {"score": 0.0021049977753042253, "phrase": "proposed_technique"}], "paper_keywords": ["Hesitant fuzzy set", " Aggregation operator", " Extended hesitant fuzzy linguistic term set", " Group decision making", " Hesitant fuzzy linguistic term set"], "paper_abstract": "Group decision making problems which organize a group of experts to evaluate a set of alternatives with respect to several criteria are commonly discussed recently. Hesitant fuzzy linguistic term sets, characterized by a set of consecutive linguistic terms, act as a new model for qualitative settings where experts think of several possible linguistic values or richer expressions than a single term. When evaluating an indicator, alternative or variable in group decision making, however, linguistic terms involved in an expression derived by the group may be not always consecutive. Therefore, we generalize hesitant fuzzy linguistic term sets by enabling any non-consecutive linguistic terms in them, and refer to as extended hesitant fuzzy linguistic term sets (EHFLTSs). EHFLTSs can be constructed by the union of hesitant fuzzy linguistic term sets given by individual expert. As owning more desirable mathematical properties, EHFLTSs are flexible for develop complex decision model. Some basic operation and envelop of EHFLTSs are defined and some mathematical properties are discussed as well. For the sake of application in group decision making, we develop two classes of aggregation operators for aggregating a set of EHFLTSs to suit the cases where weighting vectors take the form of real numbers and linguistic terms respectively. Then a new group decision making model is formed and corresponding processes for two distinct scenarios are developed. A practical application clarifies the rationality and advantages of the proposed technique.", "paper_title": "Extended hesitant fuzzy linguistic term sets and their aggregation in group decision making", "paper_id": "WOS:000346062500002"}