{"auto_keywords": [{"score": 0.04759132288543124, "phrase": "conference_papers"}, {"score": 0.03557926669028957, "phrase": "journal_papers"}, {"score": 0.010815696884620037, "phrase": "data_mining"}, {"score": 0.010763730820998641, "phrase": "information_retrieval"}, {"score": 0.0071828446751051635, "phrase": "new_trend"}, {"score": 0.005287329541283537, "phrase": "academic_intelligence"}, {"score": 0.00481495049065317, "phrase": "information_retrieval_-_an_example"}, {"score": 0.0044020386017739575, "phrase": "well-known_databases"}, {"score": 0.004255165475318718, "phrase": "similar_topics"}, {"score": 0.004183569142743863, "phrase": "vice_versa"}, {"score": 0.0041231564685814395, "phrase": "existing_algorithms"}, {"score": 0.004034162628397924, "phrase": "new_detective_procedure"}, {"score": 0.0037329555959218766, "phrase": "conference_papers'_themes"}, {"score": 0.003617088380438489, "phrase": "new_research_themes"}, {"score": 0.0034878415614226685, "phrase": "specific_area"}, {"score": 0.003211668393914767, "phrase": "academic_publications"}, {"score": 0.0030893565549474085, "phrase": "published_papers"}, {"score": 0.0027230195443357745, "phrase": "automatic_examination_procedure"}, {"score": 0.002632018450749207, "phrase": "human_resources"}, {"score": 0.002568880797253276, "phrase": "new_procedure"}, {"score": 0.0025072539014372275, "phrase": "analytical_results"}, {"score": 0.0024649946795812713, "phrase": "journals_papers"}, {"score": 0.00236529977725354, "phrase": "data_points"}, {"score": 0.0022259513905243497, "phrase": "urgent_topics"}, {"score": 0.002188423059571308, "phrase": "new_researchers"}, {"score": 0.002135903717944924, "phrase": "cross-domain_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Citation analysis", " Scientific web intelligence", " Topic discovery and tracking", " Data mining", " Information retrieval", " Academic intelligence"], "paper_abstract": "This paper reports a work that was intended to reveal the connection between topics investigated by conference papers and journal papers. This work selected hundreds of papers in data mining and information retrieval from well-known databases and showed that the topics covered by conference papers in a year often leads to similar topics covered by journal papers in the subsequent year and vice versa. This study used some existing algorithms and combination of these algorithms to proposed a new detective procedure for the researchers to detect the new trend and get the academic intelligence from conferences and journals. The goal of this research is fourfold: First, the research investigates if the conference papers' themes lead the journal papers'. Second, the research examines how the new research themes can be identified from the conference papers. Third, the research looks at a specific area such as information retrieval and data mining as an illustration. Fourth, the research studies any inconsistencies of the correlation between the conference papers and the journal papers. This study explores the connections between the academic publications. The methodologies of information retrieval and data mining can be exploited to discover the relationships between published papers among all topics. By discovering the connections between conference papers and journal papers, researchers can improve the effectiveness of their research by identifying academic intelligence, This Study discusses how conference papers and journal papers are related. The topics of conference papers are identified to determine whether they represent new trend discussed in journal papers. An automatic examination procedure based on information retrieval and data mining is also proposed to minimize the time and human resources required to predict further research developments. This study develops a new procedure and collects a dataset to verify those problems. Analytical results demonstrate that the conference papers Submitted to journals papers are similar each year. Conference papers certainly affect the journal papers published over three years. About 87.23% of data points from papers published in 1991-2007 support our assumption. The research is intended to help researchers identify new trend in their research fields, and focus on the urgent topics. This is particularly valuable for new researchers in their field, or those who wish to perform cross-domain studies. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Research intelligence involving information retrieval - An example of conferences and journals", "paper_id": "WOS:000270646200019"}