{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "structured_eligibility_criteria"}, {"score": 0.04306476287253624, "phrase": "eligibility_criteria"}, {"score": 0.011742494665578905, "phrase": "automated_structuring"}, {"score": 0.004753194996637899, "phrase": "patient_recruitment"}, {"score": 0.004668059458774745, "phrase": "successful_completion"}, {"score": 0.004644014990871423, "phrase": "clinical_trials"}, {"score": 0.004560826038984214, "phrase": "new_methods"}, {"score": 0.004308911439983845, "phrase": "candidate_patients"}, {"score": 0.0038959121068990517, "phrase": "different_trials"}, {"score": 0.003816197777388722, "phrase": "new_trials"}, {"score": 0.0033971539563683174, "phrase": "potentially_unnecessarily_restrictive_conditions"}, {"score": 0.0033448623007224596, "phrase": "recruitment_potential"}, {"score": 0.003209306891991172, "phrase": "related_conditions"}, {"score": 0.003111246537236127, "phrase": "general_meaning"}, {"score": 0.0030475381446620716, "phrase": "contextual_patterns"}, {"score": 0.003031815311399173, "phrase": "medical_concepts"}, {"score": 0.0030161733498347476, "phrase": "constraining_values"}, {"score": 0.002893899860959493, "phrase": "predefined_relations"}, {"score": 0.0028273061946184645, "phrase": "medical_ontologies"}, {"score": 0.0026986685585382347, "phrase": "fine_grained_queries"}, {"score": 0.0026161698049580804, "phrase": "intuitive_navigation"}, {"score": 0.0025296325165671315, "phrase": "interesting_co-occurrences"}, {"score": 0.0023958326775913165, "phrase": "low_recall"}, {"score": 0.0022225915717768003, "phrase": "medical_perspective"}, {"score": 0.002165798731600657, "phrase": "trial_design"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Formalizing eligibility criteria", " Supporting trial design", " Semantic annotation", " Populating ontology from text", " Data visualization"], "paper_abstract": "Patient recruitment is one of the most important barriers to successful completion of clinical trials and thus to obtaining evidence about new methods for prevention, diagnostics and treatment. The reason is that recruitment is effort consuming. It requires the identification of candidate patients for the trial (the population under study), and verifying for each patient whether the eligibility criteria are met. The work we describe in this paper aims to support the comparison of population under study in different trials, and the design of eligibility criteria for new trials. We do this by introducing structured eligibility criteria, that enhance reuse of criteria across trials. We developed a method that allows for automated structuring of criteria from text. Additionally, structured eligibility criteria allow us to propose suggestions for relaxation of criteria to remove potentially unnecessarily restrictive conditions. We thereby increase the recruitment potential and generalizability of a trial. Our method for automated structuring of criteria enables us to identify related conditions and to compare their restrictiveness. The comparison is based on the general meaning of criteria, comprised of commonly occurring contextual patterns, medical concepts and constraining values. These are automatically identified using our pattern detection algorithm, state of the art ontology annotators and semantic taggers. The comparison uses predefined relations between the patterns, concept equivalences defined in medical ontologies, and threshold values. The result is a library of structured eligibility criteria which can be browsed using fine grained queries. Furthermore, We developed visualizations for the library that enable intuitive navigation of relations between trials, criteria and concepts. These visualizations expose interesting co-occurrences and correlations, potentially enhancing meta-research. The method for criteria structuring processes only certain types of criteria, which results in low recall of the method (18%) but a high precision for the relations we identify between the criteria (94%). Analysis of the approach from the medical perspective revealed that the approach can be beneficial for supporting trial design, though more research is needed. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Enhancing reuse of structured eligibility criteria and supporting their relaxation", "paper_id": "WOS:000359752100019"}