{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "relevant_contextual_information"}, {"score": 0.02919541736870407, "phrase": "power_analysis"}, {"score": 0.004758457292840376, "phrase": "movie-recommender_system"}, {"score": 0.004721162131188487, "phrase": "context-aware_recommender_system"}, {"score": 0.004611013257082199, "phrase": "highly_researched_and_implemented_way"}, {"score": 0.004539005582217305, "phrase": "personalized_service"}, {"score": 0.004346704947011699, "phrase": "remaining_issues"}, {"score": 0.003954837422946628, "phrase": "irrelevant_contextual_information"}, {"score": 0.0038930368103015467, "phrase": "negative_impact"}, {"score": 0.00384731849108269, "phrase": "recommendation_accuracy"}, {"score": 0.003728000957725218, "phrase": "contextual_variable"}, {"score": 0.003684213587410217, "phrase": "users'_ratings"}, {"score": 0.0034185505275141077, "phrase": "specific_context"}, {"score": 0.002966438503447793, "phrase": "statistical_testing"}, {"score": 0.0028743610212291727, "phrase": "real_movie_dataset"}, {"score": 0.00281826552772148, "phrase": "contextual_information"}, {"score": 0.0026148807877309417, "phrase": "slightly_different_reasoning"}, {"score": 0.0025038930574283174, "phrase": "significant_difference"}, {"score": 0.002155412043665635, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "small_dataset"}], "paper_keywords": ["personalization", " user modelling", " recommender systems", " contextual information"], "paper_abstract": "Context-aware recommender system (CARS) is a highly researched and implemented way of providing a personalized service that helps users to find their desired content. One of the remaining issues is how to decide which contextual information to acquire and how to incorporate it into CARS. While the relevant contextual information will improve the recommendations, the irrelevant contextual information could have a negative impact on the recommendation accuracy. By testing the independence between the contextual variable on the users' ratings for items, we can detect its relevance and impact on the feedback for the item consumed in that specific context. In this article, we propose several new theoretical concepts that should help deciding which information to use, as well as a methodology for detecting which contextual information contributes to explaining the variance in the ratings, based on statistical testing. The experiment was conducted on the real movie dataset that contains 12 different pieces of contextual information. We used two statistical tests with power analysis for the detection, and three contextualized matrix-factorization algorithms with slightly different reasoning for the prediction of ratings. The results showed a significant difference in the prediction of ratings in the context that was detected as relevant by our method, and the one that was detected as irrelevant, pointing to the importance of the power analysis and the benefits of the proposed method in the case of a small dataset.", "paper_title": "Predicting and Detecting the Relevant Contextual Information in a Movie-Recommender System", "paper_id": "WOS:000315426200006"}