{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "centralized_hvac_systems"}, {"score": 0.004790756351382389, "phrase": "room-level_zoning"}, {"score": 0.004707030616007825, "phrase": "hvac"}, {"score": 0.004624751696958501, "phrase": "energy_usage"}, {"score": 0.0044644734709113985, "phrase": "nation's_largest_energy_consumers"}, {"score": 0.004320599949140603, "phrase": "hvac_systems"}, {"score": 0.004245051445971095, "phrase": "conditioning_occupied_buildings"}, {"score": 0.004128981421251788, "phrase": "air_conditioners"}, {"score": 0.003955787027818305, "phrase": "deep-setback_mode"}, {"score": 0.003216804708106142, "phrase": "centralized_hvac_system"}, {"score": 0.003058515297281172, "phrase": "conditioning_unoccupied_rooms"}, {"score": 0.003020171537471668, "phrase": "approach_room-level_zoning"}, {"score": 0.0029898418888138364, "phrase": "room_state"}, {"score": 0.0029747911329678933, "phrase": "learned_activity_patterns"}, {"score": 0.002886059812773808, "phrase": "unoccupied_rooms"}, {"score": 0.0028426887945253373, "phrase": "defined_comfortable_temperature"}, {"score": 0.002750934994181092, "phrase": "occupied_rooms"}, {"score": 0.002723301730223192, "phrase": "comfortable_temperature"}, {"score": 0.0026688629249775925, "phrase": "high_probability"}, {"score": 0.0025761937402886954, "phrase": "hvac_system"}, {"score": 0.002543881282993268, "phrase": "room-level_zoning_system"}, {"score": 0.002524688179363081, "phrase": "dual-zone"}, {"score": 0.0024742098091226203, "phrase": "existing_centralized_hvac_system"}, {"score": 0.0024617483174454113, "phrase": "wireless_temperature_sensors"}, {"score": 0.0024431733736805057, "phrase": "room-level_temperature"}, {"score": 0.0023405257495466352, "phrase": "conditioned_air"}, {"score": 0.002311162358845935, "phrase": "dual-zone_statically"}, {"score": 0.002202894673025544, "phrase": "initial_analysis"}, {"score": 0.0021479597698614373, "phrase": "existing_single-zoned_thermostat"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Building energy", " Wireless sensor networks", " Energy", " Environment", " Sensing"], "paper_abstract": "Heating, ventilation, and cooling (HVAC) accounts for 38% of building energy usage, and over 15% of all US energy usage, making it one of the nation's largest energy consumers. A number of projects have attempted to optimize the control of HVAC systems by minimizing the energy wasted in conditioning occupied buildings or rooms. Researchers have proposed systems that turn off air conditioners or heaters when a house is unoccupied, or put the system into an energy saving deep-setback mode when the occupants are inactive, such as when they are asleep. These approaches enable the retrofitting of centralized HVAC systems, that are widely used within the United States, to be more energy efficient. An area that has not been as well explored is the retrofitting of centralized HVAC systems to save energy when the residents are at home and awake. In this paper, we demonstrate how to use cheap, off-the-shelf sensors and actuators to retrofit a centralized HVAC system and enable the heating, or cooling, of rooms individually, in order to reduce waste caused by conditioning unoccupied rooms. We call this approach room-level zoning. Sensors detect room state and learned activity patterns are used to predict occupancy. Based on this information, unoccupied rooms drift away from a user defined comfortable temperature if occupants are less likely to use them in the near future while occupied rooms remain at a comfortable temperature. Thus, conditioning only the rooms with a high probability of occupancy to the setpoint saves energy by decreasing the load on the HVAC system. We implement a room-level zoning system, called Dual-Zone, in a 1400 square foot house by retrofitting an existing centralized HVAC system with wireless temperature sensors to monitor room-level temperature, motion sensors to monitor occupancy, and wirelessly actuatable dampers to control the flow of conditioned air through the house. Dual-Zone statically zones the house into two zones: one conditioned at night and the other conditioned during the day. Initial analysis indicates that this method has a 20.5% energy savings over the existing single-zoned thermostat during a 20 day evaluation. Published by Elsevier Inc.", "paper_title": "Feasibility of retrofitting centralized HVAC systems for room-level zoning", "paper_id": "WOS:000209576200005"}