{"auto_keywords": [{"score": 0.011169164841073258, "phrase": "design_reuse"}, {"score": 0.006751890221918717, "phrase": "partial_retrieval"}, {"score": 0.00481495049065317, "phrase": "oriented_partial_retrieval"}, {"score": 0.004773904938276846, "phrase": "cad_models"}, {"score": 0.0046928556063004214, "phrase": "huge_number"}, {"score": 0.004234532601573088, "phrase": "existing_methods"}, {"score": 0.003123652729688503, "phrase": "reference_models"}, {"score": 0.0030573959252626695, "phrase": "design_reusable_subpart"}, {"score": 0.002854645802851, "phrase": "multi-mode_partial_retrieval"}, {"score": 0.0027230880516264685, "phrase": "exact_retrieval"}, {"score": 0.0026998264237910884, "phrase": "relaxed_retrieval"}, {"score": 0.002564360070426064, "phrase": "incomplete_and_vague_queries"}, {"score": 0.0025315664299815537, "phrase": "early_design_stage"}, {"score": 0.0024148618915672353, "phrase": "multi-mode_matching"}, {"score": 0.0023233800372985686, "phrase": "design_reusable_subparts"}, {"score": 0.0022449697898020947, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Partial retrieval", " CAD model", " Design reuse", " Multi-mode", " Reusable subpart"], "paper_abstract": "As a huge number of 3D CAD models is generated each year, retrieval of 3D CAD models is becoming more and more important for achieving design reuse. However, the existing methods for partial retrieval of 3D CAD models are very few and far from the requirements of design reuse. In this paper, we present an approach to partial retrieval of 3D CAD models for design reuse. The criteria for determining whether a subpart of 3D CAD models is reusable for design is defined first. Based on the criteria defined, all the design reusable subparts involved in the 3D CAD models in the library are automatically extracted and stored in the library as reference models. Moreover, each design reusable subpart in the library is represented by all its local matching regions in a hierarchical way so as to support multi-mode partial retrieval. In our approach, three partial retrieval modes including normal retrieval, exact retrieval and relaxed retrieval are defined to meet various partial retrieval requirements of design reuse such as the incomplete and vague queries during the early design stage. And the multi-mode partial retrieval is achieved by performing multi-mode matching and similarity assessment between the query and the design reusable subparts in the library indexed by bitmap. Experimental results are presented to demonstrate the effectiveness of the approach. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Design reuse oriented partial retrieval of CAD models", "paper_id": "WOS:000283962900002"}