{"auto_keywords": [{"score": 0.04322873010093233, "phrase": "rfdps"}, {"score": 0.015326798816015551, "phrase": "program_schemes"}, {"score": 0.00583432747012598, "phrase": "inflationary_fixed-point_logic"}, {"score": 0.00481495049065317, "phrase": "polynomial-time_program_schemes"}, {"score": 0.0043305354943056875, "phrase": "finite_structures"}, {"score": 0.0038804410204616954, "phrase": "gurevich's_sense"}, {"score": 0.0037961770933599135, "phrase": "program_scheme"}, {"score": 0.003754731210715724, "phrase": "isomorphism-closed_class"}, {"score": 0.0034139056533151, "phrase": "rfdps._we"}, {"score": 0.0031497178007011666, "phrase": "well-known_problem"}, {"score": 0.002690771424958613, "phrase": "polynomial-time_logic"}, {"score": 0.0022403279163829516, "phrase": "finite_model_theory"}, {"score": 0.0021996478802839316, "phrase": "zero-one_laws"}, {"score": 0.0021597049163247476, "phrase": "existing_tools"}, {"score": 0.002128272293291141, "phrase": "logical_hierarchy_results"}, {"score": 0.0021049977753042253, "phrase": "limited_use"}], "paper_keywords": [""], "paper_abstract": "We define a class of program schemes RFDPS constructed around notions of forall-loops, repeat-loops, arrays and if-then-else instructions, and which take finite structures as inputs, and we examine the class of problems, denoted RFDPS also, accepted by such program schemes. The class of program schemes RFDPS is a logic, in Gurevich's sense, in that: every program scheme accepts an isomorphism-closed class of finite structures; we can recursively check whether a given finite structure is accepted by a given program scheme; and we can recursively enumerate the program schemes of RFDPS. We show that the class of problems RFDPS properly contains the class of problems definable in inflationary fixed-point logic (for example, the well-known problem Parity is in RFDPS) and that there is a strict, infinite hierarchy of classes of problems within RFDPS (the union of which is RFDPS) parameterized by the depth of nesting of forall-loops in our program schemes. This is the first strict, infinite hierarchy in any polynomial-time logic properly extending inflationary fixed-point logic (with the property that the union of the classes in the hierarchy consists of all problems definable in the logic). The fact that there are problems (like Parity) in RFDPS which cannot be defined in many of the more traditional logics of finite model theory (which often have zero-one laws) essentially means that existing tools, techniques and logical hierarchy results are of limited use to us.", "paper_title": "An infinite hierarchy in a class of polynomial-time program schemes", "paper_id": "WOS:000240364100010"}