{"auto_keywords": [{"score": 0.0385002243860364, "phrase": "information_system"}, {"score": 0.00481495049065317, "phrase": "information_systems"}, {"score": 0.004558414405811025, "phrase": "increasingly_important_role"}, {"score": 0.004513255056769647, "phrase": "information_systems_initiatives"}, {"score": 0.004402295697276237, "phrase": "considerable_attention"}, {"score": 0.003716520760680603, "phrase": "use_processes"}, {"score": 0.0035712919163869176, "phrase": "knowledge_fragmentation"}, {"score": 0.0026612444314342023, "phrase": "divergent_conceptualizations"}, {"score": 0.0025317627242523104, "phrase": "single_perspective"}], "paper_keywords": ["IS development", " IS use", " IS characteristics", " culture", " integration", " differentiation", " fragmentation"], "paper_abstract": "Culture plays an increasingly important role in information systems initiatives, and it receives considerable attention from researchers who have studied a variety of aspects of its role in IS initiatives. Notwithstanding the contributions of research to date, our knowledge of how culture influences and is influenced by-the development and use processes and an information system itself remains fragmented. Knowledge fragmentation is amplified by the fact that conceptualizations of culture differ among researchers. Indeed, most researchers agree that culture consists of patterns of meaning underlying a variety of manifestations. Researchers diverge, however, on the degree of consensus on these interpretations that they assume to be reached within a collective. In order to integrate these divergent conceptualizations of culture, we adopt the view that no single perspective is sufficient to capture the complexity of interplay between culture, the processes of developing and using an IS, and the IS itself We have, therefore, adopted a conceptualization that views culture from three perspectives-integration, differentiation, and fragmentation-that come into play simultaneously and jointly. Using this conceptualization, the paper synthesizes what is known about the role of culture in IS initiatives, and proposes a model of the relationships between culture, the development and use processes, and an information system.", "paper_title": "A three-perspective model of culture, information systems, and their development and use", "paper_id": "WOS:000258859700008"}