{"auto_keywords": [{"score": 0.008394065755683971, "phrase": "routed_wirelength"}, {"score": 0.0048150892060201955, "phrase": "placement"}, {"score": 0.004686688155058031, "phrase": "congestion_mitigation"}, {"score": 0.004440277230269978, "phrase": "emerging_technology"}, {"score": 0.00436890075128947, "phrase": "integration_density"}, {"score": 0.0038168424095396205, "phrase": "post-placement_partitioning_step"}, {"score": 0.0035965032173588753, "phrase": "commercial_router-based_monolithic_intertier"}, {"score": 0.002944284514509205, "phrase": "routing_demand_model"}, {"score": 0.002714779217561487, "phrase": "off-loading_demand"}, {"score": 0.0025167026017217926, "phrase": "power_delay_product"}, {"score": 0.0021049977753042253, "phrase": "reduced_metal_layer_usage"}], "paper_keywords": ["Monolithic 3D (M3D)", " partitioning", " placement", " routing congestion"], "paper_abstract": "Monolithic 3D (M3D) is an emerging technology that enables integration density which is orders of magnitude higher than that offered by through-silicon-vias. In this paper, we demonstrate that a modified 2D placement technique coupled with a post-placement partitioning step is sufficient to produce high-quality M3D placement solutions. We also present a commercial router-based monolithic intertier via insertion methodology that improves the routability of M3D ICs. We demonstrate that, unlike in 2D ICs, the routing supply and demand in M3D ICs are not completely independent of each other. We develop a routing demand model for M3D ICs, and use it to develop an O(N) min-overflow partitioner that enhances routability by off-loading demand from one tier to another. This technique reduces the routed wirelength and the power delay product by up to 7.44% and 4.31%, respectively. This allows a two-tier M3D IC to achieve, on average, 19.9% and 11.8% improvement in routed wirelength and power delay product over 2D, even with reduced metal layer usage.", "paper_title": "Placement-Driven Partitioning for Congestion Mitigation in Monolithic 3D IC Designs", "paper_id": "WOS:000351765000005"}