{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "spontaneous_and_personalized_interaction"}, {"score": 0.004760017604908536, "phrase": "home_computing_environments"}, {"score": 0.004417848254181138, "phrase": "ubiquitous_computing_technologies"}, {"score": 0.004030157055463817, "phrase": "hew_approach"}, {"score": 0.0037617986040878342, "phrase": "future_embedded_systems"}, {"score": 0.0036763623220059933, "phrase": "new_approach"}, {"score": 0.0034911335714333507, "phrase": "new_issues"}, {"score": 0.003058944053868522, "phrase": "personal_home_server"}, {"score": 0.0029214769181390653, "phrase": "home_appliances"}, {"score": 0.002806256131739047, "phrase": "different_personal_home_server"}, {"score": 0.002574387911697005, "phrase": "individual_preferences"}, {"score": 0.0023480892503414596, "phrase": "railroad_stations"}], "paper_keywords": ["home computing", " personal devices", " spontaneous interaction", " personalization", " appliance coordination"], "paper_abstract": "Our daily lives are expected to change dramatically due to the popularity of ubiquitous computing technologies. These will make it possible to integrate various aspects of our lives. However, a hew approach is required to seamlessly deal with devices embedded in our environments. Future embedded systems will embody a new approach that will take into account a variety of new issues, for example, spontaneous interaction, personalization, privacy protection, and interoperability. In this paper, we propose a personal home server that will make it possible to coordinate home appliances. Since everyone will have a different personal home server, it will allow us to personalize how the appliances are used according to individual preferences. Our personal home server can seamlessly discover and configure appliances at any locations, such as at railroad stations, cars, and streets as well as houses. We also discuss its design and implementation and present its current status.", "paper_title": "A software infrastructure for supporting spontaneous and personalized interaction in home computing environments", "paper_id": "WOS:000246339400005"}