{"auto_keywords": [{"score": 0.046069464194864115, "phrase": "session_key"}, {"score": 0.00481495049065317, "phrase": "scalable_transitive_human-verifiable_authentication_protocol"}, {"score": 0.004765788394931875, "phrase": "mobile_devices"}, {"score": 0.004235095881928715, "phrase": "prior_secret"}, {"score": 0.003802135020791801, "phrase": "handheld_devices"}, {"score": 0.00374399358035391, "phrase": "long_hexadecimal_keys"}, {"score": 0.0036678472439508484, "phrase": "devices'_screens"}, {"score": 0.0027505037762786087, "phrase": "tripartite_authentication_protocol"}, {"score": 0.002708399936381754, "phrase": "temporary_confidential_channel"}, {"score": 0.002559444836360178, "phrase": "transitive_authentication_protocol"}, {"score": 0.0025202582748972122, "phrase": "multiple_handheld_devices"}, {"score": 0.002468938912850425, "phrase": "conference_key"}, {"score": 0.0023331227492950422, "phrase": "formal_proof"}, {"score": 0.0021049977753042253, "phrase": "mobile_phone"}], "paper_keywords": ["Human verifiable authentication protocol", " mobile security"], "paper_abstract": "The man-in-the-middle (MITM) attack is the major threat for handheld devices to agree on a session key in which they do not share any prior secret in advance, even if these devices are physically located in the same place. Apart from insecurely typing passwords into handheld devices or comparing long hexadecimal keys displayed on the devices' screens, many other human-verifiable protocols have been proposed in the literature to solve the problem. Unfortunately, most of these schemes are unscalable to more users. Even when there are only three entities attempting to agree on a session key, these protocols need to be rerun three times. In this paper, we present a bipartite and a tripartite authentication protocol using a temporary confidential channel. Besides, we further extend the system into a transitive authentication protocol that allows multiple handheld devices to establish a conference key securely and efficiently. In addition, we provide a formal proof to our protocol to demonstrate our scheme is indeed secure. We also implement the prototype of the system on a mobile phone with satisfying performance.", "paper_title": "A Scalable Transitive Human-Verifiable Authentication Protocol for Mobile Devices", "paper_id": "WOS:000322026900006"}