{"auto_keywords": [{"score": 0.03961779893438284, "phrase": "forensic_investigator"}, {"score": 0.009787441193904673, "phrase": "anti-forensic_operations"}, {"score": 0.009487344237838044, "phrase": "forensic_techniques"}, {"score": 0.00481495049065317, "phrase": "motion_compensated_video"}, {"score": 0.004695900553353526, "phrase": "digital_information"}, {"score": 0.004536976344964643, "phrase": "multimedia_content"}, {"score": 0.004342430078306461, "phrase": "digital_forgeries"}, {"score": 0.00422177384286051, "phrase": "digital_manipulations"}, {"score": 0.004002902686509964, "phrase": "digital_forger"}, {"score": 0.0038431888954930083, "phrase": "new_evidence"}, {"score": 0.003819187440994939, "phrase": "anti-forensic_manipulation"}, {"score": 0.0036553070575015344, "phrase": "false_alarm"}, {"score": 0.003095923814666088, "phrase": "digital_videos"}, {"score": 0.0029260602766930065, "phrase": "digital_video"}, {"score": 0.0028625406368744995, "phrase": "theoretical_model"}, {"score": 0.002835740601294821, "phrase": "forensically_detectable_fingerprints"}, {"score": 0.002688532127821979, "phrase": "video_frame_deletion"}, {"score": 0.002671722386856879, "phrase": "addition_detection_technique"}, {"score": 0.0026467898401098438, "phrase": "wang"}, {"score": 0.0026301555975559126, "phrase": "farid"}, {"score": 0.0025730425700096365, "phrase": "anti-forensic_technique"}, {"score": 0.00241658945942583, "phrase": "new_set"}, {"score": 0.002327310963701377, "phrase": "game_theoretic_framework"}, {"score": 0.002220326414611295, "phrase": "new_techniques"}], "paper_keywords": ["Digital forensics", " anti-forensics", " frame deletion", " video compression", " game theory"], "paper_abstract": "Due to the ease with which digital information can be altered, many digital forensic techniques have been developed to authenticate multimedia content. Similarly, a number of anti-forensic operations have recently been designed to make digital forgeries undetectable by forensic techniques. However, like the digital manipulations they are designed to hide, many anti-forensic operations leave behind their own forensically detectable traces. As a result, a digital forger must balance the trade-off between completely erasing evidence of their forgery and introducing new evidence of anti-forensic manipulation. Because a forensic investigator is typically bound by a constraint on their probability of false alarm (P-fa) , they must also balance a trade-off between the accuracy with which they detect forgeries and the accuracy with which they detect the use of anti-forensics. In this paper, we analyze the interaction between a forger and a forensic investigator by examining the problem of authenticating digital videos. Specifically, we study the problem of adding or deleting a sequence of frames from a digital video. We begin by developing a theoretical model of the forensically detectable fingerprints that frame deletion or addition leaves behind, then use this model to improve upon the video frame deletion or addition detection technique proposed by Wang and Farid. Next, we propose an anti-forensic technique designed to fool video forensic techniques and develop a method for detecting the use of anti-forensics. We introduce a new set of techniques for evaluating the performance of anti-forensic operations and develop a game theoretic framework for analyzing the interplay between a forensic investigator and a forger. We use these new techniques to evaluate the performance of each of our proposed forensic and anti-forensic techniques, and identify the optimal actions of both the forger and forensic investigator.", "paper_title": "Temporal Forensics and Anti-Forensics for Motion Compensated Video", "paper_id": "WOS:000306520900018"}