{"auto_keywords": [{"score": 0.04143278372851632, "phrase": "learning_materials"}, {"score": 0.03880116769569452, "phrase": "visual_materials"}, {"score": 0.038198640349319045, "phrase": "visual_learning_materials"}, {"score": 0.03244300176671328, "phrase": "cognitive_style"}, {"score": 0.00481495049065317, "phrase": "visualizer-verbalizer_cognitive_styles"}, {"score": 0.004752954376588157, "phrase": "visual_or_verbal_learning_material"}, {"score": 0.004425909662226326, "phrase": "computer_technology"}, {"score": 0.004215868268050613, "phrase": "individual_learners"}, {"score": 0.004121275290411653, "phrase": "current_study"}, {"score": 0.00401575464882225, "phrase": "student's_preference"}, {"score": 0.0038251032877881412, "phrase": "specific_format"}, {"score": 0.0035501395640663786, "phrase": "pretest_post-test_design"}, {"score": 0.003370565320453525, "phrase": "mathematical_learning_task"}, {"score": 0.0033271045779740683, "phrase": "probability_theory"}, {"score": 0.002608218347502229, "phrase": "learning_results"}, {"score": 0.0025578967205807843, "phrase": "cognitive_ability"}, {"score": 0.002436289099444074, "phrase": "cognitive_processing"}, {"score": 0.002366110899738696, "phrase": "preferred_format"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human-computer interface", " Interactive learning environments", " Media in education", " Multimedia/hypermedia systems", " Simulations"], "paper_abstract": "A student might find a certain representational format (e.g., diagram, text) more attractive than other formats for learning. Computer technology offers opportunities to adjust the formats used in learning environments to the preferences of individual learners. The question addressed in the current study was: does the match between a student's preference regarding the format of learning materials have any relation with performance when learning with a specific format? For example, do learners with a preference for visual materials indeed perform better with visual learning materials? In a study with a pretest post-test design, 48 participants were randomly assigned to one of two conditions. Both conditions completed a mathematical learning task about combinatorics and probability theory. In one condition learning materials were mainly diagram-based in the other condition they were mainly text-based. Afterward, the relations between cognitive style (visualizers-verbalizers), cognitive abilities (e.g., spatial and verbal ability), and learning performance were examined. The findings showed that cognitive style and learning outcomes were unrelated, for example, learners with a preference for visual materials do not necessarily perform better with visual learning materials. Learning results seem to be influenced by cognitive ability (in particular spatial visualization) and the extent to which a format affords cognitive processing, rather than a match between used and preferred format. It is argued that students should not choose on the basis of their preference, because it might lead them to selecting a format that is less effective for learning. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Exploring the relation between visualizer-verbalizer cognitive styles and performance with visual or verbal learning material", "paper_id": "WOS:000298523800003"}