{"auto_keywords": [{"score": 0.04974064540897106, "phrase": "finland"}, {"score": 0.015719650696396813, "phrase": "healthcare_it_development"}, {"score": 0.003933508945770709, "phrase": "future_it_systems"}, {"score": 0.0037163618245226755, "phrase": "working-age_physicians"}, {"score": 0.00346164863873186, "phrase": "entire_questionnaire"}, {"score": 0.0032937749380725317, "phrase": "statistical_methods"}, {"score": 0.0032358074601765555, "phrase": "former_and_content_analysis"}, {"score": 0.0031451673059794205, "phrase": "responding_physicians"}, {"score": 0.003024655649924378, "phrase": "current_methods"}, {"score": 0.00297141030969672, "phrase": "rather_the_lack"}, {"score": 0.0027188802510720775, "phrase": "common_assumption"}, {"score": 0.002642681666526916, "phrase": "future_systems"}, {"score": 0.0025686131021181134, "phrase": "usability_improvements"}, {"score": 0.0025413743933379185, "phrase": "current_systems"}, {"score": 0.0025055037815033725, "phrase": "major_improvements"}, {"score": 0.0023006418600072325, "phrase": "improved_methods"}, {"score": 0.0021657265492371976, "phrase": "on-going_development"}, {"score": 0.0021503823972534096, "phrase": "commercial-off-the-shelf_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["End-user participation", " Computer systems development", " Medical informatics applications", " Physicians", " Finland", " Questionnaires", " User-computer interface"], "paper_abstract": "Objective: To learn (1) about the kind of experiences that physicians have with participation in healthcare IT development; (2) whether physicians are interested in participating in IT development activities, and if so, how; and (3) the visions that physicians have regarding future IT systems. Methods: A web-based questionnaire which was answered by about one-third of the working-age physicians in Finland, which is exceptionally broad and sizeable a sample. This research deals with only a small part of the entire questionnaire. The questions used for this study were both quantitative and qualitative. Statistical methods were applied to the former and content analysis to the latter. Results: The responding physicians were highly critical of their IT systems, and their experiences with the current methods of participation, or rather the lack of it, were quite negative. However, a very significant proportion of the respondents were willing to contribute to IT systems development, contrary to a common assumption that clinicians are disinterested. Visioning of future systems was quite cautious, dealing mainly with usability improvements to the current systems. Conclusions: Major improvements are needed both in the usability of the systems currently in use in Finland and in the collaboration between end-users and developers. Improved methods of participation need to be developed and applied, particularly for the procurement, deployment and on-going development of commercial-off-the-shelf applications. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Physicians' experiences of participation in healthcare IT development in Finland: Willing but not able", "paper_id": "WOS:000299311000003"}