{"auto_keywords": [{"score": 0.040562026366344935, "phrase": "cultural_dimensions"}, {"score": 0.028198276166246455, "phrase": "e-service_quality"}, {"score": 0.008508951795185193, "phrase": "web_site"}, {"score": 0.00525799338439291, "phrase": "moderating_effect"}, {"score": 0.00459039896577789, "phrase": "tourism_service"}, {"score": 0.004334658876001957, "phrase": "british"}, {"score": 0.004272984584732603, "phrase": "spanish"}, {"score": 0.0041522059428827345, "phrase": "tourism_product"}, {"score": 0.003977403701783668, "phrase": "structural_equation_model"}, {"score": 0.0037377733149169573, "phrase": "online_tourist_satisfaction"}, {"score": 0.0036845490951857617, "phrase": "original_data"}, {"score": 0.003332537728389913, "phrase": "service_quality"}, {"score": 0.0032850648549389025, "phrase": "tourists'_satisfaction"}, {"score": 0.002648768009464535, "phrase": "key_practical_implications"}, {"score": 0.002524982927936405, "phrase": "tourist_satisfaction"}, {"score": 0.0024771000236931836, "phrase": "online_purchase"}, {"score": 0.0023388183537341213, "phrase": "web-based_businesses"}, {"score": 0.0021049977753042253, "phrase": "cross-cultural_study"}], "paper_keywords": ["Consumer behaviour", " Tourism", " Internet", " Web sites", " Customer satisfaction", " E-service quality", " E-satisfaction", " National cultures", " Tourist behaviour"], "paper_abstract": "Purpose - The purpose of this paper is to analyse the influence of culture on the relationship between each of the dimensions of e-service quality and satisfaction with a web site involving purchase of a tourism service. Design/methodology/approach - A questionnaire was administered to 300 international tourists (150 British and 150 Spanish) who had purchased a tourism product via the internet. The study employs a structural equation model to analyse the effect of cultural dimensions on the relationship between e-service quality and online tourist satisfaction. The original data were standardised in order to allow comparison. Findings - The results show that the influence of the dimensions of service quality on the tourists' satisfaction with their online purchases is moderated by cultural dimensions, namely uncertainty avoidance and individualism/collectivism. Research limitations/implications - In this study only two cultures are used to analyse the moderating effect of cultural dimensions on the relationship between quality and satisfaction and only two cultural dimensions are analysed. Practical implications - The key practical implications of the work lie in illuminating the variations in tourist satisfaction when making an online purchase, and understanding the role played by cultural dimensions in interactions with web-based businesses. Originality/value - This paper makes progress in the study of the dimensions of the e-service quality. Furthermore it is a cross-cultural study which pays attention to the moderating effect of the cultural dimensions on the relationship of each dimension of e-service quality with satisfaction with the web site.", "paper_title": "E-service quality as antecedent to e-satisfaction The moderating effect of culture", "paper_id": "WOS:000304637600001"}