{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "supply_chain_visibility"}, {"score": 0.00940917715511841, "phrase": "supply_chain_strategic_performance"}, {"score": 0.007025335505011853, "phrase": "strategic_value"}, {"score": 0.00600056123977412, "phrase": "supply_chain_reconfigurability"}, {"score": 0.004212453011596424, "phrase": "dynamic_capabilities"}, {"score": 0.003051713660488494, "phrase": "direct_impact"}, {"score": 0.002526938673434697, "phrase": "supply_chains"}, {"score": 0.0023776656246300063, "phrase": "greater_competitive_advantage"}, {"score": 0.0021049977753042253, "phrase": "european_journal_of_information_systems"}], "paper_keywords": ["supply chain visibility", " dynamic capabilities", " reconfigurability", " strategic value"], "paper_abstract": "To understand the role of supply chain visibility in creating strategic value, this study uses the dynamic capabilities view to uncover the nature of supply chain visibility. The study identifies four important constructs of supply chain visibility that are helpful in driving supply chain reconfigurability and thus improving supply chain strategic performance. They are visibility for sensing, visibility for learning, visibility for coordinating, and visibility for integrating. The results show that visibility for sensing has direct impact on supply chain strategic performance. Empirical evidence also supports that visibility for learning, visibility for coordinating, and visibility for integrating are important for enhancing supply chain reconfigurability, thus creating strategic value in supply chains. Supply chain visibility therefore enables firms to reconfigure their supply chain resources for greater competitive advantage. Implications of the results regarding the nature and the role of supply chain visibility in enhancing supply chain strategic performance are provided. European Journal of Information Systems (2010) 19, 238-249. doi: 10.1057/ejis.2010.10; published online 9 March 2010", "paper_title": "The strategic value of supply chain visibility: increasing the ability to reconfigure", "paper_id": "WOS:000277833900009"}