{"auto_keywords": [{"score": 0.04508162406013035, "phrase": "organization_goals"}, {"score": 0.008713768692145006, "phrase": "organization_goals_conformance"}, {"score": 0.005648182383539371, "phrase": "relevant_organization_data"}, {"score": 0.004723847090183984, "phrase": "organizational_goals"}, {"score": 0.004252602474733162, "phrase": "structuring_the_organization_goals_model"}, {"score": 0.003828187766572941, "phrase": "unified_model"}, {"score": 0.003773680962197766, "phrase": "organization_goals_structure"}, {"score": 0.0036845490951857617, "phrase": "recent_literature"}, {"score": 0.002752139271586703, "phrase": "organization_ontology"}, {"score": 0.002611010097359509, "phrase": "domain_experts"}, {"score": 0.0024652715040303416, "phrase": "decision_making"}, {"score": 0.002305468528385778, "phrase": "first_step"}, {"score": 0.0022294857939412073, "phrase": "organization_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ontology", " Ontology comparison", " Organization goals", " Organization modeling", " Organization ontology", " Literature review"], "paper_abstract": "Organizational goals serve as the most important achievement target in every organization. Even though some researchers have developed the concept of the organization goals, but structuring the organization goals model is always questionable by the way it is being used. In this paper, we propose ontology to develop a unified model for the organization goals structure. We review the recent literature on the organization modelling and ontology development as an effort to evaluate the organization goals using a metrics for the achievement of the organization goals. We suggest that the metrics is important to identify the relevant organization data in relation to the organization goals conformance. In order to achieve this purpose, we investigate various associated concepts and organize the literature based on the organization goals, organization ontology and metrics model. We observe our proposed models are important for domain experts and entrepreneurs to evaluate the relevant organization data and to assist them in decision making. In summary, the contribution of this survey may serve as a first step in understanding the evaluation of the organization data for the achievement of the organization goals. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Recent developments in the organization goals conformance using ontology", "paper_id": "WOS:000317162900043"}