{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rss"}, {"score": 0.04054616108459909, "phrase": "news_articles"}, {"score": 0.004722898398399427, "phrase": "user_profile"}, {"score": 0.004650519511749445, "phrase": "end_device"}, {"score": 0.004109865377936045, "phrase": "useful_information"}, {"score": 0.0038189638340666936, "phrase": "aforementioned_situation"}, {"score": 0.0037170399498025215, "phrase": "interesting_news_articles"}, {"score": 0.003674192201248236, "phrase": "daily_basis"}, {"score": 0.003548579306515579, "phrase": "small_screen_device"}, {"score": 0.003374655868348244, "phrase": "rss_feeds"}, {"score": 0.003005039427642664, "phrase": "merely_the_useful_information"}, {"score": 0.0028798723050615788, "phrase": "efficient_results"}, {"score": 0.002429090371567499, "phrase": "end_user's_small_screen_device"}, {"score": 0.002283243905993669, "phrase": "summarization_procedures"}, {"score": 0.0021544587602892466, "phrase": "client_device_capacity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Summarization algorithms", " Categorization procedure", " Data reprocessing", " Efficient text summarization", " Personalizing the web", " Text categorization", " Sentence weighting"], "paper_abstract": "In the last decade, the advances in technology along with the ease of access to information have dramatically changed the World Wide Web status during the last few years. The Internet acts as a means of finding useful information and more specifically news articles. Additionally, more and more people want to utilize their mobile devices towards the scope of reading news articles. The aforementioned situation generates a significant, yet almost untouched problem: easily locating interesting news articles on a daily basis within the space that is available on the small screen device. In our work, we propose a framework that, by utilizing RSS feeds, is able to personalize on the needs of the users and on the capabilities of their device, in order to present to them only a fraction of the news articles and merely the useful information that derives from them. Deploying a generalized, multifunctional mechanism that produces efficient results for the situation described, seems to be a panacea for most of the text-based, information retrieval needs. Within this framework we created PeRSSonal, a mechanism that is able to create personalized, pre-categorized, dynamically generated RSS feeds focalized on the end user's small screen device. The system is based on algorithms that incorporate the user into the categorization and summarization procedures, while the articles are presented back to him/her according to her interests and the client device capacity. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Adaptation of RSS feeds based on the user profile and on the end device", "paper_id": "WOS:000278578500006"}