{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_annotation_task"}, {"score": 0.003916098498242888, "phrase": "short_summary"}, {"score": 0.003479692058963528, "phrase": "first_international_evaluation"}, {"score": 0.0032800186243040663, "phrase": "completely_automatic_annotation"}, {"score": 0.0032414759269196493, "phrase": "medical_images"}, {"score": 0.0031845067058084583, "phrase": "visual_properties"}, {"score": 0.002914288956035066, "phrase": "automatic_annotation_techniques"}, {"score": 0.0028293966058473476, "phrase": "semantic_information"}, {"score": 0.0027961342030212353, "phrase": "little-annotated_medical_images"}, {"score": 0.002620040660435039, "phrase": "experienced_physicians"}, {"score": 0.0024842242921857705, "phrase": "detailed_analysis"}, {"score": 0.0021682027434117095, "phrase": "strong_participation"}, {"score": 0.0021049977753042253, "phrase": "future_benchmarks"}], "paper_keywords": ["content-based image retrieval", " medical image annotation", " evaluation in computer vision"], "paper_abstract": "In this paper, the automatic annotation task of the 2005 CLEF cross-language image retrieval campaign (ImageCLEF) is described. This paper focuses on the database used, the task setup, and the plans for further medical image annotation tasks in the context of ImageCLEF. Furthermore, a short summary of the results of 2005 is given. The automatic annotation task was added to ImageCLEF in 2005 and provides the first international evaluation of state-of-the-art methods for completely automatic annotation of medical images based on visual properties. The aim of this task is to explore and promote the use of automatic annotation techniques to allow for extracting semantic information from little-annotated medical images. A database of 10.000 images was established and annotated by experienced physicians resulting in 57 classes, each with at least 10 images. Detailed analysis is done regarding the (i) image representation, (ii) classification method, and (iii) learning method. Based on the strong participation of the 2005 campain, future benchmarks are planned.", "paper_title": "The CLEF 2005 automatic medical image annotation task", "paper_id": "WOS:000246318800005"}