{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collision_notification"}, {"score": 0.049452114640627876, "phrase": "wireless_transmitter"}, {"score": 0.03987826082742922, "phrase": "wireless_networks"}, {"score": 0.0273901230181267, "phrase": "listener_antenna"}, {"score": 0.004669085371587273, "phrase": "packet_loss"}, {"score": 0.004507760907425495, "phrase": "entire_transmission"}, {"score": 0.004183137595671171, "phrase": "wired_networks"}, {"score": 0.00395069818358908, "phrase": "useful_communication"}, {"score": 0.003492840830999027, "phrase": "channel_activity"}, {"score": 0.0031289290660162145, "phrase": "novel_scheme"}, {"score": 0.002941913249957503, "phrase": "phy-layer_information"}, {"score": 0.0027417911324611917, "phrase": "unique_signature"}, {"score": 0.002544017922741882, "phrase": "signature_correlation"}, {"score": 0.0023294867572824147, "phrase": "notification_signature"}, {"score": 0.0021805201234139475, "phrase": "strong_self-interference"}, {"score": 0.0021518875024104244, "phrase": "transmit_antenna"}, {"score": 0.0021236300589450143, "phrase": "prototype_testbed"}], "paper_keywords": ["Collision detection", " wireless communication"], "paper_abstract": "A wireless transmitter learns of a packet loss and infers collision only after completing the entire transmission. If the transmitter could detect the collision early [such as with carrier sense multiple access with collision detection (CSMA/CD) in wired networks], it could immediately abort its transmission, freeing the channel for useful communication. There are two main hurdles to realize CSMA/CD in wireless networks. First, a wireless transmitter cannot simultaneously transmit and listen for a collision. Second, any channel activity around the transmitter may not be an indicator of collision at the receiver. This paper attempts to approximate CSMA/CD in wireless networks with a novel scheme called CSMA/CN (collision notification). Under CSMA/CN, the receiver uses PHY-layer information to detect a collision and immediately notifies the transmitter. The collision notification consists of a unique signature, sent on the same channel as the data. The transmitter employs a listener antenna and performs signature correlation to discern this notification. Once discerned, the transmitter immediately aborts the transmission. We show that the notification signature can be reliably detected at the listener antenna, even in the presence of a strong self-interference from the transmit antenna. A prototype testbed of 10 USRP/GNU Radios demonstrates the feasibility and effectiveness of CSMA/CN.", "paper_title": "CSMA/CN: Carrier Sense Multiple Access With Collision Notification", "paper_id": "WOS:000303068300017"}