{"auto_keywords": [{"score": 0.046411984812010414, "phrase": "electrical_engineering"}, {"score": 0.032255822944368726, "phrase": "ics_course"}, {"score": 0.011120615977018486, "phrase": "hop"}, {"score": 0.00481495049065317, "phrase": "supplementary_hands-on_practice"}, {"score": 0.004748832495727873, "phrase": "introductory_computer_science_course"}, {"score": 0.004651346011959237, "phrase": "computer_science"}, {"score": 0.004524455848517757, "phrase": "compulsory_theoretical_course"}, {"score": 0.004222145870153206, "phrase": "ics"}, {"score": 0.004178522455099832, "phrase": "wide_variety"}, {"score": 0.004036455094603843, "phrase": "incomplete_understanding"}, {"score": 0.003967235882351874, "phrase": "learning_incentive"}, {"score": 0.003939880387831148, "phrase": "possible_problems"}, {"score": 0.0035884582625234297, "phrase": "advanced_practice_courses"}, {"score": 0.0034424690391411093, "phrase": "first-year_college_students"}, {"score": 0.0033484464719654105, "phrase": "better_understanding"}, {"score": 0.002986907667028281, "phrase": "hop_participants"}, {"score": 0.0029458177077921043, "phrase": "significantly_higher_academic_scores"}, {"score": 0.0026735459686033627, "phrase": "increased_interest"}, {"score": 0.00254697318939512, "phrase": "third_prize"}, {"score": 0.00246877952076635, "phrase": "optional_hop"}, {"score": 0.002279660253812632, "phrase": "students'_academic_performance"}, {"score": 0.0022639147412879487, "phrase": "class_attendance_rate"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Introduction to Computer Science (ICS)", " Hands-on practice (HOP)", " Education", " Electrical engineering (EE)"], "paper_abstract": "Introduction to Computer Science (ICS), which is a compulsory theoretical course for freshmen of the electrical engineering (EE) department, lays the foundation for more advanced courses. Nevertheless, since ICS covers a wide variety of concepts that are difficult to completely comprehend, incomplete understanding and a loss of learning incentive are possible problems. The aim of implementing hands-on practice (HOP) activities was to prepare the students for the actual hardware manipulation in the field of EE and also to enhance their performance in the future advanced practice courses. Through organizing optional evening hands-on practice (HOP) activities, this study investigated whether the first-year college students who participated in HOP would exhibit a better understanding in ICS compared to those who did not. The enrollment in HOP was optional in which the performance did not affect the score in the ICS course. The results showed that HOP participants not only had significantly higher academic scores (p < 0.05), but were also less stressed toward the ICS course (p < 0.05) than the non-participants. The former also showed increased interest in accepting challenges (e.g. Two HOP participants later entered the National Microcomputer Design Competition and were awarded the third prize). In conclusion, the introduction of optional HOP for freshmen of electrical engineering not only alleviated the stress that they face in response to the ICS course, but also improved the students' academic performance and class attendance rate as well as raising their interest and boosting their confidence in further challenges in the field of electrical engineering. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The impact of supplementary hands-on practice on learning in introductory computer science course for freshmen", "paper_id": "WOS:000326554100001"}