{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "continuous_location-dependent_queries"}, {"score": 0.049089957407198945, "phrase": "location_granules"}, {"score": 0.004687419167634463, "phrase": "location-based_services"}, {"score": 0.004604271739916253, "phrase": "important_research"}, {"score": 0.004536104856119294, "phrase": "mobile_computing"}, {"score": 0.004482295432728009, "phrase": "different_mechanisms"}, {"score": 0.004402770481509365, "phrase": "location-dependent_queries"}, {"score": 0.004247910389657671, "phrase": "location_data"}, {"score": 0.004184997303147371, "phrase": "fine_geographic_precision"}, {"score": 0.004123012124092743, "phrase": "different_granularity"}, {"score": 0.0037139814615660943, "phrase": "city_name"}, {"score": 0.0032664003336950243, "phrase": "gps-like_geographic_coordinates"}, {"score": 0.003123265938453612, "phrase": "existing_approaches"}, {"score": 0.0030495020877548324, "phrase": "maximum_precision"}, {"score": 0.0029333222445143705, "phrase": "distributed_query_processing_approach"}, {"score": 0.0028554857218530206, "phrase": "location_resolution"}, {"score": 0.002746677144043828, "phrase": "required_terminology"}, {"score": 0.0022616217096561274, "phrase": "extensive_experimental_evaluation"}, {"score": 0.0021949961292124145, "phrase": "expressive_power"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Location-based services", " Location granules", " Location-dependent constraints", " Continuous and distributed query processing"], "paper_abstract": "Location-based services have attracted the attention of important research in the field of mobile computing. Specifically, different mechanisms have been proposed to process location-dependent queries. In the above mentioned context, it is usually assumed that the location data are expressed at a fine geographic precision. However, a different granularity may be more appropriate in certain situations. Thus, a location resolution higher than required may even be inconvenient or not understandable by the user (for example, if the user expects a city name as an answer and instead the system provides the latitude/longitude coordinates). Moreover, if the locations presented to the user need to be refreshed automatically as the objects move, it is obvious that maintaining up-to-date GPS-like geographic coordinates would be more expensive in terms of processing and communication. Unfortunately, the existing approaches assume queries whose locations are always given with maximum precision (i.e., GPS locations). In this paper, a distributed query processing approach that adapts itself to the level of the location resolution required is presented. Thus, it supports continuous location-dependent queries based on the required terminology for the locations, depending on the granularity used (e.g., GPS, cities, states, provinces, or any other predefined geographic area). For the above mentioned purpose, location granules can be defined to specify the semantics appropriate for the queries and/or the way the results should be presented. A prototype showing the functionality and benefits of the approach has been implemented and used in an extensive experimental evaluation. The proposal not only increases the flexibility and expressive power of the queries considerably but also performs efficiently. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "An approach to process continuous location-dependent queries on moving objects with support for location granules", "paper_id": "WOS:000292227600006"}