{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "precise_style"}, {"score": 0.007618400124048167, "phrase": "workflow_modeling"}, {"score": 0.004670597652149685, "phrase": "controlled_experiments"}, {"score": 0.004135010810625326, "phrase": "uml_activity_diagrams"}, {"score": 0.004046020290832207, "phrase": "construct_comprehensibility"}, {"score": 0.0037087324991876727, "phrase": "different_levels"}, {"score": 0.0035662378173267647, "phrase": "specific_rules"}, {"score": 0.0030223381739019894, "phrase": "comprehension_tasks"}, {"score": 0.002868404184756449, "phrase": "lighter_variant"}, {"score": 0.002831158147480665, "phrase": "main_results"}, {"score": 0.002640507929183363, "phrase": "significantly_better_comprehension"}, {"score": 0.002473420909291381, "phrase": "significant_impact"}, {"score": 0.0024519545383399773, "phrase": "task_completion_time"}, {"score": 0.0021049977753042253, "phrase": "comprehending_workflows"}], "paper_keywords": ["Family of experiments", " Precise and Ultra-light styles", " UML activity diagrams", " Workflow modeling"], "paper_abstract": "In this paper, we present the results from a family of experiments conducted to assess whether the level of formality/precision in workflow modeling, based on UML activity diagrams, influences two aspects of construct comprehensibility: correctness of understanding and task completion time. In particular, we have considered two styles for workflow modeling with different levels of formality: a precise style (with specific rules and imposed constraints) and an ultra-light style (no rules, no imposed constraints). Experiments were conducted with 111 participants (Bachelor and Master students). In each experiment, participants accomplished comprehension tasks on two workflows, modeled either with the precise style or with a lighter variant. The main results from our data analysis can be summarized as follows: (i) all participants achieved a significantly better comprehension of workflows written in the precise style, (ii) the style had no significant impact on task completion time, (iii) more experienced participants benefited more, with respect to less experienced ones, from the precise style, as for their correctness of understanding, and (iv) all participants found the precise style useful in comprehending workflows.", "paper_title": "On the comprehension of workflows modeled with a precise style: results from a family of controlled experiments", "paper_id": "WOS:000365427900009"}