{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "empirical_distribution"}, {"score": 0.004782455247247007, "phrase": "prokaryotic_genome_n-mers"}, {"score": 0.00451491283266524, "phrase": "vital_step"}, {"score": 0.004454158739805578, "phrase": "entire_genome"}, {"score": 0.0040373708328770306, "phrase": "extremely_rare_words"}, {"score": 0.003916098498242888, "phrase": "negative_binomial_distribution"}, {"score": 0.003837273003552065, "phrase": "n-mer_distributions"}, {"score": 0.0033399473627760945, "phrase": "poisson"}, {"score": 0.0027336881691956186, "phrase": "negative_binomial_model"}, {"score": 0.0026157259734105, "phrase": "small_percentage"}, {"score": 0.0025028412246758994, "phrase": "zinb."}, {"score": 0.0024607296642187846, "phrase": "zero-inflation_distributions"}, {"score": 0.0024358027662024105, "phrase": "traditional_poisson_setting"}, {"score": 0.0021049977753042253, "phrase": "possible_overdispersion"}], "paper_keywords": ["DNA", " genome analysis", " probability", " statistics"], "paper_abstract": "Characterizing the empirical distribution of the frequency of n-mers is a vital step in understanding the entire genome. This will allow for researchers to examine how complex the genome really is, and move beyond simple, traditional modeling frameworks that are often biased in the presence of abundant and/or extremely rare words. We hypothesize that models based on the negative binomial distribution and its zero-inflated counterpart will characterize the n-mer distributions of genomes better than the Poisson. Our study examined the empirical distribution of the frequency of n-mers (6 <= n <= 11) in 2,199 genomes. We considered four distributions: Poisson, negative binomial, zero-inflated Poisson, and zero-inflated negative binomial (ZINB). The number of genomes that have nullomers in 6-, 7-, and 8-mers was 150, 602 and 2,012, respectively, whereas all of the genomes for the 9-, 10-, and 11-mers had nullomers. In each n-mer considered, the negative binomial model performed the best for at least 93% of the 2,199 genomes; however, a small percentage (i.e., < 7%) of the genomes did prefer the ZINB. The negative binomial and zero-inflation distributions extend the traditional Poisson setting and are more flexible in handling overdispersion that can be caused by an increase in nullomers. In an effort to characterize the distribution of the frequency of n-mers, researchers should also consider other discrete distributions that are more flexible and adjust for possible overdispersion.", "paper_title": "Characterizing the Empirical Distribution of Prokaryotic Genome n-mers in the Presence of Nullomers", "paper_id": "WOS:000342301600002"}