{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "social_cognitive_theory-based_hip_fracture_prevention_web_site_for_older_adults"}, {"score": 0.004399905285945236, "phrase": "preliminary_evaluation"}, {"score": 0.004122490120202936, "phrase": "moderated_discussion_board"}, {"score": 0.003901407184706592, "phrase": "newspaper_advertisement"}, {"score": 0.0029463123778313196, "phrase": "significant_improvement"}, {"score": 0.002873331232538783, "phrase": "calcium_intake"}, {"score": 0.0026919067120537055, "phrase": "time_interactions"}, {"score": 0.0024717881264735477, "phrase": "discussion_board_usage"}, {"score": 0.0024105326885334962, "phrase": "outcome_gains"}, {"score": 0.0023040642263522505, "phrase": "preliminary_effectiveness"}, {"score": 0.0022810491620483737, "phrase": "web-based_health_interventions"}, {"score": 0.0021049977753042253, "phrase": "online_health_behavior_change_interventions"}], "paper_keywords": ["Health promotion", " Hip fracture prevention Internet", " Older adults", " Social Cognitive Theory-based online intervention"], "paper_abstract": "The purposes of this study were to develop a Social Cognitive Theory-based, structured Hip Fracture Prevention Web site for older adults and conduct a preliminary evaluation of its effectiveness. The Theory-based, structured Hip Fracture Prevention Web site is composed of learning modules and a moderated discussion board. A total of 245 older adults recruited from two Web sites and a newspaper advertisement were randomized into the Theory-based, structured Hip Fracture Prevention Web site and the conventional Web sites groups. Outcomes included (1) knowledge (hip fractures and osteoporosis), (2) self-efficacy and outcome expectations, and (3) calcium intake and exercise and were assessed at baseline, end of treatment (2 weeks), and follow-up (3 months). Both groups showed significant improvement in most outcomes. For calcium intake, only the Theory-based, structured Hip Fracture Prevention Web site group showed improvement. None of the group and time interactions were significant. The Theory-based, structured Hip Fracture Prevention Web site group, however, was more satisfied with the intervention. The discussion board usage was significantly correlated with outcome gains. Despite several limitations, the findings showed some preliminary effectiveness of Web-based health interventions for older adults and the use of a Theory-based, structured Hip Fracture Prevention Web site as a sustainable Web structure for online health behavior change interventions.", "paper_title": "Effects of a Social Cognitive Theory-Based Hip Fracture Prevention Web Site for Older Adults", "paper_id": "WOS:000283848300006"}