{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "joint_detection"}, {"score": 0.004550029253278477, "phrase": "lossless_source_coding"}, {"score": 0.004398094237005956, "phrase": "asymptotically_optimal_decision_rules"}, {"score": 0.004156012879026324, "phrase": "desired_information_source"}, {"score": 0.0031665087019813244, "phrase": "performance_criterion"}, {"score": 0.0030606302942851027, "phrase": "false_alarm_probability"}, {"score": 0.002843180211561427, "phrase": "false_alarm_event"}, {"score": 0.0027480831196871093, "phrase": "asymptotic_performance"}, {"score": 0.0027017308406240563, "phrase": "decision_rules"}, {"score": 0.0026262033625248445, "phrase": "universal_decision_rules"}, {"score": 0.0025383451160985488, "phrase": "underlying_sources"}, {"score": 0.0023713273141757326, "phrase": "training_sequences"}], "paper_keywords": ["Error exponent", " hypothesis testing", " false alarm", " misdetection", " source coding", " universal schemes"], "paper_abstract": "The problem of joint detection and lossless source coding is considered. We derive asymptotically optimal decision rules for deciding whether or not a sequence of observations has emerged from a desired information source, and to compress it if has. In particular, our decision rules asymptotically minimize the cost of compression in the case that the data have been classified as desirable, subject to given constraints on the two kinds of the probability of error. In another version of this performance criterion, the constraint on the false alarm probability is replaced by a constraint on the cost of compression in the false alarm event. We then analyze the asymptotic performance of these decision rules. We also derive universal decision rules for the case where the underlying sources (under either hypothesis or both) are unknown, and training sequences from each source may or may not be available. Finally, we discuss how our framework can be extended in several directions.", "paper_title": "Asymptotically Optimal Decision Rules for Joint Detection and Source Coding", "paper_id": "WOS:000344524100004"}