{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "superpixel_segmentation"}, {"score": 0.004601508848655033, "phrase": "connected_set"}, {"score": 0.004555371402128666, "phrase": "homogeneous_regions"}, {"score": 0.0043533862892678864, "phrase": "specific_properties"}, {"score": 0.004266501496765747, "phrase": "almost_all_authors"}, {"score": 0.003233075944817365, "phrase": "compact_superpixels"}, {"score": 0.0031845067058084583, "phrase": "example_application"}, {"score": 0.003012560489169148, "phrase": "negative_correlation"}, {"score": 0.0028933521924166287, "phrase": "second_desirable_property"}, {"score": 0.0028642924503126154, "phrase": "superpixel_segmentations"}, {"score": 0.002750934994181092, "phrase": "regular_structure"}, {"score": 0.002682370021834353, "phrase": "pixel_grid"}, {"score": 0.0022706700510423954, "phrase": "six_benchmark_algorithms"}, {"score": 0.0022252591643049744, "phrase": "proposed_algorithm"}], "paper_keywords": ["Superpixel segmentation", " Compactness", " Superpixel lattices"], "paper_abstract": "Superpixel segmentation is the oversegmentation of an image into a connected set of homogeneous regions. Depending on the algorithm, superpixels have specific properties. One property that almost all authors claim for their superpixels is compactness. However, the compactness of superpixels has not yet been measured and the implications of compactness have not been investigated for superpixels. As our first contribution, we propose a metric to measure the compactness of superpixels. We further discuss implications of compactness and demonstrate the benefits of compact superpixels with an example application. Most importantly, we show that there is a negative correlation between compactness and boundary recall. A second desirable property for superpixel segmentations is conforming to a lattice. This regular structure, similar to the pixel grid of an image, can then be used for more efficient algorithms. As our second contribution, we propose an algorithm that offers both a transparent and easy-to-use compactness control with an optional lattice guarantee. We show in our evaluation with six benchmark algorithms, that the proposed algorithm outperforms the state-of-the-art. (C) 2013 Elsevier B. V. All rights reserved.", "paper_title": "An evaluation of the compactness of superpixels", "paper_id": "WOS:000334315000008"}