{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "end-user_programmers"}, {"score": 0.01029327811665258, "phrase": "yahoo"}, {"score": 0.008386706319743302, "phrase": "community_repositories"}, {"score": 0.004741575909417311, "phrase": "public_repositories"}, {"score": 0.004640732813201498, "phrase": "pipes"}, {"score": 0.004617976623151858, "phrase": "context"}, {"score": 0.004445362365289235, "phrase": "increasingly_large_number"}, {"score": 0.004364165612189736, "phrase": "software_engineering_challenges"}, {"score": 0.0039070805769954005, "phrase": "better_understanding"}, {"score": 0.0038831337860595434, "phrase": "end-user_programmer_communities"}, {"score": 0.003551895245595481, "phrase": "pipes_repository"}, {"score": 0.003131080208280537, "phrase": "great_deal"}, {"score": 0.0027770234187618815, "phrase": "existing_programs"}, {"score": 0.002432762217202045, "phrase": "better_end-user_programmer_support"}, {"score": 0.0023882384197463987, "phrase": "software_life-cycle"}, {"score": 0.002315831335278694, "phrase": "program_understanding"}, {"score": 0.002224966726830651, "phrase": "highly-similar_artifacts"}, {"score": 0.0021641529087429797, "phrase": "full_advantage"}, {"score": 0.002144252482711611, "phrase": "community_resources"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["End-user programmers", " Community analysis", " Artifact repositories", " Web mashups", " Diversity analysis"], "paper_abstract": "Context: End-user programmers are numerous, write software that matters to an increasingly large number of users, and face software engineering challenges that are similar to their professionals counterparts. Yet, we know little about how these end-user programmers create and share artifacts in repositories as part of a community. Objective: This work aims to gain a better understanding of end-user programmer communities, the characteristics of artifacts in community repositories, and how authors evolve over time. Method: An artifact-based analysis of 32,000 mashups from the Yahoo! Pipes repository was performed. The popularity, configurability, complexity, and diversity of the artifacts were measured. Additionally, for the most prolific authors, we explore their submission trends over time. Results: Similar to other online communities, there is great deal of attrition but authors who persevere tend to improve over time, creating pipes that are more configurable, diverse, complex, and popular. We also discovered, however, that end-user programmers do not effectively reuse existing programs, submit pipes that are highly similar to others already in the repository, and in most cases do not have an awareness of the community or the richness of artifacts that exist in repositories. Conclusion: There is a need for better end-user programmer support in several stages of the software life-cycle, including development, maintenance, search, and program understanding. Without such support, the community repositories will continue to be cluttered with highly-similar artifacts and authors may not be able to take full advantage of the community resources. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Discovering how end-user programmers and their communities use public repositories: A study on Yahoo! Pipes", "paper_id": "WOS:000320217900011"}