{"auto_keywords": [{"score": 0.04640845917719624, "phrase": "wireless_technologies"}, {"score": 0.038673829558973125, "phrase": "service_level_negotiation_protocol"}, {"score": 0.0375570334701301, "phrase": "service_level"}, {"score": 0.00481495049065317, "phrase": "emerging_new_services"}, {"score": 0.004548848077202625, "phrase": "qos._these"}, {"score": 0.004379662855702013, "phrase": "wi-fi"}, {"score": 0.004232702713825967, "phrase": "service_delivery"}, {"score": 0.004184825434585617, "phrase": "security_attacks"}, {"score": 0.004121826934975274, "phrase": "open_medium"}, {"score": 0.00393844255111604, "phrase": "qos_level"}, {"score": 0.003908678575537341, "phrase": "security_level"}, {"score": 0.0038062581748678245, "phrase": "provided_services"}, {"score": 0.0036093693971289754, "phrase": "dynamic_negotiation"}, {"score": 0.0033329032920236994, "phrase": "malicious_attacks"}, {"score": 0.0031726658985051924, "phrase": "qos"}, {"score": 0.002350196395175188, "phrase": "security_mechanisms"}, {"score": 0.002288519595829552, "phrase": "negotiation_protocol_performances"}, {"score": 0.0021948455916770233, "phrase": "security_solution"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["service level", " negotiation protocol", " web services", " security protocols", " performances evaluation"], "paper_abstract": "Today, the emerging new services like voice over IP and video on demand require some guarantees in terms of QoS. These services can be accessed using wireless technologies, such as Wi-Fi or WiMAX (Worldwide Interoperability for Microwave Access). This may make the service delivery vulnerable to security attacks because of the open medium on which wireless technologies are based. Thus, in addition to QoS level, security level must also be guaranteed for the provided services. In this paper, we present the service level negotiation protocol, which ensures a dynamic negotiation of a service level covering both QoS and security. Moreover, the negotiation flow itself could be the target of some malicious attacks. Indeed, these attacks can aim to degrade the service level (QoS and / or security) or to make an entity, which is involved in a negotiation, unavailable, etc. Thus, the objective of this paper is to study the security of the flow corresponding to the negotiation provided by service level negotiation protocol. In fact, the security required by this flow will be provided through the use of three different mechanisms: Web services security, secure sockets layer, and IP security protocol. Because these security mechanisms may have an impact on the negotiation protocol performances, we will also evaluate this impact to adopt the security solution that allows minimizing it. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "A secured, automated, and dynamic end-to-end service level negotiation", "paper_id": "WOS:000314177800004"}