{"auto_keywords": [{"score": 0.04701209021022985, "phrase": "trick"}, {"score": 0.00566777051103951, "phrase": "bartholdi"}, {"score": 0.004853906438223006, "phrase": "tovey"}, {"score": 0.00481495049065317, "phrase": "multimode_control_attacks"}, {"score": 0.004384504920139083, "phrase": "control_attacks"}, {"score": 0.004241914481080374, "phrase": "election_outcome"}, {"score": 0.0036553070575015344, "phrase": "complexity-theoretic_hardness_results"}, {"score": 0.0027286224888843956, "phrase": "real-life_settings"}, {"score": 0.002497976173193543, "phrase": "new_voters"}, {"score": 0.0023900527169254744, "phrase": "spoiler_candidate"}, {"score": 0.0023249757987087055, "phrase": "unified_framework"}, {"score": 0.0022492129111567824, "phrase": "polynomial-time_multiprong_attack_algorithms"}, {"score": 0.0021049977753042253, "phrase": "deterministic_polynomial_time"}], "paper_keywords": [""], "paper_abstract": "In 1992, Bartholdi, Tovey, and Trick opened the study of control attacks on elections-attempts to improve the election outcome by such actions as adding/deleting candidates or voters. That work has led to many results on how algorithms can be used to find attacks on elections and how complexity-theoretic hardness results can be used as shields against attacks. However, all the work in this line has assumed that the attacker employs just a single type of attack. In this paper, we model and study the case in which the attacker launches a multipronged (i.e., multimode) attack. We do so to more realistically capture the richness of real-life settings. For example, an attacker might simultaneously try to suppress some voters, attract new voters into the election, and introduce a spoiler candidate. Our model provides a unified framework for such varied attacks. By constructing polynomial-time multiprong attack algorithms we prove that for various election systems even such concerted, flexible attacks can be perfectly planned in deterministic polynomial time.", "paper_title": "Multimode Control Attacks on Elections", "paper_id": "WOS:000287372400003"}