{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rb-explorer"}, {"score": 0.00931116377248486, "phrase": "nand_flashes"}, {"score": 0.005067179497012183, "phrase": "write_amplification"}, {"score": 0.005023519840537758, "phrase": "data_volume"}, {"score": 0.0050045391935718865, "phrase": "ssd_endurance"}, {"score": 0.004720043307726269, "phrase": "write_amplification_measurement"}, {"score": 0.004661674183785889, "phrase": "large_write_amplification_ratio"}, {"score": 0.004479678062285735, "phrase": "solid_state_disks"}, {"score": 0.0043804319008535555, "phrase": "practical_way"}, {"score": 0.004251500979153001, "phrase": "novel_measuring_method"}, {"score": 0.0041989015114686674, "phrase": "ssd_level"}, {"score": 0.004157288914136317, "phrase": "nand_flash_level"}, {"score": 0.0040200712329559055, "phrase": "nand_flash"}, {"score": 0.003661382948704217, "phrase": "proposed_write_amplification_model"}, {"score": 0.0035183010916001664, "phrase": "plane_levels"}, {"score": 0.0033639840192975835, "phrase": "page_programs"}, {"score": 0.003264872488939969, "phrase": "different_operation"}, {"score": 0.0029330318530416417, "phrase": "number_n-p"}, {"score": 0.0029039278872065692, "phrase": "page_size_p"}, {"score": 0.0028608109787377255, "phrase": "number_n-channel"}, {"score": 0.0028253682745674608, "phrase": "number_n-chip"}, {"score": 0.002769568481822277, "phrase": "number_n-die"}, {"score": 0.0024879447331744883, "phrase": "amplification_ratios"}, {"score": 0.0024145810181278944, "phrase": "real-world_ssd"}, {"score": 0.002390609215251156, "phrase": "ssd-v"}, {"score": 0.0023609780669713288, "phrase": "fine-tuned_ssd_simulator"}, {"score": 0.002185273325876397, "phrase": "ssd"}], "paper_keywords": ["Write amplification", " NAND flash", " solid state disk", " read/busy signal", " write endurance", " performance"], "paper_abstract": "A large write amplification ratio degrades the program/erase cycles (P/Es) of NAND Flashes and reduces the endurance and performance of solid state disks (SSDs). The lack of a practical way to measure write amplification for SSDs motivates us to propose a novel measuring method called RB-Explorer at the SSD level rather than the NAND Flash level. The goal of RB-Explorer is two-fold: (1) to accurately measure the write amplification of SSDs to quantify SSD endurance and (2) to study the impacts of I/O techniques on write amplification of SSDs. RB-Explorer incorporates a Ready/Busy (R/B) signal of one of the NAND Flashes in an SSD in a proposed write amplification model for SSDs with four full-parallelism levels (i.e., the channel, chip, die, and plane levels). RB-Explorer takes two steps toward measuring write amplification. First, RB-Explorer quantifies the number of page programs using the low R/B signal level, the duration of which varies with the different operation (i.e., read, program, and erase) in NAND Flash. Second, RB-Explorer measures data volume written to NAND Flashes by considering parallelisms at four levels. Data volume written to a die in a NAND Flash is obtained as a product of the number N-p of programs and page size P-a. Given the number N-channel of channels, the number N-chip of chips per channel, and the number N-die of dies per chip, one can obtain the data volume written to NAND Flashes as a product of N-p; P-a; N-die; N-chip, and N-channel. RB-Explorer is applied to analyzing write amplification ratios of SSDs to track SSD endurance. Furthermore, we implement a real-world SSD (i.e., SSD-v) and employ a fine-tuned SSD simulator (i.e., SSDsim) to validate the accuracy of RB-Explorer. Our experimental results show that RB-Explorer improves on the accuracy of SSDsim-the state-of-the-art SSD simulator-in most tested cases. We conduct a series of measurements using micro-benchmarks and I/O traces to demonstrate how RB-Explorer may be applied to investigate SSDs.", "paper_title": "RB-Explorer: An Accurate and Practical Approach to Write Amplification Measurement for SSDs", "paper_id": "WOS:000351458800018"}