{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "halton_sequences"}, {"score": 0.0038499929374478125, "phrase": "large_dimensions"}, {"score": 0.0037392451233558234, "phrase": "sobol'_sequence"}, {"score": 0.003359647377874098, "phrase": "generalized_halton_sequences"}, {"score": 0.0029031614127920232, "phrase": "important_improvement"}, {"score": 0.002861062731782219, "phrase": "upper_bounds"}, {"score": 0.002725082271104791, "phrase": "atanassov"}, {"score": 0.002436289099444074, "phrase": "different_generalized_halton_sequences"}, {"score": 0.002286781334850213, "phrase": "numerical_experiments"}, {"score": 0.002220900173110114, "phrase": "new_generalized_halton_sequence"}, {"score": 0.002135995282374723, "phrase": "practical_advantage"}, {"score": 0.0021049977753042253, "phrase": "surveyed_constructions"}], "paper_keywords": ["Halton sequences", " permutations", " scrambling", " discrepancy"], "paper_abstract": "Halton sequences have always been quite popular with practitioners, in part because of their intuitive definition and ease of implementation. However, in their original form, these sequences have also been known for their inadequacy to integrate functions in moderate to large dimensions, in which case (t, s)-sequences such as the Sobol' sequence are usually preferred. To overcome this problem, one possible approach is to include permutations in the definition of Halton sequences thereby obtaining generalized Halton sequences-an idea that goes back to almost thirty years ago, and that has been studied by many researchers in the last few years. In parallel to these efforts, an important improvement in the upper bounds for the discrepancy of Halton sequences has been made by Atanassov in 2004. Together, these two lines of research have revived the interest in Halton sequences. In this article, we review different generalized Halton sequences that have been proposed recently, and compare them by means of numerical experiments. We also propose a new generalized Halton sequence which, we believe, offers a practical advantage over the surveyed constructions, and that should be of interest to practitioners.", "paper_title": "Generalized Halton Sequences in 2008: A Comparative Study", "paper_id": "WOS:000272039800001"}