{"auto_keywords": [{"score": 0.0436874611008316, "phrase": "software_architecture"}, {"score": 0.041584694892282274, "phrase": "first-class_entity"}, {"score": 0.03525727816544821, "phrase": "java"}, {"score": 0.030022492403471327, "phrase": "saj"}, {"score": 0.00481495049065317, "phrase": "first-class_connector"}, {"score": 0.004296264970612285, "phrase": "important_contributions"}, {"score": 0.0035796471115594553, "phrase": "first-class_support"}, {"score": 0.003419943984098415, "phrase": "new_component-oriented_programming_language"}, {"score": 0.0032302647179383915, "phrase": "architectural_concepts"}, {"score": 0.0026152363154073707, "phrase": "implementation_level"}, {"score": 0.002570817338292482, "phrase": "simultaneous_reuse"}, {"score": 0.0024005409468262203, "phrase": "component_model"}, {"score": 0.002359759876402679, "phrase": "connector_model"}, {"score": 0.0021049977753042253, "phrase": "type_soundness_property"}], "paper_keywords": [""], "paper_abstract": "The idea of a connector, which explicitly describes the interactions among components, is one of the important contributions of the research on software architecture. The importance of the connector as a first-class entity in software architecture has been increasingly recognized. In this paper we argue that such an important abstraction also deserves first-class support from programming languages. We present a new component-oriented programming language, SAJ (Software Architecture based Java), which integrates some architectural concepts such as the component, the port and particularly the connector into Java. The connector is treated as a first-class entity in SAJ as is the component so that software architecture can be made more explicit at implementation level and the simultaneous reuse of the component and the connector can be realized. The component model and the connector model underlying SAJ are also discussed in detail. We formalize our language giving both the type system and operational semantics and prove the type soundness property.", "paper_title": "A new component-oriented programming language with the first-class connector", "paper_id": "WOS:000241813400017"}