{"auto_keywords": [{"score": 0.031710251985384436, "phrase": "hybrid_vehicular_networks"}, {"score": 0.00386876598761639, "phrase": "high_resolution"}, {"score": 0.0038375280115736958, "phrase": "video_quality"}, {"score": 0.003700037700138249, "phrase": "cooperative_video_streaming_scenario"}, {"score": 0.0036553070575015344, "phrase": "requested_member"}, {"score": 0.003236596168242036, "phrase": "video_data"}, {"score": 0.0031974502006267163, "phrase": "requested_member_hop"}, {"score": 0.003133252930886608, "phrase": "ad-hoc_network"}, {"score": 0.003057910095857785, "phrase": "k-hop_cooperative_video_streaming_protocol"}, {"score": 0.0027295084882654917, "phrase": "video_playback"}, {"score": 0.002696479050724968, "phrase": "dsrc-based_ad-hoc_network"}, {"score": 0.002387337550919433, "phrase": "network_simulator_version"}, {"score": 0.002311047934798247, "phrase": "proposed_protocol"}, {"score": 0.002264607102799332, "phrase": "simulation_results"}, {"score": 0.0022371907579775796, "phrase": "proposed_scheme"}, {"score": 0.0022011501095573747, "phrase": "assignment_interval"}, {"score": 0.0021049977753042253, "phrase": "k-hop_video_forwarding"}], "paper_keywords": ["Cooperative streaming", " scalable video coding", " vehicular ad-hoc network (VANET)", " dedicated short-range communication (DSRC)"], "paper_abstract": "When a number of persons, e. g., a family or a group of friends, drive their vehicles for a trip together, they can form a fleet of vehicles and share their network resources during their trip. Let one member want to watch a video from the Internet. He may not have high resolution or video quality due to his limited 3G/3.5G bandwidth to the Internet. The cooperative video streaming scenario allows the requested member to ask other members of the same fleet to download video cooperatively. In other words, other members can help to download parts of the video from the Internet and then forward video data to the requested member hop by hop through the ad-hoc network. This work proposes the k-hop cooperative video streaming protocol using H.264/SVC over the hybrid vehicular networks which consist of 3G/3.5G cellular network and Dedicated Short-Range Communications (DSRC) ad-hoc network. In order to smooth video playback over the DSRC-based ad-hoc network, this work proposes: (1) one streaming task assignment scheme that schedules the streaming task to each member over the dynamic vehicular networks, and (2) packet forwarding strategies that decide the forwarding sequence of the buffered video data to the requested member hop by hop. Finally, we utilize the network simulator version 2 (NS2) to simulate the proposed protocol. Based on the simulation results, the proposed scheme can estimate the assignment interval adaptively and the playback priority first (PPF) strategy has the best performance for the k-hop video forwarding over the hybrid vehicular networks.", "paper_title": "The K-hop Cooperative Video Streaming Protocol Using H.264/SVC Over the Hybrid Vehicular Networks", "paper_id": "WOS:000339168800014"}