{"auto_keywords": [{"score": 0.03711286130508702, "phrase": "classification_time"}, {"score": 0.013100889400510744, "phrase": "spectroscopic_data_sets"}, {"score": 0.012811375745116071, "phrase": "time_series"}, {"score": 0.00481495049065317, "phrase": "fast_classification"}, {"score": 0.004778923541463994, "phrase": "spectrographic_measurements"}, {"score": 0.004637478829869904, "phrase": "food_industry"}, {"score": 0.0045855181084455444, "phrase": "time-efficient_alternative"}, {"score": 0.00450020161335541, "phrase": "lightning-monitoring_systems"}, {"score": 0.004449772140968921, "phrase": "spectroscopic_measurements"}, {"score": 0.004399905285945236, "phrase": "latter_application"}, {"score": 0.00422177384286051, "phrase": "severe_storms"}, {"score": 0.004112175423546628, "phrase": "shapelet_based_classification_method"}, {"score": 0.003785836059995376, "phrase": "significant_downside"}, {"score": 0.0036324746826127997, "phrase": "classification_tree"}, {"score": 0.0035514484574435574, "phrase": "high_throughput_applications"}, {"score": 0.0034984340449789745, "phrase": "long_time"}, {"score": 0.0032941471167321408, "phrase": "time_complexity"}, {"score": 0.0032571885279065126, "phrase": "shapelet_based_models"}, {"score": 0.003136952589428254, "phrase": "open_challenge"}, {"score": 0.002976019715894587, "phrase": "shapelet_method"}, {"score": 0.002365587018070219, "phrase": "new_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Spectrography", " Time series", " Classification", " Shapelets", " Local"], "paper_abstract": "Spectroscopy is widely used in the food industry as a time-efficient alternative to chemical testing. Lightning-monitoring systems also employ spectroscopic measurements. The latter application is important as it can help predict the occurrence of severe storms, such as tornadoes. The shapelet based classification method is particularly well-suited for spectroscopic data sets. This technique for classifying time series extracts patterns unique to each class. A significant downside of this approach is the time required to build the classification tree. In addition, for high throughput applications the classification time of long time series is inhibitive. Although some progress has been made in terms of reducing the time complexity of building shapelet based models, the problem of reducing classification time has remained an open challenge. We address this challenge by introducing local-shapelets. This variant of the shapelet method restricts the search for a match between shapelets and time series to the vicinity of the location from which each shapelet was extracted. This significantly reduces the time required to examine each shapelet during both the learning and classification phases. Classification based on local-shapelets is well-suited for spectroscopic data sets as these are typically very tightly aligned. Our experimental results on such data sets demonstrate that the new approach reduces learning and classification time by two orders of magnitude while retaining the accuracy of regular (non-local) shapelets-based classification. In addition, we provide some theoretical justification for local-shapelets. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Local-shapelets for fast classification of spectrographic measurements", "paper_id": "WOS:000349271500027"}