{"auto_keywords": [{"score": 0.04918458396503634, "phrase": "user_performance"}, {"score": 0.045100492615217605, "phrase": "visual_marks"}, {"score": 0.044775125169566825, "phrase": "search_time"}, {"score": 0.04255944800395904, "phrase": "search_performance"}, {"score": 0.04000970489961659, "phrase": "design_guidelines"}, {"score": 0.02605118181032554, "phrase": "response_times"}, {"score": 0.00481495049065317, "phrase": "visualization_size"}, {"score": 0.0040171817997972335, "phrase": "self-reported_difficulty"}, {"score": 0.003927203683176278, "phrase": "different_display_types"}, {"score": 0.0036830211726031946, "phrase": "effective_visualizations"}, {"score": 0.0035065523764817143, "phrase": "unique_target"}, {"score": 0.003480161521018509, "phrase": "colored_visualizations"}, {"score": 0.003214730261140886, "phrase": "target_square"}, {"score": 0.002722234804904997, "phrase": "grouped_displays"}, {"score": 0.002552781867125423, "phrase": "random_displays"}, {"score": 0.002514464610980629, "phrase": "color_layout"}, {"score": 0.002402921062033032, "phrase": "smallest_mark_size"}, {"score": 0.002366847878952636, "phrase": "mark_size"}, {"score": 0.002202742267484358, "phrase": "potential_application_areas"}, {"score": 0.002137088643982437, "phrase": "small_case_study"}, {"score": 0.0021049977753042253, "phrase": "preliminary_findings"}], "paper_keywords": ["information visualization", " graphical perception", " size", " layout"], "paper_abstract": "In this paper we make the following contributions: (1) we describe how the grouping, quantity, and size of visual marks affects search time based on the results from two experiments; (2) we report how search performance relates to self-reported difficulty in finding the target for different display types; and (3) we present design guidelines based on our findings to facilitate the design of effective visualizations. Both Experiment 1 and 2 asked participants to search for a unique target in colored visualizations to test how the grouping, quantity, and size of marks affects user performance. In Experiment 1, the target square was embedded in a grid of squares and in Experiment 2 the target was a point in a scatterplot. Search performance was faster when colors were spatially grouped than when they were randomly arranged. The quantity of marks had little effect on search time for grouped displays (\"popout\"), but increasing the quantity of marks slowed reaction time for random displays. Regardless of color layout (grouped vs. random), response times were slowest for the smallest mark size and decreased as mark size increased to a point, after which response times plateaued. In addition to these two experiments we also include potential application areas, as well as results from a small case study where we report preliminary findings that size may affect how users infer how visualizations should be used. We conclude with a list of design guidelines that focus on how to best create visualizations based on grouping, quantity, and size of visual marks.", "paper_title": "The relation between visualization size, grouping, and user performance", "paper_id": "WOS:000344991700040"}