{"auto_keywords": [{"score": 0.045116239727526465, "phrase": "funding_bodies"}, {"score": 0.014771079099643472, "phrase": "researcher_portfolios"}, {"score": 0.0047747348769918, "phrase": "research_lead"}, {"score": 0.0044275118637330975, "phrase": "funding_acknowledgement_data"}, {"score": 0.004390517953424082, "phrase": "increasing_pressure"}, {"score": 0.004157446556371582, "phrase": "financial_resources"}, {"score": 0.0038711548651825917, "phrase": "particular_project"}, {"score": 0.003398714712611042, "phrase": "suddenly_increased_funding_scarcity"}, {"score": 0.00330025288273863, "phrase": "greater_forms"}, {"score": 0.0031117775337824853, "phrase": "individual_researcher_portfolios"}, {"score": 0.003072807453368781, "phrase": "resource_use"}, {"score": 0.0028015105858516702, "phrase": "double_dipping"}, {"score": 0.0026193328696791306, "phrase": "organisations_fund_research"}, {"score": 0.0023779596230982234, "phrase": "greater_citation_impact"}, {"score": 0.0021049977753042253, "phrase": "bureaucratic_management_process"}], "paper_keywords": ["Funding acknowledgement", " Research policy", " Impact", " Bibliometrics"], "paper_abstract": "Increasing pressure on budgets of funding bodies has led to discussion of how to make financial resources go further, and to the concern that some researchers take more money from funding bodies for a particular project than needed, a practice that has been termed \"double-dipping\". Some evidence has emerged that this might be occurring, and in this context of suddenly increased funding scarcity, albeit in a system with greater forms of support, a proposal has been made that funding bodies monitor and manage individual researcher portfolios to optimize resource use. Our paper provides evidence relevant to both the \"double dipping\" issue and the proposal to manage portfolios. We show that where certain pre-conditions for \"double dipping\" are met (i.e. when funding comes from more than organisation, and the organisations fund research in a very similar area), and where therefore an argument to monitor researcher portfolios might be applicable, the research produced under these conditions has greater citation impact. We query the claim that when more funding is acknowledged this is inherently undesirable and we express our doubts that subjecting the allocation of funding to researchers to a bureaucratic management process will necessarily increase the impact of research.", "paper_title": "On the horns of a dilemma: does more funding for research lead to more research or a waste of resources that calls for optimization of researcher portfolios? An analysis using funding acknowledgement data", "paper_id": "WOS:000343609900010"}