{"auto_keywords": [{"score": 0.04369656670145452, "phrase": "color-concept_associations"}, {"score": 0.04154041880609474, "phrase": "occupational_background"}, {"score": 0.013487001463024952, "phrase": "white-collar_workers"}, {"score": 0.00481495049065317, "phrase": "color-concept_association"}, {"score": 0.004741093882013236, "phrase": "chinese"}, {"score": 0.004610809404212932, "phrase": "visual_displays"}, {"score": 0.004568198442824687, "phrase": "visual_search"}, {"score": 0.004267468074128779, "phrase": "different_occupational_backgrounds"}, {"score": 0.00415019999222481, "phrase": "hong_kong_chinese_students"}, {"score": 0.003852939975815287, "phrase": "questionnaire_survey"}, {"score": 0.003723879111071547, "phrase": "hong_kong"}, {"score": 0.0034356922031028533, "phrase": "different_occupations"}, {"score": 0.003310287367847261, "phrase": "managerial_staff"}, {"score": 0.0032898346872897383, "phrase": "steel_workers"}, {"score": 0.003199345207727474, "phrase": "chi-square_test"}, {"score": 0.0028526747080263757, "phrase": "mainland_china"}, {"score": 0.0027741761880779535, "phrase": "tested_concepts"}, {"score": 0.002551372449383365, "phrase": "similar_occupations"}, {"score": 0.0025277455170687746, "phrase": "similar_color_perceptions"}, {"score": 0.002450554073692113, "phrase": "different_color_associations"}, {"score": 0.002171328030402927, "phrase": "product_designs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Color-concept association", " Occupational background", " Color display", " Chinese"], "paper_abstract": "Background: The use of colors in visual displays can facilitate visual search and perception, but their use may not be effective without consideration of differences in the interpretation of their connoted meanings between individuals of different occupational backgrounds. Objective: This study examined color-concept associations for Hong Kong Chinese students and white-collar workers, and then compared their associations with those of two other occupational groups to assess whether occupational background is related to color-concept associations. Method: A questionnaire survey was used to examine color-concept associations among 100 university students and 100 white-collar workers in Hong Kong. The participants were presented with 16 safety-related concepts and were asked to choose one of 10 colors that best represented each concept. The associations reported by four groups with different occupations (the two groups in this study and the groups of managerial staff and steel workers examined in our previous study) were compared. A chi-square test was applied to determine whether significant color association(s) existed for each concept. Results: Our results revealed that each concept was significantly associated with at least one color (p < 0.01). The Hong Kong white-collar workers and managerial staff in mainland China both expressed the same color associations for 14 of the tested concepts, and differed only over which colors were associated with \"strong,\" and \"radiation hazard.\" These findings generally suggest that populations with similar occupations can have similar color perceptions. However, the students and the other three employee groups reported different color associations with the concepts \"normal,\" \"off\" and \"potential hazard.\" Conclusions: Occupational background is associated with how color is interpreted for its connoted meaning. One should consider occupational background carefully when choosing colors in product designs, especially for safety. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A study of the relationship between color-concept association and occupational background for Chinese", "paper_id": "WOS:000356208900007"}