{"auto_keywords": [{"score": 0.04570276350376956, "phrase": "semantic_names"}, {"score": 0.030271926597602316, "phrase": "stup"}, {"score": 0.02952315821068961, "phrase": "shanghai"}, {"score": 0.028792660963785265, "phrase": "beijing"}, {"score": 0.028182109543432747, "phrase": "sp"}, {"score": 0.00481495049065317, "phrase": "personalized_location_naming"}, {"score": 0.004658426838467567, "phrase": "greater_convenience"}, {"score": 0.0044904452331803, "phrase": "user's_physical_locations"}, {"score": 0.004312622975366676, "phrase": "important_context"}, {"score": 0.004281053243493438, "phrase": "mobile_recommendations"}, {"score": 0.004111488691642256, "phrase": "novel_location"}, {"score": 0.003778253716938922, "phrase": "gps_device"}, {"score": 0.003334309053314909, "phrase": "local_search_framework"}, {"score": 0.0028993944292191433, "phrase": "rank_techniques"}, {"score": 0.0025490525773769063, "phrase": "personalized_semantic_names"}, {"score": 0.0024660058541899647, "phrase": "location_naming"}, {"score": 0.0024389949605061138, "phrase": "tp"}, {"score": 0.002274191167918445, "phrase": "up."}, {"score": 0.002224510044064184, "phrase": "experimental_results"}, {"score": 0.002183938718432764, "phrase": "proposed_baselines"}, {"score": 0.002159951198924152, "phrase": "accurate_semantic_names"}, {"score": 0.0021049977753042253, "phrase": "testing_queries"}], "paper_keywords": ["Algorithms", " Design", " Experimentation", " Location-based services", " location naming", " location-based social network"], "paper_abstract": "Many innovative location-based services have been established to offer users greater convenience in their everyday lives. These services usually cannot map user's physical locations into semantic names automatically. The semantic names of locations provide important context for mobile recommendations and advertisements. In this article, we proposed a novel location naming approach which can automatically provide semantic names for users given their locations and time. In particular, when a user opens a GPS device and submits a query with her physical location and time, she will be returned the most appropriate semantic name. In our approach, we drew an analogy between location naming and local search, and designed a local search framework to propose a spatiotemporal and user preference (STUP) model for location naming. STUP combined three components, user preference (UP), spatial preference (SP), and temporal preference (TP), by leveraging learning-to-rank techniques. We evaluated STUP on 466,190 check-ins of 5,805 users from Shanghai and 135,052 check-ins of 1,361 users from Beijing. The results showed that SP was most effective among three components and that UP can provide personalized semantic names, and thus it was a necessity for location naming. Although TP was not as discriminative as the others, it can still be beneficial when integrated with SP and UP. Finally, according to the experimental results, STUP outperformed the proposed baselines and returned accurate semantic names for 23.6% and 26.6% of the testing queries from Beijing and Shanghai, respectively.", "paper_title": "Mining Check-In History for Personalized Location Naming", "paper_id": "WOS:000335576200011"}