{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "n-detection_test_sets"}, {"score": 0.004650896226390719, "phrase": "test_sets"}, {"score": 0.004544629724830453, "phrase": "target_fault"}, {"score": 0.004518442937844318, "phrase": "n_times"}, {"score": 0.004215677131963292, "phrase": "restricted_values"}, {"score": 0.0038431888954930083, "phrase": "average-case_analysis"}, {"score": 0.0035648266669315943, "phrase": "unmodelled_fault_coverage"}, {"score": 0.0032309093154028663, "phrase": "particular_test"}, {"score": 0.0029794666460666646, "phrase": "specific_set"}, {"score": 0.002945175711537758, "phrase": "target_faults"}, {"score": 0.0028446460307503343, "phrase": "untargeted_faults"}, {"score": 0.002349884235026956, "phrase": "proposed_analysis_methods"}, {"score": 0.0021921063460682293, "phrase": "n-detection_test_generation_procedure"}, {"score": 0.0021049977753042253, "phrase": "n-detection_test_set_quality"}], "paper_keywords": [""], "paper_abstract": "Test sets that detect each target fault n times (n-detection test sets) are typically generated for restricted values of n because of the increase in test set size with n. Both a worst-case analysis and an average-case analysis is performed to investigate the effects of restricting n on, the unmodelled fault coverage of an (arbitrary) n-detection test set of a full-scan circuit. The analysis is independent of any particular test set or any particular test generation procedure. It is based on a specific set of target faults and a specific set of untargeted faults. It shows that, depending on the circuit, very large values of n may be needed to guarantee the detection of all the untargeted faults. The implications of these results are discussed and it is also demonstrated that the proposed analysis methods can be used to evaluate the effects of incorporating into the n-detection test generation procedure specific strategies aimed at improving the n-detection test set quality.", "paper_title": "Worst-case and average-case analysis of n-detection test sets and test generation strategies", "paper_id": "WOS:000248317000010"}