{"auto_keywords": [{"score": 0.04882560650374233, "phrase": "pervasive_environments"}, {"score": 0.035285873941248234, "phrase": "user_preferences"}, {"score": 0.004832762679569154, "phrase": "context"}, {"score": 0.004566123591480369, "phrase": "large_number"}, {"score": 0.004531637625717547, "phrase": "embedded_devices"}, {"score": 0.004363058588000252, "phrase": "available_services"}, {"score": 0.004184825434585617, "phrase": "user's_current_context"}, {"score": 0.0036784938661226104, "phrase": "implicit_discovery_requests"}, {"score": 0.0034749794034364197, "phrase": "proactive_service_discovery_approach"}, {"score": 0.0033967510986397946, "phrase": "implicit_requests"}, {"score": 0.0032826873794020253, "phrase": "formal_context_model"}, {"score": 0.0032578629307203097, "phrase": "hyperspace_analogue"}, {"score": 0.0026945722090537397, "phrase": "numeric_coding_methods"}, {"score": 0.0026338658998573752, "phrase": "algorithms'_performance"}, {"score": 0.002555040841339798, "phrase": "context-driven_service_discovery_system"}, {"score": 0.002459810433812049, "phrase": "new_context_sources"}, {"score": 0.00233240715947344, "phrase": "smart_phones"}, {"score": 0.002279841453843241, "phrase": "discovery_results"}, {"score": 0.0021049977753042253, "phrase": "real_time"}], "paper_keywords": ["pervasive environments", " context awareness", " context model", " service discovery"], "paper_abstract": "Pervasive environments are characterized by a large number of embedded devices offering their services to the user. Which of the available services are of most interest to the user considerably depends on the user's current context. User context is often rich and very dynamic; making an explicit, user-driven discovery of services impractical. Users in such environments would instead like to be continuously informed about services relevant to them. Implicit discovery requests triggered by changes in the context are therefore prevalent. This paper proposes a proactive service discovery approach for pervasive environments addressing these implicit requests. Services and user preferences are described by a formal context model called Hyperspace Analogue to Context, which effectively captures the dynamics of context and the relationship between services and context. Based on the model, we propose a set of algorithms that can continuously present the most relevant services to the user in response to changes of context, services or user preferences. Numeric coding methods are applied to improve the algorithms' performance. The algorithms are grounded in a context-driven service discovery system that automatically reacts to changes in the environment. New context sources and services can be dynamically integrated into the system. A client for smart phones continuously informs users about the discovery results. Experiments show, that the system can efficiently provide the user with continuous, up-to-date information about the most useful services in real time.", "paper_title": "Context-driven personalized service discovery in pervasive environments", "paper_id": "WOS:000290801800002"}