{"auto_keywords": [{"score": 0.015109280344700611, "phrase": "multi-agent_systems"}, {"score": 0.013222440850211358, "phrase": "information_collection"}, {"score": 0.01289256700515193, "phrase": "information_processing"}, {"score": 0.012616292159038239, "phrase": "data_identifiability"}, {"score": 0.00481495049065317, "phrase": "agent_platforms"}, {"score": 0.004493207015584002, "phrase": "agent_community"}, {"score": 0.004316812490871324, "phrase": "agent-based_applications"}, {"score": 0.004269913167716059, "phrase": "users'_privacy"}, {"score": 0.003969957613513855, "phrase": "traditional_security_mechanisms"}, {"score": 0.003745179888113379, "phrase": "personal_information"}, {"score": 0.0036508702548731383, "phrase": "particular_individual"}, {"score": 0.002601065207135226, "phrase": "extensive_evaluation"}, {"score": 0.0024092539025697014, "phrase": "privacy_loss"}, {"score": 0.002247900207250435, "phrase": "bearable_performance_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Privacy", " Agent Platforms", " Multi-agent Systems", " Security", " Trust", " Reputation"], "paper_abstract": "Agent Platforms are the software that supports the development and execution of Multi-agent Systems. There are many Agent Platforms developed by the agent community, but they hardly consider privacy. This leads to agent-based applications that invade users' privacy. Privacy can be threatened by two main information activities: information collection and information processing. Information collection can be prevented using traditional security mechanisms. Information processing can be prevented by minimizing data identifiability, i.e., the degree by which personal information can be directly attributed to a particular individual. However, minimizing data identifiability may directly affect other crucial issues in Multi-agent Systems, such as accountability, trust, and reputation. In this paper, we present the support that the Magentix2 Agent Platform provides for preserving privacy. Specifically, it provides mechanisms to avoid information collection and information processing when they are not desired. Moreover, Magentix2 provides these mechanisms without compromising accountability, trust, and reputation. We also provide in this paper an application built on top of Magentix2 that exploits its support for preserving privacy. Finally, we provide an extensive evaluation of the support that Magentix2 provides for preserving privacy based on that application. We specifically test whether or not privacy loss can be minimized by using the support that Magentix2 provides, whether or not this support introduces a bearable performance overhead, and whether or not existing trust and reputation models can be implemented on top of Magentix2. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Magentix2: A privacy-enhancing Agent Platform", "paper_id": "WOS:000313855000008"}