{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collision_avoidance_mechanisms"}, {"score": 0.049498146181447024, "phrase": "discovery_process"}, {"score": 0.004717960684395242, "phrase": "xpon._operation_of_all_time"}, {"score": 0.0046987973264610685, "phrase": "division_multiple_access_passive_optical_networks"}, {"score": 0.004384623928442369, "phrase": "so-called_discovery_process"}, {"score": 0.004261419841494814, "phrase": "newly_activated_optical_network_units"}, {"score": 0.004008897491380646, "phrase": "already_registered_onus"}, {"score": 0.003912112659326054, "phrase": "available_upstream_bandwidth"}, {"score": 0.0038332390893263844, "phrase": "discovery_windows"}, {"score": 0.003740679163860117, "phrase": "contending_onus"}, {"score": 0.003680212979775528, "phrase": "collision_probability"}, {"score": 0.00335095982979018, "phrase": "passive_optical_network"}, {"score": 0.0031910037920846817, "phrase": "random_delay_mechanism"}, {"score": 0.0027666443986705453, "phrase": "known_cams"}, {"score": 0.0027108021939930014, "phrase": "quantitative_and_qualitative_manner"}, {"score": 0.0026560841114619147, "phrase": "best_mechanism"}, {"score": 0.002623783458189614, "phrase": "next_generation"}, {"score": 0.00260246764210499, "phrase": "xpon_systems"}, {"score": 0.002560352786969071, "phrase": "average_number"}, {"score": 0.002539550974361945, "phrase": "discovery_cycles"}, {"score": 0.002388827597970943, "phrase": "rdm"}], "paper_keywords": [""], "paper_abstract": "Operation of all time division multiple access passive optical networks (PONs), regardless of the layer 2 protocol in use, requires the utilization of the so-called discovery process allowing for identification and registration of newly activated optical network units (ONUs). For the duration of the discovery process, all transmissions from already registered ONUs are halted, decreasing the available upstream bandwidth. The number of discovery windows required to successfully register all contending ONUs depends on the collision probability for their registration requests. To decrease such a collision probability for registration requests, several types of collision avoidance mechanisms (CAMs) can be used in various flavors of passive optical network (xPON), as we examine in more detail. A random delay mechanism (RDM) is typically exploited in 1 Gbit/s Ethernet PON (1G-EPON) and gigabit PON (GPON), though other CAMs are also available. It is our goal therefore to examine the efficiency of all known CAMs, compare them in quantitative and qualitative manner, and recommend the best mechanism for the next generation of xPON systems, minimizing the average number of discovery cycles required to register contending ONUs (maximizing thus the registration success probability). The results indicate that RDM is indeed the best of simple, single-stage CAMs available, thus confirming the choice of both the P802.3ah Task Force (TF) and Full Service Access Network (FSAN)/ITU-T at the time when their respective 1G-EPON and GPON specifications were written. (C) 2009 Optical Society of America", "paper_title": "Comparison of collision avoidance mechanisms for the discovery process in xPON", "paper_id": "WOS:000265514800001"}