{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "supplier_selection"}, {"score": 0.022980773789996002, "phrase": "economic_perspective"}, {"score": 0.009768212709386817, "phrase": "lowest_bid_price"}, {"score": 0.0047113960612140335, "phrase": "conventional_view"}, {"score": 0.004677372885331908, "phrase": "cost_benefit_analysis"}, {"score": 0.004610058444728656, "phrase": "cost_dimension"}, {"score": 0.004165105357908494, "phrase": "important_characteristic"}, {"score": 0.004135010810625326, "phrase": "supply_chains"}, {"score": 0.0037222099716098783, "phrase": "economic_standpoint"}, {"score": 0.003668591097652231, "phrase": "switching_options_approach"}, {"score": 0.003512308265830794, "phrase": "conventional_wisdom"}, {"score": 0.0034742854447532678, "phrase": "buyer's_choice"}, {"score": 0.0034118234596993836, "phrase": "significant_difference"}, {"score": 0.0032310733124059536, "phrase": "best_option"}, {"score": 0.0030933709720820605, "phrase": "previous_studies"}, {"score": 0.003059869469624301, "phrase": "buyer-supplier_relationship"}, {"score": 0.0028249975318149468, "phrase": "previous_works"}, {"score": 0.002515090164966655, "phrase": "alternative_supply_chain_partners"}, {"score": 0.0024253827365474734, "phrase": "microsoft_excel_software"}, {"score": 0.002355920629285463, "phrase": "original_discussion"}, {"score": 0.0023051296931856265, "phrase": "switching_options_perspective"}, {"score": 0.002239103860494545, "phrase": "options_help_managers"}, {"score": 0.002206801982145622, "phrase": "supplier_selection_process"}, {"score": 0.0021049977753042253, "phrase": "appropriate_decisions"}], "paper_keywords": ["Suppliers", " Supply chain management", " Strategic choices", " Uncertainty management"], "paper_abstract": "Purpose - The purpose of this paper is to analyze supplier selection from an economic perspective. The conventional view of cost benefit analysis is that the cost dimension is static, and companies are urged to pursue the lowest bid price when choosing suppliers. However, this perspective does not consider uncertainty, which is an important characteristic of supply chains. To overcome this shortcoming, a model is proposed that views supplier selection under uncertainty. Design/methodology/approach - The study proposes a model that analyzes supplier selection from an economic standpoint based on the switching options approach. Findings - The results show that, contrary to the conventional wisdom, the buyer's choice of supplier makes a significant difference under conditions of uncertainty, and naively accepting the lowest bid price is not necessarily the best option. Research limitations/implications - The study extends the literature by quantifying previous studies of the buyer-supplier relationship. This enhances understanding by quantifying the relationship under conditions of uncertainty, a topic that has been largely ignored by previous works. Practical implications - The economic perspective, which considers uncertainty, helps managers examine their supply chain relationships in depth when choosing suppliers. In addition, this study could also help buyers access alternative supply chain partners. Managers can make the calculations easily by using Microsoft Excel software. Originality/value - The paper presents an original discussion about viewing supplier selection from the switching options perspective. The modeling and analysis of switching options help managers better understand the supplier selection process from an economic perspective, and improve competitiveness by helping them to make appropriate decisions.", "paper_title": "Supplier selection under uncertainty: a switching options perspective", "paper_id": "WOS:000264971100011"}