{"auto_keywords": [{"score": 0.050075846325168705, "phrase": "social_networks"}, {"score": 0.045130573715649755, "phrase": "sns"}, {"score": 0.028743193697959663, "phrase": "diffusion_elements"}, {"score": 0.004682218325765133, "phrase": "significant_attention"}, {"score": 0.004400153852462583, "phrase": "autonomous_social_actors"}, {"score": 0.00402094658848301, "phrase": "relatively_few_systematic_reviews"}, {"score": 0.00398362591640497, "phrase": "typical_diffusion_elements"}, {"score": 0.003849711329589429, "phrase": "multiagent_computing"}, {"score": 0.0037434875065980415, "phrase": "powerful_paradigm"}, {"score": 0.0036972190829870906, "phrase": "collective_interactions"}, {"score": 0.0036742989715836745, "phrase": "autonomous_multientity_systems"}, {"score": 0.003528730431045574, "phrase": "multiagent_perspective"}, {"score": 0.003234425353582135, "phrase": "interacting_agents"}, {"score": 0.003039311963787733, "phrase": "interaction_environments"}, {"score": 0.0030204580407008214, "phrase": "multiagent_systems"}, {"score": 0.0027256800996910864, "phrase": "varying_situations"}, {"score": 0.00266693888510356, "phrase": "representative_diffusion_models"}, {"score": 0.0025611773887867255, "phrase": "decision-making_mechanisms"}, {"score": 0.0024216102875733027, "phrase": "existing_studies"}, {"score": 0.002362041061180632, "phrase": "complex_diffusion_problems"}, {"score": 0.002340081450249521, "phrase": "multiagent_methodologies"}, {"score": 0.0021648294450401133, "phrase": "empirical_research"}], "paper_keywords": ["Diffusion", " interaction", " multiagent systems", " social networks", " spread", " survey"], "paper_abstract": "In recent years, significant attention has been paid to diffusion in social networks (SNs), which is, factually, the collective behavior of a set of autonomous social actors for interacting on something in SNs (such as opinions, viruses, or innovations). While this subject has been intensively reported, there have been relatively few systematic reviews concerning the typical diffusion elements and models that are relevant to this subject. Because multiagent computing has already been widely envisioned to be a powerful paradigm for modeling the collective interactions of autonomous multientity systems. In this survey, we review diffusion in SNs through a multiagent perspective. First, we review the following essential elements in diffusion: 1) diffusion actors (who will diffuse), which can be understood to be the interacting agents; 2) diffusion media (where to be diffused), which can be understood to be the interaction environments in multiagent systems (MASs); and 3) diffusion contents (what to be diffused), which can be understood to be the interaction objects in MASs. Next, based on varying situations of diffusion elements, we review the representative diffusion models (how to diffuse), which can be understood as the decision-making mechanisms and interaction protocols in MASs. For each class of diffusion elements and models, we summarize the existing studies and discuss the challenges for solving the complex diffusion problems by applying multiagent methodologies. Finally, we discuss the advantages and disadvantages of our multiagent perspective by comparing other typical perspectives (the empirical research perspective and the theoretical perspective in empirical research), and we conclude with suggestions for further research.", "paper_title": "Diffusion in Social Networks: A Multiagent Perspective", "paper_id": "WOS:000348126100002"}