{"auto_keywords": [{"score": 0.046273829908275735, "phrase": "genetic_code"}, {"score": 0.03869507098334236, "phrase": "canonical_genetic_code"}, {"score": 0.006914983752271393, "phrase": "pareto_approach"}, {"score": 0.004818639683312229, "phrase": "entropy"}, {"score": 0.004644014990871423, "phrase": "multi-objective_approach"}, {"score": 0.00450231514359539, "phrase": "genetic_code_robustness"}, {"score": 0.004297795905522757, "phrase": "genetic_information"}, {"score": 0.004231699728933577, "phrase": "dna_molecules"}, {"score": 0.0038558497470953306, "phrase": "optimization_algorithms"}, {"score": 0.0037965243835456214, "phrase": "hypothetical_codes"}, {"score": 0.0030239842475439814, "phrase": "evaluation_function"}, {"score": 0.002769395841379498, "phrase": "best_hypothetical_codes"}, {"score": 0.0022283519468680475, "phrase": "second_objective"}], "paper_keywords": ["Genetic code robustness", " Genetic algorithms", " Computational biology", " Multi-objective evolutionary algorithms"], "paper_abstract": "The genetic code is the interface between the genetic information stored in DNA molecules and the proteins. Considering the hypothesis that the genetic code evolved to its current structure, some researches use optimization algorithms to find hypothetical codes to be compared to the canonical genetic code. For this purpose, a function with only one objective is employed to evaluate the codes, generally a function based on the robustness of the code against mutations. Very few random codes are better than the canonical genetic code when the evaluation function based on robustness is considered. However, most codons are associated with a few amino acids in the best hypothetical codes when only robustness is employed to evaluate the codes, what makes hard to believe that the genetic code evolved based on only one objective, i.e., the robustness against mutations. In this way, we propose here to use entropy as a second objective for the evaluation of the codes. We propose a Pareto approach to deal with both objectives. The results indicate that the Pareto approach generates codes closer to the canonical genetic code when compared to the codes generated by the approach with only one objective employed in the literature.", "paper_title": "Entropy-based evaluation function in a multi-objective approach for the investigation of the genetic code robustness", "paper_id": "WOS:000343290000003"}