{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "resource_sharing"}, {"score": 0.0047707093928203, "phrase": "peer-to-peer_networks"}, {"score": 0.0045765783794477505, "phrase": "peer_systems"}, {"score": 0.004390312150344245, "phrase": "system's_participants"}, {"score": 0.0041154571996523505, "phrase": "great_evidence"}, {"score": 0.004077616905584829, "phrase": "widely_deployed_systems"}, {"score": 0.0034368818187904744, "phrase": "strong_enough_incentives"}, {"score": 0.0032215231177304513, "phrase": "general_idea"}, {"score": 0.0029234476524900794, "phrase": "theoretical_model"}, {"score": 0.00274017282519193, "phrase": "scheme's_parameters"}, {"score": 0.0026899455459275575, "phrase": "desired_performance"}, {"score": 0.00229844995872581, "phrase": "realistic_simulations"}, {"score": 0.0022355167967736326, "phrase": "query_response_times"}, {"score": 0.0021049977753042253, "phrase": "system's_throughput"}], "paper_keywords": ["P2P networks", " user cooperation", " theoretical analysis", " realistic simulations"], "paper_abstract": "The performance of peer-to-peer systems depends on the level of cooperation of the system's participants. While most existing peer-to-peer architectures have assumed that users are generally cooperative, there is great evidence from widely deployed systems suggesting the opposite. To date, many schemes have been proposed to alleviate this problem. However, the majority of these schemes are either too complex to use in practice, or do not provide strong enough incentives for cooperation. In this work we propose a scheme based on the general idea that offering uploads brings revenue to a node, and performing downloads has a cost. We also introduce a theoretical model that predicts the performance of the system and computes the values of the scheme's parameters that achieve a desired performance. Our scheme is quite simple and very easy to implement. At the same time, it provides very strong incentives for cooperation and improves the performance of P2P networks significantly. In particular, theory and realistic simulations show that it reduces the query response times and file download delays by one order of magnitude, and doubles the system's throughput.", "paper_title": "An efficient algorithm for resource sharing in peer-to-peer networks", "paper_id": "WOS:000238114800050"}