{"auto_keywords": [{"score": 0.04889532068804289, "phrase": "social_sciences"}, {"score": 0.03843856552198327, "phrase": "journal_literature"}, {"score": 0.010499785083306238, "phrase": "natural_sciences"}, {"score": 0.00481495049065317, "phrase": "referencing_practices"}, {"score": 0.00462919213721188, "phrase": "journal_articles"}, {"score": 0.004579780586951551, "phrase": "core_documents"}, {"score": 0.00398325070540449, "phrase": "journal-based_databases"}, {"score": 0.003940706575253453, "phrase": "bibliometric_analysis"}, {"score": 0.003912595576016982, "phrase": "previous_studies"}, {"score": 0.0034148795808317555, "phrase": "systematic_measurement"}, {"score": 0.0031448288291084, "phrase": "citation_data"}, {"score": 0.003111211706454155, "phrase": "cd-rom_versions"}, {"score": 0.003067025024607554, "phrase": "sci"}, {"score": 0.003034158379493625, "phrase": "social_science_citation_index"}, {"score": 0.002969628818856786, "phrase": "arts_and_humanities_citation_index"}, {"score": 0.0029484246363139046, "phrase": "ahci"}, {"score": 0.0028651061556017304, "phrase": "thomson_isi"}, {"score": 0.0028446475829762203, "phrase": "philadelphia"}, {"score": 0.002824409762568482, "phrase": "pa"}, {"score": 0.002464709648714996, "phrase": "natural_and_social_sciences"}, {"score": 0.0021507795710951384, "phrase": "special_care"}, {"score": 0.0021049977753042253, "phrase": "bibliometric_indicators"}], "paper_keywords": [""], "paper_abstract": "Journal articles constitute the core documents for the diffusion of knowledge in the natural sciences. It has been argued that the same is not true for the social sciences and humanities where knowledge is more often disseminated in monographs that are not indexed in the journal-based databases used for bibliometric analysis. Previous studies have made only partial assessments of the role played by both serials and other types of literature. The importance of journal literature in the various scientific fields has therefore not been systematically characterized. The authors address this issue by providing a systematic measurement of the role played by journal literature in the building of knowledge in both the natural sciences and engineering and the social sciences and humanities. Using citation data from the CD-ROM versions of the Science Citation Index (SCI), Social Science Citation Index (SSCI), and Arts and Humanities Citation Index (AHCI) databases from 1981 to 2000 (Thomson ISI, Philadelphia, PA), the authors quantify the share of citations to both serials and other types of literature. Variations in time and between fields are also analyzed. The results show that journal literature is increasingly important in the natural and social sciences, but that its role in the humanities is stagnant and has even tended to diminish slightly in the 1990s. Journal literature accounts for less than 50% of the citations in several disciplines of the social sciences and humanities; hence, special care should be used when using bibliometric indicators that rely only on journal literature.", "paper_title": "The place of serials in referencing practices: Comparing natural sciences and engineering with social sciences and humanities", "paper_id": "WOS:000238005200001"}