{"auto_keywords": [{"score": 0.04607328873586256, "phrase": "shear-wall_dimensions"}, {"score": 0.03729021135620538, "phrase": "total_costs"}, {"score": 0.013411805954564659, "phrase": "new_price"}, {"score": 0.00481495049065317, "phrase": "concrete_structures"}, {"score": 0.004764859786310636, "phrase": "optimum_dimensions"}, {"score": 0.004633805690244912, "phrase": "three-dimensional_shear-wall"}, {"score": 0.00450633982324153, "phrase": "genetic_algorithm_method"}, {"score": 0.004459445258869177, "phrase": "design_variables"}, {"score": 0.003988487841970088, "phrase": "total_material_cost"}, {"score": 0.003480993634130542, "phrase": "seismic_code"}, {"score": 0.003456792789853532, "phrase": "turkey"}, {"score": 0.003069867656852932, "phrase": "structural_member"}, {"score": 0.0027645030021576926, "phrase": "computer_program"}, {"score": 0.0027166392914444023, "phrase": "optimum_shear-wall_dimensions"}, {"score": 0.00256895975568914, "phrase": "numeric_applications"}, {"score": 0.002506894277338543, "phrase": "sample_systems"}, {"score": 0.0024807547991927137, "phrase": "cost_function"}, {"score": 0.0021496083700137305, "phrase": "numeric_application"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Genetic algorithm", " Shear-wall systems", " Cost optimization", " Structural optimization"], "paper_abstract": "In this study, cost optimization of the three-dimensional shear-wall reinforced concrete structure is carried out using Genetic Algorithm Method. The design variables are the shear-wall dimensions. The costs of reinforcement and concrete used in the system are changed and the system is optimized for each new price, then the shear-wall dimensions that minimizes the total material cost of the system is determined once for each new price, and the effects of the changes in price on the amount of the reinforcement and concrete used in the structure and on the total costs are compared. In seismic code of Turkey, the conditions related to the shear-wall dimensions and reinforcement are taken as the constraints of the problem. In the solution to the problem, it is assumed that the other dimensions of the structural member that make up the structure remain constant, but in the calculations, the effect of the change in reinforcement on the total costs is taken into account. A computer program that can determine the optimum shear-wall dimensions required for the minimization of cost of structures has been developed, for use in numeric applications. In the solution of the sample systems, the cost function to be minimized includes the total costs of concrete and reinforcement used in the system, whereas the labor, formwork, and transportation costs are considered negligible. In this study, the optimization of a 20-floored, 3-dimensional shear-wall structure using the Genetic Algorithm Approach is presented in detail as a numeric application. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "The study of the effect of changes in cost of the materials used in 3-D shear-wall reinforced concrete structures on the optimum dimensions", "paper_id": "WOS:000263584100020"}