{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "plan_quality_optimisation"}, {"score": 0.004755054742217193, "phrase": "high_quality_plans"}, {"score": 0.0047155367844327, "phrase": "large_planning_problems"}, {"score": 0.004598933498016774, "phrase": "current_anytime_planners"}, {"score": 0.0037324526526073404, "phrase": "continuing_plan"}, {"score": 0.003670608022642996, "phrase": "larger_time"}, {"score": 0.003292770855568091, "phrase": "current_best_plan"}, {"score": 0.003197843245296877, "phrase": "block_deordering"}, {"score": 0.0030797912111959137, "phrase": "hierarchical_plan_structure"}, {"score": 0.0026941587813581252, "phrase": "line_learning"}, {"score": 0.002436888552432559, "phrase": "best_plans"}, {"score": 0.002327310963701377, "phrase": "plan_quality"}, {"score": 0.0022886952510350416, "phrase": "better_plans"}, {"score": 0.002194929830604162, "phrase": "best_results"}, {"score": 0.0021049977753042253, "phrase": "different_techniques"}], "paper_keywords": [""], "paper_abstract": "Finding high quality plans for large planning problems is hard. Although some current anytime planners are often able to improve plans quickly, they tend to reach a limit at which the plans produced are still very far from the best possible, but these planners fail to find any further improvement, even when given several hours of runtime. We present an approach to continuing plan quality optimisation at larger time scales, and its implementation in a system called BDPO2. Key to this approach is a decomposition into subproblems of improving parts of the current best plan. The decomposition is based on block deordering, a form of plan deordering which identifies hierarchical plan structure. BDPO2 can be seen as an application of the large neighbourhood search (LNS) local search strategy to planning, where the neighbourhood of a plan is defined by replacing one or more subplans with improved subplans. On-line learning is also used to adapt the strategy for selecting subplans and subplanners over the course of plan optimisation. Even starting from the best plans found by other means, BDPO2 is able to continue improving plan quality, often producing better plans than other anytime planners when all are given enough runtime. The best results, however, are achieved by a combination of different techniques working together.", "paper_title": "Continuing Plan Quality Optimisation", "paper_id": "WOS:000365178800001"}