{"auto_keywords": [{"score": 0.030389085232966018, "phrase": "correlated_positions"}, {"score": 0.00481495049065317, "phrase": "protein-protein_interactions"}, {"score": 0.004769444094319619, "phrase": "influenza_virus_envelope"}, {"score": 0.0046797114400479135, "phrase": "integral_membrane_proteins"}, {"score": 0.004136044939878838, "phrase": "functionally_competent_virions"}, {"score": 0.004019797503157808, "phrase": "amino_acid_residues"}, {"score": 0.0038515000499988673, "phrase": "physical_constraints"}, {"score": 0.0036727235025069828, "phrase": "co-evolving_residue_pairs"}, {"score": 0.0033875770020590796, "phrase": "amino_acid_sequences"}, {"score": 0.003355515315708125, "phrase": "influenza_research_database"}, {"score": 0.00258307991054107, "phrase": "co-varying_positions"}, {"score": 0.0024397017438101726, "phrase": "na_cytoplasmic_tail"}, {"score": 0.0021971473452127126, "phrase": "extreme_evolutionary_sustainability"}, {"score": 0.0021251363422701446, "phrase": "hypothetical_model"}, {"score": 0.0021049977753042253, "phrase": "pair-wise_protein_interactions"}], "paper_keywords": ["Influenza virus", " viral envelope", " hemagglutinin", " neuraminidase", " matrix proteins M1, M2", " cytoplasmic tail", " protein-protein interactions", " co-evolution analysis"], "paper_abstract": "Interactions between integral membrane proteins hemagglutinin (HA), neuraminidase (NA), M2 and membrane-associated matrix protein M1 of influenza A virus are thought to be crucial for assembly of functionally competent virions. We hypothesized that the amino acid residues located at the interface of two different proteins are under physical constraints and thus probably co-evolve. To predict co-evolving residue pairs, the EvFold (http://evfold.org) program searching the (nontransitive) Direct Information scores was applied for large samplings of amino acid sequences from Influenza Research Database (http://www.fludb.org/). Having focused on the HA, NA, and M2 cytoplasmic tails as well as C-terminal domain of M1 (being the less conserved among the protein domains) we captured six pairs of correlated positions. Among them, there were one, two, and three position pairs for HA-M2, HA-M1, and M2-M1 protein pairs, respectively. As expected, no co-varying positions were found for NA-HA, NA-M1, and NA-M2 pairs obviously due to high conservation of the NA cytoplasmic tail. The sum of frequencies calculated for two major amino acid patterns observed in pairs of correlated positions was up to 0.99 meaning their high to extreme evolutionary sustainability. Based on the predictions a hypothetical model of pair-wise protein interactions within the viral envelope was proposed.", "paper_title": "Co-evolution analysis to predict protein-protein interactions within influenza virus envelope", "paper_id": "WOS:000348346700008"}