{"auto_keywords": [{"score": 0.027236274521252234, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "output_processing"}, {"score": 0.004750178261675602, "phrase": "type_reduction"}, {"score": 0.0042912493195237725, "phrase": "effective_schemes"}, {"score": 0.003956113993518042, "phrase": "genetic-algorithm-based_type_reduction_algorithm"}, {"score": 0.0035979378467361762, "phrase": "optimal_defuzzified_output"}, {"score": 0.003525493807130663, "phrase": "type-reduced_set"}, {"score": 0.00338493754743055, "phrase": "proposed_type_reduction"}, {"score": 0.003036832649117453, "phrase": "practical_applications"}, {"score": 0.002895986736522535, "phrase": "computational_cost"}, {"score": 0.0027060037347363987, "phrase": "real_time"}, {"score": 0.0025284524249379265, "phrase": "truck_backing_control_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interval type-2 fuzzy logic controllers (IT2-FLCs)", " Type reduction", " Optimization"], "paper_abstract": "In interval type-2 fuzzy logic controllers (IT2-FLCs), the output processing includes type reduction and defuzzification. Recently, researchers have proposed many efficient type reduction algorithms, but there are no effective schemes to improve the output of defuzzification. This paper presents a genetic-algorithm-based type reduction algorithm, which reduces the type of an interval type-2 fuzzy set and provides optimal defuzzified output from the type-reduced set. In addition, the proposed type reduction is executed offline (in other words, the controller has been reduced to type-1 in practical applications), which significantly reduces the computational cost and facilitates the design of controllers that operate in real time. To demonstrate the effectiveness of the proposed method, truck backing control problems are utilized. The results show that the proposed method outperforms general IT2-FLC5 in terms of speed, computational cost, and robustness. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Genetic-algorithm-based type reduction algorithm for interval type-2 fuzzy logic controllers", "paper_id": "WOS:000355366800003"}