{"auto_keywords": [{"score": 0.048658242994016845, "phrase": "scattering_medium"}, {"score": 0.03812022871741232, "phrase": "cross_correlations"}, {"score": 0.03185896123808046, "phrase": "paraxial_regime"}, {"score": 0.031461310706329015, "phrase": "randomly_layered_medium"}, {"score": 0.027740271023772693, "phrase": "random_medium"}, {"score": 0.00481495049065317, "phrase": "virtual_source_array_imaging"}, {"score": 0.004141575435071002, "phrase": "source-receiver_array"}, {"score": 0.004088421020408183, "phrase": "far_side"}, {"score": 0.0038825121288253435, "phrase": "passive_array"}, {"score": 0.0036710872046569532, "phrase": "travel_time_migration"}, {"score": 0.003577414339646767, "phrase": "passive_array_data"}, {"score": 0.003471135453226184, "phrase": "g._papanicolaou"}, {"score": 0.003441352119167824, "phrase": "inverse_problems"}, {"score": 0.0032259472087775138, "phrase": "source_array"}, {"score": 0.0028468767420392945, "phrase": "auxiliary_array"}, {"score": 0.0025014259919355453, "phrase": "active_array"}, {"score": 0.002448061472257196, "phrase": "passive_one"}, {"score": 0.0022073031056287903, "phrase": "passive_receiver_array"}, {"score": 0.002132420504803564, "phrase": "detailed_analysis"}, {"score": 0.0021049977753042253, "phrase": "isotropic_random_media"}], "paper_keywords": ["imaging", " wave propagation", " random media", " cross correlation"], "paper_abstract": "We consider imaging in a scattering medium where the illumination goes through this medium but there is also an auxiliary, passive receiver array that is near the object to be imaged. Instead of imaging with the source-receiver array on the far side of the object, we image with the data of the passive array on the near side of the object. The imaging is done with travel time migration using the cross correlations of the passive array data. We showed in [J. Garnier and G. Papanicolaou, Inverse Problems, 28 (2012), 075002] that if (i) the source array is infinite, (ii) the scattering medium is modeled by either an isotropic random medium in the paraxial regime or a randomly layered medium, and (iii) the medium between the auxiliary array and the object to be imaged is homogeneous, then imaging with cross correlations completely eliminates the effects of the random medium. It is as if we imaged with an active array, instead of a passive one, near the object. The purpose of this paper is to analyze the resolution of the image when both the source array and the passive receiver array are finite. We show with a detailed analysis that for isotropic random media in the paraxial regime, not only is imaging not affected by the inhomogeneities, but the resolution can in fact be enhanced. This is because the random medium can increase the diversity of the illumination. We also show analytically that this will not happen in a randomly layered medium, and there may be some loss of resolution in this case.", "paper_title": "Role of Scattering in Virtual Source Array Imaging", "paper_id": "WOS:000338782900021"}