{"auto_keywords": [{"score": 0.0046993598473345395, "phrase": "actual_election_outcomes"}, {"score": 0.004631335513513859, "phrase": "big_data_world"}, {"score": 0.0040027552011993005, "phrase": "presidential_election_outcomes"}, {"score": 0.0039447744176901054, "phrase": "state_and_county_levels"}, {"score": 0.003775803846431323, "phrase": "television_programs"}, {"score": 0.003721098220825489, "phrase": "key_consideration"}, {"score": 0.0035965032173588753, "phrase": "infrequent_nature"}, {"score": 0.003359647377874098, "phrase": "recent_data"}, {"score": 0.0028058765785670546, "phrase": "television_viewership_data"}, {"score": 0.0027651847105654363, "phrase": "\"safe\"_states"}, {"score": 0.00247215300812495, "phrase": "swing_states"}, {"score": 0.0021886732310288128, "phrase": "television_advertising"}, {"score": 0.0021049977753042253, "phrase": "big_data-driven_optimization"}], "paper_keywords": ["U.S. presidential election", " big data analytics", " media analytics", " election forecasting models", " predictive analytics", " data acquisition and cleansing"], "paper_abstract": "The days of surprise about actual election outcomes in the big data world are likely to be fewer in the years ahead, at least to those who may have access to such data. In this paper we highlight the potential for forecasting the Unites States presidential election outcomes at the state and county levels based solely on the data about viewership of television programs. A key consideration for relevance is that given the infrequent nature of elections, such models are useful only if they can be trained using recent data on viewership. However, the target variable (election outcome) is usually not known until the election is over. Related to this, we show here that such models may be trained with the television viewership data in the \"safe\" states (the ones where the outcome can be assumed even in the days preceding elections) to potentially forecast the outcomes in the swing states. In addition to their potential to forecast, these models could also help campaigns target programs for advertisements. Nearly two billion dollars were spent on television advertising in the 2012 presidential race, suggesting potential for big data-driven optimization of campaign spending.", "paper_title": "Does Television Viewership Predict Presidential Election Outcomes?", "paper_id": "WOS:000361364900003"}