{"auto_keywords": [{"score": 0.04866694555848204, "phrase": "human-centric_web_applications"}, {"score": 0.013236624434735195, "phrase": "web_applications"}, {"score": 0.00481495049065317, "phrase": "systematic_approach"}, {"score": 0.004589763483242731, "phrase": "apparent_\"socialization"}, {"score": 0.0044277810648955624, "phrase": "new_prospects"}, {"score": 0.003927848423072668, "phrase": "increased_human_participation"}, {"score": 0.0037664981403399064, "phrase": "stakeholder_types"}, {"score": 0.0028586409810976367, "phrase": "flexible_and_iterative_development_processes"}, {"score": 0.00247529638625566, "phrase": "quality_attributes"}, {"score": 0.0023592715993204796, "phrase": "product-oriented_means"}, {"score": 0.0022758279600841014, "phrase": "feasible_manner"}, {"score": 0.0021049977753042253, "phrase": "semantic_web"}], "paper_keywords": ["agile development", " credibility", " feasibility", " pattern", " quality model", " semiotics"], "paper_abstract": "The apparent \"socialization\" of the Web brings new prospects as well as challenges. In this paper, the issue of credibility of Web Applications in the light of increased human participation and collaboration is considered. The stakeholder types to which credibility of Web Applications is relevant are identified. Based on a taxonomy of credibility, the origins of the issue of credibility specific to human-centric Web Applications are explored and examples in support are presented. The role of addressing credibility within the auspices of flexible and iterative development processes is emphasized. A framework for understanding and addressing the credibility of human-centric Web Applications in a methodical manner is proposed. This framework includes quality attributes of concern to stakeholders and process- and product-oriented means for addressing them in a feasible manner. Finally, extensions of the framework, including implications towards the Semantic Web, are briefly outlined.", "paper_title": "Towards a systematic approach for the credibility of human-centric web applications", "paper_id": "WOS:000254267600002"}