{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intelligent_power_outlet_system"}, {"score": 0.041577008053686304, "phrase": "power_outlet"}, {"score": 0.0040916230716372265, "phrase": "electrical_events"}, {"score": 0.004040688646993605, "phrase": "low-current_loads"}, {"score": 0.003542557455905503, "phrase": "current_sensor"}, {"score": 0.00347657813672945, "phrase": "main_features"}, {"score": 0.0033482708495261864, "phrase": "remote_control"}, {"score": 0.003125175084962886, "phrase": "current_consumption"}, {"score": 0.0029722900280316216, "phrase": "power_supply_time_schedule"}, {"score": 0.0028625406368744995, "phrase": "vampire_currents"}, {"score": 0.002722468694023035, "phrase": "electrical_fires"}, {"score": 0.002477998427152547, "phrase": "simple_home_automation_network"}, {"score": 0.0021049977753042253, "phrase": "next_generation"}], "paper_keywords": [""], "paper_abstract": "This paper presents an intelligent power outlet system that can be controlled wirelessly and that has been specifically designed to monitor electrical events in low-current loads. Each power outlet of the system embeds a microcontroller, a 2.4 GHz ZigBee interface, RFID (Radio Frequency Identification) reader, a relay, and a current sensor. The main features of the system include the remote control of the power outlet, real-time monitoring of the current consumption, the customization and programming of the power supply time schedule, the automatic interruption of vampire currents, and the prevention of certain types of electrical fires and electrocutions. A prototype with such features has been implemented and tested in a simple home automation network in order to validate its functionalities. The results show that the system reacts fast and avoids overconsumptions and electrocutions, being able to make the next generation of homes safer and smarter.", "paper_title": "An Intelligent Power Outlet System for the Smart Home of the Internet of Things", "paper_id": "WOS:000365210800001"}