{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "paper_based_resources"}, {"score": 0.004123781267600542, "phrase": "people's_behaviour"}, {"score": 0.004044645056447888, "phrase": "conventional_pen_and_paper_tools"}, {"score": 0.003791621842185417, "phrase": "learning_performance"}, {"score": 0.0036710872046569532, "phrase": "task_completion"}, {"score": 0.003577414339646767, "phrase": "working_materials"}, {"score": 0.0025892330566358503, "phrase": "online_questionnaire"}, {"score": 0.00250682585023182, "phrase": "university_students"}, {"score": 0.0023497779149212737, "phrase": "computer_and_paper_based_resources"}, {"score": 0.0022897425998475362, "phrase": "content_analysis"}, {"score": 0.0021049977753042253, "phrase": "personal_preferences"}], "paper_keywords": ["Paper", " screen", " empirical study", " advantages", " disadvantages", " student behaviour"], "paper_abstract": "The evolution and integration of Information and Communication Technologies in all sectors of society has resulted in a transformation of people's behaviour towards the conventional pen and paper tools. The adoption of technology has enhanced work and learning performance by adding swiftness in task completion, organisation of working materials and capacity of storage. Despite its popularity and value, technology, is still surpassed, in some domains, by pen and paper. This research aims to explore the advantages and disadvantages of using both computer and paper for reading and writing. The development of an online questionnaire that was administered to university students intended to examine their preferences and behaviours in terms of computer and paper based resources. Through the content analysis of the questionnaires it was possible to establish patterns of use, personal preferences and to establish a connection between computer and paper use that mirrors both competitiveness and complementarity.", "paper_title": "AN EMPIRICAL STUDY ON COMPUTER AND PAPER BASED RESOURCES: ARE THEY COMPETITIVE OR COMPLIMENTARY MEANS?", "paper_id": "WOS:000366817800010"}