{"auto_keywords": [{"score": 0.047244318311946, "phrase": "external_reviewers"}, {"score": 0.007575122612457049, "phrase": "b._i._f."}, {"score": 0.00481495049065317, "phrase": "science_-_effects"}, {"score": 0.004782455247247007, "phrase": "external_reviewers'_attributes"}, {"score": 0.004702168843383725, "phrase": "fellowship_applications"}, {"score": 0.004424087591260246, "phrase": "young_scientists"}, {"score": 0.004190682785437681, "phrase": "different_personal_attributes"}, {"score": 0.003996536734752314, "phrase": "actual_evaluation_practice"}, {"score": 0.0037600281647068522, "phrase": "selection_procedure"}, {"score": 0.003696842380670749, "phrase": "b.i.f."}, {"score": 0.0036470559917231218, "phrase": "long-term_fellowships"}, {"score": 0.0036224139706218916, "phrase": "doctoral_and_post-doctoral_researchers"}, {"score": 0.0028089019809364817, "phrase": "fellowship_applicants"}, {"score": 0.0025113494092413604, "phrase": "significant_effect"}, {"score": 0.002485911017095097, "phrase": "reviewers'_attributes"}, {"score": 0.0024440836179156593, "phrase": "b._i._f._fellowship_applications"}, {"score": 0.0023465400668244386, "phrase": "applicants'_scientific_achievement"}, {"score": 0.002199978308846543, "phrase": "foundation's_goal"}, {"score": 0.002162951519368368, "phrase": "higher_scientific_achievement"}, {"score": 0.0021049977753042253, "phrase": "lower_scientific_achievement"}], "paper_keywords": ["peer review", " particularism", " universalism", " country of residence", " gender", " evaluation experience", " judgmental tendencies"], "paper_abstract": "Aim: The scientific norm of universalism prescribes that external reviewers recommend the allocation of awards to young scientists solely on the basis of their scientific achievement. Since the evaluation of grants utilizes scientists with different personal attributes, it is natural to ask whether the norm of universalism reflects the actual evaluation practice. Subjects and methods: We investigated the influence of three attributes of external reviewers on their ratings in the selection procedure followed by the Boehringer Ingelheim Fonds (B.I.F.) for awarding long-term fellowships to doctoral and post-doctoral researchers in biomedicine: (i) number of applications assessed in the past for the B. I. F. (reviewers' evaluation experience), (ii) the reviewers' country of residence and (iii) the reviewers' gender. To analyze the reviewers' ratings (1: award; 2: maybe award; 3: no award) in an ordinal regression model (ORM) the following were considered in addition to the three attributes: (i) the scientific achievements of the fellowship applicants, (ii) interaction effects between reviewers' and applicants' attributes and (iii) judgmental tendencies of reviewers. Results: The results of the model estimations show no significant effect of the reviewers' attributes on the evaluation of B. I. F. fellowship applications. The ratings of the external reviewers are mainly determined by the applicants' scientific achievement prior to application. Conclusions: The results suggest that the external reviewers of the B. I. F. indeed achieved the foundation's goal of recommending applicants with higher scientific achievement for fellowships and of recommending those with lower scientific achievement for rejection. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Gatekeepers of science - Effects of external reviewers' attributes on the assessments of fellowship applications", "paper_id": "WOS:000253974300010"}