{"auto_keywords": [{"score": 0.04129247632853448, "phrase": "dsp"}, {"score": 0.00481495049065317, "phrase": "bi-criteria_disassembly_sequencing_problem"}, {"score": 0.004695389394526107, "phrase": "product_recovery"}, {"score": 0.0046118021635786315, "phrase": "product_disassembly"}, {"score": 0.0042920078348374375, "phrase": "disassembly_sequence_planning"}, {"score": 0.003965684670332574, "phrase": "disassembly_sequence_plan"}, {"score": 0.003853251284913932, "phrase": "disassembly_tasks"}, {"score": 0.003509317669345521, "phrase": "decision_version"}, {"score": 0.0034220655476652683, "phrase": "optimal_dsp"}, {"score": 0.003385336776758738, "phrase": "np-complete_problem"}, {"score": 0.0032075033252058835, "phrase": "heuristic_and_metaheuristic_techniques"}, {"score": 0.0027181663098561066, "phrase": "selected_parts"}, {"score": 0.0026032523182547003, "phrase": "greedy_randomized_adaptive_search_procedure"}, {"score": 0.0025568135952982345, "phrase": "path-relinking-based_heuristic_methodology"}, {"score": 0.0024842242921857705, "phrase": "disassembly_problem"}, {"score": 0.002328326982534932, "phrase": "consistent_generation"}, {"score": 0.0023116191163488824, "phrase": "near-optimal_solutions"}, {"score": 0.0022379017425216917, "phrase": "superior_speed"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["reverse logistics", " disassembly sequence problem", " GRASP", " path relinking", " multicriteria"], "paper_abstract": "The first crucial step of product recovery is disassembly. Some product disassembly is almost always needed in remanufacturing, recycling, and disposal. Since disassembly tends to be expensive, disassembly sequence planning becomes important in minimizing resources (time and money) invested in disassembly and maximizing the level of automation. A disassembly sequence plan (DSP) is a sequence of disassembly tasks, which begins with a product to be disassembled and terminates in a state where all of the parts of interest are separated. The decision version of the problem of finding the optimal DSP is an NP-complete problem and therefore complex and challenging to solve. Often one has to resort to heuristic and metaheuristic techniques for solving such problems. In this paper, we seek a DSP that addresses two criteria in order. First, we look for a sequence, the cost of which is close to our cost aspiration. Second, we look for a sequence that prioritizes some selected parts to be disassembled as early as possible. We propose a greedy randomized adaptive search procedure (GRASP) and path-relinking-based heuristic methodology specifically developed to solve such bi-criteria type of disassembly problem. An example is considered to illustrate the implementation of the methodology. Conclusions drawn include the consistent generation of near-optimal solutions, the ability to preserve precedence, the superior speed of the metaheuristic, and its practicality due to its ease of implementation. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A path-relinking approach for a bi-criteria disassembly sequencing problem", "paper_id": "WOS:000256256900018"}