{"auto_keywords": [{"score": 0.04510289334579302, "phrase": "psg"}, {"score": 0.00481495049065317, "phrase": "sleep_eeg_arousals"}, {"score": 0.00478579024367007, "phrase": "sleep_studies"}, {"score": 0.004558748120167778, "phrase": "standard_technique"}, {"score": 0.0039280214778273925, "phrase": "abrupt_shift"}, {"score": 0.0039042115674024006, "phrase": "eeg_frequency"}, {"score": 0.0038805454197432337, "phrase": "normal_structure"}, {"score": 0.0037075456471849892, "phrase": "important_factor"}, {"score": 0.003574695610710444, "phrase": "computing_assistance"}, {"score": 0.003384262486955773, "phrase": "psg_test"}, {"score": 0.003343336516033681, "phrase": "economical_and_human_resources"}, {"score": 0.0032333158387737424, "phrase": "real_patients"}, {"score": 0.0029512611306191194, "phrase": "different_feature_selection_methods"}, {"score": 0.00291555613737437, "phrase": "redundant_features"}, {"score": 0.0028541057064952876, "phrase": "sleep_arousals"}, {"score": 0.0026129863248033807, "phrase": "good_performance"}, {"score": 0.0025039656549083497, "phrase": "different_methods"}, {"score": 0.0023417427763424916, "phrase": "relevant_features"}, {"score": 0.002278440725193305, "phrase": "irrelevant_features"}, {"score": 0.0021966859554037174, "phrase": "input_space"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Feature selection", " Knowledge discovery in databases", " Machine learning", " Sleep studies"], "paper_abstract": "Sleep studies are carried out in order to diagnose those diseases associated with the sleep. The standard technique consists on monitoring various bio-physiological signals of the patient during sleep. The resulting recording, the polysomnography (PSG) is then analyzed offline by the physician. This supposes a very time-consuming task and therefore automation of these analyses is desirable. An arousal during sleep is defined as an abrupt shift in EEG frequency. Normal structure of sleep is altered by the presence of these events, thus being an important factor that influences on the quality of sleep. The use of computing assistance for the detection of these events on the PSG is aimed at reducing the cost of the PSG test, both in economical and human resources. In this work, a dataset containing PSGs of real patients was used for the detection of arousals in sleep. A total of 42 features were extracted from biosignals for the detection of these events. Our aim was to use different feature selection methods to eliminate the redundant features studying their influence on the identification of sleep arousals, checking whether classification could be improved. The objective is to reduce the number of features, identifying the subset of those with more relevance while preserving a good performance on the classifier. Two approximations are explored, wrappers and filters, using different methods of both, and also combinations of each of the methods by means of the union and the intersection of the relevant features obtained. The results showed that discarding the irrelevant features by these methods is feasible, reducing the dimensionality on the input space and also improving the accuracy of the classifiers. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Reducing dimensionality in a database of sleep EEG arousals", "paper_id": "WOS:000288343900150"}