{"auto_keywords": [{"score": 0.04439563634541904, "phrase": "acm"}, {"score": 0.004636594774238505, "phrase": "visual_exploration"}, {"score": 0.004540365779658683, "phrase": "human-computer_interaction"}, {"score": 0.004192484908247302, "phrase": "computer-human_interaction"}, {"score": 0.004105435059094976, "phrase": "user_interface_software"}, {"score": 0.004020185355794902, "phrase": "advanced_visual_interfaces"}, {"score": 0.003920209964956682, "phrase": "information_visualization"}, {"score": 0.003759057920801288, "phrase": "data_set"}, {"score": 0.0036809741830924796, "phrase": "exploration_process"}, {"score": 0.003589404014552974, "phrase": "expected_patterns"}, {"score": 0.0031912018800904314, "phrase": "prestigious_and_long-established_chi_conference"}, {"score": 0.0030343239259424497, "phrase": "unexpected_insights"}, {"score": 0.002743262400544957, "phrase": "distinct_patterns"}, {"score": 0.0026862220320327613, "phrase": "interesting_sidelight"}, {"score": 0.0026193328696791306, "phrase": "hci_field-exploratory_data_analysis"}, {"score": 0.0022609695885550058, "phrase": "new_ones"}, {"score": 0.0021049977753042253, "phrase": "fascinating_new_ones"}], "paper_keywords": [""], "paper_abstract": "We present a visual exploration of the field of human-computer interaction (HCI) through the author and article metadata of four of its major conferences: the ACM conferences on Computer-Human Interaction (CHI), User Interface Software and Technology, and Advanced Visual Interfaces and the IEEE Symposium on Information Visualization. This article describes many global and local patterns we discovered in this data set, together with the exploration process that produced them. Some expected patterns emerged, such as that-like most social networks-coauthorship and citation networks exhibit a power-law degree distribution, with a few widely collaborating authors and highly cited articles. Also, the prestigious and long-established CHI conference has the highest impact (citations by the others). Unexpected insights included that the years when a given conference was most selective are not correlated with those that produced its most highly referenced articles and that influential authors have distinct patterns of collaboration. An interesting sidelight is that methods from the HCI field-exploratory data analysis by information visualization and direct-manipulation interaction-proved useful for this analysis. They allowed us to take an open-ended, exploratory approach, guided by the data itself. As we answered our original questions, new ones arose; as we confirmed patterns we expected, we discovered refinements, exceptions, and fascinating new ones.", "paper_title": "20 years of four HCI conferences: A visual exploration", "paper_id": "WOS:000252164000003"}