{"auto_keywords": [{"score": 0.029527297444984297, "phrase": "ip_and_mpls_networks"}, {"score": 0.014929920035699356, "phrase": "node_failure"}, {"score": 0.014075074127282455, "phrase": "service_providers"}, {"score": 0.008607254831843804, "phrase": "physical_layer"}, {"score": 0.00481495049065317, "phrase": "desirable_features"}, {"score": 0.004419904580451831, "phrase": "network_resilience"}, {"score": 0.004338390136272005, "phrase": "key_demand"}, {"score": 0.004274257668843717, "phrase": "resilient_networks"}, {"score": 0.0040571383470418085, "phrase": "failed_part"}, {"score": 0.0038798015183611275, "phrase": "traffic_diversion_process"}, {"score": 0.0034954725617970294, "phrase": "new_path"}, {"score": 0.0034437574674180365, "phrase": "diverted_traffic"}, {"score": 0.002847540262784593, "phrase": "sonet_networks"}, {"score": 0.002193196442500506, "phrase": "mpls"}, {"score": 0.0021850254717637172, "phrase": "fast_reroute_schemes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MPLS networks", " IP fast reroute", " protection switching", " micro-loop prevention", " loop-free alternate", " U-turn alternate"], "paper_abstract": "One of the desirable features of any network is its ability to keep services running despite a link or node failure. This ability is usually referred to as network resilience and has become a key demand from service providers. Resilient networks recover from a failure by repairing themselves automatically by diverting traffic from the failed part of the network to another portion of the network. This traffic diversion process should be fast enough to ensure that the interruption of service due to a link or node failure is either unnoticeable or as small as possible. The new path taken by a diverted traffic can be computed at the time a failure occurs through a procedure called rerouting. Alternatively the path can be computed before a failure occurs through a procedure called fast reroute. Much attention is currently being paid to fast reroute because service providers who are used to the 50-ms failure recovery time associated with SONET networks are demanding the same feature from IP and MPLS networks. While this requirement can easily be met in SONET because it operates at the physical layer, it is not easily met in IP and MPLS networks that operate above the physical layer. However, over the last few years, several schemes have been proposed for accomplishing 50-ms fast reroutes for IP and MPLS networks. The purpose of this paper is to provide a survey of the IP fast reroute and MPLS fast reroute schemes that have been proposed. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "A survey of IP and multiprotocol label switching fast reroute schemes", "paper_id": "WOS:000246260800002"}