{"auto_keywords": [{"score": 0.04969224955450255, "phrase": "venus"}, {"score": 0.02791169674816841, "phrase": "nwchem"}, {"score": 0.006464239261701682, "phrase": "electronic_structure_theory"}, {"score": 0.006367754019259728, "phrase": "direct_dynamics_simulations"}, {"score": 0.006265446633313681, "phrase": "tight_coupling"}, {"score": 0.005278958599058868, "phrase": "distributed_program"}, {"score": 0.005260649055236894, "phrase": "test_data"}, {"score": 0.005039987371538217, "phrase": "linux"}, {"score": 0.004901759075130721, "phrase": "sequential_code"}, {"score": 0.00481495049065317, "phrase": "chemical_dynamics_simulations"}, {"score": 0.004742965015655678, "phrase": "resulting_software_package"}, {"score": 0.004543893117268502, "phrase": "routine_calls"}, {"score": 0.004419235376738147, "phrase": "core_codes"}, {"score": 0.00434809683142194, "phrase": "direct_dynamics_trajectories"}, {"score": 0.004293003078863547, "phrase": "overall_execution"}, {"score": 0.004253371990822773, "phrase": "essentially_sequential_code"}, {"score": 0.0042287877724301514, "phrase": "highly_parallel_structure"}, {"score": 0.004175199418629634, "phrase": "data_transmission"}, {"score": 0.004131857799258646, "phrase": "recent_examples"}, {"score": 0.0040703282972236856, "phrase": "program"}, {"score": 0.00400450303282999, "phrase": "cpc_program_library"}, {"score": 0.003995226376780718, "phrase": "queen's_university"}, {"score": 0.00398597119868552, "phrase": "belfast"}, {"score": 0.0039767372273711195, "phrase": "n._ireland"}, {"score": 0.003949163176828598, "phrase": "educational_community_license"}, {"score": 0.003805286259369455, "phrase": "tar.gz_programming_language"}, {"score": 0.003796482956954358, "phrase": "fortran"}, {"score": 0.003533011633478693, "phrase": "important_role"}, {"score": 0.0035125763643693306, "phrase": "atomic-level_chemical_dynamics_information"}, {"score": 0.0034720585078081125, "phrase": "rate_constants"}, {"score": 0.0034640109995671795, "phrase": "intramolecular_vibrational_energy_redistribution_rates"}, {"score": 0.003432006418352367, "phrase": "direct_dynamics"}, {"score": 0.003424051423539817, "phrase": "electronic_structure_methods"}, {"score": 0.003372789982430224, "phrase": "complex_systems"}, {"score": 0.0032687548955857284, "phrase": "general_electronic_structure_program"}, {"score": 0.003212346150241582, "phrase": "direct_dynamics_simulation"}, {"score": 0.0032101923731540426, "phrase": "running_time"}, {"score": 0.003158454626856202, "phrase": "ab_initio_method"}, {"score": 0.0031277316566463978, "phrase": "design_goals"}, {"score": 0.00305596203954658, "phrase": "code_developments"}, {"score": 0.0029893023011442863, "phrase": "parallel_code"}, {"score": 0.0029479723215484702, "phrase": "hessian"}, {"score": 0.002930889218742926, "phrase": "important_aspect"}, {"score": 0.002883639898615449, "phrase": "tight_coupling_interface"}, {"score": 0.002833858168838899, "phrase": "classical_chemical_dynamics_simulation"}, {"score": 0.0028011473746675313, "phrase": "initial_sampling"}, {"score": 0.0027720297139913947, "phrase": "chemical_reaction"}, {"score": 0.0027210356111840627, "phrase": "schrodinger"}, {"score": 0.0026771333996253783, "phrase": "electronic_structure_program"}, {"score": 0.0026400883813440584, "phrase": "classical_trajectory_program"}, {"score": 0.0025975148936012602, "phrase": "full_documentation"}, {"score": 0.0025824766016411625, "phrase": "distribution_file"}, {"score": 0.002567525149632232, "phrase": "readme_file"}, {"score": 0.0025526600386971514, "phrase": "brief_description"}, {"score": 0.002494053127080523, "phrase": "input_and_output_data"}, {"score": 0.002439620320946358, "phrase": "signed_license_agreement"}, {"score": 0.002364300949730563, "phrase": "chemical_system"}, {"score": 0.0023588149152358826, "phrase": "simulation_time"}, {"score": 0.0022806798371116698, "phrase": "different_types"}, {"score": 0.0022543398609156592, "phrase": "valiev_et_al"}, {"score": 0.00221025662652057, "phrase": "full_simulation"}, {"score": 0.0021771901738611827, "phrase": "dft"}, {"score": 0.0021695525833357165, "phrase": "small_basis"}, {"score": 0.002156986617540392, "phrase": "single_compute"}, {"score": 0.002132072143544779, "phrase": "heavy_atoms"}, {"score": 0.0021271238150603975, "phrase": "larger_basis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Direct dynamics", " Classical trajectories", " Molecular simulation"], "paper_abstract": "The interface for VENUS and NWChem, and the resulting software package for direct dynamics simulations are described. The coupling of the two codes is considered to be a tight coupling since the two codes are compiled and linked together and act as one executable with data being passed between the two codes through routine calls. The advantages of this type of coupling are discussed. The interface has been designed to have as little interference as possible with the core codes of both VENUS and NWChem. VENUS is the code that propagates the direct dynamics trajectories and, therefore, is the program that drives the overall execution of VENUS/NWChem. VENUS has remained an essentially sequential code, which uses the highly parallel structure of NWChem. Subroutines of the interface that accomplish the data transmission and communication between the two computer programs are described. Recent examples of the use of VENUS/NWChem for direct dynamics simulations are summarized. Program summary Program title: VENUS/NWChem Catalogue identifier: AERS_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AERS_v1_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Open Source Educational Community License No. of lines in distributed program, including test data, etc.: 10,831,970 No. of bytes in distributed program, including test data, etc.: 77,141,871 Distribution format: tar.gz Programming language: Fortran 77 with some C in NWChem, MPI. Computer: All Linux based workstations and parallel supercomputers. Operating system: Linux. Has the code been vectorized or parallelized?: Venus is a sequential code; NWChem can run in parallel. Classification: 16.8. Subprograms used: Cat Id Title Reference AEGI_v1_0 NWChem CPC 181(2010)1477 Nature of problem: Direct dynamics simulations play an important role in investigating and understanding atomic-level chemical dynamics information such as atomistic reaction mechanisms, unimolecular and bimolecular rate constants, intramolecular vibrational energy redistribution rates, etc. The ability to couple direct dynamics with electronic structure methods brings a level of fidelity to the simulations that is important for complex systems. However, a tight coupling between two codes that have their own development teams and schedules can be challenging. Solution method: The VENUS/NWChem interface is designed to link the general electronic structure program (NWChem) and classical chemical dynamics simulation program (VENUS) to perform direct dynamics simulation in which the trajectories \"on the fly\" with the potential and its derivatives obtained directly from electronic structure theory. One of the design goals is to build interfaces that require as little interference in NWChem and VENUS as possible so that each of the code developments can continue independently. This is especially important since VENUS is currently a sequential code and NWChem is a parallel code and being able to compute the energies, gradients, and Hessian in parallel is an important aspect of making the software useful to users. In this manuscript, the tight coupling interface between the two codes is described and examples of its use are given. In the classical chemical dynamics simulation an ensemble of trajectories is calculated, and the initial sampling represents the conditions of the reactants for the chemical reaction under investigation. Each trajectory is evaluated by numerically integrating either Hamilton's or Newton's equations of motion. The Schrodinger equation is solved and the energy and energy gradient are calculated in the electronic structure program (NWChem), and this information is passed to the classical trajectory program (VENUS) to solve the equations of motion. Additional comments: Full documentation is provided in the distribution file. This includes a README file giving the names and brief description of all the files that make up the package and instructions on the installation and execution of the program. Sample input and output data for test run will also be provided. The software is free to download and use once a signed license agreement has been received. The agreement will be displayed when the program is requested. Running time: The running time depends on the size of the chemical system, simulation time, complexity of the ab initio method and number of CPUs. The ab initio method is the most time consuming part of each step in the calculations and scaling, for different types of systems and levels of theory is available in Valiev et al. (2010). Again, there are many factors that affect the running time for the full simulation and it can range from several hours for simulations of a few atoms with DFT and a small basis set running on a single compute node to several days for the simulation of tens of heavy atoms with larger basis set running parallel. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "The VENUS/NWChem software package. Tight coupling between chemical dynamics simulations and electronic structure theory", "paper_id": "WOS:000331919100038"}