{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "policy_selection"}, {"score": 0.004296889776409743, "phrase": "piece_selection_policy"}, {"score": 0.004260800171269249, "phrase": "peer_selection_policy"}, {"score": 0.0042250123967577284, "phrase": "replica_management_policy"}, {"score": 0.004033464035028803, "phrase": "research_work"}, {"score": 0.003660452313567116, "phrase": "existing_research"}, {"score": 0.0035240305920962766, "phrase": "simulation_framework"}, {"score": 0.0033641551050434663, "phrase": "different_policy_compositions"}, {"score": 0.0033218213825698417, "phrase": "simulation_results"}, {"score": 0.0030657684627749364, "phrase": "sequential_piece_selection_policy"}, {"score": 0.003027178161479457, "phrase": "cascading_peer_selection_policy"}, {"score": 0.0029890721584351684, "phrase": "proportional_replica_management_policy"}, {"score": 0.002951444412262927, "phrase": "best_performance"}, {"score": 0.0026782279715171866, "phrase": "different_policies"}, {"score": 0.0023694065215394593, "phrase": "extra_replica_space"}, {"score": 0.0022238834225283594, "phrase": "extra_storage_space"}, {"score": 0.002131857309586904, "phrase": "practical_scenarios"}, {"score": 0.0021049977753042253, "phrase": "peers'_bandwidth"}], "paper_keywords": ["P2P VoD streaming", " Piece selection policy", " Peer selection policy", " Replica management policy"], "paper_abstract": "The P2P-based video-on-demand (P2P VoD) service has achieved tremendous success among Internet users, and attracted many researchers' interest. Piece selection policy, peer selection policy and replica management policy are three important policies in P2P VoD systems. Although there has been some research work on the policy selection of the P2P VoD system, it still remains unknown that which policy composition is better for the system. Different from the existing research, we study the existing P2P VoD policies by using a simulation framework to understand the features as well as the performance of different policy compositions. The simulation results indicate that when the bandwidth and storage resources are limited in the P2P VoD system, the composition of the sequential piece selection policy, the cascading peer selection policy and the proportional replica management policy has the best performance among all the different policy compositions. However, when the bandwidth and storage resources are sufficient in the system, there will be little difference between different policies. To further understand such a system, we also explore the impact of resources on policies selection. Our simulation provides evidence that theoretically the P2P VoD system can work well without extra replica space as long as the bandwidth of the peers is large enough, but the extra storage space can help improve the performance of the system in practical scenarios where the peers' bandwidth is limited.", "paper_title": "Exploring the policy selection of the P2P VoD system: A simulation-based research", "paper_id": "WOS:000356581300009"}