{"auto_keywords": [{"score": 0.028649528978382733, "phrase": "free-text_method"}, {"score": 0.010509529447988176, "phrase": "chest_x-ray_radiography"}, {"score": 0.01037391888942535, "phrase": "radiology_reports"}, {"score": 0.009471939609983871, "phrase": "structured_reports"}, {"score": 0.004952720859224204, "phrase": "chest_x-rays"}, {"score": 0.00481495049065317, "phrase": "generates_structured"}, {"score": 0.004629912133717504, "phrase": "narrative_form"}, {"score": 0.004481132747216135, "phrase": "advanced_applications"}, {"score": 0.00445195298244008, "phrase": "data_analysis"}, {"score": 0.004408537640504066, "phrase": "decision_support"}, {"score": 0.0041703614123283165, "phrase": "existing_reports"}, {"score": 0.004102780105064226, "phrase": "fundamental_sentence_structure"}, {"score": 0.003756252137445817, "phrase": "soft_tissue"}, {"score": 0.003695356628334569, "phrase": "chest_wall"}, {"score": 0.003361069456060196, "phrase": "resource_description_framework"}, {"score": 0.0033391817484145618, "phrase": "rdf"}, {"score": 0.003285002755070214, "phrase": "reporting_system"}, {"score": 0.0028915634293105014, "phrase": "associated_terms"}, {"score": 0.0028727045847620957, "phrase": "fifty_chest_x-rays"}, {"score": 0.0028076592725295646, "phrase": "five_radiologists"}, {"score": 0.002225481283887324, "phrase": "daily_clinical_practice"}, {"score": 0.002118827457244586, "phrase": "almost_concordant_reports"}, {"score": 0.0021049977753042253, "phrase": "shorter_time"}], "paper_keywords": ["Chest x-ray photography", " radiology report", " structured report", " resource description framework", " information model"], "paper_abstract": "Objectives: Radiology reports are typically made in narrative form; this is a barrier to the implementation of advanced applications for data analysis or a decision support. We developed a system that generates structured reports for chest x-ray radiography. Methods: Based on analyzing existing reports, we determined the fundamental sentence structure of findings as compositions of procedure, region, finding, and diagnosis. We categorized the observation objects into lung, mediastinum, bone, soft tissue, and pleura and chest wall. The terms of region, finding, and diagnosis were associated with each other. We expressed the terms and the relations between the terms using a resource description framework (RDF) and developed a reporting system based on it. The system shows a list of terms in each category, and modifiers can be entered using templates that are linked to each term. This system guides users to select terms by highlighting associated terms. Fifty chest x-rays with abnormal findings were interpreted by five radiologists and reports were made either by the system or by the free-text method. Results: The system decreased the time needed to make a report by 12.5% compared with the free-text method, and the sentences generated by the system were well concordant with those made by free-text method (F-measure = 90%). The results of the questionnaire showed that our system is applicable to radiology reports of chest x-rays in daily clinical practice. Conclusions: The method of generating structured reports for chest x-rays was feasible, because it generated almost concordant reports in shorter time compared with the free-text method.", "paper_title": "Development of a System that Generates Structured Reports for Chest X-ray Radiography", "paper_id": "WOS:000281697000005"}