{"auto_keywords": [{"score": 0.0394121994341566, "phrase": "efficient_greedy_algorithm"}, {"score": 0.00481495049065317, "phrase": "social_networks"}, {"score": 0.004698229304089357, "phrase": "new_variant"}, {"score": 0.004640929126263433, "phrase": "task_allocation_problem"}, {"score": 0.00447316895126645, "phrase": "social_network"}, {"score": 0.0041065099247719495, "phrase": "np"}, {"score": 0.003386301445203071, "phrase": "broad_set"}, {"score": 0.003237116128682586, "phrase": "proposed_algorithm"}, {"score": 0.0031845067058084583, "phrase": "solution_quality"}, {"score": 0.003158522476399068, "phrase": "computation_time"}, {"score": 0.002839352319679885, "phrase": "realistic_applications"}, {"score": 0.002659142621852998, "phrase": "large-scale_applications"}, {"score": 0.0023610946923597405, "phrase": "optimal_algorithm"}, {"score": 0.002157433262687853, "phrase": "truthful_mechanism"}, {"score": 0.0021049977753042253, "phrase": "cluster-based_algorithm"}], "paper_keywords": ["Task allocation", " Social networks", " Resource allocation", " Distributed algorithm", " Mechanism design"], "paper_abstract": "This paper proposes a new variant of the task allocation problem, where the agents are connected in a social network and tasks arrive at the agents distributed over the network. We show that the complexity of this problem remains NP-complete. Moreover, it is not approximable within some factor. In contrast to this, we develop an efficient greedy algorithm for this problem. Our algorithm is completely distributed, and it assumes that agents have only local knowledge about tasks and resources. We conduct a broad set of experiments to evaluate the performance and scalability of the proposed algorithm in terms of solution quality and computation time. Three different types of networks, namely small-world, random and scale-free networks, are used to represent various social relationships among agents in realistic applications. The results demonstrate that our algorithm works well and also that it scales well to large-scale applications. In addition we consider the same problem in a setting where the agents holding the resources are self-interested. For this, we show how the optimal algorithm can be used to incentivize these agents to be truthful. However, the efficient greedy algorithm cannot be used in a truthful mechanism, therefore an alternative, cluster-based algorithm is proposed and evaluated.", "paper_title": "Multiagent task allocation in social networks", "paper_id": "WOS:000300283100002"}