{"auto_keywords": [{"score": 0.04492262832868242, "phrase": "cover_traffic"}, {"score": 0.00879828839008822, "phrase": "rbc"}, {"score": 0.007740489563401459, "phrase": "statistical_disclosure_attack"}, {"score": 0.0048116944487456735, "phrase": "alice"}, {"score": 0.0047846807459660376, "phrase": "receiver-bound_cover"}, {"score": 0.00469500313566324, "phrase": "important_privacy_service"}, {"score": 0.004650793657308996, "phrase": "passive_eavesdroppers"}, {"score": 0.0046069985410261746, "phrase": "communicating_parties"}, {"score": 0.0044922081848067135, "phrase": "long-term_statistical_analysis"}, {"score": 0.004099455381916337, "phrase": "privacy-sensitive_users"}, {"score": 0.003788444178071508, "phrase": "consistent_levels"}, {"score": 0.003717368939083015, "phrase": "inconsistent_cover_traffic"}, {"score": 0.0036132394176383582, "phrase": "anonymity_system"}, {"score": 0.003545439507880801, "phrase": "sending_patterns"}, {"score": 0.003174464741377186, "phrase": "different_cover"}, {"score": 0.0031644543425642575, "phrase": "traffic_methods"}, {"score": 0.002970725517928825, "phrase": "high_probability"}, {"score": 0.0028065024340850615, "phrase": "attacker_success"}, {"score": 0.002576988153314685, "phrase": "additional_time"}, {"score": 0.0022637650216685906, "phrase": "realistic_social_networks"}, {"score": 0.0022002633747977593, "phrase": "user_generated_cover_traffic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Privacy-enhancing technologies", " Cover traffic", " Anonymity", " Anonymous communications", " Statistical disclosure attack"], "paper_abstract": "Anonymous communications provides an important privacy service by keeping passive eavesdroppers from linking communicating parties. However, an attacker can use long-term statistical analysis of traffic sent to and from such a system to link senders with their receivers. Cover traffic is an effective, but somewhat limited, counter strategy against this attack. Earlier work in this area proposes that privacy-sensitive users generate and send cover traffic to the system. However, users are not online all the time and cannot be expected to send consistent levels of cover traffic; use of inconsistent cover traffic drastically reduces its impact. We propose that the anonymity system generate cover traffic that mimics the sending patterns of users in the system. This receiver-bound cover (RBC) helps to make up for users that aren't there, confusing the attacker. To study the statistical disclosure attack and different cover traffic methods, we introduce an analytical: method to bound the time for an attacker to identify a contact of Alice with high probability. We use these bounds to show that cover traffic sent by Alice greatly increases the time for attacker success, especially as the amount of traffic from other users increases. Further, we show that RBC greatly enhances the defense, forcing the attacker to take additional time proportional to the amount of cover used. We also examine the effectiveness of the attack and cover traffic when the attacker can only observe part of the traffic in the system. We validate our analysis through simulations that extend to realistic social networks. When RBC is used in combination with user generated cover traffic, the attack takes a very long time to succeed. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "An analysis of the statistical disclosure attack and receiver-bound cover", "paper_id": "WOS:000298072100005"}