{"auto_keywords": [{"score": 0.00459165923324494, "phrase": "comparison_framework"}, {"score": 0.0037969755088553326, "phrase": "seven_existing_automatic_accessibility_metrics"}, {"score": 0.003307988966112615, "phrase": "experimental_demonstration"}, {"score": 0.0031393948330209255, "phrase": "seven_published_metrics"}, {"score": 0.0027610089418453614, "phrase": "page_measure"}, {"score": 0.0026202187680903063, "phrase": "highest_levels"}, {"score": 0.0021659920594094407, "phrase": "new_research_avenues"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Web accessibility", " Quality framework", " Metrics", " Automatic assessment", " Automatic accessibility evaluation"], "paper_abstract": "The fact that several web accessibility metrics exist may be evidence of a lack of a comparison framework that highlights how well they work and for what purposes they are appropriate. In this paper we aim at formulating such a framework, demonstrating that it is feasible, and showing the findings we obtained when we applied it to seven existing automatic accessibility metrics. The framework encompasses validity, reliability, sensitivity, adequacy and complexity of metrics in the context of four scenarios where the metrics can be used. The experimental demonstration of the viability of the framework is based on applying seven published metrics to more than 1500 web pages and then operationalizing the notions of validity-as-conformance, adequacy and complexity. Our findings lead us to conclude that the Web Accessibility Quantitative Metric, Page Measure and Web Accessibility Barrier are the metrics that achieve the highest levels of quality (out of the seven that we examined). Finally, since we did not analyse reliability, sensitivity and validity-in-use, this paper provides guidance to address them in what are new research avenues. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Automatic web accessibility metrics: Where we are and where we can go", "paper_id": "WOS:000290009900004"}