{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_processes"}, {"score": 0.018443570291140594, "phrase": "integrated_management"}, {"score": 0.003742084495435749, "phrase": "key_aspects"}, {"score": 0.0036553070575015344, "phrase": "trivial_task"}, {"score": 0.003591542373891629, "phrase": "huge_number"}, {"score": 0.0027579362569638945, "phrase": "fmesp"}, {"score": 0.00270978310478061, "phrase": "conceptual_and_technological_elements"}, {"score": 0.0024667783849055634, "phrase": "measurement_perspective"}, {"score": 0.0022854384756395116, "phrase": "software_process_measurement"}, {"score": 0.002258745901862197, "phrase": "model_level"}, {"score": 0.002206290313627494, "phrase": "representative_measures"}], "paper_keywords": ["software process modeling", " software measurement", " conceptual framework", " software engineering environment"], "paper_abstract": "Nowadays, organizations face with a very high competitiveness and for this reason they have to continuously improve their processes. Two key aspects to be considered in the software processes management in order to promote their improvement are their effective modeling and evaluation. The integrated management of these key aspects is not a trivial task, the huge number and diversity of elements to take into account makes it complex the management of software processes. To case and effectively support this management, in this paper we propose FMESP: a framework for the integrated management of the modeling and measurement of software processes. FMESP incorporates the conceptual and technological elements necessary to ease the integrated management of the definition and evaluation of software processes. From the measurement perspective of the framework and in order to provide the support for the software process measurement at model level a set of representative measures have been defined and validated. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "FMESP: Framework for the modeling and evaluation of software processes", "paper_id": "WOS:000242133700004"}