{"auto_keywords": [{"score": 0.03748524774994645, "phrase": "min-hop"}, {"score": 0.004715908063787721, "phrase": "different_strategies"}, {"score": 0.004250302819248558, "phrase": "peer_networks"}, {"score": 0.004162826481635768, "phrase": "especially_oriented_networks"}, {"score": 0.004119762981892093, "phrase": "limited_resources"}, {"score": 0.004055998173160551, "phrase": "wireless_mesh_networks"}, {"score": 0.003993216345115755, "phrase": "wifi_technology"}, {"score": 0.0036553070575015344, "phrase": "server_node"}, {"score": 0.0034162643819889054, "phrase": "least_number"}, {"score": 0.0031597433845085092, "phrase": "fuzzy_inference_process"}, {"score": 0.0030308784612749647, "phrase": "etx_cost"}, {"score": 0.0029224275921964724, "phrase": "fuzzy_inputs"}, {"score": 0.0026609940110902666, "phrase": "currently_more_extended_random_strategy"}, {"score": 0.002127046102734894, "phrase": "wireless_network_simulation_tool"}], "paper_keywords": ["P2P", " Wireless mesh network", " Fuzzy control", " Peer selection"], "paper_abstract": "In this paper, we study the use of various strategies for selecting the server node in Peer to Peer networks, which are especially oriented networks with limited resources such as wireless mesh networks based on WiFi technology. We examine three different strategies: Random, the currently most used one, in which the server node is randomly chosen, Min-Hop, that selects the path with the least number of hops, and Purely Fuzzy, where the selection is made from a fuzzy inference process using the number of hops and the ETX cost (Expected Transmission Count) as fuzzy inputs. We analyze two different transmission scenarios: without obstacles and with obstacles between nodes. Results show that the currently more extended random strategy is the least efficient in most of cases, Min-Hop and Purely Fuzzy have a very similar behavior in networks without obstacles, and Purely Fuzzy is clearly more efficient in networks with obstacles. The study of performance was carried out using a wireless network simulation tool for discrete event simulation OMNeT++.", "paper_title": "Peer selection in P2P wireless mesh networks: comparison of different strategies", "paper_id": "WOS:000361728200005"}