{"auto_keywords": [{"score": 0.04822029140240176, "phrase": "local-government_data"}, {"score": 0.008713768692145006, "phrase": "spatial_data_infrastructures"}, {"score": 0.0042336638794732255, "phrase": "second_generation"}, {"score": 0.004150661689086371, "phrase": "first_generation"}, {"score": 0.004069281642441942, "phrase": "nsdi"}, {"score": 0.00393066798511457, "phrase": "data_integration"}, {"score": 0.003472927015404464, "phrase": "first-generation_sdi_data-sharing_activities"}, {"score": 0.0032724821705972357, "phrase": "data_sharing"}, {"score": 0.0031297538950335233, "phrase": "sdi_programmes"}, {"score": 0.003068327486877065, "phrase": "previous_research"}, {"score": 0.003023047748772801, "phrase": "local-government_data_sharing"}, {"score": 0.0029784342137867776, "phrase": "immediate_organizational_and_practical_concerns"}, {"score": 0.0029344771385297137, "phrase": "state_or_national_policies"}, {"score": 0.0028484940955893134, "phrase": "research_findings"}, {"score": 0.002579622880371082, "phrase": "existing_governmental_activities"}, {"score": 0.0025541693207036167, "phrase": "nsdi_principles"}, {"score": 0.002454835845644037, "phrase": "surveyed_local_governments"}, {"score": 0.0022010965931147735, "phrase": "client-service-based_sdi"}, {"score": 0.0021049977753042253, "phrase": "local_government"}], "paper_keywords": ["spatial data infrastructure", " data sharing", " local government", " US"], "paper_abstract": "This paper presents a typology of local-government data sharing arrangements in the US at a time when spatial data infrastructures ( SDI) are moving into a second generation. In the first generation, the US National Spatial Data Infrastructure (NSDI) theoretically involved a pyramid of data integration resting on local-government data sharing. Availability of local-government data is the foundation for all SDI-related data sharing in this model. However, first-generation SDI data-sharing activities and principles have gained only a tenuous hold in local governments. Some formalized data sharing occurs, but only infrequently in response to SDI programmes and policies. Previous research suggests that local-government data sharing aligns with immediate organizational and practical concerns rather than state or national policies and programmes. We present research findings echoing extending these findings to show that local-government data sharing is largely informal in nature and is undertaken to support existing governmental activities. NSDI principles remain simply irrelevant for the majority of surveyed local governments. The typology we present distinguishes four distinct types of local-government data sharing arrangements that reflect institutional, political, and economic factors. The effectiveness of second generation, client-service-based SDI will be seriously constrained if the problems of local government take-up fail to be addressed.", "paper_title": "Local-government data sharing: Evaluating the foundations of spatial data infrastructures", "paper_id": "WOS:000238567200003"}