{"auto_keywords": [{"score": 0.03517083259120442, "phrase": "proposed_crnn"}, {"score": 0.010452184716679124, "phrase": "general_linear_constraints"}, {"score": 0.004529093447865156, "phrase": "attractive_alternative"}, {"score": 0.004359078118356132, "phrase": "least_square_estimation"}, {"score": 0.004068907083697369, "phrase": "cooperative_recurrent_neural_network"}, {"score": 0.004007083686875716, "phrase": "crnn"}, {"score": 0.0037402558657576124, "phrase": "proposed_crnn_model"}, {"score": 0.0035179764329354877, "phrase": "parallel_implementation"}, {"score": 0.0034118234596993836, "phrase": "special_case"}, {"score": 0.003088384809415812, "phrase": "existing_neural_networks"}, {"score": 0.0030414140732789186, "phrase": "penalty_parameters"}, {"score": 0.002690406375639144, "phrase": "exact_optimal_solution"}, {"score": 0.002629238854352447, "phrase": "additional_condition"}, {"score": 0.00254983442025512, "phrase": "conventional_numerical_algorithms"}, {"score": 0.002435190484324197, "phrase": "low_computational_complexity"}], "paper_keywords": [""], "paper_abstract": "The constrained L-1 estimation is an attractive alternative to both the unconstrained L1 estimation and the least square estimation. In this letter, we propose a cooperative recurrent neural network (CRNN) for solving L-1 estimation problems with general linear constraints. The proposed CRNN model combines four individual neural network models automatically and is suitable for parallel implementation. As a special case, the proposed CRNN includes two existing neural networks for solving unconstrained and constrained L-1 estimation problems, respectively. Unlike existing neural networks with penalty parameters, for solving the constrained L-1 estimation problem, the proposed CRNN is guaranteed to converge globally to the exact optimal solution without any additional condition. Compared with conventional numerical algorithms, the proposed CRNN has a low computational complexity and can deal with the L-1 estimation problem with degeneracy. Several applied examples show that the proposed CRNN can obtain more accurate estimates than several existing algorithms.", "paper_title": "A cooperative recurrent neural network for solving L-1 estimation problems with general linear constraints", "paper_id": "WOS:000253045800010"}