{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vector_skeletons"}, {"score": 0.03132816988308867, "phrase": "optimal_feature_sets"}, {"score": 0.004137288854115515, "phrase": "forensic_document_examiners"}, {"score": 0.00386519448487341, "phrase": "specially_developed_skeletonisation_algorithm"}, {"score": 0.0037653554368382814, "phrase": "feature_extraction"}, {"score": 0.003118486096035156, "phrase": "nine_unconstrained_handwriting"}, {"score": 0.0029131986574478072, "phrase": "wrapper_method"}, {"score": 0.002867771524071872, "phrase": "constructive_neural_network"}, {"score": 0.002750056254309311, "phrase": "genetic_algorithm"}, {"score": 0.0025824576209656676, "phrase": "structural_micro_features"}, {"score": 0.0025025186963415, "phrase": "forensic_document_analysis"}, {"score": 0.0024634797027967203, "phrase": "discriminative_power"}, {"score": 0.002206700502606511, "phrase": "vector_skeletonisation"}, {"score": 0.0021049977753042253, "phrase": "l_feature_extraction_accuracy"}], "paper_keywords": [""], "paper_abstract": "This paper presents a study of 25 structural features extracted from samples of grapheme 'th' that correspond to features commonly used by forensic document examiners. Most of the features are extracted using vector skeletons produced by a specially developed skeletonisation algorithm. The methods of feature extraction are presented along with the results. Analysis of the usefulness of the features was conducted and three categories of features were identified: indispensable, partially relevant and irrelevant for determining the authorship of gen- nine unconstrained handwriting. The division was performed based on searching the optimal feature sets using the wrapper method. A constructive neural network was used as a classifier and a genetic algorithm was used to search for optimal feature sets. It is shown that structural micro features similar to those used in forensic document analysis do possess discriminative power. The results are also compared to those obtained in our preceding study, and it is shown that use of the vector skeletonisation allows both extraction of more structural features and improvement the L feature extraction accuracy from 87% to 94%.", "paper_title": "Extraction and analysis of document examiner features from vector skeletons of grapheme 'th'", "paper_id": "WOS:000235773400018"}