{"auto_keywords": [{"score": 0.04243745322817866, "phrase": "indication-based_prescribing"}, {"score": 0.010612387000973441, "phrase": "antihypertensive_medications"}, {"score": 0.010416110136274874, "phrase": "problem_list_documentation"}, {"score": 0.009487345172829526, "phrase": "cpoe"}, {"score": 0.008738178071815424, "phrase": "multiple_indications"}, {"score": 0.006698285828500879, "phrase": "inaccurate_problems"}, {"score": 0.004778923541463994, "phrase": "computerized_order_entry"}, {"score": 0.004620093797504386, "phrase": "problem_lists"}, {"score": 0.0045855181084455444, "phrase": "electronic_medical_records"}, {"score": 0.00450020161335541, "phrase": "meaningful_use_incentive"}, {"score": 0.004366970206156021, "phrase": "prescribed_medications"}, {"score": 0.004334280585565239, "phrase": "computerized_physician_order_entry"}, {"score": 0.004127657126534723, "phrase": "excellent_target"}, {"score": 0.003743381699791, "phrase": "electronic_problem_list_additions"}, {"score": 0.0035782919812390635, "phrase": "cds"}, {"score": 0.003382017342396959, "phrase": "problem_list_additions"}, {"score": 0.0032941471167321408, "phrase": "observational_analysis"}, {"score": 0.003172551230409948, "phrase": "physicians'_selections"}, {"score": 0.0028233196851239753, "phrase": "omitted_problems"}, {"score": 0.0026483647033436674, "phrase": "somewhat_lower_accuracy"}, {"score": 0.002502995662011305, "phrase": "accurate_problem"}, {"score": 0.002330233210731173, "phrase": "potential_indications"}, {"score": 0.0021857667493036786, "phrase": "problem_list_maintenance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Clinical decision support", " CDS", " EMR", " Problem list", " CPOE", " Indication based", " Hypertension"], "paper_abstract": "Background: Maintenance of problem lists in electronic medical records is required for the meaningful use incentive and by the Joint Commission. Linking indication with prescribed medications using computerized physician order entry (CPOE) can improve problem list documentation. Prescribing of antihypertensive medications is an excellent target for interventions to improve indication-based prescribing because antihypertensive medications often have multiple indications and are frequently prescribed. Objective: To measure the accuracy and completeness of electronic problem list additions using indication-based prescribing of antihypertensives. Design: Clinical decision support (CDS) was implemented so that orders of antihypertensives prompted ordering physicians to select from problem list additions indicated by that medication. An observational analysis of 1000 alerts was performed to determine the accuracy of physicians' selections. Results: At least one accurate problem was placed 57.5% of the time. Inaccurate problems were placed 4.8% of the time. Accuracy was lower in medications with multiple indications and the likelihood of omitted problems was higher compared to medications whose only indication was hypertension. Attending physicians outperformed other clinicians. There was somewhat lower accuracy for inpatients compared to outpatients. Conclusion: CDS using indication-based prescribing of antihypertensives produced accurate problem placement roughly two-thirds of time with fewer than 5% inaccurate problems placed. Performance of alerts was sensitive to the number of potential indications of the medication and attendings vs. other clinicians prescribing. Indication-based prescribing during CPOE can be used for problem list maintenance, but requires optimization. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A trial of indication based prescribing of antihypertensive medications during computerized order entry to improve problem list documentation", "paper_id": "WOS:000324312000010"}