{"auto_keywords": [{"score": 0.02583171025442314, "phrase": "optimal_solutions"}, {"score": 0.00481495049065317, "phrase": "multiple_competitive_facilities_location"}, {"score": 0.004583579470330216, "phrase": "continuous_location_problem"}, {"score": 0.004292212137716459, "phrase": "competitive_environment"}, {"score": 0.00380511089035825, "phrase": "new_facilities"}, {"score": 0.003429001377800258, "phrase": "global_optimization_problem"}, {"score": 0.0028460640294160383, "phrase": "evolutionary_algorithm"}, {"score": 0.0027843339377323878, "phrase": "comprehensive_computational_study"}, {"score": 0.0026942333853202556, "phrase": "evolutionary_algorithms"}, {"score": 0.002592784882557155, "phrase": "best_solutions"}, {"score": 0.0022359278646792153, "phrase": "evolutionary_strategies"}], "paper_keywords": ["Evolutionary algorithm", " multimodal optimization", " multistart", " simulated annealing", " continuous location", " computational study"], "paper_abstract": "A continuous location problem in which a firm wants to set up two or more new facilities in a competitive environment is considered. Other facilities offering the same product or service already exist in the area. Both the locations and the qualities of the new facilities are to be found so as to maximize the profit obtained by the firm. This is a global optimization problem, with many local optima. In this paper we analyze several approaches to solve it, namely, three multistart local search heuristics, a multistart simulated annealing algorithm, and two variants of an evolutionary algorithm. Through a comprehensive computational study it is shown that the evolutionary algorithms are the heuristics that provide the best solutions. Furthermore, using a set of problems for which the optimal solutions are known, only the evolutionary algorithms were able to find the optimal solutions for all the instances. The evolutionary strategies presented in this paper can be easily adapted to handle other continuous location problems.", "paper_title": "Solving the Multiple Competitive Facilities Location and Design Problem on the Plane", "paper_id": "WOS:000263626200003"}