{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "member_commitment"}, {"score": 0.049604883316905664, "phrase": "virtual_communities"}, {"score": 0.004696608876994947, "phrase": "integrated_perspective"}, {"score": 0.004230382915464492, "phrase": "biggest_challenge"}, {"score": 0.004167653403322565, "phrase": "virtual_social_networks"}, {"score": 0.0039651694106206245, "phrase": "individual_factors"}, {"score": 0.0032004205378150354, "phrase": "current_members"}, {"score": 0.00299958349498286, "phrase": "structural_equation_modeling"}, {"score": 0.002544422946205545, "phrase": "online_community_literature"}, {"score": 0.0025066304722422463, "phrase": "critical_antecedent_factors"}, {"score": 0.002444883254621769, "phrase": "community_commitment_behavior"}, {"score": 0.0023727863021828547, "phrase": "issue_involvement"}, {"score": 0.0023143284925318916, "phrase": "social_interaction"}, {"score": 0.002136747803494932, "phrase": "online_community_administrators"}, {"score": 0.0021049977753042253, "phrase": "community_positioning"}], "paper_keywords": ["Community networks", " Customer retention", " Facilitators", " Human-computer interaction", " Social networking sites", " User behaviour", " User studies", " Virtual worlds", " Communities"], "paper_abstract": "Purpose - Although the number of virtual communities has increased dramatically over the past few years, attracting and maintaining members remains the biggest challenge to establishing virtual social networks. This study seeks to integrate the roles of individual factors (issue involvement), social factors (social interaction), and system factors (system interactivity), and to explore how these factors contribute to member commitment in virtual communities. Design/methodology/approach - A total of 402 undergraduate students, who are all current members of virtual communities, participated in this study. Data were analyzed using structural equation modeling (SEM). Findings - The findings reveal that member commitment to communities was influenced more by their issue involvement compared to their perceived social interaction or perceived system interactivity. Originality/value - This research contributes to online community literature by integrating critical antecedent factors in the field of community commitment behavior. The findings indicate that issue involvement is more important than social interaction and system interactivity for influencing member commitment to communities. Additionally, the findings suggest that online community administrators should consider community positioning and topic selecting programs when attempting to influence users to commit to communities.", "paper_title": "Investigating member commitment to virtual communities using an integrated perspective", "paper_id": "WOS:000303299600004"}