{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "co-linked_business_web_sites"}, {"score": 0.02926699878278517, "phrase": "related_businesses"}, {"score": 0.0046776367107079315, "phrase": "purpose_-_the_purpose"}, {"score": 0.004414593685834931, "phrase": "business_web_sites"}, {"score": 0.00413960431690257, "phrase": "yahoo"}, {"score": 0.0038443132503234428, "phrase": "content_analysis"}, {"score": 0.0035357399513289904, "phrase": "web_site"}, {"score": 0.0032623406075681315, "phrase": "connected_pairs"}, {"score": 0.0032414013828487727, "phrase": "highly_related_businesses"}, {"score": 0.0030294669203999565, "phrase": "non-business_reasons"}, {"score": 0.0029810774705309536, "phrase": "co-linked_sites"}, {"score": 0.002952414496287241, "phrase": "loose_or_marginal_business_relationship"}, {"score": 0.0028680638354014183, "phrase": "home_pages"}, {"score": 0.002697799358876857, "phrase": "commercial_sites"}, {"score": 0.002629160426591144, "phrase": "educational_sites"}, {"score": 0.002529454236169383, "phrase": "content_analysis_study"}, {"score": 0.0024970641749396784, "phrase": "previous_quantitative_studies"}, {"score": 0.002356353539621074, "phrase": "web_data_mining"}, {"score": 0.002296381861149051, "phrase": "link_motivations"}, {"score": 0.0021049977753042253, "phrase": "co-link_data_collection"}], "paper_keywords": ["worldwide web", " content management", " business environment"], "paper_abstract": "Purpose - The purpose of this article is to examine the reasons for the creation of co-links between pairs of business web sites. Specifically, to determine whether co-linked business web sites are really related. Design/methodology/approach - Co-links to 32 telecommunications companies were retrieved using Yahoo! and a random sample of 495 co-linking pages (the page that initiated the co-link) were selected for a content analysis. The context of the co-link and the content of the co-linking page were manually examined to record the following data: type of web site and the reason for the creation of the co-link. Findings - The study found that 61.4 per cent of co-links were created to connected pairs of highly related businesses (related companies, related products, and related services). Only 14.7 per cent of co-links were created for non-business reasons. The remaining 23.8 per cent of co-linked sites showed a loose or marginal business relationship. The study also found that co-links targeting home pages (as opposed to non-homepages) were more likely to connect related businesses. Furthermore, co-links coming from commercial sites (as opposed to other sites such as educational sites) are more likely to link related businesses. Originality/value - The findings from this content analysis study confirm results from previous quantitative studies that showed that web co-links measure relatedness of co-linked sites and that co-links can be objects of web data mining. The study contributes to our understanding of link motivations and the web linking phenomenon in general. The difference between links to homepages and that to non-homepages found in the study can guide us in co-link data collection.", "paper_title": "Are co-linked business web sites really related ? A link classification study", "paper_id": "WOS:000249328100003"}