{"auto_keywords": [{"score": 0.04071321179847176, "phrase": "symbolic_steps"}, {"score": 0.012483482404829277, "phrase": "previous_known_algorithm"}, {"score": 0.008539906220524496, "phrase": "buchi_objectives"}, {"score": 0.006309478506352859, "phrase": "mdp."}, {"score": 0.00481495049065317, "phrase": "qualitative_analysis"}, {"score": 0.004782920863973593, "phrase": "markov"}, {"score": 0.004655285779819366, "phrase": "markov_decision"}, {"score": 0.004410713064804144, "phrase": "almost-sure_winning_states"}, {"score": 0.0040951809276235495, "phrase": "first_subquadratic_symbolic_algorithm"}, {"score": 0.0034243271052114234, "phrase": "constant_out-degree"}, {"score": 0.003136471009987959, "phrase": "new_algorithm"}, {"score": 0.0027961342030212353, "phrase": "previous_algorithms"}, {"score": 0.0026151382801601034, "phrase": "k"}, {"score": 0.0025870463897472943, "phrase": "maximal_number"}, {"score": 0.002552309172078995, "phrase": "strongly_connected_components"}, {"score": 0.0024758420717852113, "phrase": "win-lose_algorithm"}, {"score": 0.002353441996629643, "phrase": "symbolic_scc_computation"}, {"score": 0.0023139986108451946, "phrase": "linear_symbolic_steps"}, {"score": 0.0022370795358896784, "phrase": "linear_number"}, {"score": 0.0021921581733031514, "phrase": "worst_case"}], "paper_keywords": ["Markov decision processes", " Probabilistic verification", " Buchi objectives", " Symbolic algorithms"], "paper_abstract": "We consider Markov decision processes (MDPs) with Buchi (liveness) objectives. We consider the problem of computing the set of almost-sure winning states from where the objective can be ensured with probability 1. Our contributions are as follows: First, we present the first subquadratic symbolic algorithm to compute the almost-sure winning set for MDPs with Buchi objectives; our algorithm takes symbolic steps as compared to the previous known algorithm that takes O(n (2)) symbolic steps, where n is the number of states and m is the number of edges of the MDP. In practice MDPs have constant out-degree, and then our symbolic algorithm takes symbolic steps, as compared to the previous known O(n (2)) symbolic steps algorithm. Second, we present a new algorithm, namely win-lose algorithm, with the following two properties: (a) the algorithm iteratively computes subsets of the almost-sure winning set and its complement, as compared to all previous algorithms that discover the almost-sure winning set upon termination; and (b) requires symbolic steps, where K is the maximal number of edges of strongly connected components (scc's) of the MDP. The win-lose algorithm requires symbolic computation of scc's. Third, we improve the algorithm for symbolic scc computation; the previous known algorithm takes linear symbolic steps, and our new algorithm improves the constants associated with the linear number of steps. In the worst case the previous known algorithm takes 5a <...n symbolic steps, whereas our new algorithm takes 4a <...n symbolic steps.", "paper_title": "Symbolic algorithms for qualitative analysis of Markov decision processes with Buchi objectives", "paper_id": "WOS:000319151400003"}