{"auto_keywords": [{"score": 0.03301702102989929, "phrase": "scatter_approach"}, {"score": 0.00481495049065317, "phrase": "efficient_scatter-based_kernel_superposition"}, {"score": 0.0047689174754929195, "phrase": "gpu._kernel"}, {"score": 0.004545240514015278, "phrase": "spatially_varying_kernel"}, {"score": 0.00433200902751133, "phrase": "medical_imaging"}, {"score": 0.004011366422179016, "phrase": "mathematical_simplifications"}, {"score": 0.003953932197201054, "phrase": "true_convolutions"}, {"score": 0.0034558655164987134, "phrase": "real-life_applications"}, {"score": 0.0032463805170627686, "phrase": "gather_approach"}, {"score": 0.002948547333717581, "phrase": "kernel_sizes"}, {"score": 0.002166711569953301, "phrase": "higher_dimensionality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Kernel superposition", " Variable kernel convolution", " Spatially varying", " Point spread function", " Scatter", " GPU"], "paper_abstract": "Kernel superposition, where an image is convolved with a spatially varying kernel, is commonly used in optics, astronomy, medical imaging and radiotherapy. This operation is computationally expensive and generally cannot benefit from the mathematical simplifications available for true convolutions. We systematically evaluated the performance of a number of implementations of a 2D Gaussian kernel superposition on several graphics processing units of two recent architectures. The 2D Gaussian kernel was used because of its importance in real-life applications and representativeness of expensive-to-evaluate, separable kernels. The implementations were based both on the gather approach found in the literature and on the scatter approach presented here. Our results show that, over a range of kernel sizes, the scatter approach delivers speedups of 2.1-14.5 or 1.3-4.9 times, depending on the architecture. These numbers were further improved to 4.8-28.5 and 3.7-16.8 times, respectively, when only \"exact\" implementations were compared. Speedups similar to those presented are expected for other separable kernels and, we argue, will also remain applicable for problems of higher dimensionality. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Efficient scatter-based kernel superposition on GPU", "paper_id": "WOS:000360777800002"}