{"auto_keywords": [{"score": 0.0391397034121065, "phrase": "single_local_image_feature"}, {"score": 0.00481495049065317, "phrase": "-many_feature"}, {"score": 0.004757366891541805, "phrase": "object_recognition"}, {"score": 0.004607139608615063, "phrase": "mainstream_object_categorisation_community"}, {"score": 0.004533806239310673, "phrase": "object_representations"}, {"score": 0.0044795698035664695, "phrase": "local_image_features"}, {"score": 0.004035777314816881, "phrase": "one-to-one_correspondence"}, {"score": 0.0033822643082593285, "phrase": "single_feature"}, {"score": 0.0033417571465258, "phrase": "coarser_scale"}, {"score": 0.00328849874768242, "phrase": "second_image"}, {"score": 0.0032491108935498794, "phrase": "effective_object_categorisation"}, {"score": 0.0028229071631385634, "phrase": "many-to-many_graph"}, {"score": 0.0027667539384678814, "phrase": "different_way"}, {"score": 0.0026471070725516467, "phrase": "shape_class_prototype"}, {"score": 0.0025944417620244924, "phrase": "class_exemplars"}, {"score": 0.0023653276631862958, "phrase": "higher_levels"}, {"score": 0.0022358683283304533, "phrase": "abstract_shape"}, {"score": 0.0021391300942881, "phrase": "geometric_spaces"}, {"score": 0.0021049977753042253, "phrase": "many-to-many_graph-matching_problem"}], "paper_keywords": [""], "paper_abstract": "The mainstream object categorisation community relies heavily on object representations consisting of local image features, due to their ease of recovery and their attractive invariance properties. Object categorisation is therefore formulated as finding, that is, 'detecting', a one-to-one correspondence between image and model features. This assumption breaks down for categories in which two exemplars may not share a single local image feature. Even when objects are represented as more abstract image features, a collection of features at one scale (in one image) may correspond to a single feature at a coarser scale (in the second image). Effective object categorisation therefore requires the ability to match features many-to-many. In this paper, we review our progress on three independent object categorisation problems, each formulated as a graph matching problem and each solving the many-to-many graph matching problem in a different way. First, we explore the problem of learning a shape class prototype from a set of class exemplars which may not share a single local image feature. Next, we explore the problem of matching two graphs in which correspondence exists only at higher levels of abstraction, and describe a low-dimensional, spectral encoding of graph structure that captures the abstract shape of a graph. Finally, we embed graphs into geometric spaces, reducing the many-to-many graph-matching problem to a weighted point matching problem, for which efficient many-to-many matching algorithms exist.", "paper_title": "Many-to-many feature matching in object recognition: a review of three approaches", "paper_id": "WOS:000318228200002"}