{"auto_keywords": [{"score": 0.04962913836247387, "phrase": "numerical_optimization"}, {"score": 0.04274518365190484, "phrase": "specific_problem"}, {"score": 0.00481495049065317, "phrase": "adaptive_strategies"}, {"score": 0.004724878518219719, "phrase": "differential_evolution"}, {"score": 0.004178935413340453, "phrase": "best_mutation_strategy"}, {"score": 0.003678414118674967, "phrase": "improved_de"}, {"score": 0.003299460925313939, "phrase": "different_parameter_adaptation_methods"}, {"score": 0.0031920445513574907, "phrase": "different_strategies"}, {"score": 0.002973477198728592, "phrase": "jade"}, {"score": 0.0029039692582303904, "phrase": "recently_proposed_de_variant"}, {"score": 0.002836096284133166, "phrase": "twenty_widely_used_scalable_benchmark_problems"}, {"score": 0.0027307746993761035, "phrase": "test_suit"}, {"score": 0.002705059527911504, "phrase": "experimental_results"}, {"score": 0.002259883463607508, "phrase": "final_solutions"}, {"score": 0.0022280223816618736, "phrase": "convergence_rate"}, {"score": 0.002155412043665635, "phrase": "powerful_capability"}], "paper_keywords": ["Differential evolution (DE)", " numerical optimization", " parameter adaptation", " real-world problems", " strategy adaptation"], "paper_abstract": "Differential evolution (DE) is a simple, yet efficient, evolutionary algorithm for global numerical optimization, which has been widely used in many areas. However, the choice of the best mutation strategy is difficult for a specific problem. To alleviate this drawback and enhance the performance of DE, in this paper, we present a family of improved DE that attempts to adaptively choose a more suitable strategy for a problem at hand. In addition, in our proposed strategy adaptation mechanism (SaM), different parameter adaptation methods of DE can be used for different strategies. In order to test the efficiency of our approach, we combine our proposed SaM with JADE, which is a recently proposed DE variant, for numerical optimization. Twenty widely used scalable benchmark problems are chosen from the literature as the test suit. Experimental results verify our expectation that the SaM is able to adaptively determine a more suitable strategy for a specific problem. Compared with other state-of-the-art DE variants, our approach performs better, or at least comparably, in terms of the quality of the final solutions and the convergence rate. Finally, we validate the powerful capability of our approach by solving two real-world optimization problems.", "paper_title": "Enhanced Differential Evolution With Adaptive Strategies for Numerical Optimization", "paper_id": "WOS:000288454300007"}