{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "common_due_date"}, {"score": 0.042074474479433875, "phrase": "old_jobs"}, {"score": 0.04018921998628563, "phrase": "new_jobs"}, {"score": 0.004752873752686246, "phrase": "constrained_flowshop"}, {"score": 0.00469159356595623, "phrase": "variable_neighbourhood_search_approach"}, {"score": 0.004531997388646422, "phrase": "due_date"}, {"score": 0.004435006247087171, "phrase": "flowshop_layout"}, {"score": 0.0035564156572789473, "phrase": "rescheduling_problem"}, {"score": 0.003332704619499476, "phrase": "tightest_possible_due_date"}, {"score": 0.00319141242685261, "phrase": "maximum_tardiness"}, {"score": 0.002990592465417758, "phrase": "interesting_scheduling_problem"}, {"score": 0.002387083859537412, "phrase": "new_heuristic"}, {"score": 0.0023562342764987254, "phrase": "variable_neighbourhood_search"}, {"score": 0.002266051712795851, "phrase": "computational_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Metaheuristics", " Flowshop", " Common due date", " Due date setting"], "paper_abstract": "In this paper we study a due date setting problem in a flowshop layout. The problem consists of scheduling a set of jobs arriving to the system together with jobs already present (denoted as old jobs), in order to set a common due date for the new jobs. Since the old jobs have a common due date that must not be violated, our problem is a rescheduling problem with the objective of minimising the makespan of the new jobs (thus obtaining the tightest possible due date for the new jobs) and a constraint since the maximum tardiness of the old jobs must be equal to zero. This approach leads to an interesting scheduling problem in which two different objectives are considered, each one for a subset of the jobs that must be scheduled. To the best of our knowledge, this type of problems have been scarcely considered in the literature, and only for very specific purposes. Since our problem is clearly NP-hard, a new heuristic based on variable neighbourhood search (VNS) has been designed. The computational results show that our proposed heuristic outperforms two existing heuristic methods for similar problems in the literature. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Setting a common due date in a constrained flowshop: A variable neighbourhood search approach", "paper_id": "WOS:000276185100007"}