{"auto_keywords": [{"score": 0.034363394393867576, "phrase": "velocity_control_technique"}, {"score": 0.00481495049065317, "phrase": "velocity_control_techniques"}, {"score": 0.004776669953449352, "phrase": "immersive_virtual_environments"}, {"score": 0.004663636232080366, "phrase": "existing_velocity_control_techniques"}, {"score": 0.004203803478570494, "phrase": "five_known_velocity_control_techniques"}, {"score": 0.003959353513286997, "phrase": "good_travel_technique"}, {"score": 0.003456427643307907, "phrase": "better_recollection"}, {"score": 0.0033077610063168093, "phrase": "twenty_users"}, {"score": 0.0032036590920314725, "phrase": "virtual_corridors"}, {"score": 0.0031654684543975077, "phrase": "information-gathering_tasks"}, {"score": 0.002910545717767559, "phrase": "users'_ability"}, {"score": 0.0025918235228843444, "phrase": "virtual_walls"}, {"score": 0.0022352169832099153, "phrase": "travel_techniques"}, {"score": 0.0021734768728417977, "phrase": "users'_performances"}], "paper_keywords": ["Virtual reality", " 3D interaction", " Velocity control technqiues"], "paper_abstract": "While many of the existing velocity control techniques are well designed, the techniques are often application-specific, making it difficult to compare their effectiveness. In this paper, we evaluate five known velocity control techniques using the same experimental settings. We compare the techniques based on the assumption that a good travel technique should be easy to learn and easy to use, should cause the user to have few collisions with the VE, should allow the user to complete tasks faster, and should promote better recollection of the environment afterwards. In our experiments, we ask twenty users to use each velocity control technique to navigate through virtual corridors while performing information-gathering tasks. In all cases, the users use pointing to indicate the direction of travel. We then measure the users' ability to recollect the information they see in the VE, as well as how much time they spend in the VE and how often they collide with the virtual walls. After each test, we use questionnaires to evaluate the ease of learning and ease of use of the velocity control technique, and the users' sense of presence in the environment. Each of the travel techniques is then evaluated based on the users' performances in the VE and the results of their questionnaires.", "paper_title": "User experimentation: an evaluation of velocity control techniques in immersive virtual environments", "paper_id": "WOS:000208104100006"}