{"auto_keywords": [{"score": 0.0459151544989095, "phrase": "koike-akino_et_al"}, {"score": 0.04528864506241519, "phrase": "network_coding_map"}, {"score": 0.01282655638716286, "phrase": "exclusive_law"}, {"score": 0.012291082904614595, "phrase": "network_coding_maps"}, {"score": 0.011611322431478803, "phrase": "singular_fade_states"}, {"score": 0.00481495049065317, "phrase": "wireless_network-coded_bidirectional_relaying_using_latin_squares"}, {"score": 0.0047920120174595555, "phrase": "m-psk_modulation"}, {"score": 0.00473514052306018, "phrase": "modulation_schemes"}, {"score": 0.0047013405841819025, "phrase": "physical_layer_network-coded_two-way_relaying_scenario"}, {"score": 0.004252602474733162, "phrase": "channel_conditions"}, {"score": 0.003874208690248324, "phrase": "latin_square"}, {"score": 0.003702206069379459, "phrase": "channel_fade_states"}, {"score": 0.0036669760226536977, "phrase": "minimum_distance"}, {"score": 0.003640772864312978, "phrase": "effective_constellation"}, {"score": 0.003246019443995452, "phrase": "harmful_effects"}, {"score": 0.0031391359313176974, "phrase": "latin_squares"}, {"score": 0.0030285084113651035, "phrase": "small_set"}, {"score": 0.0028255311595541868, "phrase": "open_problem"}, {"score": 0.0027455623011503217, "phrase": "explicit_construction_procedures"}, {"score": 0.002661474607275484, "phrase": "possible_channel_realizations"}, {"score": 0.002598543802992702, "phrase": "finite_number"}, {"score": 0.0025614999929672, "phrase": "specific_network_coding_map"}, {"score": 0.002537097217899195, "phrase": "particular_region"}, {"score": 0.002494949035510408, "phrase": "complex_plane"}, {"score": 0.0022294857939412073, "phrase": "computer_search"}, {"score": 0.002171542198410875, "phrase": "simulation_results"}, {"score": 0.0021508464435431385, "phrase": "proposed_scheme"}, {"score": 0.0021252533072727707, "phrase": "conventional_exclusive-or"}, {"score": 0.0021049977753042253, "phrase": "network_coding"}], "paper_keywords": ["Latin squares", " physical layer network coding", " wireless bidirectional relaying"], "paper_abstract": "The design of modulation schemes for the physical layer network-coded two-way relaying scenario is considered with a protocol which employs two phases: multiple access (MA) phase and broadcast (BC) phase. It was observed by Koike-Akino et al. that adaptively changing the network coding map used at the relay according to the channel conditions greatly reduces the impact of MA interference which occurs at the relay during the MA phase and all these network coding maps should satisfy a requirement called the exclusive law. We show that every network coding map that satisfies the exclusive law is representable by a Latin Square and conversely, that this relationship can be used to get the network coding maps satisfying the exclusive law. The channel fade states for which the minimum distance of the effective constellation at the relay become zero are referred to as the singular fade states. For M - PSK modulation (M any power of 2), it is shown that there are (M-2/4 - M/2 + 1) M singular fade states. Also, it is shown that the constraints which the network coding maps should satisfy so that the harmful effects of the singular fade states are removed, can be viewed equivalently as partially filled Latin Squares (PFLS). The problem of finding all the required maps is reduced to finding a small set of maps for M - PSK constellations (any power of 2), obtained by the completion of PFLS. Even though the completability of M x M PFLS using M symbols is an open problem, specific cases where such a completion is always possible are identified and explicit construction procedures are provided. Having obtained the network coding maps, the set of all possible channel realizations (the complex plane) is quantized into a finite number of regions, with a specific network coding map chosen in a particular region. It is shown that the complex plane can be partitioned into two regions: a region in which any network coding map which satisfies the exclusive law gives the same best performance and a region in which the choice of the network coding map affects the performance. The quantization thus obtained analytically, leads to the same as the one obtained using computer search for M = 4-PSK signal set by Koike-Akino et al., when specialized for Simulation results show that the proposed scheme performs better than the conventional exclusive-OR (XOR) network coding and in some cases outperforms the scheme proposed by Koike-Akino et al.", "paper_title": "Wireless Network-Coded Bidirectional Relaying Using Latin Squares for M-PSK Modulation", "paper_id": "WOS:000324573500035"}