{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_sharing"}, {"score": 0.006170485943372794, "phrase": "china"}, {"score": 0.004635187955017185, "phrase": "xi'an"}, {"score": 0.004437910956996051, "phrase": "quantitative_relationship"}, {"score": 0.004272164161788242, "phrase": "contextual_factors"}, {"score": 0.0037493114715625784, "phrase": "multi-dimensional_characteristics"}, {"score": 0.0036288825833675127, "phrase": "six_measures"}, {"score": 0.003272375502853897, "phrase": "model_framework"}, {"score": 0.003266430801935962, "phrase": "empirical_results"}, {"score": 0.003167217223469026, "phrase": "significant_influences"}, {"score": 0.0029029754274913803, "phrase": "corresponding_propositions"}, {"score": 0.002855934865505357, "phrase": "sharing-contingent_variables"}, {"score": 0.0027641218567092665, "phrase": "quantitative_formulation"}, {"score": 0.0023602032679095955, "phrase": "knowledge_sharing-performance_relationship"}, {"score": 0.0021049977753042253, "phrase": "contingent_factors"}], "paper_keywords": ["knowledge sharing", " performance", " contingent factors", " survey"], "paper_abstract": "This paper explores the quantitative relationship between knowledge sharing and performance, with contextual factors in consideration. First, we argue that both knowledge sharing and its contextual factors should be associated with performance. Then, we analyze the multi-dimensional characteristics of knowledge sharing and propose six measures for it. Next, we model the relationship between knowledge sharing and performance, integrating various contingent factors with the model framework, some of which have significant influences on the relationship between knowledge sharing and performance. After that, we propose four alternative models and corresponding propositions for knowledge sharing-contingent variables relationship, and present a quantitative formulation of the relationship between knowledge sharing and performance. Finally, we conduct a survey of 249 organizations in Van, China, and show the empirical results. Our propositions about the knowledge sharing-performance relationship and contingent factors are supported by the survey. The empirical results suggest that managers have to pay attention to some contingent factors while they commit to knowledge sharing. This study adds to the understanding of the effects of knowledge sharing on performance, and gives implications to the practice of knowledge sharing. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Relationship between knowledge sharing and performance: A survey in Xi'an, China", "paper_id": "WOS:000242836900004"}