{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "eye_strain"}, {"score": 0.016854649471848837, "phrase": "stereoscopic_vision"}, {"score": 0.004757227624616643, "phrase": "stereoscopic_displays"}, {"score": 0.004700193486903964, "phrase": "stereoscopic_devices"}, {"score": 0.003945754887845885, "phrase": "immersion_techniques"}, {"score": 0.00306189690236109, "phrase": "high_frequency_content"}, {"score": 0.0030069062905274976, "phrase": "large_disparities"}, {"score": 0.002830617996609902, "phrase": "irritating_high_frequencies"}, {"score": 0.002796616969627065, "phrase": "high_horizontal_disparity_zones"}, {"score": 0.0027133856739937133, "phrase": "virtual_objects"}, {"score": 0.0026326249204932733, "phrase": "real_screen_level"}, {"score": 0.0022361964497681934, "phrase": "positive_effects"}], "paper_keywords": ["Human Factors", " Blur", " visual fatigue", " tracked point of view", " virtual reality", " stereoscopy"], "paper_abstract": "Stereoscopic devices are widely used (immersion-based working environments, stereoscopically-viewed movies, auto-stereoscopic screens). In some instances, exposure to stereoscopic immersion techniques can be lengthy, and so eye strain sets in. We propose a method for reducing eye strain induced by stereoscopic vision. After reviewing sources of eye strain linked to stereoscopic vision, we focus on one of these sources: images with high frequency content associated with large disparities. We put forward an algorithm for removing the irritating high frequencies in high horizontal disparity zones (i.e., for virtual objects appearing far from the real screen level). We elaborate on our testing protocol to establish that our image processing method reduces eye strain caused by stereoscopic vision, both objectively and subjectively. We subsequently quantify the positive effects of our algorithm on the relief of eye strain and discuss further research perspectives.", "paper_title": "Real-Time Adaptive Blur for Reducing Eye Strain in Stereoscopic Displays", "paper_id": "WOS:000305325800004"}