{"auto_keywords": [{"score": 0.030424249019695215, "phrase": "interpolated_h-index"}, {"score": 0.015719716506582538, "phrase": "fractional_counting"}, {"score": 0.014784883322560505, "phrase": "h-index_framework"}, {"score": 0.0136930460399185, "phrase": "standard_h-index"}, {"score": 0.0039772848945723435, "phrase": "natural_number"}, {"score": 0.0038959121068990517, "phrase": "rather_coarse_indicator"}, {"score": 0.0037381083634085424, "phrase": "relatively_small_number"}, {"score": 0.0030083825666563898, "phrase": "earlier_publications"}, {"score": 0.0029620573986902416, "phrase": "first_two_problems"}, {"score": 0.0028127163745564777, "phrase": "pseudo_h-index"}, {"score": 0.002740885774408238, "phrase": "new_proposal"}, {"score": 0.002684740763324991, "phrase": "third_problem"}, {"score": 0.0024333239726872604, "phrase": "real-world_example"}, {"score": 0.0022168460543913787, "phrase": "fatal_flaws"}], "paper_keywords": ["Citation analysis", " Bibliometrics", " Fractional counting", " h-index", " Interpolated h-index", " Rational h-index"], "paper_abstract": "Purpose The purpose of this paper is to extend the h-index framework to the case that articles are counted fractionally. Design/methodology/approach Three restrictions related to the standard h-index are explained: as the standard h-index is a natural number it is a rather coarse indicator; if a scientist has published a relatively small number of publications then the h-index is completely determined by the number of publications; the standard h-index cannot be applied if publications are counted fractionally, or when magnitude values smaller than one occur. Findings We recall solutions we proposed in earlier publications regarding the first two problems (the use of the interpolated h-index and of the pseudo h-index) and add a new proposal to solve the third problem. The relation between the recently introduced window/field-normalized h-type index (hwf-index) and the interpolated h-index is described. A real-world example proves the feasibility of this proposal. Research limitations/implications Colleagues have shown that the h-index and its variations have fatal flaws and hence should never be used. Yet, not everyone agrees with this opinion. Originality/value Assuming that the h-index still has some value, this paper introduces a refinement of the interpolated h-index, called the generalized interpolated h-index. In this way the h-index framework is extended to incorporate, for instance, the case that fractional counting for publications and citations is applied.", "paper_title": "A note on the interpolated or real-valued h-index with a generalization for fractional counting", "paper_id": "WOS:000334967100001"}