{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "full_conditional_probabilities"}, {"score": 0.004520643802955724, "phrase": "bayesian"}, {"score": 0.004470177647909885, "phrase": "bayesian_networks"}, {"score": 0.004053362743156545, "phrase": "conditional_probabilities"}, {"score": 0.004007083686875716, "phrase": "primary_objects"}, {"score": 0.0034512514926836667, "phrase": "artificial_intelligence"}, {"score": 0.003166259444961177, "phrase": "existing_concepts"}, {"score": 0.0029214769181390653, "phrase": "layer_independence"}, {"score": 0.0026955672787561716, "phrase": "first_concept"}, {"score": 0.002574387911697005, "phrase": "graphoid_properties"}, {"score": 0.002402812984584538, "phrase": "contraction"}, {"score": 0.0021789194955896102, "phrase": "brief_discussion"}], "paper_keywords": ["Full conditional probabilities", " Coherent probabilities", " Independence concepts", " Graphoid properties", " Bayesian networks"], "paper_abstract": "This paper examines concepts of independence for full conditional probabilities; that is, for set-functions that encode conditional probabilities as primary objects, and that allow conditioning on events of probability zero. Full conditional probabilities have been used in economics, in philosophy, in statistics, in artificial intelligence. This paper characterizes the structure of full conditional probabilities under various concepts of independence; limitations of existing concepts are examined with respect to the theory of Bayesian networks. The concept of layer independence (factorization across layers) is introduced; this seems to be the first concept of independence for full conditional probabilities that satisfies the graphoid properties of Symmetry, Redundancy, Decomposition, Weak Union, and Contraction. A theory of Bayesian networks is proposed where full conditional probabilities are encoded using infinitesimals, with a brief discussion of hyperreal full conditional probabilities. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Independence for full conditional probabilities: Structure, factorization, non-uniqueness, and Bayesian networks", "paper_id": "WOS:000326426200001"}