{"auto_keywords": [{"score": 0.05007843022623741, "phrase": "mathematical_expression_recognition_systems"}, {"score": 0.04419846536070136, "phrase": "mathml"}, {"score": 0.00456020621016909, "phrase": "proposed_method"}, {"score": 0.0038948525410795517, "phrase": "mathml_representation"}, {"score": 0.003831801113154043, "phrase": "tree_structure"}, {"score": 0.0036288825833675127, "phrase": "tree-matching_problem"}, {"score": 0.003236941658990869, "phrase": "corresponding_euler_strings"}, {"score": 0.0025472634689904772, "phrase": "performance_measure"}, {"score": 0.0024386325347607674, "phrase": "proposed_algorithm"}, {"score": 0.00230932021677234, "phrase": "output_mathml_file"}, {"score": 0.0022472527731744974, "phrase": "proposed_evaluation_method"}, {"score": 0.00217496508306238, "phrase": "groundtruthed_expressions"}, {"score": 0.0021049977753042253, "phrase": "expression_recognition_system"}], "paper_keywords": ["OCR", " Mathematical expressions", " Performance evaluation", " Tree matching", " Euler strings"], "paper_abstract": "Performance evaluation of mathematical expression recognition systems is attempted. The proposed method assumes expressions (input as well as recognition output) are coded following MathML or TEX/LaTEX (which also gets converted into MathML) format. Since any MathML representation follows a tree structure, evaluation of performance has been modeled as a tree-matching problem. The tree corresponding to the expression generated by the recognizer is compared with the groundtruthed one by comparing the corresponding Euler strings. The changes required to convert the tree corresponding to the expression generated by the recognizer into the groundtruthed one are noted. The number of changes required to make such a conversion is basically the distance between the trees. This distance gives the performance measure for the system under testing. The proposed algorithm also pinpoints the positions of the changes in the output MathML file. Testing of the proposed evaluation method considers a set of example groundtruthed expressions and their corresponding recognized results produced by an expression recognition system.", "paper_title": "EMERS: a tree matching-based performance evaluation of mathematical expression recognition systems", "paper_id": "WOS:000287757000009"}