{"auto_keywords": [{"score": 0.04347375766938499, "phrase": "new_visuomotor_gain"}, {"score": 0.023067551920634637, "phrase": "wrist_rotations"}, {"score": 0.022751265472919377, "phrase": "continuous_visual_feedback"}, {"score": 0.008335967529108076, "phrase": "visual_feedback"}, {"score": 0.007347841270446589, "phrase": "second_experiment"}, {"score": 0.005549009161604848, "phrase": "internal_model"}, {"score": 0.00481495049065317, "phrase": "new_visuomotor_mappings"}, {"score": 0.004551563730037998, "phrase": "visually_guided_reaching_movements"}, {"score": 0.004363480951473701, "phrase": "motor_control"}, {"score": 0.004332894955218135, "phrase": "wrist_rotation"}, {"score": 0.004183137595671171, "phrase": "wrist_motor_control"}, {"score": 0.0039264465913491356, "phrase": "virtual_teapot"}, {"score": 0.003885216927966404, "phrase": "force_feedback_robot_arm"}, {"score": 0.003633927813203731, "phrase": "motor_system"}, {"score": 0.0035705347414368696, "phrase": "imposed_visuomotor_gain"}, {"score": 0.0035206146304891973, "phrase": "first_experiment"}, {"score": 0.003410822685334396, "phrase": "learning_phase"}, {"score": 0.0032697235411641695, "phrase": "different_design"}, {"score": 0.0031677308747058187, "phrase": "visual_teapot"}, {"score": 0.0029109914689364465, "phrase": "earlier_work"}, {"score": 0.0028201570908224166, "phrase": "robotic_arm_manipulations"}, {"score": 0.0027225413530200505, "phrase": "movement_duration"}, {"score": 0.0026655969705316708, "phrase": "novel_visuomotor_gains"}, {"score": 0.002227125088932002, "phrase": "clear_adaptation"}, {"score": 0.0021049977753042253, "phrase": "wrist_axis"}], "paper_keywords": [""], "paper_abstract": "Mechanisms involved in the production of visually guided reaching movements have been extensively investigated, but little is known on the motor control of wrist rotation. In two independent experiments, we examined the adaptation of wrist motor control to new visuomotor gain in rotation in a task where subjects were asked to adjust the orientation of a virtual teapot using a force feedback robot arm without time constraints. We manipulated the visual feedback to assess how feedback affects the mechanisms employed by the motor system to compensate for the imposed visuomotor gain. In the first experiment, continuous visual feedback was provided to subjects during the learning phase with the new visuomotor gain. In a second experiment, which used a different design, only terminal feedback was provided, also as a visual teapot. We tested whether adaptation to yaw (flexion/extension) wrist rotations could transfer to pitch (ulnar/radial) rotations, as suggested by earlier work. We showed that in conditions close to robotic arm manipulations by teleoperators (when continuous visual feedback is available and the movement duration is not limited), novel visuomotor gains of wrist rotations are spontaneously taken into account without the need for adaptation. Nevertheless, an internal model of the new visuomotor gain was constructed in parallel, since limited, but significant, aftereffects were observed. For the second experiment, for which visual feedback was only provided after the manipulation, a clear adaptation with an internal model updating to new visuomotor gain was observed. This adaptation was transferrable to another wrist axis. However, after the transfer of the adaptation, subjects spontaneously and rapidly returned to a gain of 1.", "paper_title": "New Visuomotor Mappings of Wrist Rotations Are Ignored if Continuous Visual Feedback Is Available", "paper_id": "WOS:000335505300003"}