{"auto_keywords": [{"score": 0.014559863694812799, "phrase": "electrical_machines"}, {"score": 0.011395027825289356, "phrase": "eddy-current_model"}, {"score": 0.00481495049065317, "phrase": "laminated_non-linear_magnetic_circuits"}, {"score": 0.004139028737420222, "phrase": "rotating-field_problems"}, {"score": 0.003989046949801574, "phrase": "magnetic_field"}, {"score": 0.00395970654908854, "phrase": "explicit_coupling_terms"}, {"score": 0.00388729255686046, "phrase": "jacobean_matrix"}, {"score": 0.003816197777388722, "phrase": "time_efficiency"}, {"score": 0.0033288399506044763, "phrase": "coupling_terms"}, {"score": 0.003304339421246321, "phrase": "fast_and_robust_convergence"}, {"score": 0.0026277995163948263, "phrase": "overall_procedure"}, {"score": 0.0024677487011556427, "phrase": "practical_value"}, {"score": 0.0023088708688076666, "phrase": "eddy-current_losses"}, {"score": 0.0021442819603609835, "phrase": "field_solution"}, {"score": 0.0021049977753042253, "phrase": "energy_balance"}], "paper_keywords": ["Eddy currents", " Electrical machines", " Steel", " Loss", " Losses", " Energy loss", " Power loss"], "paper_abstract": "Purpose - The purpose of this paper is to implement and test a 1D eddy-current model for laminated iron core of electrical machines and investigate the possibility of incorporating it in a 2D FE analysis. Design/methodology/approach - The 1D eddy-current model of laminated core is extended to handle rotating-field problems and coupling between the x- and y-components of the magnetic field. Explicit coupling terms are introduced in the Jacobean matrix to ensure convergence and time efficiency. The procedure is computationally tested for both the case where there is no feedback to the 2D FE and the case where the results of the eddy-current model were fed-back to the 2D analysis. Findings - The coupling terms ensured fast and robust convergence. The incorporation of the eddy-current model in the 2D FE analysis is possible, provided some under-relaxation is used to ensure the convergence of the overall 1D-2D procedure. Research limitations/implications - The method has been computationally tested with 2D like procedure corresponding to a 2D model with only one element. The behaviour of the model in actual 2D computation presents some problems related to the convergence of the overall procedure and they have been dealt with in another publication. Originality/value - The paper is of practical value for designers of electrical machines. On one hand, the model can be used a posteriori to estimate eddy-current losses in iron stacks, and on the other hand it can be incorporated into 2D FE analysis including the losses in the field solution and enhancing its power and energy balance.", "paper_title": "Modelling eddy-current in laminated non-linear magnetic circuits", "paper_id": "WOS:000292715900023"}