{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_worlds"}, {"score": 0.045462223221237344, "phrase": "professional_identity"}, {"score": 0.043400370094307784, "phrase": "second_life"}, {"score": 0.004547564208690591, "phrase": "virtual_world_settings"}, {"score": 0.004220086640742953, "phrase": "information_services"}, {"score": 0.0038309141193444015, "phrase": "virtual_world"}, {"score": 0.0036660436272785476, "phrase": "findings_-_librarians"}, {"score": 0.0033277936960179892, "phrase": "\"game-like\"_virtual_world_environment"}, {"score": 0.003142732162296465, "phrase": "traditional_workplaces"}, {"score": 0.0029161225023394363, "phrase": "\"_an_upgraded_avatar_appearance"}, {"score": 0.0025328377393370642, "phrase": "avatar-mediated_online_distance_education"}, {"score": 0.002258745901862197, "phrase": "educational_settings"}, {"score": 0.0021998194157393353, "phrase": "avatar-mediated_communication"}], "paper_keywords": ["Virtual worlds", " Second Life", " Avatars", " Digital reference", " Distance education", " Librarians", " Distance learning"], "paper_abstract": "Purpose - This study aims to examine librarianship and education in virtual world settings, focusing particularly on how librarians and educators establish professional identity and trust while teaching and providing information services as avatars within Second Life. Design/methodology/approach - Data was gathered through semi-structured in-depth interviews with 12 librarians and educators within the virtual world of Second Life, and in visits to 50 virtual world workplaces. Findings - Librarians and educators faced challenges of establishing professional identity and credibility for two different audiences i.e. \"newbies\" and \"residents\" within the \"game-like\" virtual world environment. Visual elements such as a conservative, humanoid avatar appearance, and imagery drawn from traditional workplaces were used by librarians and educators to establish their professional role with \"newbies\", while for \"residents\" an upgraded avatar appearance was necessary to convey credibility. Practical implications For librarians and educators working within highly visual, graphical. online settings such as virtual worlds, this study describes issues in providing avatar-mediated online distance education and online library services. Originality/value - This research provides in-depth interviews and observations with librarians and educators from a variety of libraries and educational settings. The study also explores avatar-mediated communication, which is little-examined as yet in US research.", "paper_title": "Professional avatars: librarians and educators in virtual worlds", "paper_id": "WOS:000304576700004"}