{"auto_keywords": [{"score": 0.03829477508328845, "phrase": "cosense"}, {"score": 0.015719716506582538, "phrase": "collaborative_web_search"}, {"score": 0.01255516382669492, "phrase": "collaborative_search_tasks"}, {"score": 0.004759250494071843, "phrase": "sensemaking"}, {"score": 0.004676895436217523, "phrase": "important_aspect"}, {"score": 0.004622783000449884, "phrase": "information-seeking_tasks"}, {"score": 0.004412494693940597, "phrase": "individual_level"}, {"score": 0.0036838048761094933, "phrase": "new_tool"}, {"score": 0.003516079377293321, "phrase": "searchtogether"}, {"score": 0.0033170847930578473, "phrase": "collaborative_sensemaking"}, {"score": 0.0032596049901888724, "phrase": "individual_sensemaking"}, {"score": 0.0031660031870090434, "phrase": "different_kinds"}, {"score": 0.00278497898719426, "phrase": "synchronous_and_asynchronous_collaboration"}, {"score": 0.0023792975669318615, "phrase": "different_procedural_knowledge"}, {"score": 0.002142161017595363, "phrase": "collaborative_search_task"}], "paper_keywords": [""], "paper_abstract": "Sensemaking is an important aspect of information-seeking tasks but has mostly been studied at the individual level. We conducted a study of sensemaking in collaborative Web search using SearchTogether and found that collaborators face several challenges in making sense of information during collaborative search tasks. We built and evaluated a new tool, CoSense, which enhanced sensemaking in SearchTogether. The evaluation of CoSense provided insights into how collaborative sensemaking differed from individual sensemaking in terms of the different kinds of information that collaborators needed to make sense of. In this article we discuss findings about how sensemaking occurs in synchronous and asynchronous collaboration and the challenges participants face in handling handoffs. We found that participants had two different strategies of handling handoffssearch-lead and sensemaking-leadand that participants with these two strategies exhibited different procedural knowledge of sensemaking. We also discuss how complex and varied the products of sensemaking are during a collaborative search task. Through our evaluation of CoSense we provide insights into the design of tools that can enhance sensemaking in collaborative search tasks.", "paper_title": "Sensemaking in Collaborative Web Search", "paper_id": "WOS:000288663500004"}