{"auto_keywords": [{"score": 0.04823115624486472, "phrase": "ontology-based_models"}, {"score": 0.009324800579875734, "phrase": "semantic_reconciliation"}, {"score": 0.00481495049065317, "phrase": "design_and_manufacturing_knowledge_models"}, {"score": 0.004174824849669107, "phrase": "product_lifecycle_systems"}, {"score": 0.003935420482629049, "phrase": "multiple_ontology-based_models"}, {"score": 0.0036373553416391823, "phrase": "difficult_one"}, {"score": 0.0030464123943266673, "phrase": "cross-model_semantic_correspondences"}, {"score": 0.0027200305495826797, "phrase": "semantic_manufacturing_interoperability_framework"}, {"score": 0.0026020254041372723, "phrase": "common_logic-based_underpinning"}, {"score": 0.0025014259919355453, "phrase": "cross-model_correspondences"}, {"score": 0.0023694065215394593, "phrase": "relevant_logic-based_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "important_structures"}], "paper_keywords": ["Design and manufacture", " heavyweight ontology", " Common Logic", " ontology mapping", " ontology alignment", " interoperability"], "paper_abstract": "Ontology-based models of product design and manufacture are becoming increasingly important in the effort towards achieving interoperability among various stakeholders within and across product lifecycle systems. However, in the eventuality of having to interoperate between multiple ontology-based models, with the intention of sharing knowledge among them, the process still remains a difficult one. Although the concept of ontology mapping/matching has been developed as a means to interoperate across ontology-based models, yet the concept has remained relatively weak in terms of its ability to enable the formalization and verification of cross-model semantic correspondences in design and manufacture. In this paper, improved concepts to achieve semantic reconciliation are being investigated in the context of the Semantic Manufacturing Interoperability Framework (SMIF). The approach uses a Common Logic-based underpinning for enabling the evaluation and verification of cross-model correspondences. The approach has been successfully tested by applying the relevant logic-based mechanisms, in order to show the reconciliation of two individually developed knowledge models. Through this, it has been demonstrated that the approach enables semantic reconciliation of important structures within ontology-based models of design and manufacture.", "paper_title": "Semantic reconciliation across design and manufacturing knowledge models: A logic-based approach", "paper_id": "WOS:000298744200001"}