{"auto_keywords": [{"score": 0.04112949191000256, "phrase": "modem_mathematics"}, {"score": 0.030980468250983276, "phrase": "potential_and_actual_infinities"}, {"score": 0.02679304367042305, "phrase": "potential_infinity"}, {"score": 0.026392644474033274, "phrase": "actual_infinity"}, {"score": 0.00481495049065317, "phrase": "hidden_contradictions"}, {"score": 0.004717125879761534, "phrase": "purpose_-_the_paper's_aim"}, {"score": 0.004550669123303854, "phrase": "deeply_hidden_contradictions"}, {"score": 0.004256895619944631, "phrase": "conceptual_approach"}, {"score": 0.003961613484271729, "phrase": "intrinsic_attribute"}, {"score": 0.003176333519010176, "phrase": "modem_mathematical_system"}, {"score": 0.002851301751761804, "phrase": "logical_and_non-logical_axiomatic_systems"}], "paper_keywords": ["cybernetics", " mathematics", " research"], "paper_abstract": "Purpose - The paper's aim is to show a pair of deeply hidden contradictions in the system of mathematics. Design/methodology/approach - The paper takes a conceptual approach to the problem. Findings - It is indicated that it is an intrinsic attribute of modem mathematics and its theoretical foundation to mix up the intensions and methods of two different thoughts of infinities, which provides the basis of legality for using the methods of analysis, produced by combining the two kinds of infinities, in the study of the modem mathematical system. In this paper, by exactly employing the method of analysis of mixing up potential and actual infinities, we card the logical and non-logical axiomatic systems for modem mathematics. The outcome of our carding implies that in modem mathematics and its theoretical foundation, some axioms implicitly assume the convention that each potential infinity equals an actual infinity, while some other axioms implicitly apply the belief that \"each potential infinity is different of any actual infinity.\" Originality/value - By using the concepts of potential and actual infinities, the authors uncover two contradictory thinking logics widely employed in the study of mathematics.", "paper_title": "Modem system of mathematics and a pair of hidden contradictions in its foundation", "paper_id": "WOS:000256048100005"}