{"auto_keywords": [{"score": 0.03445564019371514, "phrase": "companion_paper"}, {"score": 0.033067104039962776, "phrase": "chaotic_pr_system"}, {"score": 0.02842407000679083, "phrase": "chaotic_system"}, {"score": 0.00481495049065317, "phrase": "chaotic_pattern_recognition_neural_network"}, {"score": 0.00469740813902244, "phrase": "usual_goal"}, {"score": 0.004647911247507267, "phrase": "natural_and_artificial_perception"}, {"score": 0.003813669883040509, "phrase": "oversimplified_model"}, {"score": 0.003760137090849196, "phrase": "true_image"}, {"score": 0.0035408501923902477, "phrase": "chaotic_model"}, {"score": 0.0035159043158639633, "phrase": "pattern_recognition"}, {"score": 0.00316206336164649, "phrase": "view_point"}, {"score": 0.002833689453299307, "phrase": "additional_noise"}, {"score": 0.002603012037901889, "phrase": "formal_model"}, {"score": 0.0025393296453558203, "phrase": "lyapunov_exponents"}, {"score": 0.0025125151618810523, "phrase": "routh-hurwitz_criterion"}, {"score": 0.0023079225317714793, "phrase": "theoretical_possibility"}, {"score": 0.0022674379203603224, "phrase": "periodic_behavior"}, {"score": 0.0021049977753042253, "phrase": "epileptic_behavior"}], "paper_keywords": ["chaotic neural networks (CNNs)", " chaotic pattern recognition (PR)", " modeling inaccurate perception"], "paper_abstract": "The usual goal of modeling natural and artificial perception involves determining how a system can extract the object that it perceives from an image that is noisy. The \"inverse\" of this problem is one of modeling how even a clear image can be perceived to be blurred in certain contexts. To our knowledge, there is no solution to this in the literature other than for an oversimplified model in which the true image is garbled with noise by the perceiver himself. In this paper, we propose a chaotic model of pattern recognition (PR) for the theory of \"blurring.\" This paper, which is an extension to a companion paper demonstrates how one can model blurring from the view point of a chaotic PR system. Unlike the companion paper in which a chaotic PR system extracts the pattern from the input, in this case, we show that even without the inclusion of additional noise, perception of an object can be \"blurred\" if the dynamics of the chaotic system are modified. We thus propose a formal model and present an analysis using the Lyapunov exponents and the Routh-Hurwitz criterion. We also demonstrate experimentally the validity of our model by using a numeral data set. A byproduct of this model is the theoretical possibility of desynchronization of the periodic behavior of the brain (as a chaotic system), rendering us the possibility of predicting, controlling, and annulling epileptic behavior.", "paper_title": "Desynchronizing a chaotic pattern recognition neural network to model inaccurate perception", "paper_id": "WOS:000246641800016"}