{"auto_keywords": [{"score": 0.03805591382224184, "phrase": "account_reachability"}, {"score": 0.03692979073919857, "phrase": "privacy_risk"}, {"score": 0.014853405813438485, "phrase": "archecker"}, {"score": 0.00481495049065317, "phrase": "account_reachability_risk"}, {"score": 0.004581505405526037, "phrase": "user's_profile"}, {"score": 0.0045249263666466005, "phrase": "regional_information"}, {"score": 0.004173743791750695, "phrase": "social_networking_service_users"}, {"score": 0.003946650265907885, "phrase": "multiple_accounts"}, {"score": 0.0032953582866530966, "phrase": "user's_private_account"}, {"score": 0.002700348931172875, "phrase": "user's_profiles"}, {"score": 0.002521623057264411, "phrase": "system_very_simply_checks"}, {"score": 0.002340081450249521, "phrase": "personal_information"}], "paper_keywords": ["Privacy", " Web", " ARChecker", " Social networking service", " Account reachability", " Privacy risk"], "paper_abstract": "Purpose - The purpose of this paper was to argue that social networking service users should be vigilant in protecting the relationship between multiple accounts. Design/methodology/approach - In this paper, the authors propose the use of account reachability, a measure of privacy risk which demonstrates the possibility of a stranger finding a user's private account based on information in their public account. In addition, they present ARChecker, a tool to calculate the value of account reachability. ARChecker also provides advice on how to modify the user's profiles and messages to decrease the privacy risk. Findings - The system very simply checks account reachability and shows the result and reasons for accessibility to personal information. From the results, users can learn how to protect themselves from privacy risk by taking certain measures. Originality/value - This paper proposes account reachability, a new measure of privacy risk, and presents ARChecker, a tool to calculate the value of account reachability.", "paper_title": "Calculation of account reachability risk for users having multiple SNS accounts from user's profile and regional information", "paper_id": "WOS:000354207200006"}