{"auto_keywords": [{"score": 0.042657423330974706, "phrase": "perceived_violations"}, {"score": 0.006271022183214138, "phrase": "potential_error"}, {"score": 0.00481495049065317, "phrase": "emergency_psychiatry_rounds"}, {"score": 0.0047468516620285525, "phrase": "contemporary_error_research"}, {"score": 0.004580769304731227, "phrase": "error_commission"}, {"score": 0.004452078350485375, "phrase": "integral_part"}, {"score": 0.004420472010542188, "phrase": "cognitive_work"}, {"score": 0.004342430078306461, "phrase": "expert_level"}, {"score": 0.004296264970612285, "phrase": "collaborative_workspaces"}, {"score": 0.004043744293248725, "phrase": "accepted_practice_norms"}, {"score": 0.003846926701870193, "phrase": "reason's_widely_accepted_definition"}, {"score": 0.0037387746981660717, "phrase": "intended_outcome"}, {"score": 0.0035189057079817285, "phrase": "error_prevention"}, {"score": 0.0033475472608077823, "phrase": "accepted_procedure"}, {"score": 0.0033119237381809617, "phrase": "psychiatric_emergency_department"}, {"score": 0.003105979498529766, "phrase": "fourteen_ped_patient_rounds"}, {"score": 0.0028920935761027724, "phrase": "qualitative_coding_methods"}, {"score": 0.0028006988338192375, "phrase": "prior_research"}, {"score": 0.0027316100642958544, "phrase": "ped._results"}, {"score": 0.0027121844541913367, "phrase": "thirty_incidents"}, {"score": 0.0024718415971488627, "phrase": "retrospective_analysis"}, {"score": 0.002359759876402679, "phrase": "error_analysis"}, {"score": 0.002342972434255588, "phrase": "occasional_reported_adverse_events"}, {"score": 0.0022527488455744674, "phrase": "real_time"}, {"score": 0.0021200841162726846, "phrase": "ped"}], "paper_keywords": [""], "paper_abstract": "Objective: Contemporary error research suggests that the quest to eradicate error is misguided Error commission, detection, and recovery are an integral part of cognitive work, even at the expert level. In collaborative workspaces, the perception of potential error is directly observable: workers discuss and respond to perceived violations of accepted practice norms. As perceived violations are captured and corrected preemptively, they do not fit Reason's widely accepted definition of error as \"failure to achieve an intended outcome.\" However, perceived violations suggest the aversion of potential error, and consequently have implications for error prevention. This research aims to identify and describe perceived violations of the boundaries of accepted procedure in a psychiatric emergency department (PED), and how they are resolved in practice. Design: Clinical discourse from fourteen PED patient rounds was audio-recorded. Excerpts from recordings suggesting perceived violations or incidents of miscommunication were extracted and analyzed using qualitative coding methods. The results are interpreted in relation to prior research on vulnerabilities to error in the PED. Results: Thirty incidents of perceived violations or miscommunication are identified and analyzed. Of these, only one medication error was formally reported. Other incidents would not have been detected by a retrospective analysis. Conclusions: The analysis of perceived violations expands the data available for error analysis beyond occasional reported adverse events. These data are prospective: responses are captured in real time. This analysis supports a set of recommendations to improve the quality of care in the PED and other critical care contexts.", "paper_title": "Reevaluating recovery: Perceived violations and preemptive interventions on emergency psychiatry rounds", "paper_id": "WOS:000246670800008"}