{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-objective_real-valued_metaheuristics"}, {"score": 0.004483120978156604, "phrase": "single-objective_optimization_problem"}, {"score": 0.004195418010131832, "phrase": "integer-valued_problem"}, {"score": 0.004027586827290042, "phrase": "effective_algorithm"}, {"score": 0.003769006950727621, "phrase": "great_consideration"}, {"score": 0.0037307208089736835, "phrase": "different_problem-domains"}, {"score": 0.003403122817578447, "phrase": "novel_attempt"}, {"score": 0.0032836104153151973, "phrase": "common_and_established_metaheuristics"}, {"score": 0.0031845067058084583, "phrase": "different_search_spaces"}, {"score": 0.0027883885425383534, "phrase": "real-valued_genetic_algorithm"}, {"score": 0.0027041907335656782, "phrase": "particle_swarm_optimization"}, {"score": 0.0026630475331025955, "phrase": "algorithmic_modifications"}, {"score": 0.0021928902836049384, "phrase": "test_cases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Multi-objective optimization", " Graph partitioning", " Genetic algorithm", " Differential evolution", " Particle swarm optimization"], "paper_abstract": "The graph partitioning is usually tackled as a single-objective optimization problem. Moreover, various problem-specific versions of different algorithms are proposed for solving this integer-valued problem, thus confusing practitioners in selecting an effective algorithm for their instances. On the other hand, although various metaheuristics are currently in great consideration towards different problem-domains, these are yet to be investigated widely to this problem. In this article, a novel attempt is made to investigate whether some common and established metaheuristics can directly be applied to different search spaces, instead of going through various problem-specific algorithms. For this, some mechanisms are proposed for handling the graph partitioning problem by general multi-objective real-valued genetic algorithm, differential evolution, and particle swarm optimization. Some algorithmic modifications are also proposed for improving the performances of the metaheuristics. Finally, the performances of the metaheuristics are compared in terms of their computer memory requirements, as well as their computational runtime and solution qualities based on some test cases with up to five objectives. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Graph partitioning by multi-objective real-valued metaheuristics: A comparative study", "paper_id": "WOS:000290381300010"}