{"auto_keywords": [{"score": 0.04963419481547922, "phrase": "service_interface_adaptation"}, {"score": 0.041871074088565045, "phrase": "service_mediation"}, {"score": 0.03037241111200185, "phrase": "behavioural_interfaces"}, {"score": 0.00481495049065317, "phrase": "algebra_and_visual_notation"}, {"score": 0.004447600571127578, "phrase": "service_ecosystems"}, {"score": 0.0040890178236849825, "phrase": "key_challenge"}, {"score": 0.003920674807745575, "phrase": "existing_services"}, {"score": 0.003504756881063581, "phrase": "unforeseen_manners"}, {"score": 0.0033447157263095223, "phrase": "namely_service_interface_adaptation"}, {"score": 0.002684819249720834, "phrase": "declarative_approach"}, {"score": 0.002388487669097511, "phrase": "provided-required_interfaces"}, {"score": 0.0023223663501882917, "phrase": "algebraic_expressions"}, {"score": 0.002237036807966899, "phrase": "execution_engine"}, {"score": 0.0021049977753042253, "phrase": "adaptation_logic"}], "paper_keywords": [""], "paper_abstract": "The proliferation of services on the web is leading to the formation of service ecosystems wherein services interact with one another in ways not necessarily foreseen during their development or deployment. A key challenge in this setting is service mediation: the act of retrofitting existing services by intercepting, storing, transforming, and (re-)routing messages going into and out of these services so they can interact in unforeseen manners. This paper addresses a sub-problem of service mediation, namely service interface adaptation, that arises when the interface that a service provides does not match the interface that it is expected to provide in a given interaction. The paper focuses on reconciling mismatches between behavioural interfaces, i.e. interfaces that capture ordering constraints between interactions. It presents a declarative approach to service interface adaptation based on: (i) an algebra over behavioural interfaces; and (ii) a visual language that allows pairs of provided-required interfaces to be. linked through algebraic expressions. These expressions are fed into an execution engine that intercepts, buffers, transforms and forwards messages to enact the adaptation logic.", "paper_title": "Adapt or perish: Algebra and visual notation for service interface adaptation", "paper_id": "WOS:000241137100006"}