{"auto_keywords": [{"score": 0.04474066772270724, "phrase": "source_nodes"}, {"score": 0.015044191990720355, "phrase": "throughput_capacity"}, {"score": 0.013777781709258018, "phrase": "system_throughput"}, {"score": 0.00908766148304357, "phrase": "canonical_networks"}, {"score": 0.006185515409222994, "phrase": "remaining_capacity"}, {"score": 0.005071094214048775, "phrase": "general_networks"}, {"score": 0.0050418211907261755, "phrase": "random_topologies"}, {"score": 0.004448522543184813, "phrase": "practical_scenario"}, {"score": 0.004405779372462873, "phrase": "multihop_mesh_network"}, {"score": 0.004338239182984759, "phrase": "internet_gateway"}, {"score": 0.004304856672196293, "phrase": "trivial_case"}, {"score": 0.004124623649432552, "phrase": "relay_nodes"}, {"score": 0.0041019344482726315, "phrase": "isolated_link"}, {"score": 0.004031238480458909, "phrase": "nontrivial_case"}, {"score": 0.003753126425450119, "phrase": "unacceptable_trivial_solution"}, {"score": 0.0036600192572132676, "phrase": "link_capacity"}, {"score": 0.0035417276553221426, "phrase": "one-hop_source_nodes"}, {"score": 0.003342196195645291, "phrase": "one-hop_nodes"}, {"score": 0.0031968441980848436, "phrase": "source_traffic"}, {"score": 0.0030166837276747816, "phrase": "\"canonical_networks"}, {"score": 0.0029761243538018525, "phrase": "regularly_structured_networks"}, {"score": 0.0028576796380512157, "phrase": "equal_length"}, {"score": 0.002722787864774422, "phrase": "different_lengths"}, {"score": 0.002665465323614577, "phrase": "analytical_upper"}, {"score": 0.002559352574314113, "phrase": "simulated_throughputs"}, {"score": 0.0023779362667537274, "phrase": "aodv_routing"}, {"score": 0.0021628142746829187, "phrase": "dense_network"}, {"score": 0.0021049977753042253, "phrase": "higher_throughput"}], "paper_keywords": ["Wireless mesh networks", " many-to-one", " one-to-many", " data-gathering networks", " 802.11", " Wi-Fi", " multihop networks"], "paper_abstract": "This paper investigates the many-to-one throughput capacity (and by symmetry, one-to-many throughput capacity) of IEEE 802.11 multihop networks, in which many sources send data to a sink. An example of a practical scenario is that of a multihop mesh network connecting source and relay nodes to an Internet gateway. In the trivial case where all source nodes are just one hop from the sink, the system throughput can approach L(s), where L(s) is the throughput capacity of an isolated link consisting of just one transmitter and one receiver. In the nontrivial case where some source nodes are more than one hop away, one can still achieve a system throughput of L(s) by sacrificing and starving the non-one-hop source nodes-however, this degenerates to an unacceptable trivial solution. We could approach the problem by the following partitioning: preallocate some link capacity aL(s) (0 <= a <= 1) at the sink to the one-hop source nodes and then determine the throughput for the source nodes that are two or more hops away based on the remaining capacity L = (1 - a)L(s). The throughput of the one-hop nodes will be around aL(s). This paper investigates the extent to which the remaining capacity L can be used efficiently by the source traffic that is two or more hops away. We find that for such source traffic, a throughput of L is not achievable under 802.11. We introduce the notion of \"canonical networks,\" a general class of regularly structured networks that allow us to investigate the system throughput by varying the distances between nodes and other operating parameters. When all links have equal length, we show that 2L/3 is the upper bound for general networks, including random topologies and canonical networks. When the links are allowed to have different lengths, we show that the throughput capacity of canonical networks has an analytical upper bound of 3L/4. The tightness of the bound is confirmed by simulations of 802.11 canonical networks, in which we obtain simulated throughputs of 0.74L when the source nodes are two hops away and 0.69L when the source nodes are many hops away. We conjecture that 3L/4 is also the upper bound for general networks. Our simulations show that 802.11 networks with random topologies operated with AODV routing typically achieve throughputs far below 3L/4. Fortunately, by properly selecting routes near the gateway (or by properly positioning the relay nodes leading to the gateway) to fashion after the structure of canonical networks, the throughput can be improved by more than 150 percent: indeed, in a dense network, deactivating some of the relay nodes near the sink can lead to a higher throughput.", "paper_title": "Many-to-One Throughput Capacity of IEEE 802.11 Multihop Wireless Networks", "paper_id": "WOS:000263395700007"}