{"auto_keywords": [{"score": 0.047363369105007026, "phrase": "frequent_subgraphs"}, {"score": 0.010612387000973441, "phrase": "frequent_subgraph"}, {"score": 0.00750831554826361, "phrase": "desired_answers"}, {"score": 0.006231203492376069, "phrase": "np"}, {"score": 0.004520132822496416, "phrase": "frequent_itemsets"}, {"score": 0.004274351284774126, "phrase": "graph_mining"}, {"score": 0.00423298595241209, "phrase": "special_types"}, {"score": 0.0037666309179970876, "phrase": "comprehensive_investigation"}, {"score": 0.0037392451233558234, "phrase": "computational_complexity"}, {"score": 0.003721098220825489, "phrase": "mining_maximal_frequent_subgraphs"}, {"score": 0.003359647377874098, "phrase": "specific_classes"}, {"score": 0.0033433365160336842, "phrase": "connected_graphs"}, {"score": 0.0033271045779740683, "phrase": "general_graphs"}, {"score": 0.0032709088591705983, "phrase": "bounded_degree"}, {"score": 0.00323134923196813, "phrase": "bounded_treewidth"}, {"score": 0.003192266521731151, "phrase": "special_case"}, {"score": 0.0029458777184930896, "phrase": "enumeration_problem"}, {"score": 0.0027651847105654363, "phrase": "labeled_classes"}, {"score": 0.0027184540871935284, "phrase": "threshold_yields"}, {"score": 0.002564133578327822, "phrase": "labeled_trees"}, {"score": 0.002424450174817922, "phrase": "unlabeled_classes"}, {"score": 0.002348883765159185, "phrase": "unlabeled_trees"}], "paper_keywords": ["Algorithms", " Theory", " Graph mining", " maximal frequent subgraphs", " enumeration complexity"], "paper_abstract": "A frequent subgraph of a given collection of graphs is a graph that is isomorphic to a subgraph of at least as many graphs in the collection as a given threshold. Frequent subgraphs generalize frequent itemsets and arise in various contexts, from bioinformatics to the Web. Since the space of frequent subgraphs is typically extremely large, research in graph mining has focused on special types of frequent subgraphs that can be orders of magnitude smaller in number, yet encapsulate the space of all frequent subgraphs. Maximal frequent subgraphs (i.e., the ones not properly contained in any frequent subgraph) constitute the most useful such type. In this article, we embark on a comprehensive investigation of the computational complexity of mining maximal frequent subgraphs. Our study is carried out by considering the effect of three different parameters: possible restrictions on the class of graphs; a fixed bound on the threshold; and a fixed bound on the number of desired answers. We focus on specific classes of connected graphs: general graphs, planar graphs, graphs of bounded degree, and graphs of bounded treewidth (trees being a special case). Moreover, each class has two variants: that in which the nodes are unlabeled, and that in which they are uniquely labeled. We delineate the complexity of the enumeration problem for each of these variants by determining when it is solvable in (total or incremental) polynomial time and when it is NP-hard. Specifically, for the labeled classes, we show that bounding the threshold yields tractability but, in most cases, bounding the number of answers does not, unless P=NP; an exception is the case of labeled trees, where bounding either of these two parameters yields tractability. The state of affairs turns out to be quite different for the unlabeled classes. The main (and most challenging to prove) result concerns unlabeled trees: we show NP-hardness, even if the input consists of two trees and both the threshold and the number of desired answers are equal to just two. In other words, we establish that the following problem is NP-complete: given two unlabeled trees, do they have more than one maximal subtree in common?", "paper_title": "The Complexity of Mining Maximal Frequent Subgraphs", "paper_id": "WOS:000347799000007"}