{"auto_keywords": [{"score": 0.04528242904632838, "phrase": "web_site"}, {"score": 0.005518067173434957, "phrase": "brick-and-click_firms"}, {"score": 0.00481495049065317, "phrase": "online_user_behaviour"}, {"score": 0.004525979481628125, "phrase": "new_information_channel"}, {"score": 0.004442703298710073, "phrase": "business_results"}, {"score": 0.0042806998378295425, "phrase": "customer_behaviour"}, {"score": 0.004254277035435156, "phrase": "web_site_sponsor_brand"}, {"score": 0.00418892838079239, "phrase": "survey_instrument"}, {"score": 0.004036141321779216, "phrase": "research_model"}, {"score": 0.003723879111071547, "phrase": "consumer_e-behaviour"}, {"score": 0.0032796556275748842, "phrase": "web_site-free-content_sites"}, {"score": 0.003140401552000472, "phrase": "web_sites"}, {"score": 0.003101708453038721, "phrase": "e-commerce_web_site"}, {"score": 0.003073000846658596, "phrase": "corporate_web_site"}, {"score": 0.003016377872938571, "phrase": "main_practical_consequence"}, {"score": 0.0027827907725673845, "phrase": "direct_profitability"}, {"score": 0.0026811531172346676, "phrase": "proven_positive_relationship"}, {"score": 0.002551372449383365, "phrase": "vital_importance"}, {"score": 0.0024354002939660597, "phrase": "positive_consequences"}, {"score": 0.002191630834885141, "phrase": "indirect_profitability"}, {"score": 0.0021049977753042253, "phrase": "web_site_value"}], "paper_keywords": ["Consumer behaviour", " Attitudes", " Internet marketing", " Internet shopping", " Profit", " Brands"], "paper_abstract": "Purpose-The purpose of this article is to analyse the impact of the internet, as a new information channel for the consumer, on business results, and in particular, the consequences of attitude towards the web site with regard to customer behaviour and web site sponsor brand. Design/methodology/approach-A survey instrument was used to gather data to test the relationships in the research model. Findings-The paper shows the importance of attitude towards the web site and attitude towards the internet in explaining attitude towards the brand and consumer e-behaviour, and identifies the hierarchy of effects operative among these three concepts of attitude: attitude towards the internet; attitude towards the web site; and attitude towards the brand. Research limitations-This study only looked at one category of web site-free-content sites. Future research could apply the conclusions of this study to other types of web sites, e.g. the e-commerce web site and the corporate web site. Practical implications-The main practical consequence of the study lies in the need to take into account that the profitability of an e-business should not be measured solely in terms of direct profitability. Profits generated indirectly should also be considered, given the proven positive relationship between attitude towards the web site and attitude towards the brand. This conclusion is of vital importance since very few e-businesses obtain direct profits. Brick-and-click firms eliminate their e-businesses without bearing in mind the positive consequences they may be having on the brand itself. Originality/value-The study aimed to take a more in-depth look at the value of e-businesses for brick-and-click firms. It analysed sources of indirect profitability for the e-business that should be taken into account when looking at web site value.", "paper_title": "Attitudes' hierarchy of effects in online user behaviour", "paper_id": "WOS:000264465200002"}