{"auto_keywords": [{"score": 0.03580806098011901, "phrase": "complex_software_networks"}, {"score": 0.015633732140960133, "phrase": "small-world_networks"}, {"score": 0.015401046983072913, "phrase": "scale-free_networks"}, {"score": 0.010066990973866192, "phrase": "complex_networks"}, {"score": 0.008788697358701266, "phrase": "complex_software"}, {"score": 0.007613702100116094, "phrase": "propagation_scope"}, {"score": 0.005254819540913529, "phrase": "edge_instability_distribution"}, {"score": 0.00481495049065317, "phrase": "stability_feature"}, {"score": 0.004742511243894382, "phrase": "large-scale_complex_software"}, {"score": 0.004264923517966271, "phrase": "\"propagation_scope"}, {"score": 0.0040444053843446326, "phrase": "change_propagation"}, {"score": 0.0038352452380298464, "phrase": "clear_\"small-world"}, {"score": 0.0028525124381208705, "phrase": "software_engineering"}, {"score": 0.0027048247303526583, "phrase": "\"edge_instability"}, {"score": 0.0026040262154057607, "phrase": "structural_difference"}, {"score": 0.0021049977753042253, "phrase": "typical_structure"}], "paper_keywords": ["Complex network", " software", " propagation", " stability"], "paper_abstract": "In this paper, we attempt to understand the propagation and stability feature of large-scale complex software from the perspective of complex networks. Specifically, we introduced the concept of \"propagation scope\" to investigate the problem of change propagation in complex software. Although many complex software networks exhibit clear \"small-world\" and \"scale-free\" features, we found that the propagation scope of complex software networks is much lower than that of small-world networks and scale-free networks. Furthermore, because the design of complex software always obeys the principles of software engineering, we introduced the concept of \"edge instability\" to quantify the structural difference among complex software networks, small-world networks and scale-free networks. We discovered that the edge instability distribution of complex software networks is different from that of small-world networks and scale-free networks. We also found a typical structure that contributes to the edge instability distribution of complex software networks. Finally, we uncovered the correlation between propagation scope and edge instability in complex networks by eliminating the edges with different instability ranges.", "paper_title": "Propagation and stability in software: A complex network perspective", "paper_id": "WOS:000351729600005"}