{"auto_keywords": [{"score": 0.03499926199761658, "phrase": "lohd"}, {"score": 0.010612387000973441, "phrase": "wireless_sensor_networks"}, {"score": 0.009962555578842599, "phrase": "push"}, {"score": 0.009873016445286832, "phrase": "pull"}, {"score": 0.004771435352180973, "phrase": "data-centric_design"}, {"score": 0.0034560481756572632, "phrase": "network_settings"}, {"score": 0.00334780964309978, "phrase": "existing_approaches"}, {"score": 0.0032282396745967504, "phrase": "location_information"}, {"score": 0.002988101395789399, "phrase": "well-controlled_flooding"}, {"score": 0.0027282915297520624, "phrase": "enhanced_push"}, {"score": 0.0024797072773840704, "phrase": "extensive_simulations"}], "paper_keywords": ["Wireless sensor networks", " Data diffusion", " Broadcast", " Hybrid", " PUSH", " PULL", " Location information"], "paper_abstract": "Data-centric design has been widely adopted in wireless sensor networks thanks to its efficiency, as PUSH and PULL are two common data dissemination algorithms for such networks. The two algorithms work well with only a few sources or a few sinks, respectively. However, when there are many sources and many sinks, both of them become inefficient, In this paper, we take advantage of these two algorithms, and propose a novel Location-Oblivious Hybrid PUSH-PULL data Diffusion (LOHD) algorithm, which suits a wide range of network settings. Different from most of the existing approaches, LOHD does not rely on any location information, as it adaptively selects an ultra-node in the middle of sources and sinks through a well-controlled flooding, and the ultra-node establishes and maintains the gradients between sources and sinks. LOHD also incorporates enhanced PUSH and PULL to deliver messages along the gradients instead of flooding. We model and analyze the algorithms and perform extensive simulations. The results show that LOHD performs Much better than both PUSH and PULL, particularly when the number of sources and sinks increases. We also show that the initialization overhead well resists to Such increase, and thus LOHD is highly scalable. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "LOHD: Location-Oblivious Hybrid data Diffusion in wireless sensor networks", "paper_id": "WOS:000264419800006"}