{"auto_keywords": [{"score": 0.046476179222430886, "phrase": "visualization_tools"}, {"score": 0.022932546644440405, "phrase": "pre-university_students"}, {"score": 0.010077155510866713, "phrase": "mathematical_concepts"}, {"score": 0.009233888770237873, "phrase": "empirical_evaluations"}, {"score": 0.007194256533689094, "phrase": "non-trivial_mathematical_concepts"}, {"score": 0.00481495049065317, "phrase": "interactive_visualization_tools"}, {"score": 0.004511663118269957, "phrase": "relatively_new_class"}, {"score": 0.004482400730101349, "phrase": "learning_tools"}, {"score": 0.004367228576339114, "phrase": "higher_levels"}, {"score": 0.004227398267369744, "phrase": "new_tools"}, {"score": 0.004052263422466088, "phrase": "educational_contexts"}, {"score": 0.003935267970727093, "phrase": "educational_visualization_tools"}, {"score": 0.0035574466515880337, "phrase": "empirical_evidence"}, {"score": 0.003465957803362915, "phrase": "exploratory_and_other_learning-related_activities"}, {"score": 0.0031845067058084583, "phrase": "age_group"}, {"score": 0.0031638248208086263, "phrase": "content_domain"}, {"score": 0.002925843578799596, "phrase": "students'_predisposition"}, {"score": 0.0028879529188983524, "phrase": "mathematical_ideas"}, {"score": 0.0027591477674456227, "phrase": "visualization_tool"}, {"score": 0.002679386232765167, "phrase": "information_visualization"}, {"score": 0.0026619761089539595, "phrase": "human-computer_interaction"}, {"score": 0.0024858445890050614, "phrase": "multiple_grade_levels"}, {"score": 0.0024616504443079512, "phrase": "diverse_cognitive_and_language_skills"}, {"score": 0.0021676977432828373, "phrase": "diverse_needs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive visualization tools", " Human-computer interfaces", " Computer-supported mathematics learning", " Pre-university education", " Design of educational software"], "paper_abstract": "Many students find it difficult to engage with mathematical concepts. As a relatively new class of learning tools, visualization tools may be able to promote higher levels of engagement with mathematical concepts. Often, development of new tools may outpace empirical evaluations of the effectiveness of these tools, especially in educational contexts. This seems to be the case with educational visualization tools. Much evidence about the effectiveness of these tools appears to be more suggestive than based on empirical evaluations. In this paper, we attempt to fill this gap and provide empirical evidence for the use of visualization tools in supporting exploratory and other learning-related activities. In particular, we aim to investigate whether visualization tools can be used to engage pre-university students in exploring non-trivial mathematical concepts. We focus particularly on this age group and content domain because of the difficulty these students may encounter when trying to investigate more challenging mathematical concepts. Also, it is during their formative years before university that students' predisposition and likeness towards mathematical ideas are formed. We report in this paper a study assessing whether a visualization tool, whose design was informed explicitly by research from information visualization and human-computer interaction, could engage pre-university students in their exploration and learning of more advanced mathematical concepts. Students who participated in this study came from multiple grade levels and have diverse cognitive and language skills as well as preferences towards mathematics. The results of this study indicate that visualization tools can effectively engage these students and support their exploration of non-trivial mathematical concepts, only if the tool is designed such that it can cater the diverse needs of these students. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Can interactive visualization tools engage and support pre-university students in exploring non-trivial mathematical concepts?", "paper_id": "WOS:000276114300015"}