{"auto_keywords": [{"score": 0.0337104322325555, "phrase": "limited_amount"}, {"score": 0.00481495049065317, "phrase": "entity_resolution"}, {"score": 0.004316396683332752, "phrase": "large_data_sets"}, {"score": 0.004167982855788402, "phrase": "er_result"}, {"score": 0.004024651422626329, "phrase": "people_data"}, {"score": 0.0037855348847339655, "phrase": "reasonable_amount"}, {"score": 0.0036553070575015344, "phrase": "real-time_applications"}, {"score": 0.003529543381704363, "phrase": "er_processing"}, {"score": 0.0022579036318895753, "phrase": "matching_records"}, {"score": 0.0021705796895687864, "phrase": "real_data_sets"}, {"score": 0.002123531043641047, "phrase": "potential_gains"}], "paper_keywords": ["Entity resolution", " pay-as-you-go", " data cleaning"], "paper_abstract": "Entity resolution (ER) is the problem of identifying which records in a database refer to the same entity. In practice, many applications need to resolve large data sets efficiently, but do not require the ER result to be exact. For example, people data from the web may simply be too large to completely resolve with a reasonable amount of work. As another example, real-time applications may not be able to tolerate any ER processing that takes longer than a certain amount of time. This paper investigates how we can maximize the progress of ER with a limited amount of work using \"hints,\" which give information on records that are likely to refer to the same real-world entity. A hint can be represented in various formats (e.g., a grouping of records based on their likelihood of matching), and ER can use this information as a guideline for which records to compare first. We introduce a family of techniques for constructing hints efficiently and techniques for using the hints to maximize the number of matching records identified using a limited amount of work. Using real data sets, we illustrate the potential gains of our pay-as-you-go approach compared to running ER without using hints.", "paper_title": "Pay-As-You-Go Entity Resolution", "paper_id": "WOS:000316755100012"}