{"auto_keywords": [{"score": 0.04274518365190484, "phrase": "ds_research"}, {"score": 0.006290665782057853, "phrase": "dsrm"}, {"score": 0.00481495049065317, "phrase": "information_systems_research"}, {"score": 0.00450020161335541, "phrase": "design_science"}, {"score": 0.004158794879468156, "phrase": "successful_artifacts"}, {"score": 0.0037153426267756452, "phrase": "commonly_accepted_framework"}, {"score": 0.0034984340449789745, "phrase": "design_science_research_methodology"}, {"score": 0.003172551230409948, "phrase": "prior_literature"}, {"score": 0.003113441660343867, "phrase": "nominal_process_model"}, {"score": 0.0030097975788892896, "phrase": "mental_model"}, {"score": 0.0029095936591723645, "phrase": "ds_process"}, {"score": 0.0028877818105020434, "phrase": "six_steps"}, {"score": 0.0023745087648471613, "phrase": "health_assessment_methods"}, {"score": 0.002347843727281585, "phrase": "software_reuse_measure"}, {"score": 0.0023214774334744713, "phrase": "internet_video_telephony_application"}, {"score": 0.0022781884538102264, "phrase": "planning_method"}, {"score": 0.002252602622785975, "phrase": "designed_methodology"}], "paper_keywords": ["case study", " design science", " design science research", " design theory", " mental model", " methodology", " process model"], "paper_abstract": "The paper motivates, presents, demonstrates in use, and evaluates a methodology for conducting design science (DS) research in information systems (IS). DS is of importance in a discipline oriented to the creation of successful artifacts. Several researchers have pioneered DS research in IS, yet over the past 15 years, little DS research has been done within the discipline. The lack of a methodology to serve as a commonly accepted framework for DS research and of a template for its presentation may have contributed to its slow adoption. The design science research methodology (DSRM) presented here incorporates principles, practices, and procedures required to carry out such research and meets three objectives: it is consistent with prior literature, it provides a nominal process model for doing DS research, and it provides a mental model for presenting and evaluating DS research in IS. The DS process includes six steps: problem identification and motivation, definition of the objectives for a solution, design and development, demonstration, evaluation, and communication. We demonstrate and evaluate the methodology by presenting four case studies in terms of the DSRM, including cases that present the design of a database to support health assessment methods, a software reuse measure, an Internet video telephony application, and an IS planning method. The designed methodology effectively satisfies the three objectives and has the potential to help aid the acceptance of DS research in the IS discipline.", "paper_title": "A design science research methodology for Information Systems Research", "paper_id": "WOS:000252906300003"}