{"auto_keywords": [{"score": 0.04367485600330987, "phrase": "control_plane"}, {"score": 0.012387310480567692, "phrase": "filtering_list"}, {"score": 0.010954196724112233, "phrase": "filtering_lists"}, {"score": 0.009503403331609412, "phrase": "activation_sequences"}, {"score": 0.00481495049065317, "phrase": "network_stability"}, {"score": 0.004757971766446564, "phrase": "interdomain_routing_protocols"}, {"score": 0.004701664126368603, "phrase": "border_gateway_protocol"}, {"score": 0.004634969772496517, "phrase": "theoretical_analyses"}, {"score": 0.004472325202570124, "phrase": "protocol_stability"}, {"score": 0.004274441125612646, "phrase": "stable_paths_problem"}, {"score": 0.004244003342588079, "phrase": "analyse_packet_routing"}, {"score": 0.00414409430952873, "phrase": "forwarding_plane"}, {"score": 0.003923103599484743, "phrase": "packet_routing"}, {"score": 0.0038674104195993314, "phrase": "broad_class_next-hop_preferences"}, {"score": 0.003669856923238194, "phrase": "acceptable_paths"}, {"score": 0.003408435852153261, "phrase": "negative_side"}, {"score": 0.0033680450833191897, "phrase": "strong_inapproximability_result"}, {"score": 0.0031355247199092865, "phrase": "maximum_number"}, {"score": 0.002996611146746012, "phrase": "positive_side"}, {"score": 0.0028366375814063848, "phrase": "first_case"}, {"score": 0.002809698509866494, "phrase": "node's_filtering_list"}, {"score": 0.0027304024382166434, "phrase": "fundamental_case"}, {"score": 0.002560051845560703, "phrase": "second_case"}, {"score": 0.0022612709474579065, "phrase": "periodic_application"}, {"score": 0.0022505017689986835, "phrase": "route_verification"}, {"score": 0.0022079343650428015, "phrase": "first_results"}, {"score": 0.0021353654932854127, "phrase": "positive_results"}, {"score": 0.0021049977753042253, "phrase": "general_case"}], "paper_keywords": ["Network routing", " Border gateway protocol", " BGP", " Stability", " Hardness of approximation"], "paper_abstract": "How effective are interdomain routing protocols, such as the border gateway protocol, at routing packets? Theoretical analyses have attempted to answer this question by ignoring the packets and instead focusing upon protocol stability. To study stability, it suffices to model only the control plane (which determines the routing graph)-an approach taken in the stable paths problem. To analyse packet routing requires modelling the interactions between the control plane and the forwarding plane (which determines where packets are forwarded), and our first contribution is to introduce such a model. We then examine the effectiveness of packet routing in this model for the broad class next-hop preferences with filtering. Here each node has a filtering list consisting of nodes it does not want its packets to route through. Acceptable paths (those that avoid nodes in the filtering list) are ranked according to the next-hop, that is, the neighbour of that the path begins with. On the negative side, we present a strong inapproximability result. For filtering lists of cardinality at most one, given a network in which an equilibrium is guaranteed to exist, it is NP-hard to approximate the maximum number of packets that can be routed to within a factor of , for any constant . On the positive side, we give algorithms to show that, in two fundamental cases, there exist activation sequences under which every packet will route. The first case is when each node's filtering list contains only itself, that is, ; this is the fundamental case in which a node does not want its packets to cycle. Moreover, every packet will be routed before the control plane reaches an equilibrium. The second case is when all the filtering lists are empty, that is, . Thus, every packet will route even when the nodes do not care if their packets cycle! Furthermore, under these activation sequences, every packet will route even when the control plane has no equilibrium at all. Our positive results require the periodic application of route verification. To our knowledge, these are the first results to guarantee the possibility that all packets get routed without stability. These positive results are tight-for the general case of filtering lists of cardinality one, it is not possible to ensure that every packet will eventually route.", "paper_title": "Routing Regardless of Network Stability", "paper_id": "WOS:000340552300008"}