{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "secrecy_capacity"}, {"score": 0.015545916774765625, "phrase": "polar_codes"}, {"score": 0.008665124625391101, "phrase": "wiretap_channels"}, {"score": 0.00852155346152714, "phrase": "alice"}, {"score": 0.007922452565247541, "phrase": "wiretap_channel_model"}, {"score": 0.007856189900897764, "phrase": "wyner"}, {"score": 0.007639101094336252, "phrase": "coding_scheme"}, {"score": 0.006260091829409758, "phrase": "coding_schemes"}, {"score": 0.004629314163717679, "phrase": "bob"}, {"score": 0.004488296927106783, "phrase": "eve"}, {"score": 0.003988345858759183, "phrase": "bob's_probability"}, {"score": 0.0038128448094757145, "phrase": "mutual_information"}, {"score": 0.0037595947142663997, "phrase": "eve's_observations"}, {"score": 0.0036450381529042103, "phrase": "single_constant_c-s"}, {"score": 0.0033688919177039863, "phrase": "security_objectives"}, {"score": 0.0032570218602237773, "phrase": "random-coding_argument"}, {"score": 0.0032024832043416516, "phrase": "considerable_research_effort"}, {"score": 0.0030614565460256897, "phrase": "eve's_channel"}, {"score": 0.003027178161479457, "phrase": "erasure_channel"}, {"score": 0.002993282431300233, "phrase": "combinatorial_variation"}, {"score": 0.0029266243919705754, "phrase": "arikan"}, {"score": 0.0028695095228791724, "phrase": "symmetric_binary-input_discrete_memoryless_channels"}, {"score": 0.0026744596572861093, "phrase": "wide_range"}, {"score": 0.0023362681721994477, "phrase": "strong_security"}, {"score": 0.0022906518353647326, "phrase": "maurer"}, {"score": 0.002146926767291475, "phrase": "reliability_condition"}, {"score": 0.0021049977753042253, "phrase": "main_channel"}], "paper_keywords": ["Channel polarization", " information-theoretic security", " polar codes", " secrecy capacity", " strong security", " wiretap channel"], "paper_abstract": "Suppose that Alice wishes to send messages to Bob through a communication channel C-1, but her transmissions also reach an eavesdropper Eve through another channel C-2. This is the wiretap channel model introduced by Wyner in 1975. The goal is to design a coding scheme that makes it possible for Alice to communicate both reliably and securely. Reliability is measured in terms of Bob's probability of error in recovering the message, while security is measured in terms of the mutual information between the message and Eve's observations. Wyner showed that the situation is characterized by a single constant C-s, called the secrecy capacity, which has the following meaning: for all epsilon > 0, there exist coding schemes of rate R >= C-s - epsilon that asymptotically achieve the reliability and security objectives. However, his proof of this result is based upon a random-coding argument. To date, despite considerable research effort, the only case where we know how to construct coding schemes that achieve secrecy capacity is when Eve's channel C-2 is an erasure channel, or a combinatorial variation thereof. Polar codes were recently invented by Arikan; they approach the capacity of symmetric binary-input discrete memoryless channels with low encoding and decoding complexity. In this paper, we use polar codes to construct a coding scheme that achieves the secrecy capacity for a wide range of wiretap channels. Our construction works for any instantiation of the wiretap channel model, as long as both C-1 and C-2 are symmetric and binary-input, and C-2 is degraded with respect to C-1. Moreover, we show how to modify our construction in order to provide strong security, in the sense defined by Maurer, while still operating at a rate that approaches the secrecy capacity. In this case, we cannot guarantee that the reliability condition will also be satisfied unless the main channel C-1 is noiseless, although we believe it can be always satisfied in practice.", "paper_title": "Achieving the Secrecy Capacity of Wiretap Channels Using Polar Codes", "paper_id": "WOS:000295739000009"}