{"auto_keywords": [{"score": 0.04948580535995946, "phrase": "large_groups"}, {"score": 0.010288466981246018, "phrase": "traditional_methods"}, {"score": 0.0061999261853106225, "phrase": "statistically_significant_differences"}, {"score": 0.006009868834405642, "phrase": "large_group"}, {"score": 0.00481495049065317, "phrase": "computer-based_games"}, {"score": 0.004623696669036629, "phrase": "new_technologies"}, {"score": 0.004523865550323285, "phrase": "learning_process"}, {"score": 0.004412397783369937, "phrase": "e-learning_systems"}, {"score": 0.004344123393283444, "phrase": "new_teaching_methods"}, {"score": 0.004158500036893521, "phrase": "computer-based_game"}, {"score": 0.004119762981892093, "phrase": "educational_background"}, {"score": 0.004043363653396813, "phrase": "large-size_tabletop_display"}, {"score": 0.003919154537171269, "phrase": "educational_content"}, {"score": 0.0038826383289526857, "phrase": "historical_ages"}, {"score": 0.003822529597443667, "phrase": "natural_interaction"}, {"score": 0.003739931635717522, "phrase": "traditional_learning_method"}, {"score": 0.0037050791019670325, "phrase": "collaborative_learning_method"}, {"score": 0.0031219113081133723, "phrase": "pairs"}, {"score": 0.0030245745670310835, "phrase": "post-test_results"}, {"score": 0.0027799596509593166, "phrase": "traditional_method"}, {"score": 0.0021854562213835032, "phrase": "valuable_learning_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-based games", " Collaborative learning", " Large groups", " Interactive learning environments", " Media in education"], "paper_abstract": "As new technologies have emerged in the last few years, the learning process has been changing. New and powerful e-learning systems are being developed and new teaching methods can be used in classrooms. In this paper, we present a computer-based game with an educational background that is played on a large-size tabletop display. The game can be used as reinforcement for educational content related to historical ages. The game uses natural interaction. A study to compare the traditional learning method with a collaborative learning method using the game was carried out. A group of up to 12 children could learn together using the game. The experience of children in large groups was also compared with the experience of children playing in pairs. One hundred children between 8 and 11 years old participated in the study; they were divided into three groups (LGroup, Pairs, TClass). When the pretest and the post-test results were compared, it was shown that the children learned the contents in all three groups. The results also showed that there were statistically significant differences between the traditional method and the game played in a large group in favour of children who played the game in the large group. The knowledge acquired was independent from gender and age. There were no statistically significant differences between learning in large groups or learning in pairs. In both cases, the children expressed their satisfaction for the game and found it easy to use. Therefore, playing games of this type collaboratively in large groups or in pairs can be a valuable learning method that can be combined with traditional methods. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "The effects of computer-based games and collaboration in large groups vs. collaboration in pairs or traditional methods", "paper_id": "WOS:000364253600005"}