{"auto_keywords": [{"score": 0.004657185361669812, "phrase": "laptop_programs"}, {"score": 0.00421410521089045, "phrase": "exam_performance"}, {"score": 0.003942299471749811, "phrase": "learning_process"}, {"score": 0.003663443192307343, "phrase": "technology_affected_exam_performance"}, {"score": 0.003614895644619489, "phrase": "six_different_classroom_environments"}, {"score": 0.003359119985242403, "phrase": "multimedia_processing"}, {"score": 0.00312138530097218, "phrase": "social_media"}, {"score": 0.002842920225545139, "phrase": "six_conditions"}, {"score": 0.002295964130868963, "phrase": "experiential_learning_sessions"}, {"score": 0.002265497060260791, "phrase": "orientation_programs"}, {"score": 0.0021910825909008946, "phrase": "healthy_classroom_learning_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multimedia", " Multitasking", " Cognition", " Attitudes", " Experiential learning"], "paper_abstract": "Although many colleges and universities have implemented laptop programs, the use of these technologies in the classroom doesn't guarantee increases in exam performance. Used improperly, these technologies can hinder the learning process. An experiment was conducted comparing how the use or non-use of technology affected exam performance between six different classroom environments. Consistent with predictions based on theories of multitasking and multimedia processing, participants performed worst on an exam when distracted with social media. Moreover, having had this experience, participants in five of the six conditions showed a decrease in perceptions of their abilities to efficiently multitask from pre-test to post-test. Results are discussed in terms of theory and recommendations are made for the integration of experiential learning sessions into orientation programs to help promote a healthy classroom learning environment. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Exam performance and attitudes toward multitasking in six, multimedia-multitasking classroom environments", "paper_id": "WOS:000363068500018"}