{"auto_keywords": [{"score": 0.04622543665099782, "phrase": "gicad"}, {"score": 0.009143382274714628, "phrase": "commercial_programs"}, {"score": 0.004348363291608004, "phrase": "best-known_standards"}, {"score": 0.004223521213460728, "phrase": "unnecessary_commands"}, {"score": 0.004177631185971939, "phrase": "first_steps"}, {"score": 0.004132237700479874, "phrase": "learning_process"}, {"score": 0.003984444229875069, "phrase": "help_messages"}, {"score": 0.003941141575848601, "phrase": "student_self-training"}, {"score": 0.0038140261371648744, "phrase": "attractive_and_dynamic_graphic_interface"}, {"score": 0.003144134096095214, "phrase": "statistical_analysis"}, {"score": 0.003009548189374684, "phrase": "personal_preferences"}, {"score": 0.00289123004877327, "phrase": "gicad_and_commercial_programs"}, {"score": 0.002535492891830764, "phrase": "large_percentage"}, {"score": 0.0024715695446993107, "phrase": "theoretical_concepts"}, {"score": 0.0022315713796329227, "phrase": "cad"}, {"score": 0.0021912115487610286, "phrase": "subsequent_use"}, {"score": 0.0021752783872387173, "phrase": "commercial_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["human-computer interface", " intelligent tutoring systems", " interactive learning environments", " multimedia/hypermedia systems"], "paper_abstract": "At most Universities throughout the world Computer Aided Design is taught using commercial programs more suitable for business and industry than for teaching. This led us to write our own design program (GIcad) starting from the best-known standards on the market, but always avoiding unnecessary commands in the first steps of the learning process. GIcad constitutes a tool with a multitude of help messages to facilitate student self-training, it is very intuitive and has an attractive and dynamic graphic interface with a design that does not put off the beginner with a lot of options and commands. For three years - and with the collaboration of over 400 students in the first year of their course - we have been carrying out trials, experiments and tests of all kinds with GIcad and other commercial programs. The statistical analysis of the results obtained in the surveys show us that the personal preferences of the students and their learning times are very similar with both GIcad and commercial programs. But have we achieved our objective of dethroning the commercial programs? We can deduce that the students are aware of the importance of mastering the commercial programs they will encounter at work. Nevertheless, a large percentage of them prefer to consolidate the theoretical concepts and acquired practice with a program specifically written for that purpose and developed by our department. This program allows the students to indirectly learn the basis of CAD, so that the subsequent use of commercial tools poses no difficulty. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Teaching CAD at the university: Specifically written or commercial software?", "paper_id": "WOS:000247852800013"}