{"auto_keywords": [{"score": 0.00419229472352669, "phrase": "high_levels"}, {"score": 0.004045068727683462, "phrase": "real-world_applications"}, {"score": 0.0037997077863530897, "phrase": "immense_computational_complexities"}, {"score": 0.003601235776892337, "phrase": "real-world_control_problems"}, {"score": 0.003382704886584695, "phrase": "complete_representation_framework"}, {"score": 0.003149094460617212, "phrase": "significant_reduction"}, {"score": 0.0030656984915295275, "phrase": "computational_requirements"}, {"score": 0.002815864555488112, "phrase": "concept_application"}, {"score": 0.0027047136845332917, "phrase": "two-wheeled_mobile_robot"}, {"score": 0.0026330549554033876, "phrase": "real-world_outdoor_environment"}, {"score": 0.0025632898741546556, "phrase": "computational_performance"}, {"score": 0.0024620842899061614, "phrase": "multiprocessor_execution"}, {"score": 0.002162316557411786, "phrase": "different_levels"}, {"score": 0.0021049977753042253, "phrase": "different_types"}], "paper_keywords": ["General type-2 fuzzy logic systems (FLSs)", " type-2 FLSs", " zSlices"], "paper_abstract": "Higher order fuzzy logic systems (FLSs), such as interval type-2 FLSs, have been shown to be very well suited to deal with the high levels of uncertainties present in the majority of real-world applications. General type-2 FLSs are expected to further extend this capability. However, the immense computational complexities associated with general type-2 FLSs have, until recently, prevented their application to real-world control problems. This paper aims to address this problem by the introduction of a complete representation framework, which is referred to as zSlices-based general type-2 fuzzy systems. The proposed approach will lead to a significant reduction in both the complexity and the computational requirements for general type-2 FLSs, while it offers the capability to represent complex general type-2 fuzzy sets. As a proof-of-concept application, we have implemented a zSlices-based general type-2 FLS for a two-wheeled mobile robot, which operates in a real-world outdoor environment. We have evaluated the computational performance of the zSlices-based general type-2 FLS, which is suitable for multiprocessor execution. Finally, we have compared the performance of the zSlices-based general type-2 FLS against type-1 and interval type-2 FLSs, and a series of results is presented which is related to the different levels of uncertainty handled by the different types of FLSs.", "paper_title": "Toward General Type-2 Fuzzy Logic Systems Based on zSlices", "paper_id": "WOS:000283547400001"}