{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "lis"}, {"score": 0.00481495049065317, "phrase": "knowledge_exports"}, {"score": 0.004704187604192605, "phrase": "information_science_research"}, {"score": 0.00464976086880886, "phrase": "import-export_studies"}, {"score": 0.004310949776826717, "phrase": "different_disciplines"}, {"score": 0.004114787982556699, "phrase": "journal_impact_factors"}, {"score": 0.0033952989364738353, "phrase": "science_searches"}, {"score": 0.0026892447164623247, "phrase": "inter-disciplinary_differences"}, {"score": 0.0021927323694667694, "phrase": "lis_research"}], "paper_keywords": ["citation analysis", " impact factor", " import-export studies", " inter-disciplinarity", " Journal Citation Reports database", " knowledge exchange", " librarianship and information science", " Web of Science database"], "paper_abstract": "Import-export studies use citation data to describe the exchange of knowledge and ideas between different disciplines. This paper reports the use of journal impact factors (IF) to quantify the extent to which an individual discipline, specifically librarianship and information science (LIS), is able to export knowledge to other disciplines. Web of Science searches were used to identify citations to 232 high quality LIS publications extracted from submissions to the UK's 2008 Research Assessment Exercise. These publications resulted in 1061 knowledge exports to 444 unique, non-LIS citing journals, for which IFs were taken from the Journal Citation Reports database and normalised in order to minimise inter-disciplinary differences in citation behaviour. Non-LIS citing journals are shown to have IFs that are above the average for their subject categories, with this pattern of behaviour being considerably more pronounced for citations to LIS research published in non-LIS, rather than LIS, journals.", "paper_title": "Quantifying the value of knowledge exports from librarianship and information science research", "paper_id": "WOS:000314207200013"}