{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mathematical_knowledge_management"}, {"score": 0.003845154818609644, "phrase": "consistent_decisions"}, {"score": 0.0035539019235553897, "phrase": "mathematical_models"}, {"score": 0.0031577303835881964, "phrase": "mathematical_domain"}, {"score": 0.003018668521745676, "phrase": "mathematical_elements"}, {"score": 0.0028857130140890787, "phrase": "enterprise_ontology"}, {"score": 0.0027741761880779535, "phrase": "mathematical_symbolic_abstractions"}, {"score": 0.0026971491199975083, "phrase": "different_models"}, {"score": 0.0022906498741695094, "phrase": "case_study"}, {"score": 0.0022522565004588113, "phrase": "capacity_planning"}, {"score": 0.0022145052062614514, "phrase": "supply_chain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mathematical modeling", " Decision support systems", " Enterprise integration", " Knowledge management"], "paper_abstract": "The basis of decision-making in the enterprise consists in formally representing the system and its subsystems in models which adequately capture those features which are necessary to reach consistent decisions. This work represents the elements of the enterprise which are included in mathematical models (i.e. decisions, parameters, constraints, performance indicators) in an ontology which captures the knowledge of the mathematical domain. Thus, this ontology relates the mathematical elements of the models to their corresponding semantic representation within the enterprise ontology. As a result, the mathematical symbolic abstractions of a given enterprise element in different models are directly linked to their actual unique meaning, and the integration of decisions in the enterprise is transparent and improved. The purpose of this work is illustrated in a case study related to capacity planning in the supply chain and scheduling problems. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Using mathematical knowledge management to support integrated decision-making in the enterprise", "paper_id": "WOS:000336373400012"}