{"auto_keywords": [{"score": 0.03047446884731441, "phrase": "korean_blog_network"}, {"score": 0.016419144890389148, "phrase": "korean_blogospheres"}, {"score": 0.00894707615448211, "phrase": "new_business_models"}, {"score": 0.00481495049065317, "phrase": "topological_characteristics"}, {"score": 0.004750178261675602, "phrase": "korean_blogosphere."}, {"score": 0.004644146045859622, "phrase": "widespread_use"}, {"score": 0.0045200127552893704, "phrase": "important_medium"}, {"score": 0.0040010534672646775, "phrase": "social_relationships"}, {"score": 0.003947205191259291, "phrase": "korea"}, {"score": 0.0035095935622207956, "phrase": "analysis_methods"}, {"score": 0.0034467039994594065, "phrase": "foreign_blogosphere"}, {"score": 0.0033242742850902295, "phrase": "successful_business_policies"}, {"score": 0.0030783143919343972, "phrase": "behavioral_patterns"}, {"score": 0.0025804616931593897, "phrase": "scale-free_network"}, {"score": 0.002488724764295623, "phrase": "bow-tie_structure"}, {"score": 0.0021727640931660038, "phrase": "effective_algorithms"}, {"score": 0.0021049977753042253, "phrase": "korean_blogosphere"}], "paper_keywords": ["Blogosphere", " social network analysis", " bow-tie", " data mining", " graph mining"], "paper_abstract": "Due to their popularity and widespread use, blogs have become an important medium through which many people communicate and exchange information on the World Wide Web (WWW). The blogosphere has provided many opportunities for individuals and companies to establish new business models that investigate social relationships. In Korea, there are many blogospheres that appear to have characteristics that differ from other foreign blogospheres on the Internet. Consequently, it is inappropriate to apply the analysis methods used for the foreign blogosphere directly to the Korean blogospheres. To establish successful business policies for the Korean blogospheres, it is necessary to understand the characteristics of the Korean blogospheres and the behavioral patterns of the bloggers. In this paper, we analyze the characteristics of the Korean blog network, wherein each blogger forms a node and scraps by bloggers form edges. First, we demonstrate that the Korean blog network is a scale-free network, like the WWW. Second, we compare the bow-tie structure of the Korean blog network with that of the WWW. Lastly, we analyze the changes in the Korean blog network over time. Results of these analyses will be helpful in developing effective algorithms and establishing new business models targeted at the Korean blogosphere.", "paper_title": "ANALYZING TOPOLOGICAL CHARACTERISTICS OF THE KOREAN BLOGOSPHERE", "paper_id": "WOS:000365524800009"}