{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "energy_consumption"}, {"score": 0.0496341948154792, "phrase": "tool_life"}, {"score": 0.00466016686289196, "phrase": "machining_process"}, {"score": 0.004595356579614969, "phrase": "ever-increasing_understanding"}, {"score": 0.004552648949390462, "phrase": "environmental_and_societal_concerns"}, {"score": 0.004447600571127578, "phrase": "manufacturing_industries"}, {"score": 0.003570889780957037, "phrase": "experimental_investigation"}, {"score": 0.0034884152484429207, "phrase": "fuzzy_modeling"}, {"score": 0.00329813918116714, "phrase": "metal_cutting"}, {"score": 0.0030604342671868836, "phrase": "workpiece_material_hardness"}, {"score": 0.0028664985822266344, "phrase": "respective_measurements"}, {"score": 0.0028133741785871867, "phrase": "tool_damage"}, {"score": 0.00246800641971897, "phrase": "cutting_parameters"}, {"score": 0.0022686625017583387, "phrase": "machining_productivity"}, {"score": 0.002237036807966899, "phrase": "prediction_module"}, {"score": 0.002195552442011313, "phrase": "predicted_values"}, {"score": 0.0021347607855562102, "phrase": "finalized_values"}], "paper_keywords": ["Sustainability", " Grooving", " Fuzzy reasoning", " AISI 4340", " Prediction", " Optimization"], "paper_abstract": "With ever-increasing understanding of environmental and societal concerns, the focus of manufacturing industries, worldwide, is fast changing from mere profit-making to ensuring sustainability. The companies are striving hard to make their manufacturing processes more environment-friendly, in addition to being cost effective and time- and resource-efficient. The paper presents an experimental investigation and an application of fuzzy modeling for trade-off among energy consumption, tool life, and productivity of a metal cutting (machining) process. A total of 54 grooving experiments are performed under various pre-determined combinations of the workpiece material hardness, cutting speed, cutting feed, and width of cut. The respective measurements are taken for tool damage, energy consumed, and cutting and feed forces. A fuzzy rule-based system is developed that consists of two modules: optimization and prediction. The former suggests the most suitable settings for the cutting parameters that would lead to accomplishment of various combinations of the objectives related to energy consumption, tool life, and machining productivity. The prediction module works out the predicted values of all the responses based on the finalized values of the four input parameters.", "paper_title": "A rule-based system for trade-off among energy consumption, tool life, and productivity in machining process", "paper_id": "WOS:000365013800012"}