{"auto_keywords": [{"score": 0.04199668928862169, "phrase": "application_requirements"}, {"score": 0.010612387000973441, "phrase": "wireless_sensor_networks"}, {"score": 0.007628991217394187, "phrase": "tunable_parameters"}, {"score": 0.004506048850130758, "phrase": "diverse_application_domains"}, {"score": 0.0041316803676012155, "phrase": "wsn_domains"}, {"score": 0.003509006038574667, "phrase": "wsn_designers"}, {"score": 0.0030726480920918097, "phrase": "wsn_domain_diversity"}, {"score": 0.002860546817196148, "phrase": "sensor_node_parameter_tuning"}, {"score": 0.002690406375639144, "phrase": "automated_markov_decision_process"}, {"score": 0.0026091594819333654, "phrase": "optimal_sensor_node_operation"}, {"score": 0.0024918548761791435, "phrase": "processor_voltage"}, {"score": 0.002466510117718297, "phrase": "processor_frequency"}, {"score": 0.0023079225317714815, "phrase": "environmental_stimuli"}, {"score": 0.002284444272376043, "phrase": "numerical_results"}], "paper_keywords": ["Wireless sensor networks", " dynamic optimization", " MDP"], "paper_abstract": "Wireless sensor networks (WSNs) are distributed systems that have proliferated across diverse application domains (e. g., security/defense, health care, etc.). One commonality across all WSN domains is the need to meet application requirements (i.e., lifetime, responsiveness, etc.) through domain specific sensor node design. Techniques such as sensor node parameter tuning enable WSN designers to specialize tunable parameters (i.e., processor voltage and frequency, sensing frequency, etc.) to meet these application requirements. However, given WSN domain diversity, varying environmental situations (stimuli), and sensor node complexity, sensor node parameter tuning is a very challenging task. In this paper, we propose an automated Markov Decision Process (MDP)-based methodology to prescribe optimal sensor node operation (selection of values for tunable parameters such as processor voltage, processor frequency, and sensing frequency) to meet application requirements and adapt to changing environmental stimuli. Numerical results confirm the optimality of our proposed methodology and reveal that our methodology more closely meets application requirements compared to other feasible policies.", "paper_title": "An MDP-Based Dynamic Optimization Methodology for Wireless Sensor Networks", "paper_id": "WOS:000300981100006"}