{"auto_keywords": [{"score": 0.03671879024692415, "phrase": "modeling_applications"}, {"score": 0.03172587391971231, "phrase": "mixed_finite_elements"}, {"score": 0.00481495049065317, "phrase": "variational_surface_modeling"}, {"score": 0.004732785510739708, "phrase": "geometric_modeling"}, {"score": 0.004632039024076267, "phrase": "variational_formulations"}, {"score": 0.004159446063902181, "phrase": "boundary_conditions"}, {"score": 0.003916098498242888, "phrase": "high-order_geometric_pdes"}, {"score": 0.0037028514035425037, "phrase": "high-order_problems"}, {"score": 0.003441352119167824, "phrase": "preferred_approach"}, {"score": 0.003382547312072468, "phrase": "discrete_geometric_schemes"}, {"score": 0.003170811465728631, "phrase": "higher-order_fem."}, {"score": 0.003050166508545763, "phrase": "common_geometric_pdes"}, {"score": 0.00295950473406239, "phrase": "additional_variables"}, {"score": 0.002810292047426252, "phrase": "first-order_derivatives"}, {"score": 0.002726740692380339, "phrase": "simple_linear_elements"}, {"score": 0.0025780912201045555, "phrase": "continuous_region_constraints"}, {"score": 0.002427035025924384, "phrase": "mixed_framework"}, {"score": 0.0023447155524245655, "phrase": "commonly_used_discrete_geometric_discretizations"}, {"score": 0.0022848092812445533, "phrase": "particular_case"}, {"score": 0.0022168460543913787, "phrase": "convergence_behavior"}, {"score": 0.0021049977753042253, "phrase": "common_modeling_tasks"}], "paper_keywords": [""], "paper_abstract": "Many problems in geometric modeling can be described using variational formulations that define the smoothness of the shape and its behavior w.r.t. the posed modeling constraints. For example, high-quality C(2) surfaces that obey boundary conditions on positions, tangents and curvatures can be conveniently defined as solutions of high-order geometric PDEs; the advantage of such a formulation is its conceptual representation-independence. In practice, solving high-order problems efficiently and accurately for surfaces approximated by meshes is notoriously difficult. For modeling applications, the preferred approach is to use discrete geometric schemes which are efficient and robust, but their convergence properties are less well understood compared to higher-order FEM. In this paper, we explore discretizations of common geometric PDEs on meshes using mixed finite elements, where additional variables for the derivatives in the problem are introduced. Such formulations use first-order derivatives only, allowing a discretization with simple linear elements. Various boundary conditions can be naturally discretized in this setting. We formalize continuous region constraints commonly used in modeling applications, and show that these seamlessly fit into the mixed framework. We demonstrate that some of the commonly used discrete geometric discretizations can be regarded as a particular case of mixed finite elements. We study the convergence behavior of our discretizations, and how they can be applied to implement common modeling tasks.", "paper_title": "Mixed Finite Elements for Variational Surface Modeling", "paper_id": "WOS:000282019900007"}