{"auto_keywords": [{"score": 0.040893292607649186, "phrase": "deteriorating_maintenance"}, {"score": 0.00481495049065317, "phrase": "deteriorating_maintenance_activity"}, {"score": 0.004487541157100498, "phrase": "maintenance_activity"}, {"score": 0.00440403952059725, "phrase": "new_setting"}, {"score": 0.00432208488976429, "phrase": "maintenance_duration"}, {"score": 0.003807242767474929, "phrase": "due-window_assignment"}, {"score": 0.0037363522297378777, "phrase": "time_interval"}, {"score": 0.0034332736827447654, "phrase": "known_models"}, {"score": 0.0031399038722901788, "phrase": "maintenance_time"}, {"score": 0.002765490759189057, "phrase": "classical_assumption"}, {"score": 0.0027395968397212053, "phrase": "position-independent_processing_times"}, {"score": 0.0025892330566358503, "phrase": "general_position-dependent_processing_times"}, {"score": 0.002493592357827492, "phrase": "optimal_timing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Deteriorating maintenance activity", " Due-window", " Assignment problem", " Earliness-Tardiness", " Learning effect"], "paper_abstract": "Several papers published during the last decade dealt with scheduling a maintenance activity and considered a new setting, where the maintenance duration is assumed to be deteriorating, i.e., it requires more time or effort if it is delayed. We study a deteriorating maintenance in the context of due-window assignment, where a time interval is determined such that jobs completed within this interval are \"ontime\", whereas early and tardy jobs are penalized. Thus, our paper extends known models by considering simultaneously a deteriorating maintenance and due-window. Two deterioration types are considered: time-dependent (where the maintenance time increases as a function of its starting time), and position-dependent (where it is a function of its position in the sequence). The classical assumption of position-independent processing times was considered first, and then the model is extended to general position-dependent processing times. We prove several properties of the optimal timing of the due-window and of the maintenance. Consequently, we show that all the problems studied here are solved in 0(n(4)), where n is the number of jobs. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Scheduling a deteriorating maintenance activity and due-window assignment", "paper_id": "WOS:000350535600003"}