{"auto_keywords": [{"score": 0.04969278858326932, "phrase": "ofe"}, {"score": 0.04044227104335156, "phrase": "partial_signature"}, {"score": 0.008462078526662567, "phrase": "aofe"}, {"score": 0.00802956579932301, "phrase": "generic_construction"}, {"score": 0.00481495049065317, "phrase": "optimistic_fair_exchange"}, {"score": 0.004476399615305783, "phrase": "fair_manner"}, {"score": 0.003964007795174772, "phrase": "almost_all_the_previous_work"}, {"score": 0.0029965060407413898, "phrase": "ambiguous_optimistic_fair_exchange"}, {"score": 0.002599763359352916, "phrase": "formal_security_model"}, {"score": 0.002547535564922075, "phrase": "multi-user_setting"}, {"score": 0.0023016843709107297, "phrase": "efficient_instantiation"}, {"score": 0.0022011501095573747, "phrase": "strong_diffie-hellman_assumption"}, {"score": 0.002183347623351868, "phrase": "decision_linear"}, {"score": 0.0021569129153653777, "phrase": "random_oracles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Optimistic fair exchange", " Ambiguity", " Signature", " NIZK proof", " Standard model"], "paper_abstract": "Optimistic fair exchange (OFE) is a protocol for solving the problem of exchanging items or services in a fair manner between two parties, a signer and a verifier, with the help of an arbitrator which is called in only when a dispute happens between the two parties. In almost all the previous work on OFE, after obtaining a partial signature from the signer, the verifier can present it to others and show that the signer has indeed committed itself to something corresponding to the partial signature even prior to the completion of the transaction. In some scenarios, this capability given to the verifier may be harmful to the signer. In this paper, we propose the notion of ambiguous optimistic fair exchange (AOFE), which is a variant of OFE and requires additionally that the verifier cannot convince anybody about the authorship of a partial signature generated by the signer. We present a formal security model for AOFE in the multi-user setting and chosen-key model, and propose a generic construction of AOFE that is provably secure under our model. Furthermore, we propose an efficient instantiation of the generic construction, security of which is based on Strong Diffie-Hellman assumption and Decision Linear assumption without random oracles. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Ambiguous optimistic fair exchange: Definition and constructions", "paper_id": "WOS:000347602000014"}