{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "purchased_bundle"}, {"score": 0.00481495049065317, "phrase": "revealed_preferences_feedback"}, {"score": 0.004758987153057194, "phrase": "stackelberg_game"}, {"score": 0.004055998173160551, "phrase": "follower's_best_response"}, {"score": 0.004024500884681969, "phrase": "stackelberg"}, {"score": 0.0034971932704828197, "phrase": "utility-maximizing_bundle"}, {"score": 0.0029916929549256297, "phrase": "buyer's_utility_function"}, {"score": 0.002888396879326153, "phrase": "revealed_preference_feedback"}, {"score": 0.002619748321217153, "phrase": "computational_and_query_complexity"}, {"score": 0.0025892330566358503, "phrase": "broad_class"}, {"score": 0.0025690867646665835, "phrase": "stackelberg_games"}, {"score": 0.0025292620341476283, "phrase": "follower's_utility_function"}, {"score": 0.0024040357029838774, "phrase": "profit_maximization_problem"}, {"score": 0.00234834406550549, "phrase": "optimal_tolling_problem"}, {"score": 0.0023300677028248776, "phrase": "nonatomic_congestion_games"}, {"score": 0.0022939396079753463, "phrase": "latency_functions"}, {"score": 0.002154930852763048, "phrase": "corresponding_maximization_problems"}, {"score": 0.0021049977753042253, "phrase": "leader's_actions"}], "paper_keywords": [""], "paper_abstract": "A Stackelberg game is played between a leader and a follower. The leader first chooses an action, and then the follower plays his best response, and the goal of the leader is to pick the action that will maximize his payoff given the follower's best response. Stackelberg games capture, for example, the following interaction between a retailer and a buyer. The retailer chooses the prices of the goods he produces, and then the buyer chooses to buy a utility-maximizing bundle of goods. The goal of the retailer here is to set prices to maximize his profit his revenue minus the production cost of the purchased bundle. It is quite natural that the retailer in this example would not know the buyer's utility function. However, he does have access to revealed preference feedback he can set prices, and then observe the purchased bundle and his own profit. We give algorithms for efficiently solving, in terms of both computational and query complexity, a broad class of Stackelberg games in which the follower's utility function is unknown, using only \"revealed preference\" access to it. This class includes the profit maximization problem, as well as the optimal tolling problem in nonatomic congestion games, when the latency functions are unknown. Surprisingly, we are able to solve these problems even though the corresponding maximization problems are not concave in the leader's actions.", "paper_title": "Watch and Learn: Optimizing from Revealed Preferences Feedback", "paper_id": "WOS:000368182200007"}