{"auto_keywords": [{"score": 0.04019018908324452, "phrase": "gene_expression_distribution"}, {"score": 0.031158117196866168, "phrase": "proposed_methodology"}, {"score": 0.004815218631132883, "phrase": "bayes"}, {"score": 0.0047464608267006395, "phrase": "replicated_microarray_data"}, {"score": 0.0047013405841819025, "phrase": "dna_microarray"}, {"score": 0.004546755482549647, "phrase": "important_tool"}, {"score": 0.00409310463335204, "phrase": "different_conditions"}, {"score": 0.004034841146538891, "phrase": "novel_method"}, {"score": 0.003939565240409143, "phrase": "replicated_microarray_experiments"}, {"score": 0.0037377733149169573, "phrase": "alpha-stable_distributions"}, {"score": 0.0035632774896594524, "phrase": "gene_expression"}, {"score": 0.00349577373145384, "phrase": "pareto_tails"}, {"score": 0.0029853535424953595, "phrase": "alpha-stable_density"}, {"score": 0.0028053237950173508, "phrase": "scale_mixture"}, {"score": 0.002739001004969201, "phrase": "bayesian_log-posterior_odds"}, {"score": 0.0024534993283766332, "phrase": "simulated_and_experimental_data"}, {"score": 0.0023388183537341213, "phrase": "proposed_heavy-tail_model"}, {"score": 0.00220823903315848, "phrase": "gene_data"}, {"score": 0.0021049977753042253, "phrase": "high_variance"}], "paper_keywords": [""], "paper_abstract": "DNA microarray has been recognized as being an important tool for studying the expression of thousands of genes simultaneously. These experiments allow us to compare two different samples of cDNA obtained under different conditions. A novel method for the analysis of replicated microarray experiments based upon the modelling of gene expression distribution as a mixture of alpha-stable distributions is presented. Some features of the distribution of gene expression, such as Pareto tails and the fact that the variance of any given array increases concomitantly with an increase in the number of genes studied, suggest the possibility of modelling gene expression distribution on the basis of alpha-stable density. The proposed methodology uses very well known properties of astable distribution, such as the scale mixture of normals. A Bayesian log-posterior odds is calculated, which allows us to decide whether a gene is expressed differentially or not. The proposed methodology is illustrated using simulated and experimental data and the results are compared with other existing statistical approaches. The proposed heavy-tail model improves the performance of other distributions and is easily applicable to microarray gene data, specially if the dataset contains outliers or presents high variance between replicates. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A heavy-tailed empirical Bayes method for replicated microarray data", "paper_id": "WOS:000264751000002"}