{"auto_keywords": [{"score": 0.03983296937316375, "phrase": "john"}, {"score": 0.00481495049065317, "phrase": "qualitative_attributes"}, {"score": 0.004536244367689415, "phrase": "numeric_values"}, {"score": 0.004440648141548589, "phrase": "inconsistent_measurements"}, {"score": 0.004219321533320583, "phrase": "new_way"}, {"score": 0.0039077616208517026, "phrase": "non-numeric_fact"}, {"score": 0.0033232673019931206, "phrase": "hair_color"}, {"score": 0.0031981188104809994, "phrase": "divergent_observations"}, {"score": 0.002936577024096783, "phrase": "qualitative_features"}, {"score": 0.0026620655619396263, "phrase": "available_information"}, {"score": 0.0022346638243276717, "phrase": "perception_errors"}, {"score": 0.002187464225869713, "phrase": "limited_accuracy"}, {"score": 0.002159623311924437, "phrase": "individual_findings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["1.2.4 Knowledge representation", " Qualitative values", " Inconsistency", " Confusion", " Consensus", " Truth discovery"], "paper_abstract": "It is clear how to compute the average of a set of numeric values; thus, handling inconsistent measurements is possible. Recently, using confusion, we showed a new way to compute the consensus (a kind of average) of a set of assertions about a non-numeric fact, such as the religion of John. This paper solves the same problem for a set of objects possessing several symbolic attributes. Suppose there is a murder, and we ask several observers about the height, sex, hair color and ethnicity of the killer. They report divergent observations. What is the most likely portrayal of the assassin? Given a bag of assertions about an object described by qualitative features, this paper tells how to assess the most plausible or \"consensus\" object description. It is the most likely description to be true, given the available information. It is the \"centroid\" of the bag. We also compute the inconsistency of the bag: how far apart the testimonies in the bag are. All observers are equally credible, so differences arise from perception errors, and from the limited accuracy of the individual findings. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "The centroid or consensus of a set of objects with qualitative attributes", "paper_id": "WOS:000287419900028"}