{"auto_keywords": [{"score": 0.03786304727683625, "phrase": "compatible_scales"}, {"score": 0.013953327805685988, "phrase": "majority_property"}, {"score": 0.00481495049065317, "phrase": "incommensurable_framework"}, {"score": 0.004782848614014638, "phrase": "different_methods"}, {"score": 0.004687815426832587, "phrase": "multiple_and_potentially_conflicting_information"}, {"score": 0.004564021871465994, "phrase": "so-called_\"sum\"_operation"}, {"score": 0.004458375125223899, "phrase": "commensurable_prioritized_belief_bases"}, {"score": 0.004197758831410097, "phrase": "non-cautious_attitude"}, {"score": 0.004155822339559211, "phrase": "plausible_conclusions"}, {"score": 0.004073196909500369, "phrase": "sum-based_merging_operator"}, {"score": 0.0037461743696712833, "phrase": "obtained_merging_operator"}, {"score": 0.003622811707147052, "phrase": "infinite_set"}, {"score": 0.0035388743851813512, "phrase": "well-known_pareto"}, {"score": 0.0034684722988160637, "phrase": "propositional_logic_interpretations"}, {"score": 0.003343007152920687, "phrase": "different_commensurability_hypothesis"}, {"score": 0.0032546105164772995, "phrase": "postulate-based_analysis"}, {"score": 0.0029237213120317227, "phrase": "fairness_postulate"}, {"score": 0.00287514090358681, "phrase": "unique_postulate"}, {"score": 0.0027525658515943985, "phrase": "new_postulate"}, {"score": 0.002644050667977234, "phrase": "merging_process"}, {"score": 0.00242335068996852, "phrase": "incommensurable_case"}, {"score": 0.0023750878480559307, "phrase": "fairness_and_consensuality_postulates"}, {"score": 0.0022661710658109916, "phrase": "impossibility_theorem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Belief merging", " Ranked belief bases", " Incommensurability", " Consensuality"], "paper_abstract": "Different methods have been proposed for merging multiple and potentially conflicting information. The merging process based on the so-called \"Sum\" operation offers a natural method for merging commensurable prioritized belief bases. Their popularity is due to the fact that they satisfy the majority property and they adopt a non-cautious attitude in deriving plausible conclusions. This paper analyzes the sum-based merging operator when sources to merge are incommensurable, namely when they do not share the same meaning of uncertainty scales. We first show that the obtained merging operator can be equivalently characterized either in terms of an infinite set of compatible scales, or by a well-known Pareto ordering on a set of propositional logic interpretations. We also study some restrictions on compatible scales based on different commensurability hypothesis. Moreover, this paper provides a postulate-based analysis of our merging operators. We show that when prioritized bases to merge are not commensurable, the majority property is no longer satisfied. We provide conditions to recovering it. We also analyze the fairness postulate, which represents the unique postulate unsatisfied when belief bases to merge are commensurable and we propose a new postulate of consensuality. This postulate states that the result of the merging process must be consensual. It obtains the consent of all parties by integrating a piece of belief of each base. Finally, in the incommensurable case, we show that the fairness and consensuality postulates are satisfied when all compatible scales are considered. However, we provide an impossibility theorem stating that there is no way to satisfy fairness and consensuality postulates if only one canonical compatible scale is considered. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Sum-based weighted belief base merging: From commensurable to incommensurable framework", "paper_id": "WOS:000343853800013"}