{"auto_keywords": [{"score": 0.04349398232170127, "phrase": "vlsi_modules"}, {"score": 0.03469246557285302, "phrase": "bottom-up_hierarchy"}, {"score": 0.00481495049065317, "phrase": "bottom-up_vlsi_placements"}, {"score": 0.004766877640444116, "phrase": "new_perturbation_method"}, {"score": 0.0047192824773697, "phrase": "hierarchical-congregated_ant_system"}, {"score": 0.004533585346030341, "phrase": "variable-order_bottom-up_placement"}, {"score": 0.004503352884480204, "phrase": "vlsi."}, {"score": 0.004384407114103125, "phrase": "ant_colonies"}, {"score": 0.00412809672402551, "phrase": "hard_modules"}, {"score": 0.003992207640169795, "phrase": "soft_modules"}, {"score": 0.003822191555851545, "phrase": "area-based_two-dimensional_cost_function"}, {"score": 0.0036107002958650344, "phrase": "local_optima_problems"}, {"score": 0.003562656752692045, "phrase": "global_view"}, {"score": 0.0035270425911920595, "phrase": "major_drawback"}, {"score": 0.0034917831997090328, "phrase": "conventional_bottom-up_hierarchy"}, {"score": 0.003343007152920687, "phrase": "global_information"}, {"score": 0.0032546105164772995, "phrase": "new_relative_whitespace_formula"}, {"score": 0.0027159094186967247, "phrase": "newly_constructed_group"}, {"score": 0.0026088355715432523, "phrase": "subsequent_search_space"}, {"score": 0.002548331088496964, "phrase": "best-so-far_near_optimal_solutions"}, {"score": 0.0024478477463201302, "phrase": "microelectronics_center_of_north_carolina"}, {"score": 0.002431489442632083, "phrase": "mcnc"}, {"score": 0.002391067964886602, "phrase": "systems_research_center"}, {"score": 0.0022814200422609774, "phrase": "high_performance_placer"}], "paper_keywords": ["Ant colony optimization", " VLSI", " Floorplanning", " Bottom-up hierarchy"], "paper_abstract": "A new perturbation method, called Hierarchical-Congregated Ant System (H-CAS) has been proposed to perform the variable-order bottom-up placement for VLSI. H-CAS exploits the concept of ant colonies, where each ant will generate the perturbation based on differences in dimensions of the VLSI modules in hard modules floorplanning and differences in area of the VLSI modules in soft modules floorplanning. In this paper, it is mathematically proved that the area-based two-dimensional cost function for hard modules floorplanning problem can be reduced to the difference-based one dimensional cost function which avoids local optima problems. Lack of global view is a major drawback in the conventional bottom-up hierarchy, and hence, ants in the H-CAS are made to introduce global information at every level of bottom-up hierarchy. A new relative whitespace formula for bottom-up hierarchy is derived mathematically and the H-CAS embeds it in its unique update formula. The ants in H-CAS are able to communicate among themselves and update the pheromone trails when they reach the destination. Then, the ants will congregate, share their experiences and construct a new pheromone trails that belong to this newly constructed group. The congregation of at least two ants and/or ant consortiums would lead to reduction in subsequent search space and complexity. H-CAS gives the best-so-far near optimal solutions and yields low standard deviations of areas involving 9-600 blocks based on Microelectronics Center of North Carolina (MCNC) and Giga scale Systems Research Center (GSRC) benchmarks. The results obtained establish that H-CAS is a high performance placer in respect of scaling, convergence, precision, stability, and reliability. The above claims are based on the comparisons with the other floorplanning algorithms as depicted graphically. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Hierarchical congregated ant system for bottom-up VLSI placements", "paper_id": "WOS:000313855000050"}