{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "customer_satisfaction"}, {"score": 0.010612387000973441, "phrase": "integration_difficulties"}, {"score": 0.005938084679662732, "phrase": "integration_level"}, {"score": 0.004664352260912174, "phrase": "management_systems"}, {"score": 0.00422516469733364, "phrase": "relevant_issues"}, {"score": 0.003642523806177967, "phrase": "iso"}, {"score": 0.003591272267478512, "phrase": "quality_mss"}, {"score": 0.0035659724303237937, "phrase": "environmental_mss"}, {"score": 0.003503497128638099, "phrase": "exploratory_factor_analysis"}, {"score": 0.003478813491904962, "phrase": "structural_equation"}, {"score": 0.003334309053314909, "phrase": "proposed_scales_validity"}, {"score": 0.003264316172836322, "phrase": "conceptual_model"}, {"score": 0.0031845067058084583, "phrase": "empirical_study"}, {"score": 0.0029775511937434797, "phrase": "ms_documentation"}, {"score": 0.0026682872124177233, "phrase": "ms_human_resources"}, {"score": 0.0026214978443388653, "phrase": "direct_relationships"}, {"score": 0.00241658945942583, "phrase": "ms_procedures"}, {"score": 0.002275477757478827, "phrase": "first_studies"}, {"score": 0.0021049977753042253, "phrase": "integrated_mss"}], "paper_keywords": ["Innovation", " ISO 14001", " Customer satisfaction", " ISO 9001", " Integration of management systems standards", " Management systems standards"], "paper_abstract": "Purpose - The difficulties in the integration of management systems (MSs) and their relationship with innovation and customer satisfaction are explored by proposing a model that links these three concepts together. Integration, innovation and customer satisfaction are relevant issues for the competitiveness of companies, especially for the ones that have implemented several MS standards. The paper aims to discuss these issues. Design/methodology/approach - Data for the study derives from a survey carried out in 76 Spanish organizations registered to at least both ISO 9001:2008 and ISO 14001:2004 standards for quality MSs and environmental MSs, respectively. An exploratory factor analysis and structural equation modeling (SEM) are utilized to assess and confirm the proposed scales validity and the relationships of the conceptual model. Findings - Based on the empirical study, the second-order SEM shows that the difficulties of integration are directly and negatively related to both of MS documentation and procedures. This level is also directly related to the innovation and satisfaction. Nevertheless, no relationships were found between the difficulties of integration and the integration level of MS human resources. Moreover, no direct relationships were found between the difficulties of integration and both the constructs of innovation and satisfaction. Also, the results showed the integration level of MS procedures was not related to the construct of innovation. Originality/value - This is one of the first studies to relate integration difficulties with innovation and customer satisfaction, with a conclusion that an organization should give more importance to the difficulties of integrated MSs that have been uncovered to have a relationship with innovation and customer satisfaction.", "paper_title": "Can integration difficulties affect innovation and satisfaction?", "paper_id": "WOS:000331849400002"}