{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "machine_learning_systems"}, {"score": 0.004706895428234964, "phrase": "machine_learning"}, {"score": 0.004695270896279172, "phrase": "rich_interactions"}, {"score": 0.0045804107341714, "phrase": "today's_software"}, {"score": 0.004417012437860011, "phrase": "end_users"}, {"score": 0.003942877273973905, "phrase": "users'_understanding"}, {"score": 0.0037336520904376687, "phrase": "learning_systems"}, {"score": 0.003378385493203297, "phrase": "first_experiment"}, {"score": 0.0033326252993345685, "phrase": "think-aloud_study"}, {"score": 0.003287482882222731, "phrase": "users'_willingness"}, {"score": 0.0032282396745967504, "phrase": "machine_learning_reasoning"}, {"score": 0.0031556799865964974, "phrase": "feedback_users"}, {"score": 0.0027910516355928983, "phrase": "user_feedback"}, {"score": 0.0022951216874671516, "phrase": "rich_human-computer_collaboration"}, {"score": 0.002203016940021265, "phrase": "promising_direction"}, {"score": 0.0021436720821474973, "phrase": "collaboratively_share_intelligence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Intelligent user interfaces", " Rich feedback", " Explanations", " Machine learning"], "paper_abstract": "Although machine learning is becoming commonly used in today's software, there has been little research into how end users might interact with machine learning systems, beyond communicating simple \"right/wrong\" judgments. If the users themselves could work hand-in-hand with machine learning systems, the users' understanding and trust of the system could improve and the accuracy of learning systems could be improved as well. We conducted three experiments to understand the potential for rich interactions between users and machine learning systems. The first experiment was a think-aloud study that investigated users' willingness to interact with machine learning reasoning, and what kinds of feedback users might give to machine learning systems. We then investigated the viability of introducing such feedback into machine learning systems, specifically, how to incorporate some of these types of user feedback into machine learning systems, and what their impact was on the accuracy of the system. Taken together, the results of our experiments show that supporting rich interactions between users and machine learning systems is feasible for both user and machine. This shows the potential of rich human-computer collaboration via on-the-spot interactions as a promising direction for machine learning systems and users to collaboratively share intelligence. Published by Elsevier Ltd.", "paper_title": "Interacting meaningfully with machine learning systems: Three experiments", "paper_id": "WOS:000267732400003"}