{"auto_keywords": [{"score": 0.04959913342990779, "phrase": "ofdma_femtocell_networks"}, {"score": 0.03250599422606808, "phrase": "femtocell_networks"}, {"score": 0.00481495049065317, "phrase": "interference_management"}, {"score": 0.004578382275810468, "phrase": "effective_techniques"}, {"score": 0.0043533862892678864, "phrase": "data_rate"}, {"score": 0.004309725894724034, "phrase": "cellular_wireless_networks"}, {"score": 0.004202472962684885, "phrase": "cell_size"}, {"score": 0.0037423521744765075, "phrase": "growing_interests"}, {"score": 0.003522579870903474, "phrase": "mass_deployment"}, {"score": 0.0034003686971964707, "phrase": "recent_literature"}, {"score": 0.003366233863411861, "phrase": "interference_mitigation"}, {"score": 0.003332440548684892, "phrase": "neighboring_femtocells"}, {"score": 0.003105168935158648, "phrase": "major_challenges"}, {"score": 0.0028933521924166287, "phrase": "conventional_radio_resource_management_techniques"}, {"score": 0.0026023381988430666, "phrase": "users'_service_requirement"}, {"score": 0.0023405257495466352, "phrase": "resource_management"}, {"score": 0.002137137933768807, "phrase": "open_challenges"}, {"score": 0.0021049977753042253, "phrase": "interference_management_schemes"}], "paper_keywords": [""], "paper_abstract": "One of the effective techniques of improving the coverage and enhancing the capacity and data rate in cellular wireless networks is to reduce the cell size (i.e., cell splitting) and transmission distances. Therefore, the concept of deploying femtocells over macrocell has recently attracted growing interests in academia, industry, and standardization forums. Various technical challenges towards mass deployment of femtocells have been addressed in recent literature. Interference mitigation between neighboring femtocells and between the femtocell and macrocell is considered to be one of the major challenges in femtocell networks because femtocells share the same licensed frequency spectrum with macrocell. Further, the conventional radio resource management techniques for hierarchical cellular system is not suitable for femtocell networks since the positions of the femtocells are random depending on the users' service requirement. In this article, we provide a survey of the different state-of-the-art approaches for interference and resource management in orthogonal frequency-division multiple access (OFDMA)-based femtocell networks. A qualitative comparison among the different approaches is provided. To this end, open challenges in designing interference management schemes for OFDMA femtocell networks are discussed.", "paper_title": "INTERFERENCE MANAGEMENT IN OFDMA FEMTOCELL NETWORKS: ISSUES AND APPROACHES", "paper_id": "WOS:000306181900010"}