{"auto_keywords": [{"score": 0.041848501542744734, "phrase": "pd_patients"}, {"score": 0.00481495049065317, "phrase": "parkinson's_disease_patients_benefits"}, {"score": 0.004744748477093856, "phrase": "context-triggered_acoustic_cueing"}, {"score": 0.004590496414177077, "phrase": "advanced_parkinson's_disease"}, {"score": 0.004328494656899359, "phrase": "sudden_and_transient_inability"}, {"score": 0.004157058883925715, "phrase": "daily_activities"}, {"score": 0.004021835438784141, "phrase": "gait_deficits"}, {"score": 0.00391969808162005, "phrase": "pharmacologic_treatment"}, {"score": 0.0038909934410379775, "phrase": "effective_non-pharmacologic_treatments"}, {"score": 0.0036285315458900284, "phrase": "wearable_device"}, {"score": 0.0035755653799043, "phrase": "real-time_gait_data"}, {"score": 0.003459191419478298, "phrase": "pre-determined_specifications"}, {"score": 0.0033712944392793195, "phrase": "real-time_wearable_fog_detection_system"}, {"score": 0.0027844017803674444, "phrase": "professional_physiotherapists"}, {"score": 0.00275383721396097, "phrase": "post-hoc_video_analysis"}, {"score": 0.002693708217226793, "phrase": "fog_events"}, {"score": 0.0024660058541899647, "phrase": "online_assistive_feedback"}, {"score": 0.00226583335721762, "phrase": "wearable_assistant"}, {"score": 0.002159951198924152, "phrase": "next_research_steps"}], "paper_keywords": ["Pervasive health", " wearable system", " Parkinson's disease"], "paper_abstract": "Background: About 50% of the patients with advanced Parkinson's disease (PD) suffer from freezing of gait (FOG), which is a sudden and transient inability to walk. it often causes falls, interferes with daily activities and significantly impairs quality of life. Because gait deficits in PD patients are often resistant to pharmacologic treatment, effective non-pharmacologic treatments are of special interest. Objectives: The goal of our study is to evaluate the concept of a wearable device that can obtain real-time gait data, processes them and provides asistance based on pre-determined specifications. Methods: We developed a real-time wearable FOG detection system that automatically provides a cueing sound when FOG is detected and which stays until the subject resumes walking. We evaluated our wearable assistive technology in a study with 10 PD patients. Over eight hours of data was recorded and a questionnaire was filled out by each patient. Results: Two hundred and thirty-seven FOG events have been identified by professional physiotherapists in a post-hoc video analysis, The device detected the FOG events online with a sensitivity of 73.1% and a specificity of 81.6% on a 0.5 sec frame-based evaluation. Conclusions: With this study we show that online assistive feedback for PD patients is possible. We present and discuss the patients' and physiotherapists' perspectives on wearabilty and performance of the wearable assistant as well as their gait performance when using the assistant and point out the next research steps. our results demonstrate the benefit of such a context-aware system and motivate further studies.", "paper_title": "A Wearable System to Assist Walking of Parkinson's Disease Patients Benefits and Challenges of Context-triggered Acoustic Cueing", "paper_id": "WOS:000274131600012"}