{"auto_keywords": [{"score": 0.03528278775652248, "phrase": "dynamical_neural_field"}, {"score": 0.02819827616624647, "phrase": "amari's_dynamical_neural_field"}, {"score": 0.012563794832660583, "phrase": "stationary_solution"}, {"score": 0.006002048821156723, "phrase": "typical_kernel"}, {"score": 0.005128734520873853, "phrase": "global_constant_inhibitory_kernel"}, {"score": 0.004053362743156545, "phrase": "unsupervised_learning"}, {"score": 0.0036733470451885465, "phrase": "underlying_patterns"}, {"score": 0.003531474887552889, "phrase": "excited_region"}, {"score": 0.002760539837481164, "phrase": "better_performance"}, {"score": 0.002640781900605126, "phrase": "important_results"}, {"score": 0.002346160830406661, "phrase": "better_potential"}, {"score": 0.0022443390559699974, "phrase": "typical_kernels"}, {"score": 0.0021896891011033105, "phrase": "theoretical_basis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Dynamical neural field", " Stationary solution", " Interaction kernel", " Global inhibition"], "paper_abstract": "In this paper, the properties of Amari's dynamical neural field with global constant inhibition induced by its kernel are investigated. Amari's dynamical neural field illustrates many neurophysiological phenomena successfully and has been applied to unsupervised learning like data clustering in recent years. In its applications, the stationary solution to Amari's dynamical neural field plays an important role that the underlying patterns being perceived are usually presented as the excited region in it. However, the type of stationary solution to dynamical neural field with typical kernel is often sensitive to parameters of its kernel that limits its range of application. Different from dynamical neural field with typical kernel that have been discussed a lot, there are few theoretical results on dynamical neural field with global constant inhibitory kernel that has already shown better performance in practice. In this paper, some important results on existence and stability of stationary solution to dynamical neural field with global constant inhibitory kernel are obtained. All of these results show that such kind of dynamical neural field has better potential for missions like data clustering than those with typical kernels, which provide a theoretical basis of its further extensive application. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Investigation on Amari's dynamical neural field with global constant inhibition", "paper_id": "WOS:000364160900017"}