{"auto_keywords": [{"score": 0.04712099133214375, "phrase": "uk"}, {"score": 0.008947976393355981, "phrase": "srif"}, {"score": 0.005382533792213844, "phrase": "scientific_applications"}, {"score": 0.00481495049065317, "phrase": "ubiquitous_position"}, {"score": 0.004799253507802844, "phrase": "commodity_clusters"}, {"score": 0.004775803470470524, "phrase": "hpc_capabilities"}, {"score": 0.004752467467173928, "phrase": "scientific_community"}, {"score": 0.004459230141723797, "phrase": "current_high-performance_computing"}, {"score": 0.00439418019092714, "phrase": "hpc"}, {"score": 0.004252923737320014, "phrase": "internationally_competitive_position"}, {"score": 0.004211441113293312, "phrase": "hpc_dynamic"}, {"score": 0.004109488862614141, "phrase": "major_injection"}, {"score": 0.004082719204272308, "phrase": "university_hpc_sector"}, {"score": 0.004003447787882459, "phrase": "major_provider"}, {"score": 0.003990385737207714, "phrase": "hpc_resources"}, {"score": 0.003970872207239332, "phrase": "uk_research_base"}, {"score": 0.003862077401267406, "phrase": "hpc_integrators"}, {"score": 0.003774714985489891, "phrase": "hpc_service_providers"}, {"score": 0.003713521276572151, "phrase": "host_sites"}, {"score": 0.0036832960694422765, "phrase": "selected_integrator_aim"}, {"score": 0.0036592924763139915, "phrase": "entire_process"}, {"score": 0.0036295070419452903, "phrase": "system_installation"}, {"score": 0.0036176606163976026, "phrase": "subsequent_lifetime"}, {"score": 0.0034955755279605146, "phrase": "necessary_level"}, {"score": 0.0034164751616551437, "phrase": "ongoing_support"}, {"score": 0.003361069456060196, "phrase": "current_hpc_technology_roadmaps"}, {"score": 0.003295763459241421, "phrase": "undoubted_challenges"}, {"score": 0.0032689273229219197, "phrase": "crucial_issues"}, {"score": 0.0032529303004879325, "phrase": "potential_integrator_involvement"}, {"score": 0.003221169966797793, "phrase": "hardware_solution"}, {"score": 0.003143114927866027, "phrase": "ongoing_robustness"}, {"score": 0.003132851056265898, "phrase": "open-source_software_solutions"}, {"score": 0.0029975152932436144, "phrase": "in-depth_analysis"}, {"score": 0.002982842494497382, "phrase": "current_status"}, {"score": 0.0029440641784511516, "phrase": "leading_rpc_integrators"}, {"score": 0.0029296579205432124, "phrase": "uk."}, {"score": 0.0028774077667679957, "phrase": "academic_community"}, {"score": 0.0028076592725295646, "phrase": "ocf."}, {"score": 0.0026775573310474183, "phrase": "commodity-based_systems"}, {"score": 0.0026688096720559325, "phrase": "scientific_and_technical_computing"}, {"score": 0.002578662558305782, "phrase": "optimum_technology"}, {"score": 0.0025202582748972122, "phrase": "synthetic_and_application-based_floating-point_metrics"}, {"score": 0.00247935055073462, "phrase": "performance_measurements"}, {"score": 0.0024672078850634296, "phrase": "independent_tests"}, {"score": 0.002419227571086867, "phrase": "active_use"}, {"score": 0.002372178121517874, "phrase": "performance_characteristics"}, {"score": 0.0022733458660249635, "phrase": "application_performance"}, {"score": 0.0022401007567642347, "phrase": "existing_workloads"}, {"score": 0.0022291272030035736, "phrase": "srif_hpc_sector"}, {"score": 0.0022109570100232352, "phrase": "program_structures"}, {"score": 0.002192934601469313, "phrase": "computational_engineering"}, {"score": 0.0021821915946356168, "phrase": "materials_simulation"}, {"score": 0.002136242127739835, "phrase": "important_considerations"}, {"score": 0.002125776260994065, "phrase": "hpc_clusters"}, {"score": 0.0021049977753042253, "phrase": "mid-to-high-end_range"}], "paper_keywords": [""], "paper_abstract": "This chapter considers the ubiquitous position of commodity clusters in providing HPC capabilities to the scientific community, and the many issues faced by organizations when deciding how best to procure, maintain, and maximize the usage of such a resource. With a focus on developments within the UK, we provide an overview of the current high-performance computing (HPC) landscape from both the customer and supplier perspective. Historically HPC provision in the UK has been focused on one or two leading-edge national facilities that have helped the UK to develop and maintain an internationally competitive position in research using HPC. This HPC dynamic has, however, changed dramatically in the period 2005-2008 with the major injection of funding into University HPC sector through the Science Research Investment Fund (SRIF). This sector is now the major provider of HPC resources to the UK research base, with the capability of the sector increased 100-fold. Our primary focus lies on the role of HPC Integrators in supplying resources into this sector, and the challenges faced by the HPC service providers themselves in sustaining and growing these activities. The host sites through partnership with the selected integrator aim to maximize this entire process, from procurement through system installation and subsequent lifetime of the service. We ask whether those integrators based primarily in the UK have the ability to provide the necessary level of expertise required in all phases of the process, from procurement to ongoing support of the resource throughout its lifecycle. We consider how current HPC technology roadmaps might impinge on the role of integrators in responding to the undoubted challenges that lie ahead. Crucial issues when considering potential integrator involvement include both size of the hardware solution, that is, number of cores, number of nodes, and the ongoing robustness of open-source software solutions that might be deployed on these platforms. Informed by developments over the past 24 months associated with the deployment of systems funded under SRIF, we provide an in-depth analysis of the current status and capability of a number of the leading RPC Integrators within the UK. Our primary attention is given to the three major companies who now supply the academic community and hence are well known to us-Streamline Computing, ClusterVision, and OCF. Seven other integrators are also considered, albeit with less rigor. Consideration is also given to several of the Tier-1 suppliers of clusters. In reviewing the status of commodity-based systems in scientific and technical computing, systems representative of those supported by the integrators, we consider how an organization might best decide on the optimum technology to deploy against its intended workload. We outline our cluster performance evaluation work that uses a variety of synthetic and application-based floating-point metrics to inform this question. Our analysis relies on performance measurements of application independent tests (microbenchmarks) and a suite of scientific applications that are in active use on many large-scale systems. The microbenchmarks we used provide information on the performance characteristics of the hardware, specifically memory bandwidth and latency, and intercore/interprocessor communication performance. These measurements have been extensively used to provide insight into application performance, with the scientific applications used being taken from existing workloads within the SRIF HPC sector, representing various scientific domains and program structures-molecular dynamics, computational engineering, and materials simulation to name a few. The chapter concludes with a 10-point summary of important considerations when procuring HPC clusters, particularly those in the mid-to-high-end range.", "paper_title": "The UK HPC Integration Market: Commodity-Based Clusters", "paper_id": "WOS:000266063000001"}