{"auto_keywords": [{"score": 0.04794124607475937, "phrase": "fbg"}, {"score": 0.03602793698806944, "phrase": "fbg-based_system"}, {"score": 0.00481495049065317, "phrase": "fiber-bragg_grating-induced_group-delay_ripple"}, {"score": 0.004771196027464407, "phrase": "high-speed_transmission_systems"}, {"score": 0.004642292792558686, "phrase": "chirped_fiber-bragg_grating"}, {"score": 0.004537525607322823, "phrase": "dispersion_compensation"}, {"score": 0.00429558848734449, "phrase": "first_time"}, {"score": 0.004141476915000558, "phrase": "differential_detection"}, {"score": 0.0030631644367919665, "phrase": "gdr"}, {"score": 0.002782647772219627, "phrase": "optimal_launch_power"}, {"score": 0.0027197343489967296, "phrase": "fbg_modules"}, {"score": 0.0026704265616705023, "phrase": "electronic_dispersion_compensation"}, {"score": 0.0026461080202599694, "phrase": "similar_performance"}, {"score": 0.0025162526326656994, "phrase": "osnr"}, {"score": 0.002403724423251419, "phrase": "gdr_mitigation_capability"}, {"score": 0.002370955769074803, "phrase": "digital_linear_equalizer"}, {"score": 0.002275299774554847, "phrase": "tap_number"}, {"score": 0.0021049977753042253, "phrase": "q-factor_variation"}], "paper_keywords": ["Coherent detection", " Differential detection", " Dispersion compensation", " Equalization", " Fiber Bragg grating", " Group delay ripple", " Phase shift keying"], "paper_abstract": "The implementation of a chirped fiber-Bragg grating (FBG) for dispersion compensation in high-speed (up to 120 Gbit/s) transmission systems with differential and coherent detection is, for the first time, experimentally investigated. For systems with differential detection, we examine the influence of group-delay ripple (GDR) in 40 GBd 2-, 4-, and 8-ary differential phase shift keying (DPSK) systems. Furthermore, we conduct a nonlinear-tolerance comparison between the systems implementing dispersion-compensating fibers and FBG modules, using a 5 x 80 Gbit/s 100-GHz-spaced wavelength division multiplexing 4-ary DPSK signal. The results show that the FBG-based system provides a 2 dB higher optimal launch power, which leads to more than 3 dB optical signal-to-noise ratio (OSNR) improvement at the receiver. For systems with coherent detection, we evaluate the influence of GDR in a 112 Gbit/s dual-polarization quadrature phase shift keying system with respect to signal wavelength. In addition, we demonstrate that, at the optimal launch power, the 112 Gbit/s systems implementing FBG modules and that using electronic dispersion compensation provide similar performance after 840 km transmission despite the fact that the FBG-based system delivers lower OSNR at the receiver. Lastly, we quantify the GDR mitigation capability of a digital linear equalizer in the 112 Gbit/s coherent systems with respect to the equalizer tap number (N-tap). The results indicate that at least N-tap = 9 is required to confine Q-factor variation within 1 dB.", "paper_title": "Influence of Fiber-Bragg Grating-Induced Group-Delay Ripple in High-Speed Transmission Systems", "paper_id": "WOS:000305902200008"}