{"auto_keywords": [{"score": 0.030063661952507554, "phrase": "profilepstmm_model"}, {"score": 0.00481495049065317, "phrase": "tree-structure_motifs"}, {"score": 0.004777392826700429, "phrase": "carbohydrate_sugar_chains"}, {"score": 0.0041981583430961734, "phrase": "single_monosaccharide"}, {"score": 0.004005339423663657, "phrase": "multicellular_organisms"}, {"score": 0.003821342577980031, "phrase": "specific_functions"}, {"score": 0.003717925116469845, "phrase": "recognition_mechanism"}, {"score": 0.003688892770976908, "phrase": "informatics_techniques"}, {"score": 0.0035332058983966424, "phrase": "probabilistic_sibling-dependent_tree_markov_model"}, {"score": 0.0035056109035307716, "phrase": "pstmm"}, {"score": 0.003357633232360232, "phrase": "sibling-dependent_tree_structures"}, {"score": 0.0031658283119347396, "phrase": "extra_dependency"}, {"score": 0.003116551456858777, "phrase": "overfitting_problems"}, {"score": 0.0030084563186769764, "phrase": "trained_model"}, {"score": 0.002748895580860912, "phrase": "novel_concept"}, {"score": 0.002727409429089543, "phrase": "different_types"}, {"score": 0.0027060907634889734, "phrase": "state_transitions"}, {"score": 0.002674423963978094, "phrase": "parent-child_and_sibling_dependencies"}, {"score": 0.002358801930248239, "phrase": "glycan_data"}, {"score": 0.002331189621118592, "phrase": "kegg_glycan_database"}], "paper_keywords": [""], "paper_abstract": "Motivation: Carbohydrate sugar chains, or glycans, are considered the third major class of biomolecules after DNA and proteins. They consist of branching monosaccharides, starting from a single monosaccharide. They are extremely vital to the development and functioning of multicellular organisms because they are recognized by various proteins to allow them to perform specific functions. Our motivation is to study this recognition mechanism using informatics techniques from the data available. Previously, we introduced a probabilistic sibling-dependent tree Markov model (PSTMM), which we showed could be efficiently trained on sibling-dependent tree structures and return the most likely state paths. However, it had some limitations in that the extra dependency between siblings caused overfitting problems. The retrieval of the patterns from the trained model also involved manually extracting the patterns from the most likely state paths. Thus we introduce a profilePSTMM model which avoids these problems, incorporating a novel concept of different types of state transitions to handle parent-child and sibling dependencies differently. Results: Our new algorithms are more efficient and able to extract the patterns more easily. We tested the profilePSTMM model on both synthetic (controlled) data as well as glycan data from the KEGG GLYCAN database. Additionally, we tested it on glycans which are known to be recognized and bound to proteins at various binding affinities, and we show that our results correlate with results published in the literature.", "paper_title": "ProfilePSTMM: capturing tree-structure motifs in carbohydrate sugar chains", "paper_id": "WOS:000250005000004"}