{"auto_keywords": [{"score": 0.04528487297387803, "phrase": "fuzzy_multi-rules"}, {"score": 0.04485182771002568, "phrase": "fuzzy_multi-sets"}, {"score": 0.00481495049065317, "phrase": "ret_selection"}, {"score": 0.004556901872357751, "phrase": "novel_fuzzy-based_expert_system"}, {"score": 0.004164007198843467, "phrase": "main_operational_characteristics"}, {"score": 0.004122490120202936, "phrase": "six_types"}, {"score": 0.003980400251874277, "phrase": "municipal_solid_waste"}, {"score": 0.003021141590548526, "phrase": "fuzzy-based_expert_system"}, {"score": 0.002678433668156676, "phrase": "previous_criteria"}, {"score": 0.002560162916190598, "phrase": "different_relevance"}, {"score": 0.0024348510123716424, "phrase": "proposed_arrangement"}, {"score": 0.00223570488212345, "phrase": "decision_makers'_preferences"}, {"score": 0.0022022878843247257, "phrase": "decision-aid_process"}, {"score": 0.0021049977753042253, "phrase": "final_decision"}], "paper_keywords": ["Biogas", " fuzzy multi-rules and fuzzy multi-sets", " municipal solid waste landfills", " renewable energy technologies"], "paper_abstract": "The aim of this work is to demonstrate a novel fuzzy-based expert system for selecting renewable energy technologies (RET). Fuzzy multi-rules and fuzzy multi-sets are used to evaluate the main operational characteristics of six types of RET fuelled by biogas from municipal solid waste (MSW) landfills. The construction of the fuzzy multi-rules and fuzzy multi-sets is based on the following method: Mamdani controller using the Max-Min (inference process) and Center of Gravity (defuzzification process). Several criteria are used for the investigation: costs, efficiency, cogeneration, life-cycle and environmental impacts. The fuzzy-based expert system considers three different settings with two different constraints: costs and environmental impacts. One of the most relevant aspects presented by this work is about the previous criteria rank. It was created according to the different relevance observed among the attributes. The purpose of the proposed arrangement is to facilitate the understanding of the methodology and to increase the possibility of incorporating the decision makers' preferences on the decision-aid process. These aspects are essential to strengthen the final decision.", "paper_title": "A novel fuzzy-based expert system for RET selection", "paper_id": "WOS:000319616400007"}