{"auto_keywords": [{"score": 0.04956594643422059, "phrase": "virtual_world"}, {"score": 0.03773337458833726, "phrase": "psychological_ownership"}, {"score": 0.015442919463805223, "phrase": "virtual_worlds"}, {"score": 0.009408124836024313, "phrase": "usable_virtual_world"}, {"score": 0.00481495049065317, "phrase": "usability_design_and_psychological_ownership"}, {"score": 0.004529696178827392, "phrase": "projected_identities"}, {"score": 0.004037608759610068, "phrase": "usability_design"}, {"score": 0.003965684670332574, "phrase": "corresponding_effects"}, {"score": 0.003937273640906994, "phrase": "users'_psychological_desire"}, {"score": 0.003611751858608048, "phrase": "web_site_usability"}, {"score": 0.003459191419478298, "phrase": "seven_usability_factors"}, {"score": 0.0031730701021262155, "phrase": "cognitive_appraisals"}, {"score": 0.003150319576043518, "phrase": "perceived_control"}, {"score": 0.0031277316566463978, "phrase": "affective_appraisals"}, {"score": 0.003028067500715357, "phrase": "use_intention"}, {"score": 0.002995554770117301, "phrase": "cross-sectional_study"}, {"score": 0.0028381384547894865, "phrase": "strong_psychological_ownership"}, {"score": 0.0025938977569302177, "phrase": "forward-looking_e-business_managers"}, {"score": 0.0024223970976460173, "phrase": "corresponding_survey_items"}, {"score": 0.0021509807762081145, "phrase": "available_resources"}], "paper_keywords": ["architectural quality model", " human-computer interaction", " landscape preference model", " psychological ownership", " usability", " virtual worlds"], "paper_abstract": "Virtual worlds, immersive three-dimensional virtual spaces where users interact with projected identities of other users (avatars) and objects, are becoming increasingly popular and continue to grow as highly interactive, collaborative, and commercial cyberspaces. However, extant research in this context has not paid much attention to usability design of a virtual world and corresponding effects on users' psychological desire to own and control the space and objects within it and subsequent behavior intention. In this study, we apply concepts of Web site usability and psychological ownership to develop a model that illustrates the relationships between seven usability factors (legibility, firmness, coherence, variety, mystery, classic, and expressive visual aesthetics), four antecedents of psychological ownership (cognitive appraisals, perceived control, affective appraisals, and self-investment), psychological ownership, and use intention. A cross-sectional study with 239 Second Life users was conducted. The results demonstrate that designing a usable virtual world that induces strong psychological ownership is crucial to attract users to spend more time, participate in more activities, and revisit the virtual world. This is an important finding for forward-looking e-business managers looking to invest their limited resources in designing a usable virtual world. In addition, by using our model and corresponding survey items, designers can benchmark and evaluate the usability of their current virtual worlds, compare the results to the designs of competitors, and upgrade the offerings of virtual worlds, as needed, by allocating available resources to the most influential design factors to suit their specific needs.", "paper_title": "Usability Design and Psychological Ownership of a Virtual World", "paper_id": "WOS:000300445900009"}