{"auto_keywords": [{"score": 0.0447884783780907, "phrase": "opcut_switch"}, {"score": 0.014790811907374331, "phrase": "optical_packets"}, {"score": 0.010318403190858532, "phrase": "packet_scheduling"}, {"score": 0.00481495049065317, "phrase": "-reorder_packet_scheduling"}, {"score": 0.004783852487938866, "phrase": "optical_cut-through_switch"}, {"score": 0.004425909662226326, "phrase": "optical_domain"}, {"score": 0.004202223763361474, "phrase": "order_transmission"}, {"score": 0.003964007795174772, "phrase": "output_port"}, {"score": 0.0038127186374325582, "phrase": "optical_hol_packets"}, {"score": 0.0037392451233558234, "phrase": "hol_packets"}, {"score": 0.0037030390595465673, "phrase": "high_cut-through_ratio"}, {"score": 0.00342568771304873, "phrase": "buffered_packets"}, {"score": 0.003018468582368033, "phrase": "delay_threshold_rule"}, {"score": 0.0029031614127920232, "phrase": "preset_delay_threshold"}, {"score": 0.0027295084882654917, "phrase": "heavily_congested_traffic"}, {"score": 0.0026942913145235614, "phrase": "packet_order"}, {"score": 0.002591335708291347, "phrase": "packet_reorder"}, {"score": 0.0025085435314540837, "phrase": "path_multiplicity"}, {"score": 0.002436289099444074, "phrase": "bounded-reorder_packet_scheduling_algorithm"}, {"score": 0.002320449502337321, "phrase": "small_degree"}, {"score": 0.0023054252458274823, "phrase": "out-of-order_transmission"}, {"score": 0.0022390081666133627, "phrase": "energy_efficiency"}, {"score": 0.0021049977753042253, "phrase": "network_application_performance"}], "paper_keywords": ["OpCut switch", " energy efficiency", " O/E/O conversion", " cut-through ratio", " delay threshold", " reorder bound", " packet scheduling", " 100% throughput"], "paper_abstract": "The recently proposed optical cut-through (OpCut) switch holds a great potential in achieving high energy efficiency, as it allows optical packets to cut through the switch in optical domain whenever possible, which avoids power-hungry O/E/O conversion. In the OpCut switch, to ensure in-order transmission, only optical Head-of-Line (HOL) packet of a switch flow, i.e., the stream of packets sharing the same input and output port, is allowed to cut-through the switch, and optical HOL packets are always prioritized over buffered HOL packets to achieve high cut-through ratio, which is measured by the portion of packets cutting through the switch optically. However, under such priority rule, switch flows with buffered packets are at the risk of starvation, and the OpCut switch fails to achieve 100 percent throughput for all admissible i.i.d. traffics due to the unfairness in packet scheduling. To address this two issues, in this paper we propose a delay threshold rule for packet scheduling, in which buffered packets with delays exceeding a preset delay threshold are prioritized over optical packets. In the meanwhile, the cut-through ratio is very low under heavily congested traffic due to maintaining packet order, whereas the Internet is designed to accommodate a certain degree of packet reorder, which is very common in practice due to path multiplicity. In this paper, we design a bounded-reorder packet scheduling algorithm that significantly increases the cut-through ratio of the OpCut switch while allowing a small degree of out-of-order transmission. Our extensive simulation results show that the energy efficiency of OpCut switch can be significantly improved with only a very small degree of packet reordering, which has little adverse impact on the network application performance.", "paper_title": "Bounded-Reorder Packet Scheduling in Optical Cut-Through Switch", "paper_id": "WOS:000362792200003"}