{"auto_keywords": [{"score": 0.036873522834241126, "phrase": "search_costs"}, {"score": 0.008713768692145013, "phrase": "multiagent_systems"}, {"score": 0.004406360418456518, "phrase": "different_utility"}, {"score": 0.004164516065972361, "phrase": "underlying_costly_exploration_problem"}, {"score": 0.003935892934907777, "phrase": "traditional_search_notion"}, {"score": 0.0039042694651106884, "phrase": "artificial_intelligence"}, {"score": 0.003841786797726186, "phrase": "bfs"}, {"score": 0.003810909603178837, "phrase": "iddfa"}, {"score": 0.0036454883790271843, "phrase": "underlying_combinatorial_structure"}, {"score": 0.0034452601929727752, "phrase": "individual_and_aggregate_utility"}, {"score": 0.003417565253539315, "phrase": "distributed_multi-agent_economic-search_settings"}, {"score": 0.0032428780373184207, "phrase": "market_inefficiency"}, {"score": 0.0028042108531816943, "phrase": "aggregate_social_welfare"}, {"score": 0.0027704444816096505, "phrase": "even_the_expected_utility"}, {"score": 0.0024052270356036743, "phrase": "one-sided_and_two-sided_search_settings"}, {"score": 0.0023287359930308864, "phrase": "economic-search_theory"}, {"score": 0.0021049977753042253, "phrase": "system's_overall_performance"}], "paper_keywords": ["Search", " Matching", " Multi-agent systems", " Search costs"], "paper_abstract": "We consider settings were agents are faced with several possible opportunities and need to choose one. Each opportunity may offer a different utility to the agent, and determining this utility may consume resources. The underlying costly exploration problem is termed \"economic search\", though its essence is different from the traditional search notion in artificial intelligence (e. g. BFS, IDDFA, and A*), as there is no underlying combinatorial structure to the opportunities. We study the effects that search costs can have on individual and aggregate utility in distributed multi-agent economic-search settings. Traditionally, in such setting, search costs are regarded as a market inefficiency, and, as such, as something to be avoided or reduced to a minimum. We show, in contrast, that in many search settings, the introduction of search costs can actually improve the aggregate social welfare, or even the expected utility of each and every individual agent. We note that the proceeds from the search costs are assumed to be wasted, with no one directly benefiting from them. We demonstrate the benefits of search costs in both one-sided and two-sided search settings, using standard, classical models from economic-search theory. For the designers of multiagent systems, the results imply that deliberate (and potentially artificial) increase of search costs should be considered as possible means to improving the system's overall performance.", "paper_title": "Exploration costs as a means for improving performance in multiagent systems", "paper_id": "WOS:000345330000004"}