{"auto_keywords": [{"score": 0.04198314773421661, "phrase": "software_development_project"}, {"score": 0.03915408664004085, "phrase": "development_project"}, {"score": 0.00481495049065317, "phrase": "successful_software_development_projects"}, {"score": 0.004728624975677976, "phrase": "new_products"}, {"score": 0.004643839937761046, "phrase": "organizational_partnerships"}, {"score": 0.004178575202976084, "phrase": "internal_client_roles"}, {"score": 0.00384002686613679, "phrase": "coproduction_relationship"}, {"score": 0.00381691770211996, "phrase": "software_developers"}, {"score": 0.003626000977962191, "phrase": "available_knowledge"}, {"score": 0.0031462682245392785, "phrase": "coproduction_environment"}, {"score": 0.002952900365829518, "phrase": "development_teams"}, {"score": 0.0028477727736832283, "phrase": "individual_characteristics"}, {"score": 0.0028220792894598236, "phrase": "project_sizes"}, {"score": 0.0026326249204932733, "phrase": "needed_expertise"}, {"score": 0.002508365161206412, "phrase": "effective_approach"}, {"score": 0.0024410581599518784, "phrase": "meeting_project_goals"}, {"score": 0.0023470051993423483, "phrase": "important_contributor"}, {"score": 0.0023328599525181707, "phrase": "successful_outcomes"}, {"score": 0.0022909325048608054, "phrase": "effective_selection"}, {"score": 0.0022771244331421586, "phrase": "team_members"}, {"score": 0.0022294468373088424, "phrase": "available_expertise"}, {"score": 0.002176176622950153, "phrase": "team_building_functions"}, {"score": 0.002143529653780496, "phrase": "expertise_location"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Coproduction", " Project management", " Software development", " Expertise application"], "paper_abstract": "Context: Coproduction of new products has been deemed successful in organizational partnerships by adding to the quality and scope of the product. Techniques that involve users during the development of software tend to mimic this environment, but differ in the type of product and internal client roles. The question is thus, whether coproduction improves the outcomes of a software development project as it has in other disciplines. Objective: This paper evaluates how the coproduction relationship between software developers and users improves the outcomes of a development project. Coproduction is believed to improve outcomes when available knowledge is accessible and applicable to the objective of the development project. Should the relationships hold, coproduction approaches to development can be approached with confidence and improvements made by attention to the development and deployment of expertise. Method: A quantitative questionnaire related to the coproduction environment was developed for four variables to include coproduction, applying expertise, locating expertise, and project success. 128 users from development teams responded to the survey and represent a variety of industries, individual characteristics, and project sizes. Results: Expertise is crucial to the success of a software development project and coproduction improves the ability to access and apply the needed expertise. In addition, coproduction directly improves outcomes. Conclusion: Coproduction can be an effective approach to the development of systems in terms of meeting project goals. Additionally, the assembly of expertise on the team is an important contributor to successful outcomes that may be enhanced through effective selection of team members. The ability to locate the available expertise is crucial, indicating the value of team building functions to promote awareness of expertise location. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Coproduction in successful software development projects", "paper_id": "WOS:000280895700004"}