{"auto_keywords": [{"score": 0.04427417173634225, "phrase": "dictionary_learning"}, {"score": 0.00468627326602559, "phrase": "image_processing"}, {"score": 0.00451491283266524, "phrase": "new_form"}, {"score": 0.0042912493195237725, "phrase": "active_field"}, {"score": 0.004010102190292037, "phrase": "linear_combinations"}, {"score": 0.0036101552409969037, "phrase": "linear_combination"}, {"score": 0.0034898187091432806, "phrase": "new_computational_approach"}, {"score": 0.00338493754743055, "phrase": "computational_geometry"}, {"score": 0.003272083495778595, "phrase": "small_smart_non-uniform_sample"}, {"score": 0.002975652654536407, "phrase": "optimal_dictionary"}, {"score": 0.0023625233416109917, "phrase": "approximation_error"}, {"score": 0.002322767202375339, "phrase": "gain_factors"}, {"score": 0.0022914434133560852, "phrase": "computational_time"}, {"score": 0.002148315508445588, "phrase": "larger_patches"}, {"score": 0.0021337783230121286, "phrase": "high-definition_images"}, {"score": 0.0021049977753042253, "phrase": "traditional_approach"}], "paper_keywords": ["Sparsity", " Dictionary learning", " K-SVD", " Coresets"], "paper_abstract": "Signal and image processing have seen an explosion of interest in the last few years in a new form of signal/image characterization via the concept of sparsity with respect to a dictionary. An active field of research is dictionary learning: the representation of a given large set of vectors (e.g. signals or images) as linear combinations of only few vectors (patterns). To further reduce the size of the representation, the combinations are usually required to be sparse, i.e., each signal is a linear combination of only a small number of patterns. This paper suggests a new computational approach to the problem of dictionary learning, known in computational geometry as coresets. A coreset for dictionary learning is a small smart non-uniform sample from the input signals such that the quality of any given dictionary with respect to the input can be approximated via the coreset. In particular, the optimal dictionary for the input can be approximated by learning the coreset. Since the coreset is small, the learning is faster. Moreover, using merge-and-reduce, the coreset can be constructed for streaming signals that do not fit in memory and can also be computed in parallel. We apply our coresets for dictionary learning of images using the K-SVD algorithm and bound their size and approximation error analytically. Our simulations demonstrate gain factors of up to 60 in computational time with the same, and even better, performance. We also demonstrate our ability to perform computations on larger patches and high-definition images, where the traditional approach breaks down.", "paper_title": "Learning Big (Image) Data via Coresets for Dictionaries", "paper_id": "WOS:000320280800002"}