{"auto_keywords": [{"score": 0.015535971669675044, "phrase": "volume_data_sets"}, {"score": 0.00481495049065317, "phrase": "interactive_viewpoint_selection"}, {"score": 0.004701825207431857, "phrase": "automatic_viewpoint_selection_algorithms"}, {"score": 0.003980687255880282, "phrase": "useful_results"}, {"score": 0.003290494847464381, "phrase": "new_algorithm"}, {"score": 0.003118838635447237, "phrase": "running_time"}, {"score": 0.0028354207806133153, "phrase": "real-time_volume-rendering_applications"}, {"score": 0.0026714812866037584, "phrase": "maximization_problem"}, {"score": 0.0026241684260044414, "phrase": "small_sample"}, {"score": 0.002357337046408753, "phrase": "performance_results"}, {"score": 0.002142970278347126, "phrase": "comparable_results"}, {"score": 0.0021049977753042253, "phrase": "resulting_viewpoints"}], "paper_keywords": ["Viewpoint selection", " Harris interest point detection", " principal component analysis"], "paper_abstract": "Automatic viewpoint selection algorithms try to optimize the view of a data set to best show its features. They are often based on information theoretic frameworks. Although many algorithms have shown useful results, they often take several seconds to produce a result because they render the scene from a variety of viewpoints and analyze the result. In this article, we propose a new algorithm for volume data sets that dramatically reduces the running time. Our entire algorithm takes less than a second, which allows it to be integrated into real-time volume-rendering applications. The interactive performance is achieved by solving a maximization problem with a small sample of the data set, instead of rendering it from a variety of directions. We compare performance results of our algorithm to state-of-the-art approaches and show that our algorithm achieves comparable results for the resulting viewpoints. Furthermore, we apply our algorithm to multichannel volume data sets.", "paper_title": "A new approach to interactive viewpoint selection for volume data sets", "paper_id": "WOS:000329572700003"}