{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_construction"}, {"score": 0.04472882712454684, "phrase": "km_multiple_set_operation_expression"}, {"score": 0.007851751687382568, "phrase": "user's_function_requirements"}, {"score": 0.007617726030427163, "phrase": "new_km"}, {"score": 0.004671012181488876, "phrase": "knowledgeable_manufacturing_system"}, {"score": 0.00447403691097857, "phrase": "km's_automatic_construction"}, {"score": 0.004440570928903645, "phrase": "knowledge_mesh"}, {"score": 0.004410716505441607, "phrase": "km"}, {"score": 0.004081385289516914, "phrase": "developed_km-based_inference_engine"}, {"score": 0.003945949295597681, "phrase": "developed_automatic_program_construction_software"}, {"score": 0.0038278891609307164, "phrase": "kms."}, {"score": 0.0035779805381654438, "phrase": "kms_software"}, {"score": 0.0033898129842622536, "phrase": "automatic_construction_procedure"}, {"score": 0.0033106223384515546, "phrase": "user's_maximum_function-satisfaction"}, {"score": 0.0032332756920184177, "phrase": "fuzzy_function-satisfaction_degree_relationships"}, {"score": 0.00314708280192844, "phrase": "km_functions"}, {"score": 0.003063180586734181, "phrase": "multiple_fuzzy_function-satisfaction_degrees"}, {"score": 0.002853396755102163, "phrase": "one-to-one_mapping"}, {"score": 0.0027961342030212353, "phrase": "km-function-satisfaction_degree_expression"}, {"score": 0.00252656192077797, "phrase": "hybrid_genetic-tabu_algorithm"}, {"score": 0.002306189434657134, "phrase": "actual_km_example"}, {"score": 0.002267536195741775, "phrase": "management_information_system"}, {"score": 0.002252264800691347, "phrase": "mis"}, {"score": 0.0022070310530794097, "phrase": "vehicle_body_plant"}, {"score": 0.0021847592782091923, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Manufacturing systems", " Optimization", " Function requirement", " User satisfaction degree", " Knowledge mesh", " Automatic construction", " Hybrid genetic-tabu algorithm"], "paper_abstract": "This paper deals with an approach to the automatic construction and optimization of the knowledge mesh (KM) based on the user's function requirements. Once a KM multiple set operation expression is obtained, a new KM can be inferred from the expression by the developed KM-based inference engine and transformed into its corresponding KMS (knowledgeable manufacturing system) software automatically by the developed automatic program construction software so as to realize the self-reconfiguration of the KMS. Thus, the automatic construction and optimization of a KM multiple set operation expression is equivalent to the automatic construction and optimization of its corresponding KM and KMS software. To explore the automatic construction and optimization of the new KM by the user's function requirements, an automatic construction procedure of a KM aiming at the user's maximum function-satisfaction is proposed. Firstly, the fuzzy function-satisfaction degree relationships of the users' requirements for the KM functions are defined, and so are the multiple fuzzy function-satisfaction degrees of the relationships. Secondly, operations (union, intersection and minus) on both fuzzy and multiple fuzzy function-satisfaction degrees are proposed and clarified, along with the proof that there exists a one-to-one mapping between the KM multiple set operation expression and the KM-function-satisfaction degree expression. Then, the optimization model of the KM multiple set operation expression is constructed and proved to be very NP-hard. And finally, the KM multiple set operation expression is optimized by the hybrid genetic-tabu algorithm, with the steps of the KM's automatic construction presented in detail as well. Based upon the above, the KM's automatic construction and optimization are illustrated by an actual KM example which corresponds to the management information system (MIS) software used in a vehicle body plant. The proposed approach proves to be very effective. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic construction and optimization of knowledge mesh for self-reconfiguration of knowledgeable manufacturing system", "paper_id": "WOS:000298027300023"}