{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sentiment_analysis"}, {"score": 0.004621671570727774, "phrase": "automated_approaches"}, {"score": 0.004287166497171827, "phrase": "traditional_sentiment_analysis"}, {"score": 0.0036761878173205225, "phrase": "web-based_crowdsourcing_approach"}, {"score": 0.0036015684625793775, "phrase": "crowdsourced_information"}, {"score": 0.0035526625882388936, "phrase": "high_agreement"}, {"score": 0.003528458369404996, "phrase": "five_independent_annotators"}, {"score": 0.0034924598001567944, "phrase": "krippendorffs_alpha_coefficient"}, {"score": 0.003004655258223784, "phrase": "gold_standard"}, {"score": 0.002647458797373923, "phrase": "baseline_results"}, {"score": 0.002430411367515404, "phrase": "positive_sentiments"}, {"score": 0.002293051006249274, "phrase": "statistical_significance"}, {"score": 0.002238767763626708, "phrase": "mcnemar's_test"}, {"score": 0.0021560445153869985, "phrase": "elsevier_ltd."}, {"score": 0.002126725585391261, "phrase": "open_access_article"}, {"score": 0.0021049977753042253, "phrase": "cc_by_license"}], "paper_keywords": ["Emotion recognition", " Sentiment analysis", " Natural language processing", " User-generated content", " Tagging"], "paper_abstract": "In this paper we investigate the role of idioms in automated approaches to sentiment analysis. To estimate the degree to which the inclusion of idioms as features may potentially improve the results of traditional sentiment analysis, we compared our results to two such methods. First, to support idioms as features we collected a set of 580 idioms that are relevant to sentiment analysis, i.e. the ones that can be mapped to an emotion. These mappings were then obtained using a web-based crowdsourcing approach. The quality of the crowdsourced information is demonstrated with high agreement among five Independent annotators calculated using Krippendorffs alpha coefficient (alpha = 0.662). Second, to evaluate the results of sentiment analysis, we assembled a corpus of sentences in which idioms are used in context. Each sentence was annotated with an emotion, which formed the basis for the gold standard used for the comparison against two baseline methods. The performance was evaluated in terms of three measures precision, recall and F-measure. Overall, our approach achieved 64% and 61% for these three measures in two experiments improving the baseline results by 20 and 15 percent points respectively. F-measure was significantly improved over all three sentiment polarity classes: Positive, Negative and Other. Most notable improvement was recorded in classification of positive sentiments, where recall was improved by 45 percent points in both experiments without compromising the precision. The statistical significance of these improvements was confirmed by McNemar's test. (C) 2015 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).", "paper_title": "The role of idioms in sentiment analysis", "paper_id": "WOS:000360772500011"}