{"auto_keywords": [{"score": 0.046844750455015016, "phrase": "image_processing_techniques"}, {"score": 0.04260188975253477, "phrase": "extracted_cracks"}, {"score": 0.036198962300297274, "phrase": "binarized_image"}, {"score": 0.02576554420465121, "phrase": "middle_layer"}, {"score": 0.00481495049065317, "phrase": "concrete_surface_cracks"}, {"score": 0.004310949776826717, "phrase": "concrete_surface_crack_image"}, {"score": 0.003904713104101532, "phrase": "closing_operation"}, {"score": 0.003859500298805362, "phrase": "morphological_techniques"}, {"score": 0.003792664395057493, "phrase": "sobel"}, {"score": 0.003375574760845742, "phrase": "crack_image"}, {"score": 0.003221837753001224, "phrase": "concrete_surface_image"}, {"score": 0.003129317057177867, "phrase": "noise_reduction"}, {"score": 0.0024640253074497114, "phrase": "input_layer"}, {"score": 0.0023792975669318615, "phrase": "delta_learning_method"}, {"score": 0.0022576249214220187, "phrase": "output_layer"}, {"score": 0.0021927323694667694, "phrase": "real_concrete_crack_images"}, {"score": 0.0021049977753042253, "phrase": "concrete_crack_images"}], "paper_keywords": [""], "paper_abstract": "In this paper, we proposed the image processing techniques for extracting the cracks in a concrete surface crack image and the ART1-based RBF network for recognizing the directions of the extracted cracks. The image processing techniques used are the closing operation of morphological techniques, the Sobel masking used to extract edges of the cracks, and the iterated binarization for acquiring the binarized image from the crack image. The cracks are extracted from the concrete surface image after applying two times of noise reduction to the binarized image. We proposed the method for automatically recognizing the directions (horizontal, vertical, -45 degree, 45 direction degree) of the cracks with the ART1-based network. The proposed ART1-based RBF network applied ART1 to the learning between the input layer and the middle layer and the Delta learning method to the learning between the middle layer and the output layer. The experiments using real concrete crack images showed that the cracks in the concrete crack images were effectively extracted and the proposed ART1-based RBF network was effective in the recognition of the direction of extracted cracks.", "paper_title": "Recognition of concrete surface cracks using the ART1-based RBF network", "paper_id": "WOS:000239483000098"}