{"auto_keywords": [{"score": 0.042098477124909196, "phrase": "faculty_members"}, {"score": 0.017384939012978187, "phrase": "doctoral_students"}, {"score": 0.007525165343670645, "phrase": "doctoral_students'_and_faculty_members'_referencing_behavior"}, {"score": 0.004324031677173549, "phrase": "scientific_articles"}, {"score": 0.003526476304712492, "phrase": "larger_proportion"}, {"score": 0.0034867406208212146, "phrase": "conference_proceedings"}, {"score": 0.003447451122274614, "phrase": "journal_articles"}, {"score": 0.00302612773666719, "phrase": "cited_journals"}, {"score": 0.002958281631770322, "phrase": "health_research"}, {"score": 0.0028271058251633815, "phrase": "slightly_lower_impact_factors"}, {"score": 0.0027794243746094905, "phrase": "social_sciences"}, {"score": 0.002656158309155626, "phrase": "higher_impact_factors"}, {"score": 0.002398382089724878, "phrase": "higher_proportion"}, {"score": 0.0022278779300543548, "phrase": "referencing_patterns"}, {"score": 0.002202742267484358, "phrase": "age_stratification"}, {"score": 0.0021049977753042253, "phrase": "information-seeking_behavior"}], "paper_keywords": ["bibliometrics"], "paper_abstract": "This article compares doctoral students' and faculty members' referencing behavior through the analysis of a large corpus of scientific articles. It shows that doctoral students tend to cite more documents per article than faculty members, and that the literature they cite is, on average, more recent. It also demonstrates that doctoral students cite a larger proportion of conference proceedings and journal articles than faculty members and faculty members are more likely to self-cite and cite theses than doctoral students. Analysis of the impact of cited journals indicates that in health research, faculty members tend to cite journals with slightly lower impact factors whereas in social sciences and humanities, faculty members cite journals with higher impact factors. Finally, it provides evidence that, in every discipline, faculty members tend to cite a higher proportion of clinical/applied research journals than doctoral students. This study contributes to the understanding of referencing patterns and age stratification in academia. Implications for understanding the information-seeking behavior of academics are discussed.", "paper_title": "In their own image? a comparison of doctoral students' and faculty members' referencing behavior", "paper_id": "WOS:000325930600013"}