{"auto_keywords": [{"score": 0.03954527199816631, "phrase": "tablet"}, {"score": 0.004408456735066782, "phrase": "video_coding"}, {"score": 0.004347473906950474, "phrase": "scalable_video_coding"}, {"score": 0.004169519409162853, "phrase": "recent_push"}, {"score": 0.004092774981286263, "phrase": "standard_http_protocol"}, {"score": 0.003907013105134715, "phrase": "converged_entertainment_services"}, {"score": 0.00383508177668219, "phrase": "global_deployment"}, {"score": 0.0036271080216837286, "phrase": "scalable_video"}, {"score": 0.0034785371344994197, "phrase": "high-quality_live_and_time-shifted_media_contents"}, {"score": 0.0031550351923674337, "phrase": "adaptive_and_scalable_streamable_media"}, {"score": 0.0030825404960282713, "phrase": "transport_mechanisms"}, {"score": 0.0030398432591176357, "phrase": "media_content_type"}, {"score": 0.0024429654627197393, "phrase": "streaming_platform"}, {"score": 0.0022155569675462333, "phrase": "fairly_stable_quality_level"}, {"score": 0.0021049977753042253, "phrase": "overall_quality"}], "paper_keywords": ["Peer-to-peer", " Scalable video", " Streaming media", " Streaming protocol", " Performance evaluation"], "paper_abstract": "Peer-to-peer (P2P) streaming solutions are changing the way real-time multimedia transmission is distributed over the Internet. The advances in video coding, like Scalable Video Coding, also turns possible high-quality/definition video distribution and consumption. The recent push in using the standard HTTP protocol for streaming videos in the World Wide Web, is also making converged entertainment services come closer to global deployment across TV, Tablet and mobile devices. The combination of Scalable Video, P2P networks and Web technologies for transmitting high-quality live and time-shifted media contents, is a potential area of innovation and a very actual research topic. This paper describes the architecture of a quality-centric P2P distribution network supporting adaptive and scalable streamable media, that decouples the transport mechanisms from the media content type and structure (video, audio, timed-data, timed-text), irrespective of their encoding schemes. The set of P2P streaming protocols designed for the network enables streaming of live and on-demand media, with very low signaling cost. Prototypes of the P2P network components were implemented and integrated in the streaming platform of EU FP7 SARACEN Project. A suite of tests for evaluation of the performance of the solution demonstrates that it keeps a fairly stable quality level with reduced amplitude and frequency of variations, raising the overall quality perceived by the end-user.", "paper_title": "A P2P streaming architecture supporting scalable media", "paper_id": "WOS:000358990200003"}