{"auto_keywords": [{"score": 0.040415472510721626, "phrase": "scientific_literature"}, {"score": 0.014855394519188622, "phrase": "conference_proceedings"}, {"score": 0.013196657772604294, "phrase": "scientific_impact"}, {"score": 0.00481495049065317, "phrase": "scientific_information"}, {"score": 0.004477083974172596, "phrase": "important_source"}, {"score": 0.004430784015995566, "phrase": "scientific_knowledge"}, {"score": 0.004162826481635768, "phrase": "systematic_manner"}, {"score": 0.003693533648584145, "phrase": "relative_importance"}, {"score": 0.00339853518227171, "phrase": "natural_sciences"}, {"score": 0.0032599633778910516, "phrase": "social_sciences"}, {"score": 0.002983916676307492, "phrase": "nearly_all_fields"}, {"score": 0.0028178463431115562, "phrase": "engineering_papers"}, {"score": 0.0026888503045081505, "phrase": "particularly_important_role"}, {"score": 0.0026609940110902666, "phrase": "computer_sciences"}, {"score": 0.002360607691114015, "phrase": "cited_scientific_literature"}, {"score": 0.0022175679453857473, "phrase": "relatively_limited_scientific_impact"}, {"score": 0.0021381565332182773, "phrase": "total_citations"}], "paper_keywords": [""], "paper_abstract": "While several authors have argued that conference proceedings are an important source of scientific knowledge, the extent of their importance has not been measured in a systematic manner. This article examines the scientific impact and aging of conference proceedings compared to those of scientific literature in general. It shows that the relative importance of proceedings is diminishing over time and currently represents only 1.7% of references made in the natural sciences and engineering, and 2.5% in the social sciences and humanities. Although the scientific impact of proceedings is losing ground to other types of scientific literature in nearly all fields, it has grown from 8% of the references in engineering papers in the early 1980s to its current 10%. Proceedings play a particularly important role in computer sciences, where they account for close to 20% of the references. This article also shows that not unexpectedly, proceedings age faster than cited scientific literature in general. The evidence thus shows that proceedings have a relatively limited scientific impact, on average representing only about 2% of total citations, that their relative importance is shrinking, and that they become obsolete faster than the scientific literature in general.", "paper_title": "Conference proceedings as a source of scientific information: A bibliometric analysis", "paper_id": "WOS:000258582600007"}