{"auto_keywords": [{"score": 0.03710138713708482, "phrase": "multiple_solutions"}, {"score": 0.00481495049065317, "phrase": "watershed_definitions"}, {"score": 0.004648609688625397, "phrase": "numerous_solutions"}, {"score": 0.004332894955218135, "phrase": "discrete_definitions"}, {"score": 0.004276192850661652, "phrase": "wt"}, {"score": 0.004092174432583184, "phrase": "ift"}, {"score": 0.003372019835750424, "phrase": "unique_solution"}, {"score": 0.0031705348665985802, "phrase": "tz"}, {"score": 0.002941913249957503, "phrase": "watershed_line"}, {"score": 0.002717750004930131, "phrase": "catchment_basins"}, {"score": 0.002434396049547248, "phrase": "tie-zone_transform"}, {"score": 0.002339771435910601, "phrase": "lc-wt"}, {"score": 0.0023192471808039746, "phrase": "msf-wt"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Image segmentation", " Watershed transform", " Graph theory", " Minimum spanning forest", " Shortest-path forest"], "paper_abstract": "To better understand the numerous solutions related to watershed transform (WT), this paper shows the relationships between some discrete definitions of the WT, especially those based on image foresting transform (IFT) with/without lexicographic cost function, topographic distance (TD). local condition (LC), flooding (F). and minimum spanning forest (MSF). Some of these paradigms allow multiple solutions. The tie-zone (TZ) transform returns a unique solution from a set of multiple solutions of a given WT. We demonstrate that the TZ transform applied to the IFT-WT includes all the solutions predicted by the other paradigms. More precisely, the watershed line of TD-WT and F-WT are contained in the TZ of the IFT-WT, while the catchment basins of TD-WT or F-WT contain the basins of the TZ-IFT-WT. In addition, the TD-WT can be seen as the tie-zone transform of the LC-WT. Furthermore, any solution of LC-WT or MSF-WT is also solution of the IFT-WT. Finally, MSF-WT and IFT-WT have the same tie-zone transform. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Relationships between some watershed definitions and their tie-zone transforms", "paper_id": "WOS:000280936300006"}