{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interactive_search"}, {"score": 0.03341847804609969, "phrase": "target_item"}, {"score": 0.004670431171164122, "phrase": "label_relevance"}, {"score": 0.0045302298105691615, "phrase": "novel_web_page"}, {"score": 0.004247858437831649, "phrase": "rational_analysis"}, {"score": 0.0032279990773657215, "phrase": "distractor_items"}, {"score": 0.002905827490766696, "phrase": "competing_distractors"}, {"score": 0.002724428781940696, "phrase": "greater_semantic_relevance"}, {"score": 0.002669525619637691, "phrase": "location_manipulation"}, {"score": 0.002494361792853831, "phrase": "greater_influence"}], "paper_keywords": [""], "paper_abstract": "When searching a novel Web page, people often estimate the likelihood that labeled links on the page will lead to their goal. A rational analysis of this activity suggests that people should adjust their estimate of the likelihood that any one item will lead to the goal in a manner that is sensitive to the context provided by the likelihoods that other items on the page will lead to the goal. Two experiments were designed to provide evidence to discriminate between this account and others found in the literature (e.g., satisficing and assess-all accounts). The experiments systematically manipulated the relevance of the distractor items and the location of the target item on the page. The results showed that (a) a high-value item was more likely to be selected when it was first encountered if the relevance of competing distractors was relatively low and (b) more items were assessed prior to selection when the distractors were of greater semantic relevance to the goal. The location manipulation showed that if more distractors were assessed prior to the target item, then the relevance of the distractors had a greater influence on the decision as to whether to select the target immediately. These results suggest that decisions as to when to select an item from the page are sensitive to the context provided by the likelihoods of all of the items so far assessed and not just to the most recent item. The findings are therefore inconsistent with both satisficing and assess-all accounts of interactive search.", "paper_title": "Strategies for guiding interactive search: An empirical investigation into the consequences of label relevance for assessment and selection", "paper_id": "WOS:000254486300001"}