{"auto_keywords": [{"score": 0.03650560903288533, "phrase": "living_technology"}, {"score": 0.004752873752686246, "phrase": "aristotelian_ideas"}, {"score": 0.004454237726525018, "phrase": "starting_point"}, {"score": 0.004192392802008709, "phrase": "heidegger's_critique"}, {"score": 0.004102639724186862, "phrase": "scientific_and_technological_thinking"}, {"score": 0.004049709080817396, "phrase": "current_era"}, {"score": 0.0038613835226952117, "phrase": "deep_enough_appreciation"}, {"score": 0.003205268682789165, "phrase": "current_global_problems"}, {"score": 0.0031365819432206004, "phrase": "human_purposefulness"}, {"score": 0.0029647862293448895, "phrase": "nature's_emergent_capability"}, {"score": 0.0029264925857346497, "phrase": "informational_representations"}, {"score": 0.0029012378668247397, "phrase": "material_forms"}, {"score": 0.002766171878646582, "phrase": "intrinsic_value"}, {"score": 0.0022174469839432013, "phrase": "destructive_or_antisocial_purposes"}, {"score": 0.0021049977753042253, "phrase": "natural_world"}], "paper_keywords": ["Living technology", " teleology", " Heidegger", " intrinsic value", " ethics", " Prometheus"], "paper_abstract": "The Aristotelian ideas of nature (physis) and technology (techne) are taken as a starting point for understanding what it would mean for technology to be truly living. Heidegger's critique of the conflation of scientific and technological thinking in the current era is accepted as demonstrating that humanity does not have a deep enough appreciation of the nature of life to harness its essence safely. Could the vision of harnessing life be realized, which we strongly doubt, living technology would give selected humans transforming powers that could be expected to exacerbate, rather than solve, current global problems. The source of human purposefulness, and hence of both technology and ethics, is identified in nature's emergent capability to instantiate informational representations in material forms. Ethics that are properly grounded in an appreciation of intrinsic value, especially that of life, demand that proposals to give humanity the capabilities of living technology address the social, political, economic, and environmental problems inherent in its development and potential deployment. Before any development is embarked on, steps must be taken to avoid living technology, whatever the term eventually designates, becoming available for destructive or antisocial purposes such as those that might devastate humanity or irrevocably damage the natural world.", "paper_title": "Harnessing Our Very Life", "paper_id": "WOS:000324116700011"}