{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "differentially_assessed_lands"}, {"score": 0.004772593750252861, "phrase": "urban_growth_model_calibration"}, {"score": 0.004627244470096107, "phrase": "sleuth."}, {"score": 0.004330450801016359, "phrase": "tax_breaks"}, {"score": 0.0040886093072615, "phrase": "urban_growth"}, {"score": 0.003964007795174772, "phrase": "sleuth_urban_growth_model"}, {"score": 0.003826231150275071, "phrase": "excluded_layer"}, {"score": 0.003335948601271999, "phrase": "better_metrics"}, {"score": 0.003080548510001051, "phrase": "higher_values"}, {"score": 0.002832081745025006, "phrase": "tenuous_periods"}, {"score": 0.0027094427948305515, "phrase": "urban_development"}, {"score": 0.002404136142279618, "phrase": "model_behavior"}, {"score": 0.0022595974985992664, "phrase": "urban_growth_modeling"}, {"score": 0.0021426288417854987, "phrase": "excluded_layers"}], "paper_keywords": ["differential assessment", " SLEUTH", " urban growth modeling", " cellular automata", " excluded lands"], "paper_abstract": "This research sought to understand the role that differentially assessed lands (lands in the United States given tax breaks in return for their guarantee to remain in agriculture) play in influencing urban growth. Our method was to calibrate the SLEUTH urban growth model under two different conditions. The first used an excluded layer that ignored such lands, effectively rendering them available for development. The second treated those lands as totally excluded from development. Our hypothesis was that excluding those lands would yield better metrics of fit with past data. Our results validate our hypothesis since two different metrics that evaluate goodness of fit both yielded higher values when differentially assessed lands are treated as excluded. This suggests that, at least in our study area, differential assessment, which protects farm and ranch lands for tenuous periods of time, has indeed allowed farmland to resist urban development. Including differentially assessed lands also yielded very different calibrated coefficients of growth as the model tried to account for the same growth patterns over two very different excluded areas. Excluded layer design can greatly affect model behavior. Since differentially assessed lands are quite common through the United States and are often ignored in urban growth modeling, the findings of this research can assist other urban growth modelers in designing excluded layers that result in more accurate model calibration and thus forecasting.", "paper_title": "The inclusion of differentially assessed lands in urban growth model calibration: a comparison of two approaches using SLEUTH", "paper_id": "WOS:000303412500006"}