{"auto_keywords": [{"score": 0.04924496525218248, "phrase": "publication_period"}, {"score": 0.00481495049065317, "phrase": "appropriate_length"}, {"score": 0.00454090611248773, "phrase": "national_research_assessment_exercises"}, {"score": 0.0044356867986444426, "phrase": "different_nations"}, {"score": 0.00438399094249306, "phrase": "varying_periods"}, {"score": 0.0040622852274783275, "phrase": "often_contrasting_needs"}, {"score": 0.0035705347414368696, "phrase": "frequent_assessments"}, {"score": 0.0030833537429977797, "phrase": "individual_researchers'_productivity_rankings"}, {"score": 0.002570296816631395, "phrase": "contiguous_and_overlapping_publication_periods"}, {"score": 0.002298902547676131, "phrase": "strong_randomness"}, {"score": 0.002272053079580848, "phrase": "performance_rankings"}, {"score": 0.0022455164874830777, "phrase": "publication_periods"}], "paper_keywords": ["Research evaluation", " Bibliometrics", " Publication period", " Sensitivity analysis", " Research productivity", " Universities"], "paper_abstract": "National research assessment exercises are conducted in different nations over varying periods. The choice of the publication period to be observed has to address often contrasting needs: it has to ensure the reliability of the results issuing from the evaluation, but also reach the achievement of frequent assessments. In this work we attempt to identify which is the most appropriate or optimal publication period to be observed. For this, we analyze the variation of individual researchers' productivity rankings with the length of the publication period within the period 2003-2008, by the over 30,000 Italian university scientists in the hard sciences. First we analyze the variation in rankings referring to pairs of contiguous and overlapping publication periods, and show that the variations reduce markedly with periods above 3 years. Then we will show the strong randomness of performance rankings over publication periods under 3 years. We conclude that the choice of a 3 year publication period would seem reliable, particularly for physics, chemistry, biology and medicine.", "paper_title": "What is the appropriate length of the publication period over which to assess research performance?", "paper_id": "WOS:000310964500026"}