{"auto_keywords": [{"score": 0.04749520186100095, "phrase": "irr"}, {"score": 0.016658079655021692, "phrase": "bgp"}, {"score": 0.010612367500608065, "phrase": "ip_prefixes"}, {"score": 0.009648684863433352, "phrase": "ases"}, {"score": 0.008994519384891958, "phrase": "irr_data"}, {"score": 0.004601508848655033, "phrase": "irr."}, {"score": 0.004442032546224076, "phrase": "globally_distributed_data_bases"}, {"score": 0.0037423521744765075, "phrase": "timely_manner"}, {"score": 0.0036491673002304326, "phrase": "negative_beliefs"}, {"score": 0.003540392285585644, "phrase": "comprehensive_analysis"}, {"score": 0.0033832583769880576, "phrase": "corresponding_information"}, {"score": 0.002723301730223192, "phrase": "origin_ases"}, {"score": 0.0022252591643049744, "phrase": "security_level"}, {"score": 0.002158836285985314, "phrase": "bgp_routers"}, {"score": 0.0021049977753042253, "phrase": "corresponding_irr_data"}], "paper_keywords": ["Inter-domain Routing", " BGP", " IRR"], "paper_abstract": "The IRR is a set of globally distributed data bases with which ASes can register their routing and address-related information. It is often believed that the quality of the IRR data is not reliable since there are few economic incentives for ASes to register and update their routing information in a timely manner. To validate these negative beliefs, we carry out a comprehensive analysis of (IP prefix, its origin AS) pairs in BGP against the corresponding information registered with the IRR, and vice versa. Considering the IRR and BGP practices, we propose a methodology to match the (IP prefix, origin AS) pairs between those two datasets. We observe that the practice of registering IP prefixes and origin ASes with the IRR is prevalent, though the quality of the IRR data varies substantially depending on routing registries, regional Internet registries (to which ASes belong), and AS types. The IRR can help improve the security level of BGP routing by making BGP routers selectively rely on the corresponding IRR data considering these observations.", "paper_title": "A Comparative Study on IP Prefixes and their Origin ASes in BGP and the IRR", "paper_id": "WOS:000323833400003"}