{"auto_keywords": [{"score": 0.048451818327498106, "phrase": "code_understanding"}, {"score": 0.04504792807190959, "phrase": "code_obfuscation"}, {"score": 0.00481495049065317, "phrase": "source_code_obfuscation_techniques"}, {"score": 0.004540126719762935, "phrase": "malicious_code_changes"}, {"score": 0.004106877044437756, "phrase": "code_tampering"}, {"score": 0.004050442607427367, "phrase": "extensive_adoption"}, {"score": 0.0038857317730249114, "phrase": "internal_metrics"}, {"score": 0.0037796484923665855, "phrase": "code_analysis"}, {"score": 0.0037019839121200508, "phrase": "associated_computational_complexity"}, {"score": 0.0035637052288771706, "phrase": "publicly_available_user_study"}, {"score": 0.0034784018545409193, "phrase": "obfuscated_code"}, {"score": 0.0033834012029672423, "phrase": "human_attacker"}, {"score": 0.003201088113538101, "phrase": "human_subjects"}, {"score": 0.0031461489526079236, "phrase": "source_code"}, {"score": 0.0028554143163813947, "phrase": "five_controlled_experiments"}, {"score": 0.002825898877873034, "phrase": "undergraduate_and_graduate_students"}, {"score": 0.002655087144676306, "phrase": "decompiled_clients"}, {"score": 0.0024773480858940504, "phrase": "obfuscation_techniques"}, {"score": 0.0023847032316716503, "phrase": "performed_task"}, {"score": 0.0022955150243239623, "phrase": "-simpler_techniques"}, {"score": 0.0021049977753042253, "phrase": "attack_tasks"}], "paper_keywords": ["Empirical studies", " Software obfuscation", " Program comprehension"], "paper_abstract": "Context: code obfuscation is intended to obstruct code understanding and, eventually, to delay malicious code changes and ultimately render it uneconomical. Although code understanding cannot be completely impeded, code obfuscation makes it more laborious and troublesome, so as to discourage or retard code tampering. Despite the extensive adoption of obfuscation, its assessment has been addressed indirectly either by using internal metrics or taking the point of view of code analysis, e.g., considering the associated computational complexity. To the best of our knowledge, there is no publicly available user study that measures the cost of understanding obfuscated code from the point of view of a human attacker. Aim: this paper experimentally assesses the impact of code obfuscation on the capability of human subjects to understand and change source code. In particular, it considers code protected with two well-known code obfuscation techniques, i.e., identifier renaming and opaque predicates. Method: We have conducted a family of five controlled experiments, involving undergraduate and graduate students from four Universities. During the experiments, subjects had to perform comprehension or attack tasks on decompiled clients of two Java network-based applications, either obfuscated using one of the two techniques, or not. To assess and compare the obfuscation techniques, we measured the correctness and the efficiency of the performed task. Results: -at least for the tasks we considered-simpler techniques (i.e., identifier renaming) prove to be more effective than more complex ones (i.e., opaque predicates) in impeding subjects to complete attack tasks.", "paper_title": "A family of experiments to assess the effectiveness and efficiency of source code obfuscation techniques", "paper_id": "WOS:000336388500008"}