{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_logic"}, {"score": 0.04970845325281592, "phrase": "nursing_diagnostic_accuracy"}, {"score": 0.047424185998726213, "phrase": "students'_performance"}, {"score": 0.042089852724600835, "phrase": "clinical_case"}, {"score": 0.03686721192137272, "phrase": "nursing_experts"}, {"score": 0.03123085227478489, "phrase": "superior_performance"}, {"score": 0.004583736733067656, "phrase": "undergraduate_students"}, {"score": 0.0045013675768375665, "phrase": "course_year"}, {"score": 0.0043635771695352986, "phrase": "fuzzy_sets"}, {"score": 0.004153947871210216, "phrase": "relationship_values"}, {"score": 0.0041004692702610365, "phrase": "nursing_diagnoses"}, {"score": 0.0036113447126992866, "phrase": "performance_score"}, {"score": 0.003238654492764602, "phrase": "student's_choice"}, {"score": 0.003213550103405005, "phrase": "expert's_choice"}, {"score": 0.003147549342151965, "phrase": "performance_scores"}, {"score": 0.003003946660366632, "phrase": "undergraduate_nursing_course"}, {"score": 0.002743153988733465, "phrase": "diagnostic_accuracy"}, {"score": 0.0025641531534356826, "phrase": "broad_variety"}, {"score": 0.0025245283457440214, "phrase": "nursing_research"}, {"score": 0.002459839724793748, "phrase": "printed_questionnaires"}, {"score": 0.0023658941070808757, "phrase": "considerable_number"}, {"score": 0.0023414522240150287, "phrase": "incorrect_or_missing_data"}, {"score": 0.00229928355744638, "phrase": "digital_version"}, {"score": 0.0022057215755768556, "phrase": "expert_opinion"}, {"score": 0.002177269919428687, "phrase": "wrong_decision"}, {"score": 0.0021380517771409763, "phrase": "diagnostic_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Nursing diagnosis", " Educational technology", " Decision support techniques", " Fuzzy logic"], "paper_abstract": "Purpose: To describe a model for assessing nursing diagnostic accuracy and its application to undergraduate students, comparing students' performance according to the course year. Methods: This model, based on the theory of fuzzy sets, guides a student through three steps: (a) the student must parameterize the model by establishing relationship values between defining characteristic/risk factors and nursing diagnoses; (b) presentation of a clinical case; (c) the student must define the presence of each defining characteristic/risk factors for the clinical case. Subsequently, the model computes the most plausible diagnoses by taking into account the values indicated by the student. This gives the student a performance score in comparison with parameters and diagnoses that were previously provided by nursing experts. These nursing experts collaborated with the construction of the model indicating the strength of the relationship between the concepts, meaning, they parameterized the model to compare the student's choice with the expert's choice (gold standard), thus generating performance scores for the student. The model was tested using three clinical cases presented to 38 students in their third and fourth years of the undergraduate nursing course. Results: Third year students showed superior performance in identifying the presence of defining characteristic/risk factors, while fourth year students showed superior performance in the diagnoses by the model. Conclusions: The Model for Evaluation of Diagnostic Accuracy Based on Fuzzy Logic applied in this study is feasible and can be used to evaluate students' performance. In this regard, it will open a broad variety of applications for learning and nursing research. Limitations: Despite the ease in filling the printed questionnaires out, the number of steps and fields to fill in may explain the considerable number of questionnaires with incorrect or missing data. This was solved in the digital version of the questionnaire. In addition, in more complex cases, it is possible that an expert opinion can lead to a wrong decision due to the subjectivity of the diagnostic process. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Application of a model based on fuzzy logic for evaluating nursing diagnostic accuracy of students", "paper_id": "WOS:000323584700013"}