{"auto_keywords": [{"score": 0.00467207889925365, "phrase": "information_systems"}, {"score": 0.004286708921931472, "phrase": "web_data_availability"}, {"score": 0.003865826699096508, "phrase": "social_media"}, {"score": 0.0033391018638565715, "phrase": "ontology_languages"}, {"score": 0.0032538723984338615, "phrase": "user_preferences"}, {"score": 0.0028715299874549245, "phrase": "user's_queries"}, {"score": 0.002822434555587263, "phrase": "preference_model"}, {"score": 0.0026916956768363158, "phrase": "probabilistic_model"}, {"score": 0.0026116610153271943, "phrase": "preference_combination_operators"}, {"score": 0.002448061472257196, "phrase": "ranking_answers"}, {"score": 0.002375253757224999, "phrase": "well-known_skyline"}, {"score": 0.002226430168622392, "phrase": "polynomial_time"}, {"score": 0.002197801146305747, "phrase": "data_complexity"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "The incorporation of preferences into information systems, such as databases, has recently seen a surge in interest, mainly fueled by the revolution in Web data availability. Modeling the preferences of a user on the Web has also increasingly become appealing to many companies since the explosion of popularity of social media. The other surge in interest is in modeling uncertainty in these domains, since uncertainty can arise due to many uncontrollable factors. In this paper, we propose an extension of the Datalog+/- family of ontology languages with two models: one representing user preferences and one representing the (probabilistic) uncertainty with which inferences are made. Assuming that more probable answers are in general more preferable, one asks how to rank answers to a user's queries, since the preference model may be in conflict with the preferences induced by the probabilistic model-the need thus arises for preference combination operators. We propose four specific operators and study their semantic and computational properties. We also provide an algorithm for ranking answers based on the iteration of the well-known skyline answers to a query and show that, under certain conditions, it runs in polynomial time in the data complexity. Furthermore, we report on an implementation and experimental results.", "paper_title": "Preference-Based Query Answering in Probabilistic Datalog+/- Ontologies", "paper_id": "WOS:000356016100002"}