{"auto_keywords": [{"score": 0.04614766352910896, "phrase": "design_research"}, {"score": 0.00481495049065317, "phrase": "design_research_methodology"}, {"score": 0.004493045859210086, "phrase": "successful_products"}, {"score": 0.003976373766630594, "phrase": "design_researchers"}, {"score": 0.003802135020791801, "phrase": "traditional_sciences"}, {"score": 0.003740679163860117, "phrase": "understanding_phenomena"}, {"score": 0.0034761488481944657, "phrase": "necessary_but_not_sufficient_step"}, {"score": 0.00335095982979018, "phrase": "understanding_reality"}, {"score": 0.002870066750788841, "phrase": "research_success"}, {"score": 0.0028236336891860592, "phrase": "relevant_phenomena"}, {"score": 0.002755384932325921, "phrase": "influence_success"}, {"score": 0.002677837900473396, "phrase": "design_improvement"}, {"score": 0.0022378620428620782, "phrase": "major_issues"}, {"score": 0.002148387364260776, "phrase": "research_methodology"}, {"score": 0.0021049977753042253, "phrase": "teaching_material"}], "paper_keywords": ["Design Research Methodology", " Engineering Design", " Industrial Design", " Research Methods and Tools", " Systematic Design Research Methodology", " Training and Education"], "paper_abstract": "Design research informs and supports practice by developing knowledge to improve the chances of producing successful products. Training in design research has been poorly supported. Design research uses human and natural/technical sciences, embracing all facets of design; its methods and tools are adapted from both these traditions. However, design researchers are rarely trained in methods from both the traditions. Research in traditional sciences focuses primarily on understanding phenomena related to human, natural, or technical systems. Design research focuses on supporting improvement of such systems, using understanding as a necessary but not sufficient step, and it must embrace methods for both understanding reality and developing support for its improvement. A one-semester, postgraduate-level, credited course that has been offered since 2002, entitled Methodology for Design Research, is described that teaches a methodology for carrying out research into design. Its steps are to clarify research success; to understand relevant phenomena of design and how these influence success; to use this to envision design improvement and develop proposals for supporting improvement; to evaluate support for its influence on success; and, if unacceptable, to modify, support, or improve the understanding of success and its links to the phenomena of design. This paper highlights some major issues about the status of design research and describes how design research methodology addresses these. The teaching material, model of delivery, and evaluation of the course on methodology for design research are discussed.", "paper_title": "A course for teaching design research methodology", "paper_id": "WOS:000280031000005"}