{"auto_keywords": [{"score": 0.039415135072106644, "phrase": "financial_performance"}, {"score": 0.03911969223252256, "phrase": "internet_visibility"}, {"score": 0.00481495049065317, "phrase": "structural_equation_model"}, {"score": 0.004722038375317162, "phrase": "internet_reporting"}, {"score": 0.004559270778306828, "phrase": "financial_institutions"}, {"score": 0.004317109072311102, "phrase": "internet_information_disclosure"}, {"score": 0.004152018764100109, "phrase": "paper's_proposed_model"}, {"score": 0.004071846628708832, "phrase": "spanish_financial_institutions"}, {"score": 0.004040211152784802, "phrase": "publicly_available_data"}, {"score": 0.003931402465972151, "phrase": "partial_least_squares"}, {"score": 0.0038554737609608255, "phrase": "positive_and_statistically_significant_relationship"}, {"score": 0.0036080776793146843, "phrase": "direct_and_indirect_effects"}, {"score": 0.00337650257503995, "phrase": "positive_effect"}, {"score": 0.0032220148724914867, "phrase": "direct_effect"}, {"score": 0.0027886573969044042, "phrase": "logical_one"}, {"score": 0.002756180088265064, "phrase": "statistical_methods"}, {"score": 0.002422890839801611, "phrase": "value_added_advantage"}, {"score": 0.0022495644368875686, "phrase": "structural_model"}, {"score": 0.002223351523626989, "phrase": "structural_models"}, {"score": 0.0021049977753042253, "phrase": "disclosure_research"}], "paper_keywords": ["financial reporting", " online operations", " disclosure", " financial institutions", " linear structure equation modelling"], "paper_abstract": "Purpose - A structural equation model is proposed to explain internet reporting by banks. The model relates three constructs of financial institutions (size, financial performance, and internet visibility) to their final influence on internet information disclosure (e-transparency). Design/methodology/approach - This paper's proposed model analyses a sample of Spanish financial institutions using publicly available data. The model is tested using partial least squares. Findings - A positive and statistically significant relationship has been found between size, financial performance, internet visibility, and e-transparency, with direct and indirect effects. The study shows that size accounts for most of the variance. Size has a positive effect on e-transparency, financial performance, and internet visibility. However, the direct effect of financial performance and internet visibility on e-transparency is small. Research limitations/implications - The researchers have analysed only one year of data from one country and one sector. The direction of cause and effect assumed in the model is a logical one, but statistical methods cannot prove causality, only association. Even though any bank can disclose its financial information online for a very low cost, building a robust, interactive web site requires major resources. This gives larger banks a value added advantage. Originality/value - The paper examines the relationship between size, financial performance, internet visibility and e-transparency using a structural model. Although structural models are commonly used in many scientific disciplines, they have not yet been applied in disclosure research.", "paper_title": "Online reporting by banks: a structural modelling approach", "paper_id": "WOS:000248348700005"}