{"auto_keywords": [{"score": 0.047599993411656556, "phrase": "personal_healthcare_devices"}, {"score": 0.008713768692145006, "phrase": "personal_healthcare_services"}, {"score": 0.0086119270122926, "phrase": "automotive_environments"}, {"score": 0.0050685784858982945, "phrase": "automotive_system"}, {"score": 0.004620093797504386, "phrase": "main_purposes"}, {"score": 0.004485735417293941, "phrase": "elderly_people"}, {"score": 0.00443308765153716, "phrase": "chronic_illness"}, {"score": 0.004329630571352367, "phrase": "health_monitoring"}, {"score": 0.004253618550301311, "phrase": "common_life"}, {"score": 0.0036697319652557363, "phrase": "chronic_disease"}, {"score": 0.0031285355811105945, "phrase": "powerful_smart_devices"}, {"score": 0.002455009746748708, "phrase": "personal_healthcare_device"}, {"score": 0.002273292707863821, "phrase": "infotainment_system"}], "paper_keywords": ["Personal healthcare", " ISO/IEEE 11073", " u-Health", " Smart vehicle", " Wireless sensor"], "paper_abstract": "One of the main purposes of personal healthcare devices is for elderly people with chronic illness that needs a health monitoring continuously in common life. There are several standard specifications for personal healthcare devices to interact each other safely and compatibly. Depending on evolution of technology, the elderly and the chronic disease can have their own personal healthcare devices, and they can monitor themselves easily. However, some kind of limitation is still remaining in their life even if they have powerful smart devices. In situation that they need to drive and go to get treatment and to prepare medicine, automotive system does not support interfaces for personal healthcare devices. Therefore, we discuss about several standards of the personal healthcare devices and interfaces for connection of personal healthcare device. Also, automotive environments that include various network interfaces for infotainment and interconnection between infotainment system and devices and platform are considered. After that, we propose several implementations of personal healthcare services to support standard of personal healthcare devices on automotive system.", "paper_title": "Implementation of the personal healthcare services on automotive environments", "paper_id": "WOS:000331801500005"}