{"auto_keywords": [{"score": 0.03760156015498388, "phrase": "proposed_algorithm"}, {"score": 0.008713768692145006, "phrase": "image_matrices"}, {"score": 0.003849711329589429, "phrase": "new_technique"}, {"score": 0.003506851152129303, "phrase": "fisher_criterion_function"}, {"score": 0.003234425353582135, "phrase": "fisher_criterion"}, {"score": 0.0031944286166257466, "phrase": "statistical_correlation"}, {"score": 0.003077372515276563, "phrase": "objective_function"}, {"score": 0.0028737647829311587, "phrase": "uncorrelated_two-dimensional_discriminant_analysis"}, {"score": 0.0026175952455594277, "phrase": "orl_face_database"}, {"score": 0.0025532173213934422, "phrase": "experimental_results"}, {"score": 0.002340081450249521, "phrase": "previous_methods"}, {"score": 0.00231111848128734, "phrase": "feature_extraction"}, {"score": 0.002226357953581725, "phrase": "image_features"}, {"score": 0.0021049977753042253, "phrase": "classical_linear_discriminant_analysis"}], "paper_keywords": [""], "paper_abstract": "Image matrices are often transformed into vectors prior to feature extraction, which results in the curse of dimensionality when the dimensions of matrices are huge. In order to effectively deal with this problem, a new technique for two-dimensional (2D) Fisher discriminant analysis is developed in this paper. In the proposed algorithm, the Fisher criterion function is directly constructed in terms of image matrices. Then we utilize the Fisher criterion and statistical correlation between features to construct an objective function. We theoretically analyze that the proposed algorithm is equivalent to uncorrelated two-dimensional discriminant analysis in some condition. To verify the effectiveness of the proposed algorithm, experiments on ORL face database are made. Experimental results show that the performance of the proposed algorithm is superior to those of some previous methods in feature extraction. Moreover, extraction of image features using the proposed algorithm needs less time than that of classical linear discriminant analysis.", "paper_title": "Two-dimensional fisher discriminant analysis and its application to face recognition", "paper_id": "WOS:000235772300014"}