{"auto_keywords": [{"score": 0.042415635682771985, "phrase": "anaphoric_reference"}, {"score": 0.02322730111336099, "phrase": "clinical_reports"}, {"score": 0.007286817136972254, "phrase": "anaphoric_relations"}, {"score": 0.004741030507509777, "phrase": "annotated_corpus"}, {"score": 0.004625100791402994, "phrase": "real-world_entity"}, {"score": 0.0041759790955637225, "phrase": "previous_mention"}, {"score": 0.003937379670109389, "phrase": "correct_antecedent"}, {"score": 0.0039009678436644183, "phrase": "referring_expression"}, {"score": 0.003543804852018315, "phrase": "anaphor-antecedent_pairs"}, {"score": 0.0032695079595206986, "phrase": "syntactic_and_semantic_nature"}, {"score": 0.003007042361814046, "phrase": "reference_resolution_algorithms"}, {"score": 0.002951631137816642, "phrase": "clinical_text"}, {"score": 0.0028350413546400703, "phrase": "automated_anaphora_resolution"}, {"score": 0.002672852325427058, "phrase": "noun_phrases"}, {"score": 0.002656327554326748, "phrase": "semantic_type"}, {"score": 0.0026317312518257803, "phrase": "section_headings"}, {"score": 0.0025832180231667853, "phrase": "automated_resolution"}, {"score": 0.0025355968118803956, "phrase": "separate_modules"}, {"score": 0.0025199184718145604, "phrase": "reference_resolution"}, {"score": 0.0024811443887080543, "phrase": "different_report_types"}, {"score": 0.0024658019116387845, "phrase": "different_institutions"}, {"score": 0.0024429654627197393, "phrase": "different_types"}, {"score": 0.0024128447214999647, "phrase": "accurate_resolution"}, {"score": 0.002383094469215288, "phrase": "extensive_domain_knowledge"}, {"score": 0.002361022183015472, "phrase": "pathology_and_radiology_reports"}, {"score": 0.002212123058024591, "phrase": "automated_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Natural language processing", " Clinical reports"], "paper_abstract": "Motivation: Expressions that refer to a real-world entity already mentioned in a narrative are often considered anaphoric. For example, in the sentence \"The pain comes and goes,\" the expression \"the pain\" is probably referring to a previous mention of pain. Interpretation of meaning involves resolving the anaphoric reference: deciding which expression in the text is the correct antecedent of the referring expression, also called an anaphor. We annotated a set of 180 clinical reports (surgical pathology, radiology, discharge summaries, and emergency department) from two institutions to indicate all anaphor-antecedent pairs. Objective: The objective of this study is to describe the characteristics of the corpus in terms of the frequency of anaphoric relations, the syntactic and semantic nature of the members of the pairs, and the types of anaphoric relations that occur. Understanding how anaphoric reference is exhibited in clinical reports is critical to developing reference resolution algorithms and to identifying peculiarities of clinical text that may alter the features and methodologies that will be successful for automated anaphora resolution. Results: We found that anaphoric reference is prevalent in all types of clinical reports, that annotations of noun phrases, semantic type, and section headings may be especially important for automated resolution of anaphoric reference, and that separate modules for reference resolution may be required for different report types, different institutions, and different types of anaphors. Accurate resolution will probably require extensive domain knowledge especially for pathology and radiology reports with more part/whole and set/subset relations. Conclusion: We hope researchers will leverage the annotations in this corpus to develop automated algorithms and will add to the annotations to generate a more extensive corpus. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Anaphoric reference in clinical reports: Characteristics of an annotated corpus", "paper_id": "WOS:000305495500011"}