{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "requirements_engineering"}, {"score": 0.004035282762331904, "phrase": "empirical_evaluation"}, {"score": 0.0036018503805251424, "phrase": "significant_number"}, {"score": 0.00355665081072721, "phrase": "empirical_studies"}, {"score": 0.003194580334752371, "phrase": "successful_and_less_successful_application"}, {"score": 0.00301801991152303, "phrase": "progress_empirical_re_research"}, {"score": 0.0027976491158911514, "phrase": "scopus_digital_library"}, {"score": 0.0026597250663309385, "phrase": "peer-reviewed_systematic_literature_reviews"}, {"score": 0.002560751416355291, "phrase": "major_areas"}, {"score": 0.002373690110881497, "phrase": "prior_empirical_research"}, {"score": 0.0022423971916457684, "phrase": "special_issue"}, {"score": 0.0022142194702079866, "phrase": "empirical_research_methodologies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "Since the inception of the RE conference series (1992), both researchers and practitioners in the RE community have acknowledged the significance of empirical evaluation as an instrument to gain knowledge about various aspects of RE phenomena and the validity of our research results. A significant number of empirical studies have been conducted in the search for knowledge about RE problems as well as evidence of successful and less successful application of proposed solutions. This editorial presents the progress empirical RE research has made since 1992. Based on a search in the Scopus digital library, we report from an analysis of peer-reviewed systematic literature reviews and mapping studies to showcase major areas of RE research that use methods from the Empirical Software Engineering paradigm. We summarize prior empirical research in RE and introduce the contributors to this special issue on empirical research methodologies and studies in RE. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Empirical research methodologies and studies in Requirements Engineering: How far did we come?", "paper_id": "WOS:000341338500001"}