{"auto_keywords": [{"score": 0.04808016252998774, "phrase": "iron_losses"}, {"score": 0.028198276166246455, "phrase": "vector_hysteresis_model"}, {"score": 0.013805837769309189, "phrase": "induction_machines"}, {"score": 0.008297149593694628, "phrase": "electrical_machines"}, {"score": 0.004783483480147339, "phrase": "purpose_-_the_purpose"}, {"score": 0.004465187726543722, "phrase": "starting_point"}, {"score": 0.004421471944783611, "phrase": "previously_developed_vector_hysteresis_model"}, {"score": 0.004181678027929924, "phrase": "developed_approach"}, {"score": 0.0039678350316251065, "phrase": "huge_time_consumption"}, {"score": 0.003928969293303814, "phrase": "incorporated_hysteresis_model"}, {"score": 0.00389048276567065, "phrase": "new_approach"}, {"score": 0.0031429517477457925, "phrase": "research_methods"}, {"score": 0.0031019373572233706, "phrase": "paper_deal"}, {"score": 0.0029918783504666894, "phrase": "transient_operations"}, {"score": 0.0027741761880779535, "phrase": "operation_characteristics"}, {"score": 0.002675715174122091, "phrase": "air_gap_field"}, {"score": 0.0026494723416072316, "phrase": "major_role"}, {"score": 0.002497319603143104, "phrase": "main_loss_component"}, {"score": 0.0024325244760735566, "phrase": "practical_value"}, {"score": 0.0023694065215394593, "phrase": "fe_programs"}, {"score": 0.002285278663862646, "phrase": "different_fe_package"}, {"score": 0.0021968983291791784, "phrase": "presented_methods"}, {"score": 0.0021049977753042253, "phrase": "reasonably_short_time"}], "paper_keywords": ["Electric machines", " Steel", " Iron", " Hysteresis", " Modelling"], "paper_abstract": "Purpose - The purpose of this paper is to find out how to model iron losses in electrical machines accurately and efficiently. Design/methodology/approach - The starting point was a previously developed vector hysteresis model that was designed and incorporated into the 2D time-stepping finite-element (FE) simulation of induction machines. The developed approach here is a decoupling between the vector hysteresis model and the 2D FE model of the machine. The huge time consumption of the incorporated hysteresis model required some new approach to make the model computationally efficient. This is dealt with through an a posteriori use of the vector hysteresis model. Findings - In this research, it was found that the vector hysteresis model, although used in an a posteriori scheme is able to accurately predict the iron losses as far as these losses are small enough not to affect the other operation characteristics of the machine. Research limitations/implications - The research methods reported in this paper deal mainly with induction machines. The methods should be applied for transient operations of the induction machines as well as for other types of machines. The fact that the iron losses do not affect very much the operation characteristics of the machine is based on the fact that the air gap field plays a major role in these machines. The method cannot be applied to other magnetic devices where the iron losses are the main loss component. Originality/value - The paper is of practical value for designers of electrical machines, who use FE programs. The methods presented here allow them to use a different FE package to simulate the machine and own routines (based on the presented methods) to predict the iron losses without loss of accuracy and in a reasonably short time.", "paper_title": "A posteriori iron loss computation with a vector hysteresis model", "paper_id": "WOS:000287222800010"}