{"auto_keywords": [{"score": 0.03832185028118783, "phrase": "distance_ir_sensor"}, {"score": 0.015072630070294956, "phrase": "new_algorithm"}, {"score": 0.013160962266832683, "phrase": "relative_orientation"}, {"score": 0.0098868684879181, "phrase": "on-board_sensors"}, {"score": 0.00481495049065317, "phrase": "robotic_cluster"}, {"score": 0.004422632150619634, "phrase": "multi-robot_localization"}, {"score": 0.003525220627709056, "phrase": "absolute_positions"}, {"score": 0.0033943947596098583, "phrase": "team_robots"}, {"score": 0.0026543514413663893, "phrase": "complete_map"}, {"score": 0.0026169435194789772, "phrase": "team_distribution"}, {"score": 0.0023249757987087055, "phrase": "neighbor_robots"}, {"score": 0.0021656385587456952, "phrase": "introduced_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Localization", " Unit disk graph", " Cluster network", " Multi robots"], "paper_abstract": "In this paper, a new algorithm, called cluster matching, is introduced for multi-robot localization and orientation. This algorithm deals with the case in which each robot has the capability to estimate the relative orientation of those robots (called neighbors) that are within its transmission range. Furthermore, the environment is equipped with a distance IR sensor scanning the robots and estimating the absolute positions and orientations of a number of the team robots without knowing their IDs. The IDs of these robots are reconstructed by matching the orientation obtained by the distance IR sensor with the relative orientation measured with on-board sensors. The localization and orientation of robots not visible to the distance IR sensor are obtained by collecting the information coming from the on-board sensors and thus reconstructing a complete map of the team distribution. The accuracy in the estimation of the location of these robots is enhanced by introducing a new algorithm which relies on the localization of neighbor robots. Several simulation scenarios are implemented on tens of robots to show the performance of the introduced algorithm. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Multi-robot localization and orientation estimation using robotic cluster matching algorithm", "paper_id": "WOS:000347507200010"}