{"auto_keywords": [{"score": 0.037085211414711015, "phrase": "process_mining"}, {"score": 0.004815003409473092, "phrase": "scm"}, {"score": 0.004566567411073082, "phrase": "so-called_event_logs"}, {"score": 0.004042635935882651, "phrase": "new_and_more_powerful_process_mining_techniques"}, {"score": 0.003674738405118697, "phrase": "real-life_processes"}, {"score": 0.0034299649219748513, "phrase": "provincial_offices"}, {"score": 0.0031845067058084583, "phrase": "water_infrastructure"}, {"score": 0.0030847461428168614, "phrase": "process_mining_techniques"}, {"score": 0.0023038418282549274, "phrase": "prom_framework"}], "paper_keywords": ["process mining", " social network analysis", " workflow management", " business process management", " business process analysis", " data mining", " Petri nets"], "paper_abstract": "Contemporary information systems (e.g., WfM, ERP, CRM, SCM, and B2B systems) record business events in so-called event logs. Business process mining takes these logs to discover process, control, data, organizational, and social structures. Although many researchers are developing new and more powerful process mining techniques and software vendors are incorporating these in their software, few of the more advanced process mining techniques have been tested on real-life processes. This paper describes the application of process mining in one of the provincial offices of the Dutch National Public Works Department, responsible for the construction and maintenance of the road and water infrastructure. Using a variety of process mining techniques, we analyzed the processing of invoices sent by the various subcontractors and suppliers from three different perspectives: (1) the process perspective, (2) the organizational perspective, and (3) the case perspective. For this purpose, we used some of the tools developed in the context of the ProM framework. The goal of this paper is to demonstrate the applicability of process mining in general and our algorithms and tools in particular. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Business process mining: An industrial application", "paper_id": "WOS:000246598200005"}