{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "net_generation"}, {"score": 0.004736973212570135, "phrase": "growing_interest"}, {"score": 0.0045997680394590365, "phrase": "dutch_higher_education"}, {"score": 0.004394159734054881, "phrase": "'gamer_generation"}, {"score": 0.004351305527177264, "phrase": "'net_generation"}, {"score": 0.004211441113293312, "phrase": "computer_games"}, {"score": 0.0041296807537109246, "phrase": "social_interaction_patterns"}, {"score": 0.004102780105064226, "phrase": "technology_use"}, {"score": 0.0038431888954930083, "phrase": "extensive_computer_use"}, {"score": 0.003695356628334569, "phrase": "new_teaching_method"}, {"score": 0.0034276650497743603, "phrase": "higher_education_students"}, {"score": 0.003394218492907403, "phrase": "netherlands"}, {"score": 0.003231722251475338, "phrase": "formal_education"}, {"score": 0.003210652026669616, "phrase": "today's_students"}, {"score": 0.0031585736196310726, "phrase": "eight_dutch_institutes"}, {"score": 0.0031379788088249576, "phrase": "higher_education"}, {"score": 0.0030369955065974222, "phrase": "clear_representative"}, {"score": 0.0028821186265508597, "phrase": "statistically_significant_difference"}, {"score": 0.002717277008333612, "phrase": "large_or_statistically_significant_differences"}, {"score": 0.002447101794397243, "phrase": "net_generation_theory"}, {"score": 0.002196527318006187, "phrase": "collaborative_and_technology-rich_learning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cooperative/collaborative learning", " Interactive learning environments", " Simulations", " Teaching/learning strategies"], "paper_abstract": "There is a growing interest in the use of simulations and games in Dutch higher education. This development is based on the perception that students belong to the 'gamer generation' or 'net generation': a generation that has grown up with computer games and other technology affecting their preferred learning styles, social interaction patterns and technology use generally. It is often argued that in education this generation prefers active, collaborative and technology-rich learning, i.e. learning methods that involve extensive computer use and collaboration among students. Gaming is then proposed as a new teaching method which addresses these requirements. This article presents the results of a survey which studied whether this discourse is also applicable to higher education students from the Netherlands and whether games, considered as active, collaborative and technology-rich learning experiences, are of greater importance in the formal education of today's students. Of 1432 respondents from eight Dutch institutes of higher education surveyed between 2005 and 2009, about 25% fit our criteria of being a clear representative of the net generation. Furthermore, our analysis shows that there is little difference, and no statistically significant difference, in active, collaborative and technology-rich learning preferences between the representatives and non-representatives of the net generation. Furthermore, no large or statistically significant differences were found between representatives and non-representatives of the net generation with respect to the value they accorded to gaming in education. Overall our dataset did not fit the expectations raised by the net generation theory, with the percentage of students who fit the criteria being much lower than expected. However, regardless of whether they represented the net generation or not, in general our respondents preferred collaborative and technology-rich learning and deemed games a valuable teaching method. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Reviewing the need for gaming in education to accommodate the net generation", "paper_id": "WOS:000292437400007"}