{"auto_keywords": [{"score": 0.03184684011389751, "phrase": "failure_information"}, {"score": 0.031461310706329015, "phrase": "group_members"}, {"score": 0.00481495049065317, "phrase": "multicast_communications"}, {"score": 0.004522796947899013, "phrase": "group_key_management_problem"}, {"score": 0.004143196873246147, "phrase": "serious_drawback"}, {"score": 0.0040916230716372265, "phrase": "real_network_conditions"}, {"score": 0.003940706575253453, "phrase": "asynchronous_wide-area_networks"}, {"score": 0.0031845067058084583, "phrase": "new_challenge"}, {"score": 0.0028805474861014722, "phrase": "heavy_communication"}, {"score": 0.0028091907694771613, "phrase": "small_groups"}, {"score": 0.002722468694023035, "phrase": "periodic_broadcast"}, {"score": 0.0024625017739528096, "phrase": "logical_ring"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["multicast", " security", " key management", " fault-tolerance"], "paper_abstract": "Several protocols have been proposed to deal with the group key management problem. Unfortunately, most of these protocols lack fault-tolerance. This is a serious drawback in real network conditions, especially, when considering asynchronous wide-area networks, such as the Internet, where messages may be delayed indefinitely and nodes may fail. To cope with this limitation, failure detection/correction mechanisms are necessary. This kind of solutions introduces a new challenge, which is the requirement of periodically exchanging failure information between group members. This is a heavy communication overhead even with small groups. To avoid the periodic broadcast of failure information, we propose in this paper a solution that structures group members into a logical ring where only pair-wise communications are necessary to detect failures. Compared to other schemes, our solution is efficient and fault-tolerant. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "FTKM: A fault-tolerant key management protocol for multicast communications", "paper_id": "WOS:000241221500022"}