{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "system_values"}, {"score": 0.004234129588974058, "phrase": "market_dominance"}, {"score": 0.004176194589991187, "phrase": "conceptual_framework"}, {"score": 0.004062682236016889, "phrase": "theoretical_logic"}, {"score": 0.0038447943243941685, "phrase": "standards_development"}, {"score": 0.003757480190200645, "phrase": "porous_process"}, {"score": 0.003689053436223376, "phrase": "cooperative_interests"}, {"score": 0.0036553070575015344, "phrase": "competitive_pressures"}, {"score": 0.0032436052954996097, "phrase": "broader_system_values"}, {"score": 0.003213920601037463, "phrase": "normative_questions"}, {"score": 0.003140888248194296, "phrase": "proper_tradeoffs"}, {"score": 0.0030554300179552415, "phrase": "collective_efficiencies"}, {"score": 0.002786964045867666, "phrase": "intellectual_property"}, {"score": 0.002711109302199029, "phrase": "economic_development"}, {"score": 0.002361632539339945, "phrase": "growing_and_changing_discipline"}, {"score": 0.0021940118003312397, "phrase": "national_interest"}, {"score": 0.002163930783583212, "phrase": "development_activities"}, {"score": 0.0021049977753042253, "phrase": "economic_competitiveness"}], "paper_keywords": ["Standards", " SDO", " accreditation", " consortia", " intellectual property", " framework", " modeling", " simulation", " rulemaking", " governance", " government", " mandate", " conformity"], "paper_abstract": "This article discusses the dynamics inherent in modeling and simulation (M&S) standards development processes within the context of the competitive struggle for resources and market dominance. A conceptual framework is presented that provides the theoretical logic for the tension between inclusive, consensus-driven standards development processes and exclusive, preferential processes. Standards development is conceptualized as a porous process subject to both cooperative interests and competitive pressures. We elucidate how the tension between these two process ideals shapes the adoption and conformity of M&S standards and, in turn, how these processes facilitate broader system values. Normative questions are explicated about the proper tradeoffs among the desire to realize collective efficiencies gained through standards, the drive to create, own, and financially exploit new, emerging technologies through the concept of intellectual property, and the objective of economic development through fostering innovation. Both the organizational and individual incentives to engage in standards processes are discussed, together with how the politics of participation may shape standards development. This research contributes a compelling theoretical perspective not fully developed in the growing and changing discipline of M&S. The significance of exploring these questions is found in that there is a national interest in M&S standards development activities that contribute to our technological innovation and economic competitiveness.", "paper_title": "Modeling and simulation standards development, adoption and conformity in the attainment of system values: a framework for the tension between two process ideals", "paper_id": "WOS:000337567500008"}