{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "homogeneous_conic_linear_system"}, {"score": 0.004734448316824488, "phrase": "homogeneous_conic_system"}, {"score": 0.0043977131796676325, "phrase": "computational_properties"}, {"score": 0.0043699845927285905, "phrase": "normalized_system"}, {"score": 0.004163102554855044, "phrase": "c._we"}, {"score": 0.004128131970741084, "phrase": "computational_complexity"}, {"score": 0.00407622386616284, "phrase": "interior-point_method"}, {"score": 0.0040334640350288, "phrase": "complexity_value"}, {"score": 0.003357062328890972, "phrase": "double_right_arrow_alpha_y"}, {"score": 0.00300806500201762, "phrase": "general_theory"}, {"score": 0.0029953897844316162, "phrase": "projective_re-_normalization"}, {"score": 0.0029764767329116875, "phrase": "feasible_region"}, {"score": 0.0025458479274370832, "phrase": "high_probability"}, {"score": 0.0025084811914344754, "phrase": "geometric_random_walk"}, {"score": 0.0024979058181672604, "phrase": "associated_probabilistic_complexity_analysis"}, {"score": 0.0024148883246458263, "phrase": "conic_system"}, {"score": 0.0022713722522505592, "phrase": "randomly_generated_homogeneous_linear_programming_feasibility_problems"}, {"score": 0.0022145052062614514, "phrase": "projective_re-normalization_methodology"}, {"score": 0.0021773853011112882, "phrase": "overall_computation_time"}, {"score": 0.0021682027434117095, "phrase": "conic_feasibility_problems"}, {"score": 0.0021273570879990988, "phrase": "average_ipm_iterations"}, {"score": 0.0021049977753042253, "phrase": "poorly-behaved_problem_instances"}], "paper_keywords": [""], "paper_abstract": "In this paper we study the homogeneous conic system F : Ax = 0, is an element of C\\{0}. We choose a point (s) over bar. is an element of intC* that serves as a normalizer and consider computational properties of the normalized system F (s) over bar : Ax = 0, s(-T) x = 1, x is an element of C. We show that the computational complexity of solving F via an interior-point method depends only on the complexity value v of the barrier for C and on the symmetry of the origin in the image set H ((s)) over bar := {Ax: (s) over bar (T) x = 1, x is an element of C}, where the symmetry of 0 in H (s) over bar is sym(0, H ((s)) over bar) := max{alpha : y is an element of H (s) over bar double right arrow alpha y is an element of H (s) over bar}. We show that a solution of F can be computed in O(root v ln (v/sym (0, H ((s)) over bar) interior-point iterations. In order to improve the theoretical and practical computation of a solution of F, we next present a general theory for projective re- normalization of the feasible region F ((s)) over bar and the image set H ((s)) over bar and prove the existence of a normalizer (s) over bar such that sym(0, H ((s)) over bar) = 1/m provided that F has an interior solution. We develop a methodology for constructing a normalizer (s) over bar such that sym(0, H ((s)) over bar) >= 1/m with high probability, based on sampling on a geometric random walk with associated probabilistic complexity analysis. While such a normalizer is not itself computable in strongly-polynomial-time, the normalizer will yield a conic system that is solvable in O(root v ln (mv)) iterations, which is strongly-polynomial-time. Finally, we implement this methodology on randomly generated homogeneous linear programming feasibility problems, constructed to be poorly behaved. Our computational results indicate that the projective re-normalization methodology holds the promise to markedly reduce the overall computation time for conic feasibility problems; for instance we observe a 46% decrease in average IPM iterations for 100 randomly generated poorly-behaved problem instances of dimension 1,000 x 5,000.", "paper_title": "Projective re-normalization for improving the behavior of a homogeneous conic linear system", "paper_id": "WOS:000262316200004"}