{"auto_keywords": [{"score": 0.031235092053115466, "phrase": "proposed_algorithm"}, {"score": 0.015719716506582538, "phrase": "brain_mr_image_segmentation"}, {"score": 0.01466906399417306, "phrase": "brain_mr_images"}, {"score": 0.012717496322168466, "phrase": "proposed_spatial_factor"}, {"score": 0.012505457305096798, "phrase": "prior_probabilities"}, {"score": 0.011424181245147779, "phrase": "negative_log-posterior"}, {"score": 0.011328424034649658, "phrase": "dissimilarity_function"}, {"score": 0.010657519104469491, "phrase": "intensity_inhomogeneity"}, {"score": 0.010261023827886434, "phrase": "fuzzy_objective_function"}, {"score": 0.010132130403425775, "phrase": "bias_field_estimation_model"}, {"score": 0.00470404724078948, "phrase": "essential_step"}, {"score": 0.004684157900507474, "phrase": "quantitative_brain_image_analysis"}, {"score": 0.0046249906895543804, "phrase": "extensive_research_attention"}, {"score": 0.0044424917428102445, "phrase": "limited_robustness"}, {"score": 0.004349337717774093, "phrase": "limited_segmentation_accuracy"}, {"score": 0.004330941610682453, "phrase": "image_details"}, {"score": 0.004204320052179726, "phrase": "fuzzy_c-means"}, {"score": 0.004064117897000019, "phrase": "novel_spatial_factor"}, {"score": 0.003928572641266562, "phrase": "spatial_information"}, {"score": 0.0039119492240482, "phrase": "neighborhood_pixels"}, {"score": 0.0038380066875929714, "phrase": "posterior_probabilities"}, {"score": 0.00378145978325955, "phrase": "spatial_direction"}, {"score": 0.003709974534103202, "phrase": "linear_filters"}, {"score": 0.0032184697893776052, "phrase": "bias_field"}, {"score": 0.00319804885707732, "phrase": "pixel-by-pixel_level"}, {"score": 0.003150900886669123, "phrase": "orthogonal_polynomials"}, {"score": 0.0028944757265206332, "phrase": "first_group"}, {"score": 0.0027565664671199146, "phrase": "state-of-the-art_segmentation"}, {"score": 0.00273326215689528, "phrase": "jaccard"}, {"score": 0.0027159094186967247, "phrase": "benchmark_images"}, {"score": 0.002698668759373592, "phrase": "ibsr"}, {"score": 0.0026872355344859833, "phrase": "brainweb"}, {"score": 0.0026758504186829425, "phrase": "different_level"}, {"score": 0.0026307897899760383, "phrase": "comparison_results"}, {"score": 0.0025919830205975215, "phrase": "higher_accuracy_segmentation"}, {"score": 0.002575526825728026, "phrase": "stronger_ability"}, {"score": 0.002526780881314497, "phrase": "abundant_textures"}, {"score": 0.002468450551616404, "phrase": "rscfcm_algorithm"}, {"score": 0.0024012441367538434, "phrase": "novel_factor"}, {"score": 0.0023210293050850276, "phrase": "existing_fcm-type_clustering_schemes"}, {"score": 0.0023111922860677672, "phrase": "em-type_mixture_models"}, {"score": 0.0022722584151582616, "phrase": "standard_deviation_of_jaccard_similarity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Image segmentation", " Magnetic resonance imaging", " Fuzzy c-means", " Spatial information", " Intensity inhomogeneity"], "paper_abstract": "Objective: Accurate brain tissue segmentation from magnetic resonance (MR) images is an essential step in quantitative brain image analysis, and hence has attracted extensive research attention. However, due to the existence of noise and intensity inhomogeneity in brain MR images, many segmentation algorithms suffer from limited robustness to outliers, over-smoothness for segmentations and limited segmentation accuracy for image details. To further improve the accuracy for brain MR image segmentation, a robust spatially constrained fuzzy c-means (RSCFCM) algorithm is proposed in this paper. Method: Firstly, a novel spatial factor is proposed to overcome the impact of noise in the images. By incorporating the spatial information amongst neighborhood pixels, the proposed spatial factor is constructed based on the posterior probabilities and prior probabilities, and takes the spatial direction into account. It plays a role as linear filters for smoothing and restoring images corrupted by noise. Therefore, the proposed spatial factor is fast and easy to implement, and can preserve more details. Secondly, the negative log-posterior is utilized as dissimilarity function by taking the prior probabilities into account, which can further improve the ability to identify the class for each pixel. Finally, to overcome the impact of intensity inhomogeneity, we approximate the bias field at the pixel-by-pixel level by using a linear combination of orthogonal polynomials. The fuzzy objective function is then integrated with the bias field estimation model to overcome the intensity inhomogeneity in the image and segment the brain MR images simultaneously. Results: To demonstrate the performances of the proposed algorithm for the images with/without skull stripping, the first group of experiments is carried out in clinical 3T-weighted brain MR images which contain quite serious intensity inhomogeneity and noise. Then we quantitatively compare our algorithm to state-of-the-art segmentation approaches by using Jaccard similarity on benchmark images obtained from IBSR and BrainWeb with different level of noise and intensity inhomogeneity. The comparison results demonstrate that the proposed algorithm can produce higher accuracy segmentation and has stronger ability of denoising, especially in the area with abundant textures and details. Conclusion: In this paper, the RSCFCM algorithm is proposed by utilizing the negative log-posterior as the dissimilarity function, introducing a novel factor and integrating the bias field estimation model into the fuzzy objective function. This algorithm successfully overcomes the drawbacks of existing FCM-type clustering schemes and EM-type mixture models. Our statistical results (mean and standard deviation of Jaccard similarity for each tissue) on both synthetic and clinical images show that the proposed algorithm can overcome the difficulties caused by noise and bias fields, and is capable of improving over 5% segmentation accuracy comparing with several state-of-the-art algorithms. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Robust spatially constrained fuzzy c-means algorithm for brain MR image segmentation", "paper_id": "WOS:000334978100017"}