{"auto_keywords": [{"score": 0.04832242519222614, "phrase": "beta-sheet_topology"}, {"score": 0.026982864739737534, "phrase": "beta-strand_ordering"}, {"score": 0.00481495049065317, "phrase": "beta-strand_packing_interactions"}, {"score": 0.004543046350523362, "phrase": "long-range_interactions"}, {"score": 0.004198323646273642, "phrase": "ab_initio_methods"}, {"score": 0.004112020122418323, "phrase": "supplementary_method"}, {"score": 0.0038157022294338454, "phrase": "three-dimensional_search_space"}, {"score": 0.003645192746918234, "phrase": "signature_molecular_descriptor"}, {"score": 0.0035113478590679133, "phrase": "protein-protein_interactions"}, {"score": 0.003424850089214916, "phrase": "quantitative_structure-activity_relationships"}, {"score": 0.003340475943517995, "phrase": "peptide_inhibitors"}, {"score": 0.003231191164622055, "phrase": "signature_descriptor"}, {"score": 0.003151572886432253, "phrase": "support_vector_machine"}, {"score": 0.0027818804382539444, "phrase": "entire_pdb_database"}, {"score": 0.0027588314610845705, "phrase": "ten-fold_cross-validation"}, {"score": 0.0026796495639791426, "phrase": "packing_prediction"}, {"score": 0.002602734354498382, "phrase": "edge_strands"}, {"score": 0.0024554476124885806, "phrase": "correct_ordering"}, {"score": 0.002231310272815607, "phrase": "accurate_predictions"}], "paper_keywords": ["beta-sheets", " secondary structure prediction", " signature descriptor", " support vector machine"], "paper_abstract": "The prediction of beta-sheet topology requires the consideration of long-range interactions between beta-strands that are not necessarily consecutive in sequence. Since these interactions are difficult to simulate using ab initio methods, we propose a supplementary method able to assign beta-sheet topology using only sequence information. We envision using the results of our method to reduce the three-dimensional search space of ab initio methods. Our method is based on the signature molecular descriptor, which has been used previously to predict protein-protein interactions successfully, and to develop quantitative structure-activity relationships for small organic drugs and peptide inhibitors. Here, we show how the signature descriptor can be used in a Support Vector Machine to predict whether or not two beta-strands will pack adjacently within a protein. We then show how these predictions can be used to order beta-strands within beta-sheets. Using the entire PDB database with ten-fold cross-validation, we have achieved 74.0% accuracy in packing prediction and 75.6% accuracy in the prediction of edge strands. For the case of beta-strand ordering, we are able to predict the correct ordering accurately for 51.3% of the beta-sheets. Furthermore, using a simple confidence metric, we can determine those sheets for which accurate predictions can be obtained. For the top 25% highest confidence predictions, we are able to achieve 95.7% accuracy in beta-strand ordering.", "paper_title": "Prediction of beta-strand packing interactions using the signature product", "paper_id": "WOS:000235756300012"}