{"auto_keywords": [{"score": 0.04803089662471404, "phrase": "digital_libraries"}, {"score": 0.041394261792965556, "phrase": "user_interfaces"}, {"score": 0.00481495049065317, "phrase": "search_ling"}, {"score": 0.0043945048085683005, "phrase": "comparative_user_evaluation"}, {"score": 0.003885085477351673, "phrase": "usability_and_affordance_strength_questionnaires"}, {"score": 0.0036893794227117194, "phrase": "users'_evaluation"}, {"score": 0.0036456298076415652, "phrase": "key_components"}, {"score": 0.003313741359811683, "phrase": "study_show"}, {"score": 0.0031845067058084583, "phrase": "search_tasks"}, {"score": 0.0031592690527974285, "phrase": "thesaurus-enhanced_search_interfaces"}, {"score": 0.0030847461428168614, "phrase": "searchling"}, {"score": 0.0028037753646260937, "phrase": "thesaural_relationships"}, {"score": 0.0027594936602962075, "phrase": "selected_term"}, {"score": 0.00267301171407926, "phrase": "empirical_data"}, {"score": 0.0026307897899760383, "phrase": "design_ideas"}, {"score": 0.0025180781216911246, "phrase": "search_interfaces"}, {"score": 0.0024488738006005133, "phrase": "multilingual_features"}, {"score": 0.0024006068621542642, "phrase": "methodological_framework"}, {"score": 0.002372103459168231, "phrase": "developed_user_interfaces"}, {"score": 0.002181813794658713, "phrase": "thesaural_terms"}, {"score": 0.0021049977753042253, "phrase": "novel_visualization_techniques"}], "paper_keywords": ["visual user interfaces", " search user interfaces", " multilingual search and retrieval", " thesauri", " user evaluation"], "paper_abstract": "The objective of this paper is to report on a comparative user evaluation of two multilingual thesaurus-enhanced visual user interfaces-namely, T-saurus and Searchling, designed and developed for digital libraries. The study used 25 academic users carrying out three search tasks on both user interfaces. It applied usability and affordance strength questionnaires, interviews, think-alouds, and direct observation to investigate users' evaluation of the key components of both user interfaces-namely, multilingual features, thesaurus and search functions, and visualization and visual appeal. Results of the study show that users were able to successfully carry out the search tasks using thesaurus-enhanced search interfaces. However, they preferred Searchling, a faceted search user interface, for its flexible language option, thesaurus browsing, and visualization. Users preferred the interface to show the thesaural relationships along with the selected term without interacting with the interface. The empirical data gathered and the design ideas implemented within the two user interfaces will be useful for designers of search interfaces that make use of thesaurus and multilingual features. The design and methodological framework of the developed user interfaces and the study could be used to create more information-rich multilingual academic search user interfaces for teaching and learning purposes. The design and representation of thesaural terms and structures in these two interfaces are designed using novel visualization techniques.", "paper_title": "User Evaluation of Search ling and T-saurus: Multilingual Thesaurus-Enhanced Visual Interfaces for Digital Libraries", "paper_id": "WOS:000321478600004"}