{"auto_keywords": [{"score": 0.049483572884790016, "phrase": "image_search_reranking"}, {"score": 0.04495971759688538, "phrase": "low-level_visual_features"}, {"score": 0.00481495049065317, "phrase": "web_image_search"}, {"score": 0.004666598697538815, "phrase": "effective_approach"}, {"score": 0.004551199992546761, "phrase": "text-based_image_search_result"}, {"score": 0.004040688646993609, "phrase": "semantic_attributes"}, {"score": 0.0036324746826127997, "phrase": "attribute_feature"}, {"score": 0.0028268629720802772, "phrase": "visually_similar_images"}, {"score": 0.0027741761880779535, "phrase": "similar_ranking_scores"}, {"score": 0.00262191949451482, "phrase": "visual-attribute_joint_hypergraph_learning_approach"}, {"score": 0.002172093645267283, "phrase": "experimental_results"}], "paper_keywords": ["Search", " hypergraph", " attribute-assisted"], "paper_abstract": "Image search reranking is an effective approach to refine the text-based image search result. Most existing reranking approaches are based on low-level visual features. In this paper, we propose to exploit semantic attributes for image search reranking. Based on the classifiers for all the predefined attributes, each image is represented by an attribute feature consisting of the responses from these classifiers. A hypergraph is then used to model the relationship between images by integrating low-level visual features and attribute features. Hypergraph ranking is then performed to order the images. Its basic principle is that visually similar images should have similar ranking scores. In this paper, we propose a visual-attribute joint hypergraph learning approach to simultaneously explore two information sources. A hypergraph is constructed to model the relationship of all images. We conduct experiments on more than 1,000 queries in MSRA-MMV2.0 data set. The experimental results demonstrate the effectiveness of our approach.", "paper_title": "An Attribute-Assisted Reranking Model for Web Image Search", "paper_id": "WOS:000346793400001"}