{"auto_keywords": [{"score": 0.04028465982960715, "phrase": "variable_bit-rate_video_streams"}, {"score": 0.0157337834713787, "phrase": "proposed_approach"}, {"score": 0.010544242201733141, "phrase": "real-world_limited_bandwidth_networks"}, {"score": 0.009791027108869721, "phrase": "traffic_surveillance_systems"}, {"score": 0.007393957726365228, "phrase": "high_bit-rate_video_streams"}, {"score": 0.006998663866507501, "phrase": "moving_object_detection_stage"}, {"score": 0.00481495049065317, "phrase": "automatic_traffic_monitoring"}, {"score": 0.004661446705304497, "phrase": "integral_component"}, {"score": 0.004631335513513859, "phrase": "intelligent_transportation_systems"}, {"score": 0.0043830840694466, "phrase": "video_communication"}, {"score": 0.004354763128496983, "phrase": "real-world_networks"}, {"score": 0.004229556887896042, "phrase": "network_congestion"}, {"score": 0.004202223763361474, "phrase": "unstable_bandwidth"}, {"score": 0.004107935669507044, "phrase": "wireless_video_communication"}, {"score": 0.003989797665674148, "phrase": "rate_control_scheme"}, {"score": 0.0038876302202924644, "phrase": "obtainable_network_bandwidth"}, {"score": 0.003788069044402032, "phrase": "complete_and_accurate_detection"}, {"score": 0.0035386420095120706, "phrase": "motion_detection"}, {"score": 0.003493021648360933, "phrase": "analysis-based_radial_basis_function_network"}, {"score": 0.003305584108847751, "phrase": "low_bit-rate_video_streams"}, {"score": 0.003097865379563127, "phrase": "lower-dimensional_eigen-patterns"}, {"score": 0.0027472888482450776, "phrase": "low_bit-rate"}, {"score": 0.00265090644169702, "phrase": "output_value"}, {"score": 0.002599763359352916, "phrase": "detection_results"}, {"score": 0.00250041084632787, "phrase": "bit-rate_video"}, {"score": 0.0024283900925346257, "phrase": "proposed_method"}, {"score": 0.0023815296953640383, "phrase": "real-time_application"}, {"score": 0.002366110899738696, "phrase": "quantitative_and_qualitative_evaluations"}], "paper_keywords": ["Intelligent transportation systems", " moving object detection", " neural network", " principal component analysis", " variable bit-rate"], "paper_abstract": "Automated motion detection technology is an integral component of intelligent transportation systems, and is particularly essential for management of traffic and maintenance of traffic surveillance systems. Traffic surveillance systems using video communication over real-world networks with limited bandwidth often encounter difficulties due to network congestion and/or unstable bandwidth. This is especially problematic in wireless video communication. This has necessitated the development of a rate control scheme which alters the bit-rate to match the obtainable network bandwidth, thereby producing variable bit-rate video streams. However, complete and accurate detection of moving objects under variable bit-rate video streams is a very difficult task. In this paper, we propose an approach for motion detection which utilizes an analysis-based radial basis function network as its principal component. This approach is applicable not only in high bit-rate video streams, but in low bit-rate video streams, as well. The proposed approach consists of a various background generation stage and a moving object detection stage. During the various background generation stage, the lower-dimensional Eigen-patterns and the adaptive background model are established in variable bit-rate video streams by using the proposed approach in order to accommodate the properties of variable bit-rate video streams. During the moving object detection stage, moving objects are extracted via the proposed approach in both low bit-rate and high bit-rate video streams; detection results are then generated through the output value of the proposed approach. The detection results produced through our approach indicate it to be highly effective in variable bit-rate video streams over real-world limited bandwidth networks. In addition, the proposed method can be easily achieved for real-time application. Quantitative and qualitative evaluations demonstrate that it offers advantages over other state-of-the-art methods. For instance, and Similarity and F-1 accuracy rates produced via the proposed approach were up to 86.38% and 89.88% higher than those produced via other compared methods, respectively.", "paper_title": "An Advanced Moving Object Detection Algorithm for Automatic Traffic Monitoring in Real-World Limited Bandwidth Networks", "paper_id": "WOS:000333111500022"}