{"auto_keywords": [{"score": 0.046273829908275735, "phrase": "capacity_region"}, {"score": 0.015719716506582538, "phrase": "z-interference_channels"}, {"score": 0.012869834021170872, "phrase": "transmitter-receiver_pair"}, {"score": 0.010153500810127183, "phrase": "sum_capacity"}, {"score": 0.004234134308239916, "phrase": "korner"}, {"score": 0.0041954289214128256, "phrase": "marton"}, {"score": 0.003809628721278519, "phrase": "conditional_output_entropy"}, {"score": 0.0036385493850693983, "phrase": "transmitted_codewords"}, {"score": 0.003555902292752528, "phrase": "new_capacity_region"}, {"score": 0.0031991799574455555, "phrase": "specific_points"}, {"score": 0.00290473242917264, "phrase": "alternate_method"}, {"score": 0.00283870598459543, "phrase": "gaussian_z-interference_channels"}, {"score": 0.0027614468443073028, "phrase": "additional_restriction"}, {"score": 0.0025892330566358503, "phrase": "single_input_distribution"}, {"score": 0.0025420267431501367, "phrase": "interference_distribution"}, {"score": 0.002183938718432764, "phrase": "partial_decoding"}, {"score": 0.0021049977753042253, "phrase": "single-letter_characterization"}], "paper_keywords": ["Capacity", " interference channel", " one-sided interference channel", " Z-interference channel"], "paper_abstract": "We define a class of Z-interference channels for which we obtain a new upper bound on the capacity region. The bound exploits a technique first introduced by Korner and Marton. A channel in this class has the property that, for the transmitter-receiver pair that suffers from interference, the conditional output entropy at the receiver is invariant with respect to the transmitted codewords. We compare the new capacity region upper bound with the Han/Kobayashi achievable rate region for interference channels. This comparison shows that our bound is tight in some cases, thereby yielding specific points on the capacity region as well as sum capacity for certain Z-interference channels. In particular, this result can be used as an alternate method to obtain sum capacity of Gaussian Z-interference channels. We then apply an additional restriction on our channel class: the transmitter-receiver pair that suffers from interference achieves its maximum output entropy with a single input distribution irrespective of the interference distribution. For these channels, we show that our new capacity region upper bound coincides with the Han/Kobayashi achievable rate region, which is therefore capacity-achieving. In particular, for these channels superposition encoding with partial decoding is shown to be optimal and a single-letter characterization for the capacity region is obtained.", "paper_title": "Capacity Regions and Bounds for a Class of Z-Interference Channels", "paper_id": "WOS:000271019700014"}