{"auto_keywords": [{"score": 0.004610058444728656, "phrase": "partner_alignment"}, {"score": 0.004413846562278824, "phrase": "non-equity_alliance_governance_mode"}, {"score": 0.004180234323211199, "phrase": "six_developed_asia_pacific_countries"}, {"score": 0.0038737214010638745, "phrase": "non-equity_governance_mode"}, {"score": 0.0033810134162565843, "phrase": "governance_mode"}, {"score": 0.0031845067058084613, "phrase": "similar_or_related_industries"}, {"score": 0.0028715299874549245, "phrase": "behavioral_uncertainty_arguments"}, {"score": 0.0023346234464901978, "phrase": "ex_ante_specification"}, {"score": 0.002128067018576581, "phrase": "emergent_opportunities"}], "paper_keywords": ["governance mode", " alliance", " partner alignment", " information technology"], "paper_abstract": "This study investigates the effect of partner alignment on the choice of using equity versus non-equity alliance governance mode in information technology (IT) software alliances. Using 485 IT software alliances established in six developed Asia Pacific countries in the period 1998 to 2004, this study proposed and found that non-equity governance mode is adopted when the partners are of the same nationality and when the number of partners in the alliance is smaller. The choice of governance mode is however not affected by whether the partners come from similar or related industries and whether the alliance is established in the same industry as the partners. These results partially support the behavioral uncertainty arguments in transaction cost economics (TCE), as opposed to the need to maintain control and protect knowledge and technologies. This observation can be partially attributed to the nature of activities in the IT software sector where ex ante specification of activities is difficult and thus the need to maintain flexibility to allow for uncertainty and emergent opportunities. Various implications are discussed.", "paper_title": "Partner alignment and governance in IT software alliances", "paper_id": "WOS:000246678000002"}