{"auto_keywords": [{"score": 0.03225375782798011, "phrase": "temporal_association_rules"}, {"score": 0.00481495049065317, "phrase": "quasi-functional_temporal_dependencies"}, {"score": 0.004521179256835894, "phrase": "machine_learning"}, {"score": 0.004485735417293941, "phrase": "knowledge_discovery"}, {"score": 0.00443308765153716, "phrase": "logic_programming"}, {"score": 0.0040176151419992956, "phrase": "semantically_correct_situations"}, {"score": 0.003772306776343196, "phrase": "useful_and_actionable_knowledge"}, {"score": 0.0035141291835319682, "phrase": "outlier_detection"}, {"score": 0.00348655247465418, "phrase": "temporal_databases"}, {"score": 0.0033651019362620866, "phrase": "association_rules"}, {"score": 0.003299460925313939, "phrase": "normal_behavior"}, {"score": 0.0032350961776525075, "phrase": "frequent_rules"}, {"score": 0.003134705849154561, "phrase": "time_information"}, {"score": 0.002943147037670826, "phrase": "temporal_quasi-functional_dependencies"}, {"score": 0.0026045914281028473, "phrase": "temporal_quasi-functional_dependency"}, {"score": 0.0023976048394496446, "phrase": "considered_database_and_infers_rules"}, {"score": 0.002259883463607508, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge discovery", " Temporal outlier detection", " Temporal databases", " Temporal association rules", " Temporal functional dependencies"], "paper_abstract": "The problem of detecting outliers has been investigated in several research areas such as database, machine learning, knowledge discovery, and logic programming, with the aim of identifying objects of a given population whose behavior is different from that of the other data objects of the dataset. Outliers represent semantically correct situations, albeit infrequent with respect to the majority of cases. Detecting them allows extracting useful and actionable knowledge of interest to domain experts. In this paper, we focus our attention on the analysis of outlier detection in temporal databases. We propose a method, based on association rules, to infer the normal behavior of objects by extracting frequent rules from a given dataset. To include the time information, we define the concept of temporal association rules. Then, temporal association rules are combined to generate temporal quasi-functional dependencies, which define relationships among attributes over time which hold frequently. Once such dependencies have been inferred from data, outliers are retrieved with respect to them. Given a temporal quasi-functional dependency, it is possible to discover the outliers by querying the temporal association rules stored previously. Our method is independent of the considered database and infers rules, used to highlight outliers, directly from data. The applicability of the proposed approach is validated through a set of experiments which show its effectiveness and efficiency. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "TOD: Temporal outlier detection by using quasi-functional temporal dependencies", "paper_id": "WOS:000278255100005"}