{"auto_keywords": [{"score": 0.041435594524021464, "phrase": "rtdes_models"}, {"score": 0.03985254164922043, "phrase": "failure_diagnosis"}, {"score": 0.03734218400951657, "phrase": "logical_behaviour"}, {"score": 0.00481495049065317, "phrase": "delay-deadline_failures"}, {"score": 0.00477190623242136, "phrase": "fair_real_time"}, {"score": 0.004750527930368202, "phrase": "discrete_event_models"}, {"score": 0.004521566043596533, "phrase": "real_time"}, {"score": 0.00450130420152996, "phrase": "discrete_event_systems"}, {"score": 0.003987126862293129, "phrase": "real_time_systems"}, {"score": 0.0037608593980593035, "phrase": "untimed_des_models"}, {"score": 0.003499864176875713, "phrase": "failed_system"}, {"score": 0.0034220655476652683, "phrase": "logical_failures"}, {"score": 0.003361069456060196, "phrase": "rtdes_and_tdes_models"}, {"score": 0.0032277611129050234, "phrase": "timing_behaviour"}, {"score": 0.0028076592725295646, "phrase": "infinitely_many_occurrences"}, {"score": 0.0025545134727682716, "phrase": "rtdes_and_tdes_diagnosability_conditions"}, {"score": 0.0023033100935570755, "phrase": "new_diagnosability_condition"}, {"score": 0.0022218413146898887, "phrase": "fairness_property"}], "paper_keywords": ["failure diagnosis", " discrete event systems", " real time systems", " fairness"], "paper_abstract": "In this article a method for failure diagnosis of real time discrete event systems (RTDES) with 'fairness of traces' has been developed. Discrete event system (DES) modelling framework with provision for associating timing information with the transitions are required for handling real time systems. RTDES models and timed DES (TDES) models are examples of such modelling frameworks. Failure diagnosis in untimed DES models enables only the study of diagnosability of failures resulting in a change in the logical behaviour of the failed system. In addition to logical failures, failure diagnosis in RTDES and TDES models also enables diagnosability of failures that change the timing behaviour of the system but maintain the logical behaviour. Many systems exhibit fairness of traces with respect to transitions in the sense that any trace that visits a state infinitely often has infinitely many occurrences of all the transitions that emanate from that state. The abstraction employed in obtaining their (timed) DES models often obliterates this property. The RTDES and TDES diagnosability conditions, proposed in the literature and which do not consider fairness, are shown to be inadequate in this article. A new diagnosability condition is achieved by taking into account this fairness property in the RTDES models and shown to be necessary and sufficient for such systems. An analysis of time complexity for analysing the diagnosability of systems with fairness of traces is presented.", "paper_title": "Diagnosability of delay-deadline failures in fair real time discrete event models", "paper_id": "WOS:000278648300003"}