{"auto_keywords": [{"score": 0.04960202571834177, "phrase": "local_volume_preservation"}, {"score": 0.00481495049065317, "phrase": "spine-driven_bending"}, {"score": 0.0046491050101721545, "phrase": "one-dimensional_proxy_c"}, {"score": 0.004291073117901643, "phrase": "digital_model"}, {"score": 0.004060986196931943, "phrase": "skinning_techniques"}, {"score": 0.0038624981944755813, "phrase": "physical_plausibility"}, {"score": 0.0038239757564863057, "phrase": "digital_simulations"}, {"score": 0.0037480753312398754, "phrase": "proposed_fleshing_techniques"}, {"score": 0.003097865379563127, "phrase": "precise_characterization"}, {"score": 0.0029169007179202164, "phrase": "bijective_mapping_m"}, {"score": 0.0028446460307503343, "phrase": "point_x"}, {"score": 0.0022824139466623844, "phrase": "u"}], "paper_keywords": [""], "paper_abstract": "Several design and animation techniques use a one-dimensional proxy C (a spine curve in 3D) to control the deformation or behavior of a digital model of a 3D shape S. We propose a modification of these skinning techniques that ensures local volume preservation, which is important for the physical plausibility of digital simulations. In the proposed fleshing techniques, as input, we consider a smooth spine C0, a model S0 of a solid that lies sufficiently close to C0, and a deformed version C1 of C0 that is not overly bent. (We provide a precise characterization of these restrictions.) As output, we produce a bijective mapping M, that maps any point X of S onto a point M(X) of M(S). M satisfies two properties: (1) The closest projection of X on C0 and of M(X) on C1 have the same arc length parameter. (2) U and M(U) have the same volume, where U is any subset of S. We provide three different closed form expressions for radial, normal and binormal fleshing and discuss the details of their practical real-time implementation.", "paper_title": "Fleshing: Spine-driven Bending with Local Volume Preservation", "paper_id": "WOS:000318546300004"}