{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "systematic_literature_review"}, {"score": 0.040708700726361825, "phrase": "independent_variables"}, {"score": 0.004769958800452922, "phrase": "fault_prediction_performance"}, {"score": 0.004725385523804256, "phrase": "software_engineering"}, {"score": 0.00432208488976429, "phrase": "test_effort"}, {"score": 0.003789395499639015, "phrase": "modeling_techniques"}, {"score": 0.003684048704119722, "phrase": "fault_prediction_models"}, {"score": 0.003353521531649663, "phrase": "quantitative_and_qualitative_results"}, {"score": 0.0032602525602322832, "phrase": "sufficient_contextual_and_methodological_information"}, {"score": 0.002939853413763817, "phrase": "simple_modeling_techniques"}, {"score": 0.0028986672783671147, "phrase": "naive_bayes"}, {"score": 0.0028715299874549245, "phrase": "logistic_regression"}, {"score": 0.002688532127821979, "phrase": "feature_selection"}, {"score": 0.0023678143146455017, "phrase": "predictive_performance"}, {"score": 0.002280333649167796, "phrase": "fault_prediction_studies"}, {"score": 0.0021450029487459403, "phrase": "reliable_methodology"}], "paper_keywords": ["Systematic literature review", " software fault prediction"], "paper_abstract": "Background: The accurate prediction of where faults are likely to occur in code can help direct test effort, reduce costs, and improve the quality of software. Objective: We investigate how the context of models, the independent variables used, and the modeling techniques applied influence the performance of fault prediction models. Method: We used a systematic literature review to identify 208 fault prediction studies published from January 2000 to December 2010. We synthesize the quantitative and qualitative results of 36 studies which report sufficient contextual and methodological information according to the criteria we develop and apply. Results: The models that perform well tend to be based on simple modeling techniques such as Naive Bayes or Logistic Regression. Combinations of independent variables have been used by models that perform well. Feature selection has been applied to these combinations when models are performing particularly well. Conclusion: The methodology used to build models seems to be influential to predictive performance. Although there are a set of fault prediction studies in which confidence is possible, more studies are needed that use a reliable methodology and which report their context, methodology, and performance comprehensively.", "paper_title": "A Systematic Literature Review on Fault Prediction Performance in Software Engineering", "paper_id": "WOS:000311556100003"}