{"auto_keywords": [{"score": 0.03689565391010681, "phrase": "blocking_probability"}, {"score": 0.008650068093089108, "phrase": "wake-up_time"}, {"score": 0.00481495049065317, "phrase": "performance_degradation"}, {"score": 0.004774324145784758, "phrase": "sleep-mode_enabled_core_optical_networks"}, {"score": 0.0046544807197808095, "phrase": "important_target"}, {"score": 0.004556901872357751, "phrase": "wavelength-division-multiplexing-based_core_optical_networks"}, {"score": 0.004404994123834589, "phrase": "energy-efficient_optical_networks"}, {"score": 0.004330941610682453, "phrase": "opto-electronic_devices"}, {"score": 0.004186534737631288, "phrase": "low_power_mode"}, {"score": 0.003945266418163835, "phrase": "low_traffic_periods"}, {"score": 0.0037178503842258087, "phrase": "substantial_energy_savings"}, {"score": 0.0034299649219748513, "phrase": "opaque_networks"}, {"score": 0.003259702394241964, "phrase": "end-to-end_path"}, {"score": 0.003150900886669123, "phrase": "multiple_network_nodes"}, {"score": 0.002785978280998868, "phrase": "transparent_networks"}, {"score": 0.0022722584151582616, "phrase": "novel_routing_algorithm"}, {"score": 0.0021410718792612173, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "extensive_results"}], "paper_keywords": ["Energy efficiency", " On-off strategies", " Routing algorithms"], "paper_abstract": "Energy efficiency is an important target for the management of wavelength-division-multiplexing-based core optical networks. A possible power management strategy for energy-efficient optical networks consists in putting opto-electronic devices (transponders and regenerators) into a low power mode, called sleep or idle, or even turning them off, during low traffic periods. It has been shown that sleep-mode enabled transponders and regenerators yield to substantial energy savings; however, their nonnegligible wake-up time may degrade the network performance in terms of the blocking probability of the connections. Opaque networks, in which transponders are utilized at each node in the end-to-end path, are especially prone to such degradations since multiple network nodes may simultaneously exhaust their pool of transponders due to long wake-up times, increasing the blocking probability. On the other hand, these degradations are less severe in transparent networks. In this paper, we evaluate how the duration of the wake-up time affects the performance of the network in terms of blocking probability depending on its architecture (transparent, translucent, or opaque) and the dynamicity of the traffic. Additionally, we propose a novel routing algorithm to mitigate the blocking probability due to the wake-up time. The benefits of the proposed algorithm are highlighted through extensive results.", "paper_title": "Analysis of Performance Degradation in Sleep-Mode Enabled Core Optical Networks", "paper_id": "WOS:000351735300020"}