{"auto_keywords": [{"score": 0.050078487022614894, "phrase": "delayed_response"}, {"score": 0.04961045469105367, "phrase": "hurricane_katrina"}, {"score": 0.048458449814347104, "phrase": "knowledge_management"}, {"score": 0.03596176205294269, "phrase": "katrina"}, {"score": 0.004428753210416834, "phrase": "turkish"}, {"score": 0.004257806363128601, "phrase": "new_york"}, {"score": 0.0037649600980696773, "phrase": "u.s."}, {"score": 0.0036017332224257893, "phrase": "congress"}, {"score": 0.003496868378204657, "phrase": "formal_inquiry"}, {"score": 0.00307657476125683, "phrase": "km_framework"}, {"score": 0.002986969236641105, "phrase": "disaster_management"}, {"score": 0.0025137856138000014, "phrase": "television_interview_transcripts"}, {"score": 0.0024525907271610125, "phrase": "internet_resources"}, {"score": 0.0024166894703554374, "phrase": "wikipedia"}, {"score": 0.0022443390559699974, "phrase": "delay_causes"}, {"score": 0.002157538586313944, "phrase": "km_processes"}, {"score": 0.0021049977753042253, "phrase": "government_agencies"}], "paper_keywords": [""], "paper_abstract": "In contrast to many recent large-scale catastrophic events, such as the Turkish earthquake in 1999, the 9/11 attack in New York in 2001, the Bali Bombing in 2002, and the Asian Tsunami in 2004, the initial rescue effort towards Hurricane Katrina in the U.S. in 2005 had been sluggish. Even as Congress has promised to convene a formal inquiry into the response to Katrina, this article offers another perspective by analyzing the delayed response through the lens of knowledge management (KM). A KM framework situated in the context of disaster management is developed to study three distinct but overlapping KM processes, namely, knowledge creation, knowledge transfer, and knowledge reuse. Drawing from a total of more than 400 documents-including local, national, and foreign news articles, newswires, congressional reports, and television interview transcripts, as well as Internet resources such as wikipedia and blogs - 14 major delay causes in Katrina are presented. The extent to which the delay causes were a result of the lapses in KM processes within and across the government agencies are discussed.", "paper_title": "An analysis of the delayed response to Hurricane Katrina through the lens of knowledge management", "paper_id": "WOS:000246379400007"}