{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "experience_knowledge_structure"}, {"score": 0.009054061695014866, "phrase": "e-decisional_community"}, {"score": 0.004466519142879166, "phrase": "knowledge-explicit_way"}, {"score": 0.004366970206156021, "phrase": "significant_task"}, {"score": 0.004112175423546628, "phrase": "decisional_knowledge"}, {"score": 0.00396050388346298, "phrase": "formal_decision_events"}, {"score": 0.003701401653850141, "phrase": "utmost_advance"}, {"score": 0.0031845067058084583, "phrase": "ontology-based_technology"}, {"score": 0.002931569771634119, "phrase": "companies'_decisional_dna._such_possibility"}, {"score": 0.0023390219342052623, "phrase": "owl_decisional_ontology"}, {"score": 0.0021693692831601745, "phrase": "decisional_dna"}], "paper_keywords": ["knowledge acquisition", " knowledge representation formalism and method", " artificial intelligence", " information systems applications", " semantic networks"], "paper_abstract": "Collecting, distributing and sharing knowledge in a knowledge-explicit way is a significant task for any company. However, collecting decisional knowledge in the form of formal decision events as the fingerprints of a company is an utmost advance. Such decisional fingerprint is called decisional DNA. Set of experience knowledge structure can assist on accomplishing this purpose. In addition, Ontology-based technology applied to set of experience knowledge structure would facilitate distributing and sharing companies' decisional DNA. Such possibility would assist in the development of an e-decisional community, which will support decision-makers on their overwhelming job. The purpose of this paper is to explain the development of. an OWL decisional Ontology built upon set of experience, which would make decisional DNA, that is, explicit knowledge of formal decision events, a useful element in multiple systems and technologies, as well as in the construction of the e-decisional community.", "paper_title": "An OWL ontology of set of experience knowledge structure", "paper_id": "WOS:000246814000008"}