{"auto_keywords": [{"score": 0.023124186959886994, "phrase": "informal_learning"}, {"score": 0.00481495049065317, "phrase": "community_members'_roles"}, {"score": 0.0047588556219929756, "phrase": "partnership_research_projects"}, {"score": 0.004134372859330047, "phrase": "greater_control"}, {"score": 0.003991449490087454, "phrase": "technology_acceptance"}, {"score": 0.0038085117064624208, "phrase": "research_project"}, {"score": 0.0035705347414368696, "phrase": "informal_learning_methods"}, {"score": 0.0033277936960179892, "phrase": "community_representatives"}, {"score": 0.0032697235411641695, "phrase": "key_roles"}, {"score": 0.003212663446866794, "phrase": "daily_life"}, {"score": 0.0030833537429977797, "phrase": "present_article"}, {"score": 0.0029592333031063156, "phrase": "developmental_trajectories"}, {"score": 0.0028234703730349916, "phrase": "different_nonprofit_organization"}, {"score": 0.0027417911324611917, "phrase": "information_technology_efficacy"}], "paper_keywords": [""], "paper_abstract": "For 3 years, the authors of this article and several other colleagues have worked with 11 nonprofit community groups to help them take greater control of their information technology in terms of technology acceptance, adoption, and literacy through a research project. As part of this project, the authors explored informal learning methods that the groups could benefit from and practiced them with the community representatives who played key roles in the daily life of the organizations. In the present article, the authors reflect on the developmental trajectories observed for two individuals, each from a different nonprofit organization, with respect to information technology efficacy and ability. The authors analyze these trajectories as a sequence of the following four technology-related roles-technology consumers, technology planners, technology doers, and technology sustainers. The authors describe these roles, the methods used to promote informal learning, and implications for other researchers studying informal learning in communities.", "paper_title": "The Development of Community Members' Roles in Partnership Research Projects: An Empirical Study", "paper_id": "WOS:000328743400014"}