{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "theoretical_studies"}, {"score": 0.004753746768805543, "phrase": "interactions"}, {"score": 0.004281678802569817, "phrase": "host_cell"}, {"score": 0.004162703509434786, "phrase": "hiv_entry_process"}, {"score": 0.0034984340449789745, "phrase": "second_extra-cellular_loop"}, {"score": 0.0033377940531761985, "phrase": "crown_part"}, {"score": 0.003038237581227068, "phrase": "trans-membrane_domain"}, {"score": 0.002650857539177183, "phrase": "altered_state"}, {"score": 0.002626034130205569, "phrase": "aplaviroc"}, {"score": 0.0023902026696615473, "phrase": "quite_different_effect"}, {"score": 0.0023346250107435535, "phrase": "ccrs"}, {"score": 0.0021857667493036786, "phrase": "experimental_observations"}, {"score": 0.0021450029487459403, "phrase": "structural_basis"}], "paper_keywords": [""], "paper_abstract": "The interaction between the HIV gp120 protein and coreceptor CCR5 or CXCR4 of the host cell is critical in mediating the HIV entry process. A model for the CCR5-gp 120 complex has been developed. In the model, the N-terminus of CCR5 binds to three discontinuous domains of gp120, including the fourth conserved (C4) region, beta 19/beta 20 connecting loop, and V3 loop. The second extra-cellular loop (ECL2) of CCR5 also interacts with the crown part of the gp120 V3 loop. The bindings of the three CCR5 antagonists, maraviroc, aplaviroc, and vicriviroc, to the trans-membrane domain of CCR5 have been modeled. The bindings are found to affect the conformation of the ECL2 domain, which in turn drives the N-terminus of CCR5 to an altered state. Aplaviroc is more hydrophilic than maraviroc and vicriviroc, and its binding is more interfered by solvent, resulting in a quite different effect to the structure of CCRS compared with those of the other two molecules. The above results are in accord with experimental observations and provide a structural basis for further design of CCR5 antagonists.", "paper_title": "Theoretical Studies on the Interactions and Interferences of HIV-1 Glycoprotein gp120 and Its Coreceptor CCR5", "paper_id": "WOS:000287685700016"}