{"auto_keywords": [{"score": 0.04975317258245106, "phrase": "broadband_adoption"}, {"score": 0.00481495049065317, "phrase": "-economic_determinants"}, {"score": 0.004701247803858319, "phrase": "innovative_forms"}, {"score": 0.004527947981009528, "phrase": "broadband_internet"}, {"score": 0.004436116555817464, "phrase": "equitable_distribution"}, {"score": 0.004200197763119297, "phrase": "social_exclusion"}, {"score": 0.004100952337610039, "phrase": "limited_internet_use"}, {"score": 0.0040452928361255445, "phrase": "lower_incomes"}, {"score": 0.004017745870068031, "phrase": "educational_levels"}, {"score": 0.00388278852285898, "phrase": "socio-economic_determinants"}, {"score": 0.0035526625882388936, "phrase": "overall_aim"}, {"score": 0.003480541792744611, "phrase": "empirical_data"}, {"score": 0.0034450303951025704, "phrase": "socio-economic_variables"}, {"score": 0.003386645324034521, "phrase": "postal_survey"}, {"score": 0.003352088714126572, "phrase": "uk._findings"}, {"score": 0.002903628734069691, "phrase": "practical_implications"}, {"score": 0.0027395968397212053, "phrase": "emerging_technologies"}, {"score": 0.002430411367515404, "phrase": "broadband_adopters"}, {"score": 0.0023167153974120083, "phrase": "previous_literature"}], "paper_keywords": ["broadband networks", " digital computers", " socio-economic regions", " residential areas", " United Kingdom"], "paper_abstract": "Purpose - As innovative forms of information and communication technologies (ICTs) such as broadband internet are being adopted, the equitable distribution of ICTs has become an issue of concern. These apprehensions are being attributed to social exclusion that could arise due to the limited internet use among citizens with lower incomes or educational levels. This research aims to examine the impact of socio-economic determinants, such as age, gender, education, income and occupation, on the adoption of broadband. Design/methodology/approach - A survey research approach was employed to achieve the overall aim of this research. The empirical data of the socio-economic variables was collected employing a postal survey in the UK. Findings - The findings of this research suggest that in terms of broadband adoption, except for gender, all the other socio-economic variables, including age, education, occupation and income, significantly helped to explain differences between the adopters and non-adopters of broadband. Practical implications - The implications of the findings are discussed in the context of promoting the adoption of emerging technologies such as broadband to parts of the population that have limited access to the internet and ICTs in general. Originality/value - The primary value of this paper lies in extending the understanding of broadband adopters and non-adopters according to their socio-economic attributes. This has been achieved by synthesising the previous literature on a number of socio-economic: variables (such as age, gender, education, income and occupation) and also by empirically examining their effects on broadband adoption.", "paper_title": "Socio-economic determinants of broadband adoption", "paper_id": "WOS:000248068600004"}