{"auto_keywords": [{"score": 0.04825250923342016, "phrase": "public_policy"}, {"score": 0.00481495049065317, "phrase": "social_divide"}, {"score": 0.004661446705304497, "phrase": "current_research"}, {"score": 0.004527462929045081, "phrase": "collaborative_design_process"}, {"score": 0.004483659121004398, "phrase": "poor_suburban_community"}, {"score": 0.004243289764306128, "phrase": "research_project"}, {"score": 0.004094639048362357, "phrase": "state-sponsored_agency"}, {"score": 0.0038251032877881412, "phrase": "tildeo_paulo"}, {"score": 0.0036553070575015344, "phrase": "nomads.usp_research_center"}, {"score": 0.0035848560487286166, "phrase": "interactive_living"}, {"score": 0.003493021648360933, "phrase": "design_methodology"}, {"score": 0.003370565320453525, "phrase": "multidisciplinary_and_multicultural_aspects"}, {"score": 0.0033163269450817716, "phrase": "potential_users"}, {"score": 0.0032629585038738856, "phrase": "virtual_community"}, {"score": 0.003038125530190128, "phrase": "findings_-_special_interest"}, {"score": 0.002989220655735981, "phrase": "architectural_methods"}, {"score": 0.0028471655497661528, "phrase": "design_process"}, {"score": 0.0028195727965553367, "phrase": "active_exchange"}, {"score": 0.0026942913145235614, "phrase": "local_context"}, {"score": 0.0026768530320943063, "phrase": "large_social_differences"}, {"score": 0.002420516633871835, "phrase": "designer_team"}, {"score": 0.0022536005664642294, "phrase": "actual_relevance"}, {"score": 0.0022101055924375725, "phrase": "cybernetic_theory"}, {"score": 0.0021049977753042253, "phrase": "poor_communities"}], "paper_keywords": ["cybernetics", " public policy", " brazil", " design", " sociocybernetics", " economic cooperation"], "paper_abstract": "Purpose - This paper aims to draw on current research in public policy, and more specifically about a collaborative design process for a poor suburban community in S (a) over tildeo Paulo, Brazil and its relation to social cybernetics as the \"science of effective organization.\" The research project in public policy, online-communities, has been financed by the state-sponsored agency FAPESP since 2003, and involves four research groups from the Architecture and Computer Science Departments at the University of S (a) over tildeo Paulo, and various public and non-governmental organizations under the coordination of Nomads.usp Research Center (Center for Studies on Interactive Living, www.eesc.usp.br/nomads). Design/methodology/approach - The design methodology includes three premises: an organization of the team which considers multidisciplinary and multicultural aspects; the involvement of potential users as creators of the virtual community and of its concrete space; and the concern that the process will be organized so that autonomy and evolution take place. Findings - Special interest in the comparison of architectural methods and cybernetics is to understand how information and communication are dealt with using a design process to promote active exchange of knowledge and competences, and to improve interaction and conversation in a local context of large social differences, affected by lack of opportunities and regulating structures. Practical implications - Owing to its constant questioning of viability, adaptability and recursion, cybernetics should be able to make the designer team constantly revise the proposal to change conditions during its process of implementation and later autonomy. Originality/value - The paper discusses the actual relevance of the use of the cybernetic theory as a way to improve information and communication between designers and the population in poor communities.", "paper_title": "Architecture as a verb: cybernetics and design processes for the social divide", "paper_id": "WOS:000251883500021"}