{"auto_keywords": [{"score": 0.04828362906607965, "phrase": "neural_p_systems"}, {"score": 0.036817037816123374, "phrase": "control_word"}, {"score": 0.025497176504605874, "phrase": "spiking_neural_p_system"}, {"score": 0.00481495049065317, "phrase": "control_languages_associated"}, {"score": 0.004769182299692333, "phrase": "spiking_neural_p_systems"}, {"score": 0.004546755482549647, "phrase": "usual_spiking_neural_p_systems"}, {"score": 0.003791763445590174, "phrase": "chosen_alphabet"}, {"score": 0.003348513474852869, "phrase": "control_words"}, {"score": 0.003043031131345537, "phrase": "control_languages"}, {"score": 0.002687070469080394, "phrase": "non-empty_label"}, {"score": 0.0026235360404084137, "phrase": "regular_language"}, {"score": 0.0025861368747446324, "phrase": "control_language"}, {"score": 0.002537097217899195, "phrase": "context-sensitive_non-context-free_languages"}, {"score": 0.002305468528385778, "phrase": "labeled_spiking_neural_p_systems"}, {"score": 0.0021049977753042253, "phrase": "recursively_enumerable_language"}], "paper_keywords": [""], "paper_abstract": "We consider labeled spiking neural P systems, which are usual spiking neural P systems with a label associated with every rule; the labels are symbols of a given alphabet or can be lambda (empty). The rules used in a transition should have either the empty label or the same label from the chosen alphabet. In this way, a string is associated with each halting computation, called the control word of the computation. The set of all control words associated with computations in a given spiking neural P system form the control language of the system. We study the family of control languages of spiking neural P systems in comparison with the families of finite, regular, context-free, context-sensitive, and recursively enumerable languages. In the restricted case when in each step at least one rule with a non-empty label is used, every regular language is a control language, there are context-sensitive non-context-free languages of this type, but not all context-free languages are control languages of a spiking neural P system. All languages that are accepted by labeled spiking neural P systems are context-sensitive. If transitions with all rules labeled with lambda are allowed, then each recursively enumerable language can be the control word of a spiking neural P system.", "paper_title": "Control Languages Associated with Spiking Neural P Systems", "paper_id": "WOS:000323706200001"}