{"auto_keywords": [{"score": 0.03495285014461313, "phrase": "mechanism_design"}, {"score": 0.00481495049065317, "phrase": "large-scale_distributed_systems"}, {"score": 0.004713656264685915, "phrase": "open_systems"}, {"score": 0.00425103400920119, "phrase": "network_protocols"}, {"score": 0.004174220694700258, "phrase": "overall_system"}, {"score": 0.004000322474812552, "phrase": "third-party_components"}, {"score": 0.0036074566790283633, "phrase": "socially-desirable_outcomes"}, {"score": 0.003531474887552889, "phrase": "exact_behaviour"}, {"score": 0.0034994014234054397, "phrase": "market_participants"}, {"score": 0.0031748333717241456, "phrase": "specific_outcome"}, {"score": 0.002969276778056666, "phrase": "important_foundation"}, {"score": 0.0029512611306191194, "phrase": "multi-agent_systems"}, {"score": 0.0029334629173406067, "phrase": "mas"}, {"score": 0.0028802818629647614, "phrase": "traditional_mechanism_design_problem"}, {"score": 0.002802462902794585, "phrase": "agents'_game-theoretically_optimal_strategies"}, {"score": 0.0025578967205807843, "phrase": "underlying_assumptions"}, {"score": 0.002414138203828421, "phrase": "alternative_approaches"}, {"score": 0.0023560464785206095, "phrase": "engineering_problem"}, {"score": 0.002320449502337321, "phrase": "engineering_design_principles"}, {"score": 0.0021700901058417602, "phrase": "intractable_complexity"}, {"score": 0.0021049977753042253, "phrase": "evolutionary_mechanism_design"}], "paper_keywords": ["Multi-agent systems", " Auction theory", " Evolutionary game theory", " Mechanism design"], "paper_abstract": "The advent of large-scale distributed systems poses unique engineering challenges. In open systems such as the internet it is not possible to prescribe the behaviour of all of the components of the system in advance. Rather, we attempt to design infrastructure, such as network protocols, in such a way that the overall system is robust despite the fact that numerous arbitrary, non-certified, third-party components can connect to our system. Economists have long understood this issue, since it is analogous to the design of the rules governing auctions and other marketplaces, in which we attempt to achieve socially-desirable outcomes despite the impossibility of prescribing the exact behaviour of the market participants, who may attempt to subvert the market for their own personal gain. This field is known as \"mechanism design\": the science of designing rules of a game to achieve a specific outcome, even though each participant may be self-interested. Although it originated in economics, mechanism design has become an important foundation of multi-agent systems (MAS) research. In a traditional mechanism design problem, analytical methods are used to prove that agents' game-theoretically optimal strategies lead to socially desirable outcomes. In many scenarios, traditional mechanism design and auction theory yield clear-cut results; however, there are many situations in which the underlying assumptions of the theory are violated due to the messiness of the real-world. In this paper we review alternative approaches to mechanism design which treat it as an engineering problem and bring to bear engineering design principles, viz.: iterative step-wise refinement of solutions, and satisficing instead of optimization in the face of intractable complexity. We categorize these approaches under the banner of evolutionary mechanism design.", "paper_title": "Evolutionary mechanism design: a review", "paper_id": "WOS:000278717100006"}