{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "open_source_developers"}, {"score": 0.04780597585803098, "phrase": "open_source_software_projects"}, {"score": 0.004783852487938866, "phrase": "open_source_software_development"}, {"score": 0.004454691230204595, "phrase": "essential_step"}, {"score": 0.004354763128496983, "phrase": "development_process"}, {"score": 0.004284755353695709, "phrase": "development_teams"}, {"score": 0.004107935669507044, "phrase": "different_developers"}, {"score": 0.00401575464882225, "phrase": "development_team"}, {"score": 0.0038876302202924644, "phrase": "actual_key_developers"}, {"score": 0.003691048155818806, "phrase": "open_source_projects"}, {"score": 0.003158776195052182, "phrase": "rigorous_statistical_techniques"}, {"score": 0.003018468582368033, "phrase": "fine_gain_analysis"}, {"score": 0.002828740624702789, "phrase": "automated_identification"}, {"score": 0.0028104345972072534, "phrase": "key_contributors"}, {"score": 0.002720661389788773, "phrase": "analyzed_datasets"}, {"score": 0.0026768530320943063, "phrase": "statistical_techniques"}, {"score": 0.0025829353063908256, "phrase": "automated_way"}, {"score": 0.0024442137370930296, "phrase": "open_source_version_control_systems"}, {"score": 0.002397048726373276, "phrase": "main_result"}, {"score": 0.002327998222143962, "phrase": "recurrent_pattern"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Open source", " Development process", " Empirical studies", " Software metrics"], "paper_abstract": "Open source software development is becoming always more relevant. Understanding the behavior of developers in open source software projects and identifying the kinds of their contributions is an essential step to improve the efficiency of the development process and to organize the development teams more effectively. Moreover, understanding the level of participation of the different developers helps to understand which members of the development team are more important than others and who are the actual key developers. This paper investigates the behavior of open source developers and the structure of the development of open source projects through the analysis of a very large dataset: 10 well-known and widely used open source software projects for a total of more than 4 MLOC (millions of lines of code) modified distributed in more than 200 K versions. This study builds on the top of other studies in this area applying a set of rigorous statistical techniques, analyzing how developers contribute to the projects. Its novelty is in the fine gain analysis of the developers that have commit rights on the repository of the project they work on, in the automated identification of key contributors of the project, in the size of the analyzed datasets, and in the statistical techniques used to classify the behavior of the developers in an automated way. To collect such large volume of data and to ensure their integrity, a tool to automatically mine open source version control systems has been used. The main result of this study is the identification of a recurrent pattern of four kinds of contributors with the same characteristics in all the projects analyzed even if the projects are very different in domain, size, language, etc. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "A multivariate classification of open source developers", "paper_id": "WOS:000313146700006"}