{"auto_keywords": [{"score": 0.0493653882313026, "phrase": "field_defects"}, {"score": 0.022140038767028546, "phrase": "static_bug-finding_tools"}, {"score": 0.010185314503510515, "phrase": "false_negatives"}, {"score": 0.004334280585565239, "phrase": "software_defects"}, {"score": 0.004096751549280256, "phrase": "actual_defects"}, {"score": 0.0034722233102219466, "phrase": "empirical_study"}, {"score": 0.0033947594838968326, "phrase": "five_state-of-the-art_static_bug-finding_tools"}, {"score": 0.0032571885279065126, "phrase": "jcsc"}, {"score": 0.003172551230409948, "phrase": "fixed_defects"}, {"score": 0.0030901063954739375, "phrase": "rhino"}, {"score": 0.0028769371032728733, "phrase": "state-of-the-art_static_bug-finding_tools"}, {"score": 0.0027395968397212053, "phrase": "false_positives"}, {"score": 0.0026583500966092044, "phrase": "orthogonal_issue"}, {"score": 0.0023390219342052623, "phrase": "tool_warnings"}, {"score": 0.0022273034991008326, "phrase": "missed_defects"}], "paper_keywords": ["False negatives", " Static bug-finding tools", " Empirical study"], "paper_abstract": "Software defects can cause much loss. Static bug-finding tools are designed to detect and remove software defects and believed to be effective. However, do such tools in fact help prevent actual defects that occur in the field and reported by users? If these tools had been used, would they have detected these field defects, and generated warnings that would direct programmers to fix them? To answer these questions, we perform an empirical study that investigates the effectiveness of five state-of-the-art static bug-finding tools (FindBugs, JLint, PMD, CheckStyle, and JCSC) on hundreds of reported and fixed defects extracted from three open source programs (Lucene, Rhino, and AspectJ). Our study addresses the question: To what extent could field defects be detected by state-of-the-art static bug-finding tools? Different from past studies that are concerned with the numbers of false positives produced by such tools, we address an orthogonal issue on the numbers of false negatives. We find that although many field defects could be detected by static bug-finding tools, a substantial proportion of defects could not be flagged. We also analyze the types of tool warnings that are more effective in finding field defects and characterize the types of missed defects. Furthermore, we analyze the effectiveness of the tools in finding field defects of various severities, difficulties, and types.", "paper_title": "To what extent could we detect field defects? An extended empirical study of false negatives in static bug-finding tools", "paper_id": "WOS:000361600000005"}