{"auto_keywords": [{"score": 0.04502515223200546, "phrase": "historic_houses"}, {"score": 0.007244729847810367, "phrase": "uk"}, {"score": 0.006066371702304685, "phrase": "managing_historic_houses"}, {"score": 0.0055098308490959015, "phrase": "information_provision"}, {"score": 0.00481495049065317, "phrase": "uk_historic_houses"}, {"score": 0.004421601997620278, "phrase": "\"built_heritage"}, {"score": 0.004198010835867604, "phrase": "similar_vein"}, {"score": 0.004167001961564886, "phrase": "small_businesses"}, {"score": 0.003912469968653304, "phrase": "tourism_and_leisure_market"}, {"score": 0.0038835683852063707, "phrase": "heritage"}, {"score": 0.003840598580753804, "phrase": "wide_variety"}, {"score": 0.0037560869590718966, "phrase": "historic_gardens"}, {"score": 0.0037283301619292636, "phrase": "heritage_centres"}, {"score": 0.00370077772049505, "phrase": "town_centres"}, {"score": 0.003385555209074879, "phrase": "information-seeking_behaviour"}, {"score": 0.0031786037839399055, "phrase": "managing_properties"}, {"score": 0.0025916375737852506, "phrase": "effective_use"}, {"score": 0.0025157865918985704, "phrase": "future_generations"}, {"score": 0.002469508424323385, "phrase": "empirical_work_recommendations"}, {"score": 0.0024330980793680337, "phrase": "policy_making"}, {"score": 0.0021684903968454267, "phrase": "first_study"}, {"score": 0.0021365087453258263, "phrase": "existing_situation"}], "paper_keywords": ["Heritage", " Information management"], "paper_abstract": "Purpose - The purpose of this paper is to concentrate on establishments that are known as the \"built heritage\", often described as \"historic houses\". Many operate in a similar vein to small businesses and often have a more diverse range of needs. In the UK historic houses form part of the tourism and leisure market. Heritage encompasses a wide variety of establishments including historic houses, historic gardens, heritage centres, town centres, countryside and museums. Design/methodology/approach - A model was developed for the study to show the information needs of historic houses and the information-seeking behaviour of those managing historic houses. Data have been collected both via questionnaires to and interviews of those managing properties. The collection of data focused on diversity of activities, information provision, use of information, developments (including technology) and collaboration. Findings - The conclusions discuss the management of information and the difficulties expressed for those managing historic houses as discovered during the research. Properties need to be able to make effective use of this to protect the heritage for future generations. Building on the empirical work recommendations are made on policy making, education, audits, co-operation and technology to improve the provision and management of information within the sector to support these establishments. Originality/value - The research represents the first study to investigate the existing situation of historic houses and their information needs in the UK, to try and provide an overview of the sector and information provision and how that might be improved.", "paper_title": "The information needs of UK historic houses: mapping the ground", "paper_id": "WOS:000274648700003"}