{"auto_keywords": [{"score": 0.04927547645406283, "phrase": "protein_secondary_structure_prediction"}, {"score": 0.03798013525699018, "phrase": "prediction_results"}, {"score": 0.00481495049065317, "phrase": "protein_secondary_structure_predictions"}, {"score": 0.004670431171164122, "phrase": "challenging_problem"}, {"score": 0.0045302298105691615, "phrase": "prediction_methods"}, {"score": 0.003525493807130663, "phrase": "line_prediction_tools"}, {"score": 0.0034780071331554003, "phrase": "combined_prediction"}, {"score": 0.0034545033623115634, "phrase": "higher_quality"}, {"score": 0.0034079696245884073, "phrase": "input_protein"}, {"score": 0.0029655761366079877, "phrase": "secondary_structure"}, {"score": 0.002660482980203146, "phrase": "selected_team"}, {"score": 0.0026424892463535717, "phrase": "prediction_tools"}, {"score": 0.002214965506028584, "phrase": "resulting_prediction"}, {"score": 0.0021776870246727233, "phrase": "eva_accuracy_parameters"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Proteomics", " Protein structure prediction", " Data integration"], "paper_abstract": "Protein secondary structure prediction is still a challenging problem at today. Even if a number of prediction methods have been presented in the literature, the various prediction tools that are available on-line produce results whose quality is not always fully satisfactory. Therefore, a user has to know which predictor to use for a given protein to be analyzed. In this paper, we propose a server implementing a method to improve the accuracy in protein secondary structure prediction. The method is based on integrating the prediction results computed by some available on-line prediction tools to obtain a combined prediction of higher quality. Given an input protein p whose secondary structure has to be predicted, and a group of proteins F, whose secondary structures are known, the server currently works according to a two phase approach: (i) it selects a set of predictors good at predicting the secondary structure of proteins in F (and, therefore, supposedly, that of p as well), and (ii) it integrates the prediction results delivered for p by the selected team of prediction tools. Therefore, by exploiting our system, the user is relieved of the burden of selecting the most appropriate predictor for the given input protein being, at the same time, assumed that a prediction result at least as good as the best available one will be delivered. The correctness of the resulting prediction is measured referring to EVA accuracy parameters used in several editions of CASP. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Improving protein secondary structure predictions by prediction fusion", "paper_id": "WOS:000265165700004"}