{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electronic_health_records"}, {"score": 0.004253618550301311, "phrase": "critical_ddis"}, {"score": 0.004143196873246147, "phrase": "medication-related_decision_support_alerts"}, {"score": 0.004035630066743877, "phrase": "medication_knowledge_base_vendors"}, {"score": 0.004005422077299942, "phrase": "ehr"}, {"score": 0.00396050388346298, "phrase": "in-house_knowledge_base_developers"}, {"score": 0.0038431888954930083, "phrase": "federal_and_private_agencies"}, {"score": 0.003757480190200645, "phrase": "medication_use"}, {"score": 0.003729335910488339, "phrase": "candidate_ddis"}, {"score": 0.0035381202759091784, "phrase": "severity_levels"}, {"score": 0.0034203874753429113, "phrase": "therapeutic_alternatives"}, {"score": 0.003382017342396959, "phrase": "predisposing_factors"}, {"score": 0.003078504229140364, "phrase": "high_risk"}, {"score": 0.0030097975788892896, "phrase": "final_list"}, {"score": 0.0028446460307503343, "phrase": "concurrent_use"}, {"score": 0.0027499252661633525, "phrase": "complete_list"}, {"score": 0.002628506002255396, "phrase": "additional_factors"}, {"score": 0.0025892330566358503, "phrase": "patient_conditions"}, {"score": 0.002392453087295389, "phrase": "central_repository"}, {"score": 0.0023745087648471613, "phrase": "high_severity_interactions"}, {"score": 0.0023214774334744713, "phrase": "highly_clinically_significant_drug-drug_interactions"}], "paper_keywords": [""], "paper_abstract": "Objective To develop a set of high-severity, clinically significant drug-drug interactions (DDIs) for use in electronic health records (EHRs). Methods A panel of experts was convened with the goal of identifying critical DDIs that should be used for generating medication-related decision support alerts in all EHRs. Panelists included medication knowledge base vendors, EHR vendors, in-house knowledge base developers from academic medical centers, and both federal and private agencies involved in the regulation of medication use. Candidate DDIs were assessed by the panel based on the consequence of the interaction, severity levels assigned to them across various medication knowledge bases, availability of therapeutic alternatives, monitoring/management options, predisposing factors, and the probability of the interaction based on the strength of evidence available in the literature. Results Of 31 DDIs considered to be high risk, the panel approved a final list of 15 interactions. Panelists agreed that this list represented drugs that are contraindicated for concurrent use, though it does not necessarily represent a complete list of all such interacting drug pairs. For other drug interactions, severity may depend on additional factors, such as patient conditions or timing of co-administration. Discussion The panel provided recommendations on the creation, maintenance, and implementation of a central repository of high severity interactions. Conclusions A set of highly clinically significant drug-drug interactions was identified, for which warnings should be generated in all EHRs. The panel highlighted the complexity of issues surrounding development and implementation of such a list.", "paper_title": "High-priority drug-drug interactions for use in electronic health records", "paper_id": "WOS:000307934600008"}