{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "canonical_representation"}, {"score": 0.005161112465704722, "phrase": "canonical_form"}, {"score": 0.004762893197005439, "phrase": "phase_type_distributions"}, {"score": 0.00456020621016909, "phrase": "order-n_phase_type_distributions"}, {"score": 0.004389912080394437, "phrase": "open_research_problem"}, {"score": 0.003958937342925219, "phrase": "general_ph_distributions"}, {"score": 0.003831801113154043, "phrase": "long_time"}, {"score": 0.003728966994353039, "phrase": "canonical_representations"}, {"score": 0.0036091892088392775, "phrase": "general_ph_distribution_class"}, {"score": 0.0033262524445013303, "phrase": "related_results"}, {"score": 0.002934764205541183, "phrase": "minimal_representation"}, {"score": 0.0028249975318149468, "phrase": "symbolical_transformation_procedure"}, {"score": 0.002235040467016128, "phrase": "moment_bounds"}, {"score": 0.00217496508306238, "phrase": "distribution_set"}], "paper_keywords": ["Phase-type distribution", " Canonical representation", " Moment bounds"], "paper_abstract": "The characterization and the canonical representation of order-n phase type distributions (PH(n)) is an open research problem. This problem is solved for n = 2, since the equivalence of the acyclic and the general PH distributions has been proven for a long time. However, no canonical representations have been introduced for the general PH distribution class so far for n > 2. In this paper, we summarize the related results for n = 3. Starting from these results we provide a canonical representation of the PH(3) class (that is a minimal representation, too) and present a symbolical transformation procedure to obtain the canonical representation based on any (not only Markovian) vector-matrix representation of the distribution. We show that - using the same approach - no symbolical results can be derived for the order-4 PH distributions, thus probably the PH(3) class is the highest order PH class for which a symbolical canonical transformation exists. Using the transformation method to canonical form for PH(3) we numerically evaluate the moment bounds of the PH(3) distribution set, compare it to the order-3 acyclic PH distribution (APH(3)) class, and present other possible applications of the canonical form. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "On the canonical representation of phase type distributions", "paper_id": "WOS:000267413000002"}