{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "watershed_segmentation"}, {"score": 0.045973428335453655, "phrase": "immersion_approach"}, {"score": 0.0444227308407221, "phrase": "low_altitude"}, {"score": 0.044118632545570816, "phrase": "high_altitude"}, {"score": 0.043666205706024704, "phrase": "toboggan_approach"}, {"score": 0.027244860483140683, "phrase": "toboggan_algorithm"}, {"score": 0.00472961267657106, "phrase": "popular_tool"}, {"score": 0.004695900553353526, "phrase": "image_segmentation"}, {"score": 0.0038569788661154867, "phrase": "vincent"}, {"score": 0.003829455440282146, "phrase": "soille"}, {"score": 0.0036815763368083197, "phrase": "mortensen"}, {"score": 0.003655341299454205, "phrase": "barrett"}, {"score": 0.0034890505116128606, "phrase": "exactly_the_same_segmentation_result"}, {"score": 0.0030889995517870525, "phrase": "special_ridge_label"}, {"score": 0.0028446460307503343, "phrase": "pentium-iii_pc"}, {"score": 0.002482443883144136, "phrase": "computer_vision_community"}, {"score": 0.0024122616475793206, "phrase": "immersion_algorithm"}, {"score": 0.0023950275815082297, "phrase": "almost_all_the_test_images"}], "paper_keywords": ["immersion approach", " order-invariance", " toboggan approach", " watershed image segmentation"], "paper_abstract": "Watershed segmentation has recently become a popular tool for image segmentation. There are two approaches to implementing watershed segmentation: immersion approach and toboggan simulation. Conceptually, the immersion approach can be viewed as an approach that starts from low altitude to high altitude and the toboggan approach as an approach that starts from high altitude to low altitude. The former seemed to be more popular recently (e.g., Vincent and Soille), but the latter had its own supporters (e.g., Mortensen and Barrett). It was not clear whether the two approaches could lead to exactly the same segmentation result and which approach was more efficient. In this paper, we present two \"order-invariant\" algorithms for watershed segmentation, one based on the immersion approach and the other on the toboggan approach. By introducing a special RIDGE label to achieve the property of order-invariance, we find that the two conceptually opposite approaches can indeed obtain the same segmentation result. When running on a Pentium-III PC, both of our algorithms require only less than 1130 s for a 256 x 256,image and 115 s for a 512 x 512 image, on average. What is more surprising is that the toboggan algorithm, which is less well known in the computer vision community, turns out to run faster than immersion algorithm for almost all the test images we have used, especially when the image is large, say, 512 x 512 or larger. This paper also gives some explanation as to Why the toboggan algorithm can be more efficient in most cases.", "paper_title": "Comparison between immersion-based and toboggan-based watershed image segmentation", "paper_id": "WOS:000235403100010"}