{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bulk-service_finite-buffer_queueing_system"}, {"score": 0.0045198174374297285, "phrase": "queueing_system"}, {"score": 0.00443133501650381, "phrase": "main_objectives"}, {"score": 0.004110549138321181, "phrase": "latter_approach"}, {"score": 0.004046020290832207, "phrase": "single-server_finite-buffer_queue"}, {"score": 0.003935513160201076, "phrase": "poisson_process"}, {"score": 0.003828012660311739, "phrase": "minimum_size"}, {"score": 0.0037679023889496885, "phrase": "maximum_threshold_limit"}, {"score": 0.0037234376132464493, "phrase": "service_times"}, {"score": 0.0034264854489231148, "phrase": "joint_distribution"}, {"score": 0.0028786467218197245, "phrase": "average_number"}, {"score": 0.0025259082947443343, "phrase": "batch-size-dependent_service_rule"}, {"score": 0.0023896108055582615, "phrase": "service_rates"}, {"score": 0.0022339335462778437, "phrase": "potential_application"}, {"score": 0.0021987994275190314, "phrase": "computer-communication_network"}, {"score": 0.002155656133617155, "phrase": "group_testing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Batch-size-dependent service", " Bulk-service", " Congestion", " Finite-buffer", " Queue"], "paper_abstract": "In the design and analysis of any queueing system, one of the main objectives is to reduce congestion which can be achieved by controlling either arrival-rates or service-rates. This paper adopts the latter approach and analyzes a single-server finite-buffer queue where customers arrive according to the Poisson process and are served in batches of minimum size a with a maximum threshold limit b. The service times of the batches are arbitrarily distributed and depends on the size of the batches undergoing service. We obtain the joint distribution of the number of customers in the queue and the number with the server, and distributions of the number of customers in the queue, in the system, and the number with the server. Various performance measures such as the average number of customers in the queue (system) and with the server etc. are obtained. Several numerical results are presented in the form of tables and graphs and it is observed that batch-size-dependent service rule is more effective in reducing the congestion as compared to the one when service rates of the batches remain same irrespective of the size of the batch. This model has potential application in manufacturing, computer-communication network, telecommunication systems and group testing. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Reducing congestion in bulk-service finite-buffer queueing system using batch-size-dependent service", "paper_id": "WOS:000298457600004"}