{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "recommender_systems_using_incomplete_linguistic_preference_relations."}, {"score": 0.004605434064238641, "phrase": "new_methods"}, {"score": 0.004267163206961948, "phrase": "e-commerce_web_sites"}, {"score": 0.004159997145421619, "phrase": "users'_necessities"}, {"score": 0.0036864465771943933, "phrase": "recommender_systems"}, {"score": 0.003548368289666932, "phrase": "e-shops_customers"}, {"score": 0.0028944757265206332, "phrase": "unsuccessful_results"}, {"score": 0.002532151331015729, "phrase": "knowledge-based_recommender_system"}, {"score": 0.002391067964886602, "phrase": "users'_preferences"}, {"score": 0.0023458049872325214, "phrase": "linguistic_information"}, {"score": 0.0021049977753042253, "phrase": "incomplete_linguistic_preference_relations"}], "paper_keywords": ["Recommender systems", " fuzzy linguistic approach", " incomplete preference relations", " linguistic 2-tuples", " e-commerce", " e-services"], "paper_abstract": "In the e-commerce arena new methods and tools have been recently developed to improve and customize the e-commerce web sites, according to users' necessities and preferences, that are usually vague and uncertain. The most successful tool in this field has been the Recommender Systems. Their aim is to assist e-shops customers to find out the most suitable products by using recommendations. Sometimes, these systems face situations where there is a lack of information or the information is vague or imprecise that yield unsuccessful results. Although several solutions have been proposed, they still present some limitations. In this paper, we present a Knowledge-Based Recommender System that manages and models the uncertainty related to users' preferences by using linguistic information. This system will overcome the problem of lack of information by computing recommendations through completing incomplete linguistic preference relations provided by the users.", "paper_title": "IMPROVING THE EFFECTIVENESS OF KNOWLEDGE BASED RECOMMENDER SYSTEMS USING INCOMPLETE LINGUISTIC PREFERENCE RELATIONS", "paper_id": "WOS:000269866900004"}