{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "quantitative_observational_studies"}, {"score": 0.036478226051296546, "phrase": "internal_validity"}, {"score": 0.011666521018137655, "phrase": "observational_studies"}, {"score": 0.009975026835106976, "phrase": "practical_improvements"}, {"score": 0.0047013405841819025, "phrase": "large_and_growing_body"}, {"score": 0.004272969980602508, "phrase": "occupational_settings"}, {"score": 0.004034841146538891, "phrase": "existing_knowledge"}, {"score": 0.003958439439112026, "phrase": "experimental_studies"}, {"score": 0.003773680962197766, "phrase": "non-experimental_contexts"}, {"score": 0.0028187792953857957, "phrase": "appropriate_analysis"}, {"score": 0.002791932344920906, "phrase": "particular_reference"}, {"score": 0.00276534038425712, "phrase": "workflow_time_studies"}, {"score": 0.002699960312990493, "phrase": "direct_observation"}, {"score": 0.0022509365210787993, "phrase": "unique_evidence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interruption", " Multitasking", " Observational studies"], "paper_abstract": "Much of the large and growing body of literature on interruption and multitasking is motivated, in part, by a desire to reduce their negative effects in occupational settings, particularly those that are safety critical. Much of the existing knowledge has come from experimental studies, however, these do not necessarily generalize to non-experimental contexts. By virtue of being in situ, the results of observational studies are more generalizable, but internal validity remains an issue. Since many of the quantitative observational studies of interruption or multitasking to date have been largely descriptive, their full potential to contribute knowledge that informs practical improvements has been underutilized. We discuss ways to address threats to internal validity in quantitative observational studies through appropriate analysis with particular reference to workflow time studies, a form of direct observation. We also discuss the potential for more sophisticated analysis methods to both address some of the threats to internal validity and to provide more nuanced insights into the role and impacts of interruption and multitasking. In this way observational studies can contribute unique evidence to facilitate practical improvements to work practices and systems. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Studying interruptions and multitasking in situ: The untapped potential of quantitative observational studies", "paper_id": "WOS:000355048100011"}