{"auto_keywords": [{"score": 0.029420333683948755, "phrase": "uwsns"}, {"score": 0.024095146252357525, "phrase": "uwsn"}, {"score": 0.00481495049065317, "phrase": "unattended_wireless_sensor_networks"}, {"score": 0.004769444094319619, "phrase": "wireless_sensor_networks"}, {"score": 0.004613516457919661, "phrase": "wide_range"}, {"score": 0.004136044939878838, "phrase": "pervasive_tamper-resistant_hardware_results"}, {"score": 0.003419943984098415, "phrase": "novel_unattended_wireless_sensor_networks"}, {"score": 0.0032766780632972363, "phrase": "constant_supervision"}, {"score": 0.0032302647179383915, "phrase": "trusted_sink"}, {"score": 0.003199687131875466, "phrase": "uwsn's_unattended_nature"}, {"score": 0.003051073364818384, "phrase": "special_techniques"}, {"score": 0.002696101728474703, "phrase": "unattended_sensors"}, {"score": 0.00258307991054107, "phrase": "seamless_healing_rates"}, {"score": 0.0024051153560799335, "phrase": "thorough_analysis"}, {"score": 0.002359759876402679, "phrase": "simulation_results"}, {"score": 0.0022824314760583834, "phrase": "real-world_issues"}], "paper_keywords": ["Security", " Wireless sensor networks", " self-healing"], "paper_abstract": "Wireless sensor networks (WSNs) appeal to a wide range of applications that involve the monitoring of various physical phenomena. However, WSNs are subject to many threats. In particular, lack of pervasive tamper-resistant hardware results in sensors being easy targets for compromise. Having compromised a sensor, the adversary learns all the sensor secrets, allowing it to later encrypt/decrypt or authenticate messages on behalf of that sensor. This threat is particularly relevant in the novel unattended wireless sensor networks (UWSNs) scenario. UWSNs operate without constant supervision by a trusted sink. UWSN's unattended nature and increased exposure to attacks prompts the need for special techniques geared towards regaining security after being compromised. In this article, we investigate cooperative self-healing in UWSNs and propose various techniques to allow unattended sensors to recover security after compromise. Our techniques provide seamless healing rates even against a very agile and powerful adversary. The effectiveness and viability of our proposed techniques are assessed by thorough analysis and supported by simulation results. Finally, we introduce some real-world issues affecting UWSN deployment and provide some solutions for them as well as a few open problems calling for further investigation.", "paper_title": "Self-Healing in Unattended Wireless Sensor Networks", "paper_id": "WOS:000316415300007"}