{"auto_keywords": [{"score": 0.04096369961791015, "phrase": "pls-da"}, {"score": 0.020722916582184763, "phrase": "pso-svwl-plsda"}, {"score": 0.020253655224451578, "phrase": "lung_cancer"}, {"score": 0.008391593210604063, "phrase": "metabolic_profiles"}, {"score": 0.008175495607751344, "phrase": "partial_least-squares_discriminant_analysis"}, {"score": 0.006969834289210735, "phrase": "optimal_sample"}, {"score": 0.006672839967787067, "phrase": "latent_variables"}, {"score": 0.006463065640272559, "phrase": "pso-svwl-plsda."}, {"score": 0.0061695825861277824, "phrase": "healthy_controls"}, {"score": 0.00481495049065317, "phrase": "particle_swarm_optimization"}, {"score": 0.004609352548073816, "phrase": "chemometric_tools"}, {"score": 0.0043487535506391275, "phrase": "data_analysis"}, {"score": 0.0041751141941485555, "phrase": "high_similarity"}, {"score": 0.004102827311680473, "phrase": "excessive_variables"}, {"score": 0.0035885019925285394, "phrase": "new_algorithm"}, {"score": 0.0032786537599187125, "phrase": "recognition_rates"}, {"score": 0.003129317057177867, "phrase": "training_and_test_sets"}, {"score": 0.0026503306888150426, "phrase": "john_wiley"}, {"score": 0.0025967927629150715, "phrase": "current_study"}, {"score": 0.0025741794325574224, "phrase": "new_optimized_version"}, {"score": 0.0024784471503832284, "phrase": "pso"}, {"score": 0.0024283623243160357, "phrase": "variable_subsets"}, {"score": 0.0024072121760839427, "phrase": "proper_variable_weights"}, {"score": 0.0023448580051422347, "phrase": "pls-da."}, {"score": 0.0021609874288933163, "phrase": "high_recognition_capability"}], "paper_keywords": ["metabonomics", " chemometrics", " partial least-squares discriminant analysis", " partial least-squares discriminant analysis optimized by particle swarm optimization", " lung cancer"], "paper_abstract": "The complexity of metabolic profiles makes chemometric tools indispensable for extracting the most significant information. Partial least-squares discriminant analysis (PLS-DA) acts as one of the most effective strategies for data analysis in metabonomics. However, its actual efficacy in metabonomics is often weakened by the high similarity of metabolic profiles, which contain excessive variables. To rectify this situation, particle swarm optimization (PSO) was introduced to improve PLS-DA by simultaneously selecting the optimal sample and variable subsets, the appropriate variable weights, and the best number of latent variables (SVWL) in PLS-DA, forming a new algorithm named PSO-SVWL-PLSDA. Combined with H-1 nuclear magnetic resonance-based metabonomics, PSO-SVWL-PLSDA was applied to recognize the patients with lung cancer from the healthy controls. PLS-DA was also investigated as a comparison. Relatively to the recognition rates of 86% and 65%, which were yielded by PLS-DA, respectively, for the training and test sets, those of 98.3% and 90% were offered by PSO-SVWL-PLSDA. Moreover, several most discriminative metabolites were identified by PSO-SVWL-PLSDA to aid the diagnosis of lung cancer, including lactate, glucose (-glucose and -glucose), threonine, valine, taurine, trimethylamine, glutamine, glycoprotein, proline, and lipid. Copyright (c) 2015 John Wiley & Sons, Ltd. In the current study, a new optimized version of partial least-squares discriminant analysis (PLS-DA) abbreviated as PSO-SVWL-PLSDA was developed by invoking PSO to simultaneously select the optimal sample and variable subsets, the proper variable weights, and the best number of latent variables in PLS-DA. In combination with 1H nuclear magnetic resonance-based metabonomics, the newly proposed PSO-SVWL-PLSDA was applied to recognize the patients with lung cancer from the healthy controls. The results revealed that PSO-SVWL-PLSDA holds high recognition capability, and it is able to identify the most discriminative metabolites to aid the diagnosis of lung cancer.", "paper_title": "Partial least-squares discriminant analysis optimized by particle swarm optimization: application to H-1 nuclear magnetic resonance analysis of lung cancer metabonomics", "paper_id": "WOS:000362647100003"}