{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "implementation_efficiency"}, {"score": 0.04957466661795797, "phrase": "business_objectives"}, {"score": 0.013919901796927401, "phrase": "cognition-based_trust"}, {"score": 0.009832081704195614, "phrase": "multiple_projects"}, {"score": 0.009036860869855534, "phrase": "program_management"}, {"score": 0.007693420178653897, "phrase": "conflict_resolution"}, {"score": 0.00541293331198865, "phrase": "constructive_conflict_resolution"}, {"score": 0.005341782009171133, "phrase": "interpersonal_cooperation"}, {"score": 0.004518442937844318, "phrase": "unique_context"}, {"score": 0.004217708394188058, "phrase": "external_vendors"}, {"score": 0.004129248271757936, "phrase": "advanced_project_governance_techniques"}, {"score": 0.0039057335221099228, "phrase": "single_oversight"}, {"score": 0.0038748022659578865, "phrase": "structural_features"}, {"score": 0.0037935066882208235, "phrase": "individual_requirements"}, {"score": 0.003588100032858716, "phrase": "project_teams"}, {"score": 0.0033579708256295847, "phrase": "constructive_controversy_theories"}, {"score": 0.0032614317990293695, "phrase": "constructive_conflict_resolution_concepts"}, {"score": 0.0032014433546265694, "phrase": "comprehensive_literature_review"}, {"score": 0.003150900886669123, "phrase": "dependent_variables"}, {"score": 0.0030119758165837625, "phrase": "single_program"}, {"score": 0.002933125601001541, "phrase": "program_environment"}, {"score": 0.002902164861082173, "phrase": "five_variables"}, {"score": 0.002744888626958772, "phrase": "survey_study"}, {"score": 0.0027015344365793016, "phrase": "well-established_measures"}, {"score": 0.0026238177575230665, "phrase": "program_teams"}, {"score": 0.0025892821263461853, "phrase": "india"}, {"score": 0.0025348408238837655, "phrase": "individual_characteristics"}, {"score": 0.0025147388732358507, "phrase": "program_sizes"}, {"score": 0.002461907683295313, "phrase": "composite_role"}, {"score": 0.0021847119298612264, "phrase": "efficient_completion"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Conflict resolution", " Program management", " Constructive controversy", " Trust", " Interpersonal cooperation"], "paper_abstract": "Context: The information technology (IT) field presents a unique context for the management of multiple projects because of the variety of stakeholders involved, the complexity of interdependencies among projects, and the frequent use of external vendors. In practice, IT vendors typically employ advanced project governance techniques such as program management to work effectively with the numbers and variety of clients while still pursuing the benefits of a single oversight. These structural features lend themselves to conflict across teams with individual requirements. However, little research exists on program management, much less in the IT context, that represents conflict across IT project teams. Objective: In this study, the effectiveness of conflict resolution on the implementation efficiency and fulfillment of business objectives is studied through the lens of constructive controversy theories. A number of hypotheses are derived by tailoring the constructive conflict resolution concepts to IT context and making a comprehensive literature review to identify the mediator and dependent variables. A model is developed to consider the management of conflict across multiple projects combined into a single program. Method: A quantitative questionnaire related to the program environment was developed for five variables to include conflict resolution, cognition-based trust, interpersonal cooperation, business objectives and implementation efficiency. The hypotheses were tested by performing a survey study, where a number of well-established measures in the literature were used. 92 paired responses from program teams in 38 organizations located in India were obtained and represent a variety of individual characteristics, and program sizes. Results: This study identified the composite role of constructive conflict resolution and cognition-based trust in improving interpersonal cooperation. The impacts of constructive conflict resolution on business objectives were not fully mediated by cognition-based trust and interpersonal cooperation, although implementation efficiency is fully mediated. Conclusion: The management of conflict promotes trust and interpersonal cooperation necessary to improve the efficient completion of the program and benefits to the organization. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Conflict resolution effectiveness on the implementation efficiency and achievement of business objectives in IT programs: A study of IT vendors", "paper_id": "WOS:000358699900003"}