{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smart_grid"}, {"score": 0.004612376827433774, "phrase": "active_research_area"}, {"score": 0.004525088883501587, "phrase": "almost_all_the_technologies"}, {"score": 0.0041522059428827345, "phrase": "electricity_consumption"}, {"score": 0.003939565240409143, "phrase": "traditional_power_grid"}, {"score": 0.0031921317979928406, "phrase": "future_smart_grid"}, {"score": 0.0030285084113651035, "phrase": "massive_data"}, {"score": 0.0029853535424953595, "phrase": "smart_meters"}, {"score": 0.002500927169609655, "phrase": "basic_computational_awareness"}, {"score": 0.0024417832296664698, "phrase": "brief_review"}, {"score": 0.0024185182010749273, "phrase": "data_mining_and_machine_learning_technologies"}, {"score": 0.00230546852838578, "phrase": "computational_awareness"}, {"score": 0.0021354538918029286, "phrase": "open_issues"}, {"score": 0.0021049977753042253, "phrase": "future_trends"}], "paper_keywords": ["Smart grid", " Data mining", " Machine learning"], "paper_abstract": "Smart grid has been an active research area in recent years because almost all the technologies required to build smart grid are mature enough. It is expected that not only can smart grid reduce electricity consumption, but it can also provide a more reliable and versatile service than the traditional power grid can. Although the infrastructure of smart grid all over the world is far from complete yet, there is no doubt that our daily life will benefit a lot from smart grid. Hence, many researches are aimed to point out the challenges and needs of future smart grid. The question is, how do we use the massive data captured by smart meters to provide services that are as \"smart'' as possible instead of just automatically reading information from the meters. This paper begins with a discussion of the smart grid before we move on to the basic computational awareness for smart grid. A brief review of data mining and machine learning technologies for smart grid, which are often used for computational awareness, is then given to further explain their potentials. Finally, challenges, potentials, open issues, and future trends of smart grid are addressed.", "paper_title": "Computational awareness for smart grid: a review", "paper_id": "WOS:000348039600015"}