{"auto_keywords": [{"score": 0.046553380744206556, "phrase": "first_paper"}, {"score": 0.04234089089044228, "phrase": "infant_feeding"}, {"score": 0.03606618089287802, "phrase": "computational_process"}, {"score": 0.00481495049065317, "phrase": "quality-assured_infant_feeding_process"}, {"score": 0.0042650992966174065, "phrase": "data_quality"}, {"score": 0.003628024127607343, "phrase": "electronic_health_records"}, {"score": 0.003376216135716629, "phrase": "qualityassured_datasets"}, {"score": 0.0033160345607565565, "phrase": "canonical_structure"}, {"score": 0.0032716011062067286, "phrase": "raw_data"}, {"score": 0.0032423089921154503, "phrase": "multiple_ehr."}, {"score": 0.002936849401568391, "phrase": "dataset_content"}, {"score": 0.0028076592725295646, "phrase": "output_data"}, {"score": 0.0026841368358805433, "phrase": "eight_dq_dimensions"}, {"score": 0.0024093494406195386, "phrase": "second_paper"}, {"score": 0.002262209824105154, "phrase": "first_qualityassured_repository"}, {"score": 0.00216263228969761, "phrase": "perinatal_period"}, {"score": 0.0021049977753042253, "phrase": "clinical_activities"}], "paper_keywords": ["Data quality", " Electronic health record", " Data analysis", " Breastfeeding", " Perinatal care"], "paper_abstract": "This is the first paper of a series of two regarding the construction of data quality (DQ) assured repositories for the reuse of information on infant feeding from birth until two years old. This first paper justifies the need for such repositories and describes the design of a process to construct them from Electronic Health Records (EHR). As a result, Part 1 proposes a computational process to obtain qualityassured datasets represented by a canonical structure extracted from raw data from multiple EHR. For this, 13 steps were defined to ensure the harmonization, standardization, completion, de-duplication, and consistency of the dataset content. Moreover, the quality of the input and output data for each of these steps is controlled according to eight DQ dimensions: predictive value, correctness, duplication, consistency, completeness, contextualization, temporal-stability and spatial-stability. The second paper of the series will describe the application of this computational process to construct the first qualityassured repository for the reuse of information on infant feeding in the perinatal period aimed at the monitoring of clinical activities and research. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Construction of quality-assured infant feeding process of care data repositories: definition and design (Part 1)", "paper_id": "WOS:000366766100010"}