{"auto_keywords": [{"score": 0.033466414583179074, "phrase": "risum"}, {"score": 0.03278470350487644, "phrase": "mrisum"}, {"score": 0.00481495049065317, "phrase": "extractive_text_summarization"}, {"score": 0.004764220976404241, "phrase": "random_indexing"}, {"score": 0.004739056045644449, "phrase": "based_extractive_text_summarization"}, {"score": 0.003813669883040509, "phrase": "context_vectors"}, {"score": 0.0036942726653704213, "phrase": "addition_operation"}, {"score": 0.0036359780843400625, "phrase": "index_vectors"}, {"score": 0.002818692837561076, "phrase": "different_rouge_metrics"}, {"score": 0.002744888626958772, "phrase": "performance_evaluation"}, {"score": 0.002255431275670053, "phrase": "consistent_results"}, {"score": 0.002231607958228148, "phrase": "linear_distance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Word Space Model", " Random Indexing", " PageRank", " Convolution", " Modified Random Indexing"], "paper_abstract": "Random Indexing based extractive text summarization has already been proposed in literature. This paper looks at the above technique in detail, and proposes several improvements. The improvements are both in terms of formation of index (word) vectors of the document, and construction of context vectors by using convolution instead of addition operation on the index vectors. Experiments have been conducted using both angular and linear distances as metrics for proximity. As a consequence, three improved versions of the algorithm, viz. RISUM, RISUM+ and MRISUM were obtained. These algorithms have been applied on DUC 2002 documents, and their comparative performance has been studied. Different ROUGE metrics have been used for performance evaluation. While RISUM and RISUM+ perform almost at par, MRISUM is found to outperform both RISUM and RISUM+ significantly. MRISUM also outperforms LSA+TRM based summarization approach. The study reveals that all the three Random Indexing based techniques proposed in this study produce consistent results when linear distance is used for measuring proximity. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Random Indexing and Modified Random Indexing based approach for extractive text summarization", "paper_id": "WOS:000345106900003"}