{"auto_keywords": [{"score": 0.036379424137657886, "phrase": "lateral_resistance"}, {"score": 0.010612387000973441, "phrase": "fin_piles"}, {"score": 0.007213059884568714, "phrase": "fin_pile"}, {"score": 0.004748740786945996, "phrase": "three-dimensional_analysis"}, {"score": 0.0047051051659828275, "phrase": "laterally_loaded_fin_piles"}, {"score": 0.004431041346291019, "phrase": "simple_pile-soil_theories"}, {"score": 0.004309968592440261, "phrase": "complicated_geometry"}, {"score": 0.004058826900076531, "phrase": "elastic_plastic_soil_model"}, {"score": 0.004002972723329302, "phrase": "elastic_pile_material"}, {"score": 0.003966162568548304, "phrase": "interface_elements"}, {"score": 0.0038577428353448596, "phrase": "pile-soil_interaction"}, {"score": 0.003734979290204709, "phrase": "predicted_behaviour"}, {"score": 0.0034052594710793664, "phrase": "stress_distribution"}, {"score": 0.002909960617042717, "phrase": "pile_head"}, {"score": 0.0023198180380964305, "phrase": "pile_diameter"}, {"score": 0.0021049977753042253, "phrase": "loading_direction"}], "paper_keywords": ["Fin piles", " Monopiles", " Mohr-Coulomb soil model", " 3D finite element models", " Capacity of laterally loaded piles", " Efficiency of fins"], "paper_abstract": "A three-dimensional analysis of laterally loaded fin piles is presented. The behaviour of fin piles is difficult to explain using simple pile-soil theories or two dimensional numerical analyses because of the complicated geometry of the piles. In this study, a nonlinear 3D analysis with an elastic plastic soil model, an elastic pile material and interface elements are used to model the pile-soil interaction. Experimental data confirmed that the predicted behaviour of a monopile was acceptable leading to a more detailed study of the impact of fins upon the lateral resistance. The stress distribution within the pile and the deformation of the fin pile are presented. The increase in resistance gained by placing fins on a pile is illustrated by plotting the lateral resistance against displacement of the pile head for various geometries of the pile. This is expressed as the efficiency of the fins which is the ratio of the lateral resistance of a fin pile to that of a monopile with the same core diameter where the lateral resistance is defined as the resistance at a displacement of 10% of the pile diameter. The efficiency of the piles increases as the length of the fins; the increase is independent of the loading direction relative to the fins. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Finite element analysis of laterally loaded fin piles", "paper_id": "WOS:000288776600006"}