{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud_computing"}, {"score": 0.004717960684395242, "phrase": "ascending_technology"}, {"score": 0.00462291551375938, "phrase": "new_paradigm"}, {"score": 0.004548253531664032, "phrase": "rational_computational_model"}, {"score": 0.004091370602573054, "phrase": "traditional_hosting_service"}, {"score": 0.004058180509184539, "phrase": "cloud_computing_services"}, {"score": 0.003680212979775528, "phrase": "cloud_providers"}, {"score": 0.0035767311154996464, "phrase": "personal_computer"}, {"score": 0.0035332741328861776, "phrase": "internet_access"}, {"score": 0.0027893011631269873, "phrase": "service_layer_agreement"}, {"score": 0.0027666443986705453, "phrase": "resource_sharing"}, {"score": 0.002688781336915723, "phrase": "new_questions"}, {"score": 0.0026560841114619147, "phrase": "real_gains"}, {"score": 0.002388817995161952, "phrase": "present_limitations"}, {"score": 0.002350152413458658, "phrase": "full_use"}, {"score": 0.0021049977753042253, "phrase": "new_challenges"}], "paper_keywords": ["Cloud computing", " Service layer agreement", " Virtualization", " On-demand business model"], "paper_abstract": "Cloud computing is an ascending technology that has introduced a new paradigm by rendering a rational computational model possible. It has changed the dynamics of IT consumption by means of a model that provides on-demand services over the Internet. Unlike the traditional hosting service, cloud computing services are paid for per usage and may expand or shrink based on demand. Such services are, in general, fully managed by cloud providers that require users nothing but a personal computer and an Internet access. In recent years, this model has attracted the attention of researchers, investors and practitioners, many of whom have proposed a number of applications, structures and fundamentals of cloud computing, resulting in various definitions, requirements and models. Despite the interest and advances in the field, issues such as security and privacy, service layer agreement, resource sharing, and billing have opened up new questions about the real gains of the model. Although cloud computing is based on a 50-year-old business model, evidence from this study indicates that cloud computing still needs to expand and overcome present limitations that prevent the full use of its potential. In this study, we critically review the state of the art in cloud computing with the aim of identifying advances, gaps and new challenges.", "paper_title": "A systematic review on cloud computing", "paper_id": "WOS:000337800400016"}