{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "ted_nelson's_works"}, {"score": 0.04043162424334014, "phrase": "nelson's_works"}, {"score": 0.02686820480547268, "phrase": "library_science"}, {"score": 0.00469445816161498, "phrase": "hypertext_concept"}, {"score": 0.00441738161338662, "phrase": "citation_analysis"}, {"score": 0.0043506951029334984, "phrase": "citation_counting"}, {"score": 0.004156590395333602, "phrase": "document_type"}, {"score": 0.0033249197885613937, "phrase": "directly_great_impact"}, {"score": 0.003291336101694653, "phrase": "information_retrieval"}, {"score": 0.0032415934630668484, "phrase": "wide_web"}, {"score": 0.0031125795874844438, "phrase": "profound_influence"}, {"score": 0.002618995204424126, "phrase": "citation_context_analysis"}, {"score": 0.0024392031587145728, "phrase": "general_introduction"}, {"score": 0.0023659694724243764, "phrase": "vannevar_bush"}, {"score": 0.002342048999008582, "phrase": "ted_nelson"}, {"score": 0.002148226022654619, "phrase": "information_science"}], "paper_keywords": [""], "paper_abstract": "This study investigates Ted Nelson's works and the influence of his hypertext concept through citation analysis, including citation counting, characteristics of citing articles on language, document type, citing year, discipline, and citation content. The selection of the Nelson's works was based on searching Library Literature & Information Science, Library and Information Science Abstracts, Google and Yahoo search engines. The citation data were compiled from the database of Web of Science. The results of the study reveal that hypertext has directly great impact on information retrieval and world wide web; therefore, the concept has had profound influence on information, library and computer science disciplines. Moreover, the influence of Nelson's works spreads to other disciplines variously, especially on education, literature, business and economics, engineering, sociology, psychology, etc. The citation context analysis of citing articles on information and library science reveals that (1) definition, orientation and general introduction of hypertext; (2) relation of Vannevar Bush and Ted Nelson in terms of hypertext; (3) Nelson's Xanadu system and its component of hypertext; (4) the application of hypertext in information science and library science are four most citing purpose.", "paper_title": "Citation analysis of Ted Nelson's works and his influence on hypertext concept", "paper_id": "WOS:000266914500001"}