{"auto_keywords": [{"score": 0.041743876102144424, "phrase": "web_pages"}, {"score": 0.014346419018691218, "phrase": "incomplete_information"}, {"score": 0.009161509080579333, "phrase": "comprehensive_information"}, {"score": 0.00481495049065317, "phrase": "healthcare_information"}, {"score": 0.004597622380240611, "phrase": "huge_healthcare_web_sites"}, {"score": 0.004550669123303854, "phrase": "powerful_search_engines"}, {"score": 0.0043452175611323335, "phrase": "recent_studies"}, {"score": 0.004127753467337283, "phrase": "complex_scatter"}, {"score": 0.004085579055228594, "phrase": "relevant_facts"}, {"score": 0.0030798711656591948, "phrase": "information_density"}, {"score": 0.002851301751761804, "phrase": "above-mentioned_page_clusters"}, {"score": 0.0026532596852754525, "phrase": "web_sites"}, {"score": 0.0026261108615242557, "phrase": "search_tools"}, {"score": 0.002393907896783117, "phrase": "underlying_mechanisms"}, {"score": 0.0022275639370573264, "phrase": "information_scatter"}, {"score": 0.0021267708018655493, "phrase": "existing_theories"}, {"score": 0.0021049977753042253, "phrase": "information-seeking_behavior"}], "paper_keywords": [""], "paper_abstract": "Despite the development of huge healthcare Web sites and powerful search engines, many searchers end their searches prematurely with incomplete information. Recent studies suggest that users often retrieve incomplete information because of the complex scatter of relevant facts about a topic across Web pages. However, little is understood about regularities underlying such information scatter. To probe regularities within the scatter of facts across Web pages, this article presents the results of two analyses: (a) a cluster analysis of Web pages that reveals the existence of three page clusters that vary in information density and (b) a content analysis that suggests the role each of the above-mentioned page clusters play in providing comprehensive information. These results provide implications for the design of Web sites, search tools, and training to help users find comprehensive information about a topic and for a hypothesis describing the underlying mechanisms causing the scatter. We conclude by briefly discussing how the analysis of information scatter, at the granularity of facts, complements existing theories of information-seeking behavior.", "paper_title": "Scatter Matters: Regularities and Implications for the Scatter of Healthcare Information on the Web", "paper_id": "WOS:000276370500002"}