{"auto_keywords": [{"score": 0.0281377814419742, "phrase": "sdf"}, {"score": 0.00481495049065317, "phrase": "shape_diameter_function"}, {"score": 0.004550783060775205, "phrase": "close_link"}, {"score": 0.004496080495247288, "phrase": "object's_skeleton"}, {"score": 0.003704797078215222, "phrase": "wide_variety"}, {"score": 0.0031909403420958752, "phrase": "multiple_objects"}, {"score": 0.0031398318568608505, "phrase": "general_common_shape"}, {"score": 0.003003452468800793, "phrase": "volume-based_shape-function"}, {"score": 0.0027260525536580912, "phrase": "similar_values"}, {"score": 0.0027041233221381756, "phrase": "analogue_parts"}, {"score": 0.002682370021834353, "phrase": "different_objects"}, {"score": 0.0026181517251690606, "phrase": "scalar_function"}, {"score": 0.0025761937402886954, "phrase": "mesh_surface"}, {"score": 0.0024444073418288703, "phrase": "object's_volume"}, {"score": 0.002174155795026218, "phrase": "simple_and_consistent_algorithm"}, {"score": 0.0021049977753042253, "phrase": "multiple_meshes"}], "paper_keywords": ["mesh decomposition", " skeleton extraction", " geometry processing"], "paper_abstract": "Mesh partitioning and skeletonisation are fundamental for many computer graphics and animation techniques. Because of the close link between an object's skeleton and its boundary, these two problems are in many cases complementary. Any partitioning of the object can assist in the creation of a skeleton and any segmentation of the skeleton can infer a partitioning of the object. In this paper, we consider these two problems on a wide variety of meshes, and strive to construct partitioning and skeletons which remain consistent across a family of objects, not a single one. Such families can consist of either a single object in multiple poses and resolutions, or multiple objects which have a general common shape. To achieve consistency, we base our algorithms on a volume-based shape-function called the shape-diameter-function (SDF), which remains largely oblivious to pose changes of the same object and maintains similar values in analogue parts of different objects. The SDF is a scalar function defined on the mesh surface; however, it expresses a measure of the diameter of the object's volume in the neighborhood of each point on the surface. Using the SDF we are able to process and manipulate families of objects which contain similarities using a simple and consistent algorithm: consistently partitioning and creating skeletons among multiple meshes.", "paper_title": "Consistent mesh partitioning and skeletonisation using the shape diameter function", "paper_id": "WOS:000254240100004"}