{"auto_keywords": [{"score": 0.035976661192180306, "phrase": "ste."}, {"score": 0.015719713042815744, "phrase": "symbolic_trajectory_evaluation"}, {"score": 0.015403810271326986, "phrase": "ste"}, {"score": 0.004621279527317074, "phrase": "powerful_technique"}, {"score": 0.004574085781766281, "phrase": "model_checking"}, {"score": 0.0041490029730869345, "phrase": "x_value"}, {"score": 0.003802135020791801, "phrase": "user's_specification"}, {"score": 0.0034485432592912917, "phrase": "automatic_refinement_technique"}, {"score": 0.003292685392413911, "phrase": "clever_selection"}, {"score": 0.0030017207229983385, "phrase": "original_specification"}, {"score": 0.0028076592725295646, "phrase": "state_space"}, {"score": 0.0027505037762786087, "phrase": "\"unknown\"_result"}, {"score": 0.0022390533383717715, "phrase": "ste_specification"}, {"score": 0.0021049977753042253, "phrase": "vacuity_detection"}], "paper_keywords": [""], "paper_abstract": "Symbolic Trajectory Evaluation (STE) is a powerful technique for model checking. It is based on 3-valued symbolic simulation, using 0,1 and X (\"unknown\"). The X value is used to abstract away parts of the circuit. The abstraction is derived from the user's specification. Currently the process of abstraction and refinement in STE is performed manually. This paper presents an automatic refinement technique for STE. The technique is based on a clever selection of constraints that are added to the specification so that on the one hand the semantics of the original specification is preserved, and on the other hand, the part of the state space in which the \"unknown\" result is received is significantly decreased or totally eliminated. In addition, this paper raises the problem of vacuity of passed and failed specifications. This problem was never discussed in the framework of STE. We describe when an STE specification may vacuously pass or fail, and propose a method for vacuity detection in STE.", "paper_title": "Automatic refinement and vacuity detection for Symbolic Trajectory Evaluation", "paper_id": "WOS:000240257000018"}