{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electronic_medication_administration_records"}, {"score": 0.009064489012499668, "phrase": "paper-based_records"}, {"score": 0.008988200989054352, "phrase": "nursing_time"}, {"score": 0.00873847371602978, "phrase": "medication_administration_processes"}, {"score": 0.008353140553550234, "phrase": "unintended_adverse_consequences"}, {"score": 0.0067026346973761315, "phrase": "residential_aged_care"}, {"score": 0.004761015462047997, "phrase": "medication_administration"}, {"score": 0.004360906420260988, "phrase": "australian_residential_aged_care_home"}, {"score": 0.004062937864702115, "phrase": "field_notes"}, {"score": 0.004039995317682942, "phrase": "informal_conversation"}, {"score": 0.0040171817997972335, "phrase": "document_review"}, {"score": 0.0037959868107895053, "phrase": "seven_nurses"}, {"score": 0.003597102547969587, "phrase": "significant_difference"}, {"score": 0.003457231940068194, "phrase": "medication_round"}, {"score": 0.0034086028336466688, "phrase": "verbal_communication"}, {"score": 0.003370190834214415, "phrase": "infection_control"}, {"score": 0.0032760377953971248, "phrase": "electronic_and_paper-based_medication_administration_records"}, {"score": 0.0032026066791743866, "phrase": "organization's_documentation_requirement"}, {"score": 0.0029249294679606656, "phrase": "nurses'_compliance"}, {"score": 0.002908394246754633, "phrase": "documentation_requirements"}, {"score": 0.0026486377767219794, "phrase": "documentation_space"}, {"score": 0.002552781867125423, "phrase": "late_addition"}, {"score": 0.0025311573083044545, "phrase": "new_resident's_medication_profile"}, {"score": 0.002432633980666185, "phrase": "power_outage"}, {"score": 0.0024120247307686084, "phrase": "portable_device"}, {"score": 0.002215274527909304, "phrase": "future_research"}, {"score": 0.0021717202432775936, "phrase": "adverse_consequences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Benefit", " Electronic medication administration records", " Nursing home", " Process", " Time", " Unintended adverse consequence"], "paper_abstract": "Purposes: This study aimed to compare between electronic medication administration records and paper-based records in the nursing time spent on various activities in a medication round and the medication administration processes followed by nurses in an Australian residential aged care home. It also aimed to identify the benefits and unintended adverse consequences of using the electronic medication administration records. Methods: Time-motion observation, taking of field notes, informal conversation and document review were used to collect data in two units of a residential aged care home. Each unit had one nurse administer medication. Seven nurses were observed over 12 morning shifts. Unit 1 used electronic medication administration records and Unit 2 used paper-based records. Results: No significant difference between the two units was found in the nursing time spent on various activities in a medication round, including documentation, verbal communication, medication administration, infection control and transit. Comparison of the medication administration processes between the electronic and paper-based medication administration records identified a procedural problem which violated the organization's documentation requirement. This problem was documenting before providing medication to a resident when using the paper-based records. It was not observed with the electronic medication administration records. Benefits of introducing the electronic medication administration records included improving nurses' compliance with documentation requirements, freedom from the error of signing twice, reducing the possibility of forgetting to medicate a resident, facilitating nurses to record the time of medication administration to a resident and increasing documentation space. Unintended adverse consequences of introducing the electronic medication administration records included inadequate information about residents, late addition of a new resident's medication profile in the records and nurses' forgetting to medicate a resident due to power outage of the portable device. Conclusions: The electronic medication administration records may not change nursing time spent on various activities in a medication round or substantially alter the medication administration processes, but can generate both benefits and unintended adverse consequences. Future research may investigate whether and how the adverse consequences can be prevented. (C) 2015 Published by Elsevier Ireland Ltd.", "paper_title": "The impact of electronic medication administration records in a residential aged care home", "paper_id": "WOS:000362411900010"}