{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "network_performance_degradation"}, {"score": 0.04950930066917755, "phrase": "servet"}, {"score": 0.004375061788023814, "phrase": "high_influence"}, {"score": 0.00429715240295033, "phrase": "overall_performance"}, {"score": 0.0042459818200777846, "phrase": "multicore_clusters"}, {"score": 0.003951453722517865, "phrase": "parallel_applications"}, {"score": 0.003361069456060196, "phrase": "communication_pattern"}, {"score": 0.0032618078775887077, "phrase": "inter-node_communication_bandwidth"}, {"score": 0.0032036590920314725, "phrase": "modern_large_supercomputers"}, {"score": 0.002841545331522694, "phrase": "communicating_nodes"}, {"score": 0.00247529638625566, "phrase": "experimental_results"}, {"score": 0.0023033100935570755, "phrase": "real_parallel_codes"}, {"score": 0.0021821915946356168, "phrase": "network_degradation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Servet is a suite of benchmarks focused on extracting a set of parameters with high influence on the overall performance of multicore clusters. These parameters can be used to optimize the performance of parallel applications by adapting part of their behavior to the characteristics of the machine. Up to now the tool considered network bandwidth as constant and independent of the communication pattern. Nevertheless, the inter-node communication bandwidth decreases on modern large supercomputers depending on the number of cores per node that simultaneously access the network and on the distance between the communicating nodes. This paper describes two new benchmarks that improve Servet by characterizing the network performance degradation depending on these factors. This work also shows the experimental results of these benchmarks on a Cray XE6 supercomputer and some examples of how real parallel codes can be optimized by using the information about network degradation. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The Servet 3.0 benchmark suite: Characterization of network performance degradation", "paper_id": "WOS:000328871900005"}