{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "end-user_programmers"}, {"score": 0.00458488025289647, "phrase": "end-user_programming_environments"}, {"score": 0.004007083686875716, "phrase": "effective_support"}, {"score": 0.003501846136829077, "phrase": "idea_garden"}, {"score": 0.0030414140732789186, "phrase": "minimalist_learning_theory"}, {"score": 0.0027741761880779535, "phrase": "idea_garden_concept"}, {"score": 0.002723607240517261, "phrase": "coscripter_end-user_programming_environment"}, {"score": 0.0026091594819333654, "phrase": "end-user_programming_literature"}, {"score": 0.0023507916951658455, "phrase": "design_patterns"}, {"score": 0.0023079225317714815, "phrase": "programming_concepts"}], "paper_keywords": ["development frameworks and environments", " designing software", " interactive learning environments", " computational thinking", " informal learning"], "paper_abstract": "Although there have been many advances in end-user programming environments, recent empirical studies report that programming still remains difficult for end-users. We hypothesize that one reason may be lack of effective support for helping end-user programmers problem-solve their own way around barriers they encounter. Therefore, in this paper, we describe the Idea Garden, a concept designed to help end-user programmers generate new ideas and problem-solve when they run into barriers. The Idea Garden has its roots in Minimalist Learning Theory and problem-solving theories. Our proof-of-concept prototype of the Idea Garden concept in the CoScripter end-user programming environment currently targets three barriers reported in end-user programming literature. It does so using an integrated, just-in-time combination of scaffolding for problem-solving strategies, for design patterns and for programming concepts. Our empirical results showed that this approach helped end-user programmers overcome all three types of barriers that our prototype targeted.", "paper_title": "Idea Garden: Situated Support for Problem Solving by End-User Programmers", "paper_id": "WOS:000364776900006"}