{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "compositional_elements"}, {"score": 0.01796723804018025, "phrase": "aesthetic_ratings"}, {"score": 0.00860817784361935, "phrase": "chinese_users'_aesthetic_ratings"}, {"score": 0.004339108074589307, "phrase": "corresponding_modeling_research"}, {"score": 0.003910106508089187, "phrase": "abstract_black-and-white_geometric_images"}, {"score": 0.0033961782274326948, "phrase": "dependent_variable"}, {"score": 0.0033548062793973144, "phrase": "subjective_ratings"}, {"score": 0.0033139366449568565, "phrase": "aesthetic_appeal"}, {"score": 0.0030043508031729277, "phrase": "chinese_users"}, {"score": 0.002825681384008326, "phrase": "significant_effect"}, {"score": 0.002690406375639144, "phrase": "realistic_web_page_images"}, {"score": 0.002424012799998538, "phrase": "computational_model"}, {"score": 0.0021049977753042253, "phrase": "aesthetic_design"}], "paper_keywords": [""], "paper_abstract": "This article reports two experiments and the corresponding modeling research on the effects of symmetry and the number of compositional elements on Chinese users' aesthetic ratings of interfaces composed with abstract black-and-white geometric images and realistic-looking web pages. Symmetry and the number of compositional elements are the two independent variables, each with three levels. The dependent variable is subjective ratings of aesthetic appeal. The results from both experiments show that symmetry of compositional elements significantly affects aesthetic ratings of Chinese users, whereas the number alone does not have a significant effect on aesthetic ratings. However, subjects preferred realistic web page images with few elements when they lack symmetry. We also describe our development and evaluation of a computational model of aesthetic ratings based on symmetry and the number of compositional elements to predict aesthetic ratings, which can be used to evaluate and support aesthetic design of interfaces.", "paper_title": "Effects of Symmetry and Number of Compositional Elements on Chinese Users' Aesthetic Ratings of Interfaces: Experimental and Modeling Investigations", "paper_id": "WOS:000287031800002"}