{"auto_keywords": [{"score": 0.046052300942641664, "phrase": "financial_information"}, {"score": 0.02238644464695558, "phrase": "inadvertent_disclosure"}, {"score": 0.021442997357847403, "phrase": "personal_health"}, {"score": 0.018043362784395407, "phrase": "peer-to-peer_file_sharing_networks"}, {"score": 0.010612387000973441, "phrase": "personal_health_information"}, {"score": 0.0070546742007174005, "phrase": "search_terms"}, {"score": 0.006525611296853322, "phrase": "phi"}, {"score": 0.004784909348794283, "phrase": "peer-to-peer_file_sharing_programs"}, {"score": 0.004681226806682058, "phrase": "consistent_concern"}, {"score": 0.004608539830653038, "phrase": "personal_information"}, {"score": 0.004579780586951551, "phrase": "peer-to-peer_file_sharing_applications"}, {"score": 0.004522796947899013, "phrase": "limewire"}, {"score": 0.0044945705826985385, "phrase": "morpheus"}, {"score": 0.003953068310598579, "phrase": "personal_financial_information"}, {"score": 0.0038673406001234535, "phrase": "careful_review"}, {"score": 0.0036097847681731887, "phrase": "pfi."}, {"score": 0.003587235362628753, "phrase": "geographic_region"}, {"score": 0.003553674679835236, "phrase": "ip_addresses"}, {"score": 0.0034657593255581396, "phrase": "usa"}, {"score": 0.00344408669877793, "phrase": "canada"}, {"score": 0.003057346265622334, "phrase": "ethical_issues"}, {"score": 0.0029722900280316216, "phrase": "canadian_ip_addresses"}, {"score": 0.0028003960243011975, "phrase": "canadian_if_addresses"}, {"score": 0.002688532127821979, "phrase": "file_sharing_networks"}, {"score": 0.002655017467085696, "phrase": "small_percentage"}, {"score": 0.0026055251533586804, "phrase": "phi_and_pfi_files"}, {"score": 0.0025330073983168247, "phrase": "pfi"}, {"score": 0.0023127544795063263, "phrase": "pfi._anyone"}, {"score": 0.002255431275670053, "phrase": "file_sharing_applications"}], "paper_keywords": [""], "paper_abstract": "Objective There has been a consistent concern about the inadvertent disclosure of personal information through peer-to-peer file sharing applications, such as Limewire and Morpheus. Examples of personal health and financial information being exposed have been published. We wanted to estimate the extent to which personal health information (PHI) is being disclosed in this way, and compare that to the extent of disclosure of personal financial information (PFI). Design After careful review and approval of our protocol by our institutional research ethics board, files were downloaded from peer-to-peer file sharing networks and manually analyzed for the presence of PHI and PFI. The geographic region of the IP addresses was determined, and classified as either USA or Canada. Measurement We estimated the proportion of files that contain personal health and financial information for each region. We also estimated the proportion of search terms that return files with personal health and financial information. We ascertained and discuss the ethical issues related to this study. Results Approximately 0.4% of Canadian IP addresses had PHI, as did 0.5% of US IP addresses. There was more disclosure of financial information, at 1.7% of Canadian IF addresses and 4.7% of US IP addresses. An analysis of search terms used in these file sharing networks showed that a small percentage of the terms would return PHI and PFI files lie, there are people successfully searching for PFI and PHI on the peer-to-peer file sharing networks. Conclusion There is a real risk of inadvertent disclosure of PHI through peer-to-peer file sharing networks, although the risk is not as large as for PFI. Anyone keeping PHI on their computers should avoid installing file sharing applications on their computers, or if they have to use such tools, actively manage the risks of inadvertent disclosure of their, their family's, their clients', or patients' PHI.", "paper_title": "The inadvertent disclosure of personal health information through peer-to-peer file sharing programs", "paper_id": "WOS:000275488100006"}