{"auto_keywords": [{"score": 0.04596243308241487, "phrase": "description_logics"}, {"score": 0.03311990226198299, "phrase": "subjective_beliefs"}, {"score": 0.00481495049065317, "phrase": "coupled_ontologies"}, {"score": 0.004458722048888919, "phrase": "expressive_fragments"}, {"score": 0.004345909305473054, "phrase": "inherently_distributed_peer-to-peer_settings"}, {"score": 0.004076157223660074, "phrase": "general_case"}, {"score": 0.0038476708316022823, "phrase": "description_logics_knowledge_bases"}, {"score": 0.0024714996534331668, "phrase": "representation_framework"}, {"score": 0.0022882500116799777, "phrase": "existing_representation_frameworks"}, {"score": 0.002259054486157494, "phrase": "modular_description_logics"}, {"score": 0.002145942273032774, "phrase": "distributed_reasoner"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Distributed reasoning", " Description Logics", " Peer-to-peer systems"], "paper_abstract": "Combining ontologies in expressive fragments of Description Logics in inherently distributed peer-to-peer settings with autonomous peers is still a challenge in the general case. Although several modular ontology representation frameworks have been proposed for combining Description Logics knowledge bases, each of them has its own strengths and limitations. In this paper, we consider networks of peers, where each peer holds its own ontology within the fragment of Description Logics, and subjective beliefs on how its knowledge can be coupled with the knowledge of others. To allow peers to reason jointly with their coupled knowledge, while preserving their autonomy on evolving their knowledge, data, and subjective beliefs, we propose the representation framework. The article motivates the need for and compares it to existing representation frameworks for modular Description Logics. It discusses the implementation of the distributed reasoner and presents experimental results on the efficiency of this reasoner.", "paper_title": "Distributed reasoning with coupled ontologies: the E-SHIQ representation framework", "paper_id": "WOS:000361652100009"}