{"auto_keywords": [{"score": 0.03732238067663026, "phrase": "full_signatures"}, {"score": 0.006890125960611192, "phrase": "security_models"}, {"score": 0.005288591399582086, "phrase": "signing_oracle"}, {"score": 0.00481495049065317, "phrase": "enhanced_chosen-key_model"}, {"score": 0.0047247083787738285, "phrase": "ofe"}, {"score": 0.004366469287481091, "phrase": "fundamental_work"}, {"score": 0.00433900667918111, "phrase": "optimistic_fair_exchange"}, {"score": 0.0042576464476131205, "phrase": "realistic_attacks"}, {"score": 0.0042308653646339405, "phrase": "design_schemes"}, {"score": 0.004191007935893067, "phrase": "practical_models"}, {"score": 0.004035282762331904, "phrase": "practical_situation"}, {"score": 0.003693973656103879, "phrase": "existing_ofe_models"}, {"score": 0.0036476222647061243, "phrase": "realistic_situation"}, {"score": 0.0034352452951903305, "phrase": "actual_attack"}, {"score": 0.002824292971306322, "phrase": "enhanced_model"}, {"score": 0.002576988153314685, "phrase": "existing_chosen-key_model"}, {"score": 0.0024654516678953658, "phrase": "optimistic_fair_exchange_schemes"}, {"score": 0.002426795311298483, "phrase": "verifiably_encrypted_signatures"}, {"score": 0.002373690110881497, "phrase": "conventional_signatures"}, {"score": 0.0023587312574818208, "phrase": "ring_signatures"}, {"score": 0.002228263890334039, "phrase": "real_scenario"}, {"score": 0.0022142194702079866, "phrase": "dishonest_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Optimistic fair exchange", " Chosen-key model", " Enhanced model"], "paper_abstract": "Optimistic fair exchange (OFE) is a kind of protocol to guarantee fairness for the parties involved in an exchange with the help of an arbitrator. A fundamental work of optimistic fair exchange is to define security models capturing realistic attacks and design schemes secure in practical models. The security models are very essential to ensure that they capture practical situation, which will ensure that the protocols can be adopted in practice. The contributions of this paper are three fold. First, we observe that the existing OFE models do not capture realistic situation, where the adversary can actually observe the full signatures generated by the signer, prior to launching the actual attack. That is to say, the adversary is not provided with the signing oracle, which will produce full signatures generated by the signer. It is commonly believed that the full signatures generated by the signer can be simulated by the full signatures generated by the arbitrator. Unfortunately, we show that this perception is false. Second, we propose an enhanced model of OFE that explicitly provides the adversary with the signing oracle, which outputs the full signatures generated by the signer. We demonstrate the difference between our enhanced model and the existing chosen-key model through two concrete OFE schemes that serve as counterexamples. Finally, we revisit two existing generic constructions of optimistic fair exchange schemes, one based on verifiably encrypted signatures, and the other based on conventional signatures and ring signatures. Our result shows that the two generic approaches can still offer schemes secure in our enhanced model, which captures the real scenario that dishonest users may have access to the full signatures generated by the signer. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Optimistic fair exchange in the enhanced chosen-key model", "paper_id": "WOS:000347602000005"}