{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "agility_assessment_surveys"}, {"score": 0.04948948915272366, "phrase": "case_study"}, {"score": 0.004414806639101985, "phrase": "agile_principles"}, {"score": 0.00428892403807229, "phrase": "different_perceptions"}, {"score": 0.004064548693812535, "phrase": "research_literature"}, {"score": 0.0036502716977381004, "phrase": "online_surveys"}, {"score": 0.003444912629614206, "phrase": "industrial_setting"}, {"score": 0.0030554300179552415, "phrase": "selected_surveys"}, {"score": 0.002931569771634119, "phrase": "software_consultancy_company"}, {"score": 0.0028010985923790036, "phrase": "team's_agility"}, {"score": 0.0026875205754965537, "phrase": "focus-group_meetings"}, {"score": 0.002184943946549964, "phrase": "assessment_survey"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Agile", " Assessment", " Survey"], "paper_abstract": "Context: Agile software development has become popular in the past decade without being sufficiently defined. The Agile principles can be instantiated differently which creates different perceptions of Agility. This has resulted in several frameworks being presented in the research literature to evaluate the level of Agility. However, the evidence of their actual use in practice is limited. Objective: The objective is to identify online surveys that assess/profile Agility in practice, and to evaluate the surveys in an industrial setting. Method: The Agility assessment surveys were identified through searching the web. Then, they were explored and two surveys were identified as most promising for our objective. The selected surveys were evaluated in a case study with three Agile teams in a software consultancy company. Results: Each team and its customer separately judged the team's Agility. This outcome was compared with the two survey results in focus-group meetings, and finally one of the surveys was agreed to provide a more holistic assessment of Agility. Conclusions: Different surveys may judge Agility differently, which supports the viewpoint that Agile is not well defined. Therefore, practitioners must decide what Agile means to them and select the assessment survey that matches their definition. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Investigating the applicability of Agility assessment surveys: A case study", "paper_id": "WOS:000344421900011"}