{"auto_keywords": [{"score": 0.03276628718051768, "phrase": "intensity_order"}, {"score": 0.013054315445697049, "phrase": "prior_information"}, {"score": 0.012460885012726235, "phrase": "pixel_intensities"}, {"score": 0.00481495049065317, "phrase": "undersampled_mri._long"}, {"score": 0.004644329185633612, "phrase": "magnetic_resonance_imaging"}, {"score": 0.004137761530535196, "phrase": "nyquist_criterion"}, {"score": 0.004078439401031372, "phrase": "nonacquired_data"}, {"score": 0.0039196351785300045, "phrase": "reconstruction_methods"}, {"score": 0.0036597104126905437, "phrase": "spatial_or_temporal_blurring"}, {"score": 0.003271986590873581, "phrase": "order_relations"}, {"score": 0.003011033940247791, "phrase": "low-resolution_images"}, {"score": 0.0029571101238632783, "phrase": "volumetric_acquisitions"}, {"score": 0.0029041492019217033, "phrase": "dynamic_sequences"}, {"score": 0.002872827714395808, "phrase": "prior_reconstructions"}, {"score": 0.0026151058979100596, "phrase": "acquired_and_reconstructed_data"}, {"score": 0.002568261077839751, "phrase": "trio"}, {"score": 0.0024151333926491878, "phrase": "temporal_evolution"}, {"score": 0.0023125643872311994, "phrase": "second_stage_reconstruction"}, {"score": 0.0022224015540353126, "phrase": "blast"}, {"score": 0.0021825348057711628, "phrase": "order_information"}, {"score": 0.00210499793205176, "phrase": "trio."}], "paper_keywords": ["Dynamic images", " image reconstruction", " magnetic resonance imaging (MRI)", " order information", " technique for reconstruction using intensity order (TRIO)", " undersampling"], "paper_abstract": "Long acquisition times are still a limitation for many applications of magnetic resonance imaging (MRI), specially in 3-D and dynamic imaging. Several undersampling reconstruction techniques have been proposed to overcome this problem. These techniques are based on acquiring less samples than specified by the Nyquist criterion and estimating the nonacquired data by using some sort of prior information. Most of these reconstruction methods use prior information based on estimations of the pixel intensities of the images and therefore they are prone to introduce spatial or temporal blurring. Instead of using the pixel intensities, we propose to use information that allows us to sort the pixels of an image from darkest to brightest. The set of order relations which sort the pixels of an image has been called intensity order. The intensity order of an image can be estimated from low-resolution images, adjacent slices in volumetric acquisitions, temporal correlation in dynamic sequences or from prior reconstructions. Our technique for reconstruction using intensity order (TRIO) consists of looking for an image that satisfies the intensity order and minimizes the discrepancy between the acquired and reconstructed data. Results show that TRIO can effectively reconstruct 2-D-cine cardiac MR images (under-sampling factor of 4), estimating correctly the temporal evolution of the objects. Furthermore, TRIO is used as a second stage reconstruction after reconstructing with other techniques, keyhole, sliding window and BLAST, to estimate the order information. In all cases the images are improved by TRIO.", "paper_title": "TRIO a Technique for Reconstruction Using Intensity Order: Application to Undersampled MRI", "paper_id": "WOS:000293752600011"}