{"auto_keywords": [{"score": 0.014313202795719671, "phrase": "satisfied_equations"}, {"score": 0.013373764327626011, "phrase": "mahajan_et_al"}, {"score": 0.013188037451849304, "phrase": "guaranteed_values"}, {"score": 0.013135441620587536, "phrase": "j._comput"}, {"score": 0.013084721034680533, "phrase": "syst"}, {"score": 0.013031873771628386, "phrase": "sci"}, {"score": 0.008642503159320943, "phrase": "max_r-sat"}, {"score": 0.008611250550690834, "phrase": "average"}, {"score": 0.0046621835537196754, "phrase": "n_variables"}, {"score": 0.004578382275810468, "phrase": "positive_integral_weight"}, {"score": 0.004397487039229447, "phrase": "total_weight"}, {"score": 0.0043358695338488445, "phrase": "max_cut"}, {"score": 0.004309725894724034, "phrase": "expected_weight"}, {"score": 0.004122742019785897, "phrase": "optimal_solution"}, {"score": 0.0036528499204829075, "phrase": "parameterized_problem"}, {"score": 0.003459191419478298, "phrase": "arbitrary_computable_function"}, {"score": 0.0033764382987428497, "phrase": "probabilistic_inequalities"}, {"score": 0.003302320670554012, "phrase": "gutin"}, {"score": 0.0027929100418926725, "phrase": "combinatorial_proof"}, {"score": 0.0024742098091226203, "phrase": "alon_et_al"}, {"score": 0.002319346861878611, "phrase": "gutin_et_al"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Algorithms", " Fixed-parameter tractability", " Max Lin", " Max Sat"], "paper_abstract": "In the Max Lin-2 problem we are given a system S of m linear equations in n variables over F(2) in which equation j is assigned a positive integral weight w(j) for each j. We wish to find an assignment of values to the variables which maximizes the total weight of satisfied equations. This problem generalizes Max Cut. The expected weight of satisfied equations is W/2, where W = w(1) + ... + wm: W/2 is a tight lower bound on the optimal solution of Max Lin-2. Mahajan et al. (Parameterizing above or below guaranteed values, J. Comput. Syst. Sci. 75 (2009) 137-153) stated the following parameterized version of Max Lin-2: decide whether there is an assignment of values to the variables that satisfies equations of total weight at least W/2 + k, where k is the parameter. They asked whether this parameterized problem is fixed-parameter tractable, i.e., can be solved in time f (k)(nm)(O(1)), where f (k) is an arbitrary computable function in k only. Their question remains open, but using some probabilistic inequalities and, in one case, a Fourier analysis inequality, Gutin et al. (A probabilistic approach to problems parameterized above tight lower bound, in: Proc. IWPEC'09, in: Lect. Notes Comput. Sci., vol. 5917, 2009, pp. 234-245) proved that the problem is fixed-parameter tractable in three special cases. In this paper we significantly extend two of the three special cases using only tools from combinatorics. We show that one of our results can be used to obtain a combinatorial proof that another problem from Mahajan et al. (Parameterizing above or below guaranteed values, J. Comput. Syst. Sci. 75 (2009) 137-153), Max r-SAT above Average, is fixed-parameter tractable for each r >= 2. Note that Max r-SAT above Average has been already shown to be fixed-parameter tractable by Alon et al. (Solving MAX-r-SAT above a tight lower bound, in: Proc. SODA 2010, pp. 511-517), but the paper used the approach of Gutin et al. (A probabilistic approach to problems parameterized above tight lower bound, in: Proc. IWPEC'09, in: Lect. Notes Comput. Sci., vol. 5917, 2009, pp. 234-245). (C)) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Note on Max Lin-2 above Average", "paper_id": "WOS:000278635700005"}