{"auto_keywords": [{"score": 0.04704420838626198, "phrase": "web_traffic_data"}, {"score": 0.014909360561767528, "phrase": "web_hyperlink_data"}, {"score": 0.00952156530605988, "phrase": "alexa_internet"}, {"score": 0.00481495049065317, "phrase": "web_traffic_and_organization_performance_measures"}, {"score": 0.00430067200637091, "phrase": "considerable_study"}, {"score": 0.004249825947483216, "phrase": "webometrics_research"}, {"score": 0.0030819521899097934, "phrase": "u.s."}, {"score": 0.0030455339593223715, "phrase": "china"}, {"score": 0.002869457750816953, "phrase": "google"}, {"score": 0.0027686755815188213, "phrase": "compete"}, {"score": 0.0027034948760997564, "phrase": "significant_correlations"}, {"score": 0.002639845784408318, "phrase": "organizational_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Web traffic analysis", " Webometrics", " Performance measurements", " Data quality assessment"], "paper_abstract": "Unlike Web hyperlink data, Web traffic data have not yet been the focus of considerable study in Webometrics research. The relationships between Web traffic data and academic/business performance measures have not been as firmly established as the relationships between Web hyperlink data and such performance measures. Although various traffic data sources exist, few studies have examined and compared their relative merits. We carried out a study that aimed to address this lack. We selected groups of universities and businesses from the U.S. and China and collected their Web traffic data from three sources: Alexa Internet, Google Trends for Websites, and Compete. We found significant correlations between Web traffic data and organizational performance measures, specifically academic quality for universities and financial variables for businesses. We also examined the characteristics of the three data sources and compared their usefulness. We found that Alexa Internet outperformed the others. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Web traffic and organization performance measures: Relationships and data sources examined", "paper_id": "WOS:000323859700014"}