{"auto_keywords": [{"score": 0.032931100092710934, "phrase": "mle"}, {"score": 0.00481495049065317, "phrase": "independent_binomial_random_variables"}, {"score": 0.0047590526875526335, "phrase": "sequential_information"}, {"score": 0.004649187277140919, "phrase": "age-old_problem"}, {"score": 0.004385444037750123, "phrase": "strong_estimates"}, {"score": 0.003867768665068189, "phrase": "dependence_information"}, {"score": 0.0038005481380011677, "phrase": "markov_models"}, {"score": 0.0037784009327138115, "phrase": "n-gram_statistics"}, {"score": 0.0037042006198168952, "phrase": "sbe"}, {"score": 0.003574311504164068, "phrase": "first_reported_results"}, {"score": 0.0033127168183223876, "phrase": "sequence_based_estimation"}, {"score": 0.0031337020830262954, "phrase": "maximum_likelihood_estimates"}, {"score": 0.0029730145140038334, "phrase": "corresponding_mle_results"}, {"score": 0.0025987195907507393, "phrase": "corresponding_estimates"}, {"score": 0.00254603795454036, "phrase": "future_research"}, {"score": 0.002443849144972008, "phrase": "superior_overall_cumulative_estimate"}, {"score": 0.002380327476198495, "phrase": "pattern_recognition"}, {"score": 0.0022648020459693635, "phrase": "great_potential"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["estimation using sequential information", " estimation of binomials", " fused estimation methods", " sequential information"], "paper_abstract": "We re-visit(2) the age-old problem of estimating the parameters of a distribution from its observations. Traditionally, scientists and statisticians have attempted to obtain strong estimates by 'extracting' the information contained in the observations taken as a set. However, generally speaking, the information contained in the sequence in which the observations have appeared, has been ignored-i.e., except to consider dependence information as in the case of Markov models and n-gram statistics. In this paper, we present results which, to the best of our knowledge, are the first reported results, which consider how estimation can be enhanced by utilizing both the information in the observations and in their sequence of appearance. The strategy, known as sequence based estimation (SBE) works as follows. We first quickly allude to the results pertaining to computing the maximum likelihood estimates (MLE) of the data when the samples are taken individually. We then derive the corresponding MLE results when the samples are taken two-at-a-time, and then extend these for the cases when they are processed three-at-a-time, four-at-a-time etc. In each case, we also experimentally demonstrate the convergence of the corresponding estimates. We then suggest various avenues for future research, including those by which these estimates can be fused to yield a superior overall cumulative estimate of the parameter of the distribution, in pattern recognition (PR), and in other internet and compression applications. We believe that our new estimates have great potential for practitioners, especially when the cardinality of the observation set is small. (c) 2007 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "On the estimation of independent binomial random variables using occurrence and sequential information", "paper_id": "WOS:000248468800032"}