{"auto_keywords": [{"score": 0.004646088032529303, "phrase": "semantic_data_framework"}, {"score": 0.00457553517865013, "phrase": "interdisciplinary_virtual_observatory_projects"}, {"score": 0.004460309246062286, "phrase": "solar_physics"}, {"score": 0.0044150318724093226, "phrase": "space_physics"}, {"score": 0.00437021209960886, "phrase": "solar-terrestrial_physics"}, {"score": 0.004068907083697369, "phrase": "physical_quantities"}, {"score": 0.0036553070575015344, "phrase": "solar-terrestrial_ontologies"}, {"score": 0.003250238918180901, "phrase": "virtual_observatories"}, {"score": 0.0031682817605340028, "phrase": "upper_atmospheric_terrestrial_physics"}, {"score": 0.0029951555610569225, "phrase": "observational_datasets"}, {"score": 0.002949598537993663, "phrase": "resulting_data_framework"}, {"score": 0.002889928791032578, "phrase": "semantic_web_methodologies"}, {"score": 0.0028170314398963704, "phrase": "virtual_access"}, {"score": 0.002788388542538351, "phrase": "distributed_and_heterogeneous_sets"}, {"score": 0.002556359086441866, "phrase": "local_environment"}, {"score": 0.00240426758768164, "phrase": "free_and_open-source_software_tools"}, {"score": 0.002284444272376043, "phrase": "initial_production_implementation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ontologies", " Semantic web", " Knowledge representation", " Reasoning", " Data frameworks", " Virtual observatories"], "paper_abstract": "We have developed a semantic data framework that supports interdisciplinary virtual observatory projects across the fields of solar physics, space physics and solar-terrestrial physics. This work required a formal, machine understandable representation for concepts, relations and attributes of physical quantities in the domains of interest as well as their underlying data representations. To fulfill this need, we developed a set of solar-terrestrial ontologies as formal encodings of the knowledge in the Ontology Web Language-Description Logic (OWL-DL) format. We present our knowledge representation and reasoning needs motivated by the context of Virtual Observatories, from fields spanning upper atmospheric terrestrial physics to solar physics, whose intent is to provide access to observational datasets. The resulting data framework is built upon semantic web methodologies and technologies and provides virtual access to distributed and heterogeneous sets of data as if all resources appear to be organized, stored and retrieved from a local environment. Our conclusion is that the combination of use case-driven, small and modular ontology development, coupled with free and open-source software tools and languages provides sufficient expressiveness and capabilities for an initial production implementation and sets the stage for a more complete semantic-enablement of future frameworks. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Ontology-supported scientific data frameworks: The Virtual Solar-Terrestrial Observatory experience", "paper_id": "WOS:000265475500005"}