{"auto_keywords": [{"score": 0.04607258257653523, "phrase": "btv"}, {"score": 0.01885078118829147, "phrase": "camera_parameters"}, {"score": 0.010612387000973441, "phrase": "broadcast_tennis_video"}, {"score": 0.009879007320922081, "phrase": "accurate_camera_calibration"}, {"score": 0.004548848077202625, "phrase": "original_algorithm"}, {"score": 0.003748937184382714, "phrase": "frame_grouping_technique"}, {"score": 0.003371066990851953, "phrase": "camera_viewpoints"}, {"score": 0.0032951702142329357, "phrase": "group-wise_data_analysis"}, {"score": 0.0030082398041055003, "phrase": "similar_camera_viewpoint"}, {"score": 0.002940487679224863, "phrase": "hough-like_search"}, {"score": 0.00286336417751658, "phrase": "reprojection_disparity"}, {"score": 0.0028309318332306703, "phrase": "two-tiered_process"}, {"score": 0.0026945722090537397, "phrase": "good_match"}, {"score": 0.0026338658998573752, "phrase": "reprojected_camera_view"}, {"score": 0.0026040262154057607, "phrase": "tuning_step"}, {"score": 0.002488001663771768, "phrase": "camera_matrix"}, {"score": 0.0022625835448873495, "phrase": "experimental_results"}, {"score": 0.0021948455916770233, "phrase": "accurate_camera_matrix"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Sports video", " Camera calibration", " Group-wise data analysis", " Hough-like search", " Virtual content insertion", " Ball detection and tracking"], "paper_abstract": "This paper presents an original algorithm to automatically acquire accurate camera calibration from broadcast tennis video (BTV) as well as demonstrates two of its many applications. Accurate camera calibration from BTV is challenging because the frame-data of BTV is often heavily distorted and full of errors, resulting in wildly fluctuating camera parameters. To meet this challenge, we propose a frame grouping technique, which is based on the observation that many frames in BTV possess the same camera viewpoint. Leveraging on this fact, our algorithm groups frames according to the camera viewpoints. We then perform a group-wise data analysis to obtain a more stable estimate of the camera parameters. Recognizing the fact that some of these parameters do vary somewhat even if they have similar camera viewpoint, we further employ a Hough-like search to tune such parameters, minimizing the reprojection disparity. This two-tiered process gains stability in the estimates of the camera parameters, and yet ensures good match between the model and the reprojected camera view via the tuning step. To demonstrate the utility of such stable calibration, we apply the camera matrix acquired to two applications: (a) 3D virtual content insertion: and (b) tennis-ball detection and tracking. The experimental results show that our algorithm is able to acquire accurate camera matrix and the two applications have very good performances. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Automatic camera calibration of broadcast tennis video with applications to 3D virtual content insertion and ball detection and tracking", "paper_id": "WOS:000265227200007"}