{"auto_keywords": [{"score": 0.049438579755394736, "phrase": "comparative_studies"}, {"score": 0.04497733177139571, "phrase": "usability_tests"}, {"score": 0.00481495049065317, "phrase": "usability_problem"}, {"score": 0.004441059405327222, "phrase": "usability_test_data_analysis_processes"}, {"score": 0.0043619799095455415, "phrase": "problem_reports"}, {"score": 0.004023120753104693, "phrase": "usability_test"}, {"score": 0.0038985392250620483, "phrase": "agreed_test_protocol"}, {"score": 0.003044455555031339, "phrase": "academic_setting"}, {"score": 0.0027950561494657633, "phrase": "slimdevan"}, {"score": 0.0027206133859493725, "phrase": "inherent_subjectivity"}, {"score": 0.0026009105281485888, "phrase": "single_analyst_teams"}, {"score": 0.0024421008630165046, "phrase": "analysis_process"}, {"score": 0.0023033100935570755, "phrase": "identified_usability_problems"}, {"score": 0.0022118619998034742, "phrase": "original_observations"}, {"score": 0.0021336208506092173, "phrase": "subjective_parts"}, {"score": 0.0021049977753042253, "phrase": "data_analysis"}], "paper_keywords": [""], "paper_abstract": "This study explores issues of consistency and inspectability in usability test data analysis processes and reports. Problem reports resulting from usability tests performed by three professional usability labs in three different countries are compared. Each of the labs conducted a usability test on the same product, applying an agreed test protocol that was collaboratively developed by the labs. Each lab first analyzed their own findings as they always do in their regular professional practice. A few weeks later, they again analyzed their findings, but then everyone applied the same method (SlimDEVAN: a simplified version of DEVAN, a method developed for facilitating comparison of findings from usability tests in an academic setting). It was found that levels of agreement between labs did not improve when they all used SlimDEVAN, suggesting that there was inherent subjectivity in their analyses. It was found that consistency of single analyst teams varied considerably and that a method like SlimDEVAN can help in making the analysis process and findings more inspectable. Inspectability is helpful in comparative studies based on identified usability problems because it allows for tracing back findings to original observations as well as for laying bare the subjective parts of the data analysis.", "paper_title": "Usability Problem Reports for Comparative Studies: Consistency and Inspectability", "paper_id": "WOS:000261695500001"}