{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bayesian_networks"}, {"score": 0.008455535313058751, "phrase": "possible_structures"}, {"score": 0.007505530009702562, "phrase": "pso"}, {"score": 0.004762893197005439, "phrase": "discrete_particle_swarm_optimization"}, {"score": 0.004610058444728656, "phrase": "powerful_approach"}, {"score": 0.004272164161788242, "phrase": "good_algorithms"}, {"score": 0.004068087482412997, "phrase": "heuristic_search_algorithm"}, {"score": 0.0036091892088392775, "phrase": "model_structure"}, {"score": 0.002999386721353559, "phrase": "classical_pso_algorithm"}, {"score": 0.002934764205541183, "phrase": "continuous_and_real-valued_space"}, {"score": 0.002779217021776702, "phrase": "discrete_space"}, {"score": 0.0026607205525625995, "phrase": "updating_rules"}, {"score": 0.0024122047542536203, "phrase": "experimental_results"}, {"score": 0.0022472527731744974, "phrase": "optimal_bayesian_networks_structures"}, {"score": 0.00210508092881752, "phrase": "ga"}], "paper_keywords": ["Bayesian networks", " Uncertainty", " Structural learning", " PSO", " Discrete PSO", " Genetic algorithms"], "paper_abstract": "Bayesian networks are a powerful approach for representing and reasoning under conditions of uncertainty. Many researchers aim to find good algorithms for learning Bayesian networks from data. And the heuristic search algorithm is one of the most effective algorithms. Because the number of possible structures grows exponentially with the number of variables, learning the model structure from data by considering all possible structures exhaustively is infeasible. PSO (particle swarm optimization), a powerful optimal heuristic search algorithm, has been applied in various fields. Unfortunately, the classical PSO algorithm only operates in continuous and real-valued space, and the problem of Bayesian networks learning is in discrete space. In this paper, two modifications of updating rules for velocity and position are introduced and a Bayesian networks learning based on binary PSO is proposed. Experimental results show that it is more efficient because only fewer generations are needed to obtain optimal Bayesian networks structures. In the comparison, this method outperforms other heuristic methods such as GA (genetic algorithm) and classical binary PSO.", "paper_title": "A heuristic method for learning Bayesian networks using discrete particle swarm optimization", "paper_id": "WOS:000280251200005"}