{"auto_keywords": [{"score": 0.04247426879349954, "phrase": "success_factors"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004597244847332915, "phrase": "information_systems"}, {"score": 0.004303127794432684, "phrase": "satisfaction_level"}, {"score": 0.003871024872459116, "phrase": "client_firm's_top_management"}, {"score": 0.003030247482854539, "phrase": "partial_least_squares_software"}, {"score": 0.002893001738785978, "phrase": "structural_equation_model"}, {"score": 0.0027256122357680393, "phrase": "perceived_benefits"}, {"score": 0.002671990515821213, "phrase": "mediating_role"}, {"score": 0.002636828502928141, "phrase": "outsourcing_satisfaction"}, {"score": 0.00234043119560776, "phrase": "technological_ones"}], "paper_keywords": ["Satisfaction", " Outsourcing", " Success", " SEM", " Information systems", " Perceived benefits"], "paper_abstract": "Purpose - The purpose of this paper is to analyse Information Systems outsourcing success, measuring the latter according to the satisfaction level achieved by users and taking into account three success factors: the role played by the client firm's top management; the relationships between client and provider; and the degree of outsourcing. Design/methodology/approach - A survey was carried out by means of a questionnaire answered by 398 large Spanish firms. Its results were examined using the partial least squares software and through the proposal of a structural equation model. Findings - The conclusions reveal that the perceived benefits play a mediating role in outsourcing satisfaction and also that these benefits can be grouped together into three categories: strategic; economic; and technological ones. Originality/value - The study identifies how some success factors will be more influent than others depending which type of benefits are ultimately sought with outsourcing.", "paper_title": "Information systems outsourcing satisfaction: some explanatory factors", "paper_id": "WOS:000359055200005"}