{"auto_keywords": [{"score": 0.0391710032323389, "phrase": "dpil_model"}, {"score": 0.00481495049065317, "phrase": "spaced_and_massed_repetition"}, {"score": 0.0038487848937121204, "phrase": "available_encoding_resources"}, {"score": 0.003687960013746783, "phrase": "five_empirical_datasets"}, {"score": 0.0030923570058383355, "phrase": "empirical_data"}, {"score": 0.0030270132320276096, "phrase": "quality_inspection_station"}, {"score": 0.0029789104204803137, "phrase": "industrial_firm"}, {"score": 0.0027791193706247267, "phrase": "final_break"}, {"score": 0.002470987929071079, "phrase": "paper_show"}, {"score": 0.002317533977770783, "phrase": "final_break_increases"}, {"score": 0.002244410443944976, "phrase": "empirical_findings"}, {"score": 0.002220551141101661, "phrase": "moderately_short_breaks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Learning", " Forgetting", " Spaced/massed practice", " Mathematical model", " Depletion", " Novelty"], "paper_abstract": "Although several models have been suggested in the literature to describe the relationship between learning and forgetting, this relationship is still not fully understood. This paper proposes the Depletion-Power-Integration-Latency (DPIL) model, which assumes that performing a task repetitively depletes the available encoding resources for that task. The DPIL model fitted five empirical datasets well, reflecting different procedural/episodic learning settings, experimental paradigms (massed/spaced repetition, study time), tests (accuracy, latency), and retention intervals. The model was also fitted to empirical data collected from a quality inspection station at an industrial firm. The DPIL model has the advantage of predicting the length of the final break (interruption) that optimizes performance. This finding is important as it has many industrial engineering applications. The numerical results in this paper show that performance improves as the length of each break preceding the final break increases. This is consistent with empirical findings that moderately short breaks are optimal for performance. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "The Depletion-Power-Integration-Latency (DPIL) model of spaced and massed repetition", "paper_id": "WOS:000304687100030"}