{"auto_keywords": [{"score": 0.0415992188895559, "phrase": "mpml"}, {"score": 0.015719714774698138, "phrase": "multimodal_contents"}, {"score": 0.015397830862690661, "phrase": "mpml."}, {"score": 0.0144706146519891, "phrase": "multimodal_media"}, {"score": 0.004764859786310636, "phrase": "affective_lifelike_agents"}, {"score": 0.0043367547691560175, "phrase": "embodied_lifelike_agents"}, {"score": 0.003251920460276645, "phrase": "animated_web"}, {"score": 0.0031845067058084583, "phrase": "mobile_phones"}, {"score": 0.003118486096035156, "phrase": "physical_world"}, {"score": 0.003069867656852932, "phrase": "humanoid_robot"}, {"score": 0.002867771524071872, "phrase": "emotional_behavior"}, {"score": 0.0027790254309734428, "phrase": "important_factor"}, {"score": 0.0025960262223338293, "phrase": "attractive_and_friendly_human-computer_interaction_style"}], "paper_keywords": ["lifelike agent", " multimodal contents", " content description language", " emotion", " affective computing"], "paper_abstract": "In this paper, we provide an overview of our research on multimodal media and contents using embodied lifelike agents. In particular we describe our research centered on MPML (Multimodal Presentation Markup Language). MPML allows people to write and produce multimodal contents easily, and serves as a core for integrating various components and functionalities important for multimodal media. To demonstrate the benefits and usability of MPML in a variety of environments including animated Web, 3D VRML space, mobile phones, and the physical world with a humanoid robot, several versions of MPML have been developed while keeping its basic format. Since emotional behavior of the agent is an important factor for making agents lifelike and for being accepted by people as an attractive and friendly human-computer interaction style, emotion-related functions have been emphasized in MPML. In order to alleviate the workload of authoring the contents, it is also required to endow the agents with a certain level of autonomy. We show some of our approaches towards this end.", "paper_title": "Describing and generating multimodal contents featuring affective lifelike agents with MPML", "paper_id": "WOS:000236290700001"}