{"auto_keywords": [{"score": 0.0407704748864984, "phrase": "input_values"}, {"score": 0.00481495049065317, "phrase": "anonymous_message_passing_systems"}, {"score": 0.00470862827326028, "phrase": "message_complexity"}, {"score": 0.0046046429665581555, "phrase": "synchronous_anonymous_message"}, {"score": 0.004523103062368843, "phrase": "unlabeled_processors"}, {"score": 0.004136469845987887, "phrase": "possibly_different_times"}, {"score": 0.004063186599879217, "phrase": "arbitrary_numerical_input_values"}, {"score": 0.0037658881407605445, "phrase": "dormant_processor"}, {"score": 0.0034437574674180365, "phrase": "deterministic_consensus_algorithms"}, {"score": 0.0027907771648224273, "phrase": "n-node_networks"}, {"score": 0.0027047136845332917, "phrase": "consensus_algorithm"}, {"score": 0.002181766829493483, "phrase": "n-node_network"}], "paper_keywords": ["algorithm", " consensus", " anonymous networks", " message complexity"], "paper_abstract": "We consider the message complexity of achieving consensus in synchronous anonymous message passing systems. Unlabeled processors (nodes) communicate through links of a network. An adversary wakes up some subset of processors at possibly different times and assigns them arbitrary numerical input values. All other processors are dormant and do not have input values. Any message wakes up a dormant processor. The goal of consensus is to have all processors agree on one of the input values. We seek deterministic consensus algorithms using as few messages as possible. As opposed to most of the literature on consensus, the difficulty of our scenario are not faults (we assume that the network is fault-free) but the arbitrary network topology combined with the anonymity of nodes. For n-node networks of unknown topology we show a consensus algorithm using O(n(2)) messages; this complexity is optimal for this class. We show that if the network topology is known, then the complexity of consensus decreases significantly. Our main contribution is an algorithm that uses O(n(3/2) log(2) n) messages on any n-node network and we show that some networks require Omega(n log n) messages to achieve consensus.", "paper_title": "Communication Complexity of Consensus in Anonymous Message Passing Systems", "paper_id": "WOS:000351841700001"}