{"auto_keywords": [{"score": 0.04850161465082996, "phrase": "software_project_escalation"}, {"score": 0.005628207124746694, "phrase": "initial_budget"}, {"score": 0.004895433383033585, "phrase": "goal_difficulty"}, {"score": 0.004841087747871423, "phrase": "goal_specificity"}, {"score": 0.00481495049065317, "phrase": "initial_budget_and_schedule_goal"}, {"score": 0.004579005794486596, "phrase": "costly_problem"}, {"score": 0.004477870190590885, "phrase": "significant_financial_losses"}, {"score": 0.00428222231579898, "phrase": "publicly_announced_limit"}, {"score": 0.0034245614958572012, "phrase": "cost_and_mental_budgeting_perspectives"}, {"score": 0.0031140747752837826, "phrase": "laboratory_experiment"}, {"score": 0.0027382040767844093, "phrase": "budget_and_schedule_goal"}, {"score": 0.0024620842899061614, "phrase": "theoretical_contribution"}, {"score": 0.0024211009463218484, "phrase": "existing_body"}, {"score": 0.0023675132064088803, "phrase": "software_project_management"}, {"score": 0.0021049977753042253, "phrase": "potential_negative_consequences"}], "paper_keywords": ["escalation of commitment", " goal setting theory", " mental budgeting", " project estimation", " software project escalation", " software project management", " sunk cost"], "paper_abstract": "Software project escalation is a costly problem that leads to significant financial losses. Prior research suggests that setting a publicly announced limit on resources can make individuals less willing to escalate their commitment to a failing course of action. However, the relationship between initial budget and schedule goals and software project escalation remains unexplored. Drawing on goal setting theory as well as sunk cost and mental budgeting perspectives, we explore the effect of goal difficulty and goal specificity on software project escalation. The findings from a laboratory experiment with 349 information technology professionals suggest that both very difficult and very specific goals for budget and schedule can limit software project escalation. Further, the level of commitment to a budget and schedule goal directly affects software project escalation and also interacts with goal difficulty and goal specificity to affect software project escalation. This study makes a theoretical contribution to the existing body of knowledge on software project management by establishing a connection between goal setting theory and software project escalation. The study also contributes to practice by highlighting the potential negative consequences that can result from the nature of initial budget and schedule goals that are established at the outset of a project.", "paper_title": "The Effect of an Initial Budget and Schedule Goal on Software Project Escalation", "paper_id": "WOS:000308830800003"}