{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_interactions"}, {"score": 0.015097025961829717, "phrase": "multimedia_systems"}, {"score": 0.004749824776508639, "phrase": "video_news"}, {"score": 0.004706895428234964, "phrase": "demand_service"}, {"score": 0.004664352260912174, "phrase": "accurate_workload_prediction"}, {"score": 0.004051828608343507, "phrase": "entertainment_video-on-demand_service"}, {"score": 0.003378385493203297, "phrase": "lne_tv"}, {"score": 0.0032282396745967504, "phrase": "traditional_newspaper"}, {"score": 0.0028944757265206332, "phrase": "client_interactivity"}, {"score": 0.0028293966058473476, "phrase": "dependence_structure"}, {"score": 0.0027910516355928983, "phrase": "stochastic_process"}, {"score": 0.002753224894944965, "phrase": "previous_work"}, {"score": 0.0026069623057065664, "phrase": "single_variable"}, {"score": 0.002536763634539386, "phrase": "actual_multimedia_systems"}, {"score": 0.0023479408542211875, "phrase": "correlated_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Video-on-demand", " Multimedia systems", " User modeling", " Workload characterization"], "paper_abstract": "Accurate workload prediction in multimedia systems requires a description of both its probabilistic properties and the interdependence between the variables of the system. This paper analyzes the interactions of the users of a news and entertainment video-on-demand service (LNE TV, http://tv.lne.es) during six months of activity. The analysis was performed using information extracted from the server logs, analyzing more than 300,000 requests for almost 1500 videos. The type of content on the site and the structure of LNE TV, which is similar to most Internet news services supported by a traditional newspaper, make this work an interesting case study, and the results can be easily extrapolated to similar audio/video streaming services. This paper shows that client interactivity in multimedia systems has the dependence structure of a stochastic process. In previous work, this type of study has been carried out in a single variable, whereas the user interactions in actual multimedia systems are multivariate. In this context, we have used copulas to create distributions to model correlated data. In our study, we model user interactions depending on their marginal univariate distributions and their correlation coefficient with the length of the videos. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Probabilistic analysis and interdependence discovery in the user interactions of a video news on demand service", "paper_id": "WOS:000268415700006"}