{"auto_keywords": [{"score": 0.045652937703751964, "phrase": "predictiveness_curves"}, {"score": 0.0384043744476136, "phrase": "virtual_screening_methods"}, {"score": 0.012421384716028864, "phrase": "virtual_screening"}, {"score": 0.011823047636572924, "phrase": "predictiveness_curve"}, {"score": 0.0059075282697383154, "phrase": "predictive_power"}, {"score": 0.005778513290586277, "phrase": "roc_curves"}, {"score": 0.00473578343131372, "phrase": "present_work"}, {"score": 0.0044687642978081185, "phrase": "clinical_epidemiology"}, {"score": 0.004299132717464689, "phrase": "biological_markers"}, {"score": 0.0042050950311143115, "phrase": "disease_risks"}, {"score": 0.0041359134977958555, "phrase": "risk_models"}, {"score": 0.0040791288840175835, "phrase": "clinical_utility"}, {"score": 0.003924229326328455, "phrase": "logistic_regression_models"}, {"score": 0.003891806560322573, "phrase": "activity_probabilities"}, {"score": 0.0037856456822219857, "phrase": "virtual_screening_experiments"}, {"score": 0.0037130544070027305, "phrase": "intuitive_and_graphical_tool"}, {"score": 0.0034553652385029034, "phrase": "common_scale"}, {"score": 0.003188916332246111, "phrase": "predictive_performance"}, {"score": 0.0030255540794918863, "phrase": "early_recognition_problem"}, {"score": 0.002992239873711124, "phrase": "last_end"}, {"score": 0.0029267046669617107, "phrase": "total_gain"}, {"score": 0.002910545717767559, "phrase": "partial_total_gain"}, {"score": 0.0028705364714772083, "phrase": "early_recognition"}, {"score": 0.002854686750765905, "phrase": "active_compounds"}, {"score": 0.0026490647955585756, "phrase": "optimal_score_thresholds"}, {"score": 0.0025624842400376346, "phrase": "drug_discovery_program"}, {"score": 0.0024787321587310105, "phrase": "roc"}, {"score": 0.0023647829603134648, "phrase": "icm"}, {"score": 0.0023516600276539557, "phrase": "autodock_vina"}, {"score": 0.0022937597795708964, "phrase": "different_aspects"}, {"score": 0.0022310928580761614, "phrase": "detailed_evaluation"}, {"score": 0.0021049977753042253, "phrase": "virtual_screening_results"}], "paper_keywords": [""], "paper_abstract": "Background: In the present work, we aim to transfer to the field of virtual screening the predictiveness curve, a metric that has been advocated in clinical epidemiology. The literature describes the use of predictiveness curves to evaluate the performances of biological markers to formulate diagnoses, prognoses and assess disease risks, assess the fit of risk models, and estimate the clinical utility of a model when applied to a population. Similarly, we use logistic regression models to calculate activity probabilities related to the scores that the compounds obtained in virtual screening experiments. The predictiveness curve can provide an intuitive and graphical tool to compare the predictive power of virtual screening methods. Results: Similarly to ROC curves, predictiveness curves are functions of the distribution of the scores and provide a common scale for the evaluation of virtual screening methods. Contrarily to ROC curves, the dispersion of the scores is well described by predictiveness curves. This property allows the quantification of the predictive performance of virtual screening methods on a fraction of a given molecular dataset and makes the predictiveness curve an efficient tool to address the early recognition problem. To this last end, we introduce the use of the total gain and partial total gain to quantify recognition and early recognition of active compounds attributed to the variations of the scores obtained with virtual screening methods. Additionally to its usefulness in the evaluation of virtual screening methods, predictiveness curves can be used to define optimal score thresholds for the selection of compounds to be tested experimentally in a drug discovery program. We illustrate the use of predictiveness curves as a complement to ROC on the results of a virtual screening of the Directory of Useful Decoys datasets using three different methods (Surflex-dock, ICM, Autodock Vina). Conclusion: The predictiveness curves cover different aspects of the predictive power of the scores, allowing a detailed evaluation of the performance of virtual screening methods. We believe predictiveness curves efficiently complete the set of tools available for the analysis of virtual screening results.", "paper_title": "Predictiveness curves in virtual screening", "paper_id": "WOS:000364004700001"}