{"auto_keywords": [{"score": 0.0387945566502603, "phrase": "emotinet"}, {"score": 0.00481495049065317, "phrase": "emotion_detection"}, {"score": 0.0041725881174377345, "phrase": "emotion_words"}, {"score": 0.0034990853199511982, "phrase": "affective_reaction"}, {"score": 0.00347054319869429, "phrase": "real-life_contexts"}, {"score": 0.003210704011271791, "phrase": "design_process"}, {"score": 0.0031199418866663543, "phrase": "self-reported_affective_situations"}, {"score": 0.0030441844088874366, "phrase": "isear"}, {"score": 0.002898127432512101, "phrase": "semantic_roles"}, {"score": 0.002770389097966904, "phrase": "verbocean"}, {"score": 0.002747777441541958, "phrase": "conceptnet"}, {"score": 0.002714200342573924, "phrase": "sentiwordnet"}, {"score": 0.002459902948098627, "phrase": "isear_corpus"}, {"score": 0.0023322317017275803, "phrase": "small_quantity"}, {"score": 0.0022477377970612847, "phrase": "semantic_resource"}, {"score": 0.0021398115287338693, "phrase": "real_events"}, {"score": 0.0021049977753042253, "phrase": "emotional_responses"}], "paper_keywords": ["Affective computing", " emotion detection", " emotion theory", " knowledge and data engineering tools and techniques", " affect sensing and analysis"], "paper_abstract": "The task of automatically detecting emotion in text is challenging. This is due to the fact that most of the times, textual expressions of affect are not direct-using emotion words-but result from the interpretation and assessment of the meaning of the concepts and interaction of concepts described in the text. This paper presents the core of EmotiNet, a new knowledge base (KB) for representing and storing affective reaction to real-life contexts, and the methodology employed in designing, populating, and evaluating it. The basis of the design process is given by a set of self-reported affective situations in the International Survey on Emotion Antecedents and Reactions (ISEAR) corpus. We cluster the examples and extract triples using Semantic Roles. We subsequently extend our model using other resources, such as VerbOcean, ConceptNet, and SentiWordNet, with the aim of generalizing the knowledge contained. Finally, we evaluate the approach using the representations of other examples in the ISEAR corpus. We conclude that EmotiNet, although limited by the domain and small quantity of knowledge it presently contains, represents a semantic resource appropriate for capturing and storing the structure and the semantics of real events and predicting the emotional responses triggered by chains of actions.", "paper_title": "Building and Exploiting EmotiNet, a Knowledge Base for Emotion Detection Based on the Appraisal Theory Model", "paper_id": "WOS:000323625000009"}