{"auto_keywords": [{"score": 0.041462398183773855, "phrase": "network_lifetime"}, {"score": 0.022792972017449575, "phrase": "mac"}, {"score": 0.021125894963914926, "phrase": "application's_reliability_requirement"}, {"score": 0.00481495049065317, "phrase": "multipath_routing"}, {"score": 0.004632597963417253, "phrase": "wireless_sensor_networks"}, {"score": 0.004596960835906736, "phrase": "multihop_data_transmission"}, {"score": 0.00456159659731398, "phrase": "error-prone_wireless_links"}, {"score": 0.004271729935895193, "phrase": "wireless_sensors"}, {"score": 0.0035761182400032487, "phrase": "optimal_number"}, {"score": 0.0031968441980848436, "phrase": "sleeping_multipath_routing"}, {"score": 0.003075583447856341, "phrase": "cross-layer_coordination"}, {"score": 0.002902236818129282, "phrase": "mac_layers"}, {"score": 0.0028356575042385156, "phrase": "sleeping_solution"}, {"score": 0.0027706013216537042, "phrase": "multipath_routing_protocol"}, {"score": 0.0027386335451725762, "phrase": "multiple_disjoint_paths"}, {"score": 0.0025942468561537682, "phrase": "cycle_length"}, {"score": 0.002476546030310661, "phrase": "directed_diffusion"}, {"score": 0.0023099082804523044, "phrase": "longer_network_lifetime"}, {"score": 0.002292097733181405, "phrase": "required_reliability_support"}, {"score": 0.0021049977753042253, "phrase": "alive_nodes"}], "paper_keywords": ["Design", " Algorithms", " Performance", " Adaptive sensor sleeping", " multipath routing", " duty-cycled MAC protocols"], "paper_abstract": "Various applications of wireless sensor networks require multihop data transmission over error-prone wireless links, hence multipath routing can be used to meet the application's reliability requirement. On the other hand, wireless sensors are usually battery powered, and thus it is very important to save energy in order to prolong the network lifetime. In this article, we propose (1) Sleeping Multipath Routing, which can trade off reliability and network lifetime by dynamically activating an optimal number of paths to support the application's reliability requirement and putting the rest of the sensors to sleep, and (2) an adaptive sensor sleeping solution, which includes Sleeping Multipath Routing, a duty-cycled MAC protocol, and cross-layer coordination to further prolong the network lifetime by putting sensors to sleep at both the routing and the MAC layers. Our proposed Sleeping Multipath Routing and adaptive sensor sleeping solution can be implemented on any multipath routing protocol that discovers multiple disjoint paths between two nodes, and any duty-cycled MAC protocol that has fixed cycle length. We show an example of implementing our adaptive sensor sleeping solution using Directed Diffusion and S-MAC. Simulation results show that our proposed adaptive sensor sleeping solution outperforms single-layer sensor sleeping with a longer network lifetime with required reliability support. Moreover, our proposed adaptive sensor sleeping solution can significantly prolong the network lifetime when the application's reliability requirement varies over time, or when the number of alive nodes in the network changes over time.", "paper_title": "An Adaptive Sensor Sleeping Solution Based on Sleeping Multipath Routing and Duty-Cycled MAC Protocols", "paper_id": "WOS:000329134500010"}