{"auto_keywords": [{"score": 0.04814050608144561, "phrase": "broadcast_capacity"}, {"score": 0.007921498368115138, "phrase": "node_density"}, {"score": 0.007706973484887397, "phrase": "network_area"}, {"score": 0.006045842357418053, "phrase": "extended_networks"}, {"score": 0.004749106104067268, "phrase": "fundamental_problem"}, {"score": 0.0047057084749407485, "phrase": "wireless_networks"}, {"score": 0.004273196830970426, "phrase": "relay_network"}, {"score": 0.003988719758707836, "phrase": "single_source"}, {"score": 0.0036721416244816455, "phrase": "high-density_networks"}, {"score": 0.0021539955106204337, "phrase": "multihop_noncooperative_broadcasting"}, {"score": 0.0021049977753042253, "phrase": "maximum_rate"}], "paper_keywords": ["Broadcast capacity", " cooperative communication", " extended networks", " high-density networks", " relay", " scaling laws", " wireless networks"], "paper_abstract": "A fundamental problem in wireless networks is determining the broadcast capacity, i.e., the maximum data transfer rate from a given node to every other node in a relay network. This paper studies the scaling of the broadcast capacity for a network with a single source and destinations, of which f(N) are randomly selected to also act as relays. In high-density networks (i.e., the node density goes to infinity; the network area is fixed), it is shown that the broadcast capacity is upper bounded by Theta(log f(N)). Schemes are provided that achieve i) Theta(log f(N)) throughput if the channel fading is spatially continuous; ii) Theta(log log f(N))throughput if the channel fading is spatially i.i.d.. For extended networks (i.e., the node density is fixed; the network area goes to infinity), the broadcast capacity is upper bounded by Theta(1) . A under channel models with fading and path-loss exponent alpha > 2. A multistage cooperative broadcasting scheme, which achieves Theta(1) broadcast rate for the high-density extended networks with pathloss channel model is proposed. These results quantifies the gains obtained due to cooperation compared to multihop noncooperative broadcasting, which has a maximum rate that scales as Theta(1) for high-density and Theta(1/(log f(N))(alpha/2)) for extended networks.", "paper_title": "On the Broadcast Capacity of Wireless Networks With Cooperative Relays", "paper_id": "WOS:000282001700015"}