{"auto_keywords": [{"score": 0.038635731992653306, "phrase": "global_structure"}, {"score": 0.00481495049065317, "phrase": "handwritten_digit_recognition"}, {"score": 0.004285289574869884, "phrase": "proposed_methods"}, {"score": 0.004173244935967375, "phrase": "handwritten_digit_image"}, {"score": 0.0038953958723049287, "phrase": "recognition_results"}, {"score": 0.00385431710959668, "phrase": "individual_parts"}, {"score": 0.0037935066882208235, "phrase": "part-based_methods"}, {"score": 0.003287482882222731, "phrase": "proposed_three_methods"}, {"score": 0.0029722900280316216, "phrase": "individual_results"}, {"score": 0.002863921785266393, "phrase": "different_performances"}, {"score": 0.002833689453299307, "phrase": "experimental_results"}, {"score": 0.0027889366191837504, "phrase": "even_the_simplest_part-based_method"}, {"score": 0.0021049977753042253, "phrase": "part-based_method"}], "paper_keywords": ["handwritten digit recognition", " local features", " part-based method"], "paper_abstract": "In this paper, we intensively study the behavior of three part-based methods for handwritten digit recognition. The principle of the proposed methods is to represent a handwritten digit image as a set of parts and recognize the image by aggregating the recognition results of individual parts. Since part-based methods do not rely on the global structure of a character, they are expected to be more robust against various deformations which may damage the global structure. The proposed three methods are based on the same principle but different in their details, for example, the way of aggregating the individual results. Thus, those methods have different performances. Experimental results show that even the simplest part-based method can achieve recognition rate as high as 98.42% while the improved one achieved 99.15%, which is comparable or even higher than some state-of-the-art method. This result is important because it reveals that characters can be recognized without their global structure. The results also show that the part-based method has robustness against deformations which usually appear in handwriting.", "paper_title": "Part-based methods for handwritten digit recognition", "paper_id": "WOS:000322390700006"}