{"auto_keywords": [{"score": 0.04824070778853845, "phrase": "project_jargon"}, {"score": 0.014737227852203452, "phrase": "different_knowledge_backgrounds"}, {"score": 0.00916520493559745, "phrase": "interpretation_drift"}, {"score": 0.00481495049065317, "phrase": "professional_boundaries_-_the_emergence"}, {"score": 0.0044524122425287005, "phrase": "complex_issues"}, {"score": 0.004356620736507642, "phrase": "communication_breakdowns"}, {"score": 0.004262881313926916, "phrase": "different_worldviews"}, {"score": 0.004046020290832207, "phrase": "intercultural_collaboration_issue"}, {"score": 0.004010960493946656, "phrase": "previous_research"}, {"score": 0.003924629168434799, "phrase": "support_systems"}, {"score": 0.0037903327482565097, "phrase": "others'_social_worlds"}, {"score": 0.0037411604449359794, "phrase": "mutual_understanding"}, {"score": 0.0034143003168921114, "phrase": "collective_creation_process"}, {"score": 0.003170667618004276, "phrase": "different_social_worlds"}, {"score": 0.0029830992938695033, "phrase": "collective_concern"}, {"score": 0.002770150086489194, "phrase": "common_terms"}, {"score": 0.0027341763737751467, "phrase": "unavoidable_integral_aspect"}, {"score": 0.0026986685585382347, "phrase": "design_process"}, {"score": 0.0026062133750675894, "phrase": "local_languages"}, {"score": 0.0025500402081330394, "phrase": "collaboration_period"}, {"score": 0.0023270035715132866, "phrase": "communicative_difficulties"}], "paper_keywords": ["Intercultural collaboration", " Breakdown", " Interpretation drift of common terms", " Collaborative design", " Collective creation", " Project jargon"], "paper_abstract": "Collaboration among people with different knowledge backgrounds can raise complex issues. The risk of communication breakdowns increases due to the different worldviews and languages each professional brings to such a collective project. To solve this intercultural collaboration issue, previous research suggested a numbers of support systems that seek to diminish differences, understand others' social worlds and achieve mutual understanding. However, interestingly, the cases introduced in this paper indicate that a key in such collaboration support resides in the collective creation process rather than the minimizing of differences or understanding of one another's social world. Professionals in design often maintain different social worlds and their understanding of others within them, even though they collaborate for a collective concern. In this paper, by introducing and analyzing two empirical collaborative design cases, we address the interpretation drift of common terms as an unavoidable integral aspect of the design process, and the ongoing collective creation of local languages or project jargon during the collaboration period as facilitators to enable collaborators to work beyond interpretation drift and breakdowns. By referring to our cases, we show that communicative difficulties diminish but do not entirely disappear, and continuous drift in interpretations and breakdowns are observed. At the same time, in such a process, collectively created and maintained project jargon contributes largely to facilitate professionals with different knowledge backgrounds.", "paper_title": "Collaboration Across Professional Boundaries - The Emergence of Interpretation Drift and the Collective Creation of Project Jargon", "paper_id": "WOS:000358250000002"}