{"auto_keywords": [{"score": 0.04808171687412101, "phrase": "korea"}, {"score": 0.00481495049065317, "phrase": "educational_informatization_level"}, {"score": 0.0041657281535389615, "phrase": "education_informatization"}, {"score": 0.0039244530915794025, "phrase": "education_informatiozation"}, {"score": 0.003841699919521703, "phrase": "paramount_pedagogical_issues"}, {"score": 0.0038090874465452214, "phrase": "south_korea"}, {"score": 0.0036813725040313002, "phrase": "korea's_education_informatization_policy"}, {"score": 0.0035883942463601688, "phrase": "education_information"}, {"score": 0.0034828730516958807, "phrase": "satisfaction_levels"}, {"score": 0.0032531496610470377, "phrase": "education_policies"}, {"score": 0.0024969812322112174, "phrase": "education_informatization_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Improving classroom teaching", " Pedagogical issue"], "paper_abstract": "Korea is recognized as one of the most advanced countries in terms of informatization. The development of informatization has impacted education, and education informatization has contributed to the improvement of teaching in the classroom. Accordingly, education informatiozation is one of the paramount pedagogical issues in South Korea. This study evaluated the effect of Korea's education informatization policy qualitatively. The access to education information, competency, utilization and the satisfaction levels of students, teachers and parents, who are the groups most directly affected by education policies, were analyzed. In addition, the level of education informatization, the growth of which had been expected by experts, was measured. The rate of achievement as compared to the level expected by experts was analyzed. According to the results of the analysis, the rate of achievement of all three groups was low, and the education informatization level of parents was the lowest. On the basis of the results of this study, we have suggestions about the kind of effort that is needed to raise the level of education informatization. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "An analysis of educational informatization level of students, teachers, and parents: In Korea", "paper_id": "WOS:000286682700022"}