{"auto_keywords": [{"score": 0.041712156789843864, "phrase": "proposed_unsupervised_feature_selection_algorithm"}, {"score": 0.00935192919420057, "phrase": "clustering_ensembles_method"}, {"score": 0.009118233077541452, "phrase": "based_incremental_learning_algorithm"}, {"score": 0.007882562393860686, "phrase": "feature_subset"}, {"score": 0.00481495049065317, "phrase": "clustering_ensembles"}, {"score": 0.004461359547152617, "phrase": "novel_feature_selection_algorithm"}, {"score": 0.004055511503825102, "phrase": "main_idea"}, {"score": 0.003663067281537946, "phrase": "clustering_algorithm"}, {"score": 0.0031643005824589917, "phrase": "clustering_solution"}, {"score": 0.002750721367040336, "phrase": "obtained_clustering_solution"}, {"score": 0.0023758843175179702, "phrase": "multiple_clustering_solutions"}, {"score": 0.0023458049872325214, "phrase": "experimental_results"}, {"score": 0.0021593396036472777, "phrase": "better_feature_subset"}], "paper_keywords": ["clustering ensembles", " dimensionality unbiased", " population based incremental learning algorithm", " unsupervised feature selection"], "paper_abstract": "This paper describes a novel feature selection algorithm for unsupervised clustering, that combines the clustering ensembles method and the population based incremental learning algorithm. The main idea of the proposed unsupervised feature selection algorithm is to search for a subset of all features such that the clustering algorithm trained on this feature subset can achieve the most similar clustering solution to the one obtained by an ensemble learning algorithm. In particular, a clustering solution is firstly achieved by a clustering ensembles method, then the population based incremental learning algorithm is adopted to find the feature subset that best fits the obtained clustering solution. One advantage of the proposed unsupervised feature selection algorithm is that it is dimensionality-unbiased. In addition, the proposed unsupervised feature selection algorithm leverages the consensus across multiple clustering solutions. Experimental results on several real data sets demonstrate that the proposed unsupervised feature selection algorithm is often able to obtain a better feature subset when compared with other existing unsupervised feature selection algorithms. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Unsupervised feature selection using clustering ensembles and population based incremental learning algorithm", "paper_id": "WOS:000257581000002"}