{"auto_keywords": [{"score": 0.027197814714766472, "phrase": "test_suites"}, {"score": 0.00481495049065317, "phrase": "general_testability_theory"}, {"score": 0.004732606593496712, "phrase": "complexity"}, {"score": 0.0044702911400353535, "phrase": "general_framework"}, {"score": 0.003747020072136732, "phrase": "five_testability_classes"}, {"score": 0.0035110198699787013, "phrase": "finite_testability"}, {"score": 0.003125835572347772, "phrase": "better_incomplete_test_suites"}, {"score": 0.00290173234777844, "phrase": "minimum_complete_test_suites"}, {"score": 0.002744234034162797, "phrase": "testing_problems"}, {"score": 0.002267708463966758, "phrase": "testing_methods"}, {"score": 0.002195033004022173, "phrase": "general_notions"}, {"score": 0.0021545524633190985, "phrase": "specific_cases"}, {"score": 0.0021049977753042253, "phrase": "formal_testing_techniques_domain"}], "paper_keywords": ["Formal testing techniques", " general testing frameworks"], "paper_abstract": "In this paper we develop a general framework to reason about testing. The difficulty of testing is assessed in terms of the amount of tests that must be applied to determine whether the system is correct or not. Based on this criterion, five testability classes are presented and related. We also explore conditions that enable and disable finite testability, and their relation to testing hypotheses is studied. We measure how far incomplete test suites are from being complete, which allows us to compare and select better incomplete test suites. The complexity of finding that measure, as well as the complexity of finding minimum complete test suites, is identified. Furthermore, we address the reduction of testing problems to each other, that is, we study how the problem of finding test suites to test systems of some kind can be reduced to the problem of finding test suites for another kind of systems. This enables to export testing methods. In order to illustrate how general notions are applied to specific cases, many typical examples from the formal testing techniques domain are presented.", "paper_title": "A General Testability Theory: Classes, Properties, Complexity, and Testing Reductions", "paper_id": "WOS:000343898600002"}