{"auto_keywords": [{"score": 0.04869496857615713, "phrase": "tangisense"}, {"score": 0.04734772704996388, "phrase": "tangible_objects"}, {"score": 0.04132123127632088, "phrase": "interactive_table"}, {"score": 0.004815006984966773, "phrase": "rfid"}, {"score": 0.004496402246090618, "phrase": "interactive_tables"}, {"score": 0.004323886831151445, "phrase": "research_context"}, {"score": 0.004240116703465252, "phrase": "everyday_life"}, {"score": 0.0036256123915754303, "phrase": "rfid_technology"}, {"score": 0.003130396338031522, "phrase": "natural_use"}, {"score": 0.0026501935378083663, "phrase": "rfid_tags"}, {"score": 0.002573424607574822, "phrase": "context_awareness"}, {"score": 0.0023104373174118458, "phrase": "common_or_individual_space"}, {"score": 0.0022434880661725493, "phrase": "space_division"}], "paper_keywords": ["RFID", " Table", " Situation awareness", " Tangible interactions", " User-driven applications"], "paper_abstract": "Interactive tables are increasingly present not only in a research context but also in everyday life. One challenge still has to be taken up concerning interaction with several people around an interactive table. The framework of our research relates to an interactive table named TangiSense, which is equipped with RFID technology. The interaction is no longer the result of touching the table, but comes from handling tangible objects placed on the table. The use is closer to the natural use of a table. This technology makes it possible to identify the objects, which can be coupled with the users. Starting from this principle, the article proposes the use of RFID tags to collect the elements of context awareness in order to adapt the workspaces to the various possible situations around a table (work alone or with several users, on a common or individual space). An algorithm of space division is proposed, and evaluations are carried out in order to assess its global contribution. The article ends with a conclusion and some prospects.", "paper_title": "RFID-driven situation awareness on TangiSense, a table interacting with tangible objects", "paper_id": "WOS:000314508400011"}