{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "digital_retinal_images"}, {"score": 0.0046079260641779755, "phrase": "private_area"}, {"score": 0.0038818006513785977, "phrase": "emerging_technologies"}, {"score": 0.003714748329627737, "phrase": "biometric_parameters"}, {"score": 0.00355485940716082, "phrase": "biometric-based_authentication"}, {"score": 0.0032410683344688625, "phrase": "novel_authentication_method"}, {"score": 0.0031845067058084583, "phrase": "preliminary_results"}, {"score": 0.0031151864044353245, "phrase": "biometric_parameter"}, {"score": 0.0030206579994328975, "phrase": "retinal_vessel_tree"}, {"score": 0.002967931416941965, "phrase": "retinal_digital_images"}, {"score": 0.0027660443371695024, "phrase": "expert_clinicians"}, {"score": 0.002693919110230191, "phrase": "retinal_vessels"}, {"score": 0.0024236964502593254, "phrase": "verification_process"}, {"score": 0.0023604768913655463, "phrase": "registration_step"}, {"score": 0.0022095328812245852, "phrase": "fast_and_reliable_registration_method"}, {"score": 0.0021049977753042253, "phrase": "whole_authentication_process"}], "paper_keywords": ["personal authentication", " digital retinal images", " registration", " creases"], "paper_abstract": "Traditional authentication (identity verification) systems, used to gain access to a private area in a building or to data stored in a computer, are based on something the user has (an authentication card, a magnetic key) or something the user knows (a password, an identification code). However, emerging technologies allow for more reliable and comfortable user authentication methods, most of them based on biometric parameters. Much work could be found in the literature about biometric-based authentication, using parameters like iris, voice, fingerprints, face characteristics, and others. In this work a novel authentication method is presented and preliminary results are shown. The biometric parameter employed for the authentication is the retinal vessel tree, acquired through retinal digital images, i.e., photographs of the fundus of the eye. It has already been asserted by expert clinicians that the configuration of the retinal vessels is unique for each individual and that it does not vary during his life, so it is a very well-suited identification characteristic. Before the verification process can be executed, a registration step is required to align both the reference image and the picture to be verified. A fast and reliable registration method is used to perform this step, so that the whole authentication process takes about 0.3 s.", "paper_title": "Personal authentication using digital retinal images", "paper_id": "WOS:000237866500002"}