{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "recurrent_neural_networks"}, {"score": 0.0393378573740974, "phrase": "stable_equilibrium_point"}, {"score": 0.02560923745900173, "phrase": "selectable_set"}, {"score": 0.004765788394931875, "phrase": "saturated_piecewise"}, {"score": 0.004367581653370531, "phrase": "interesting_dynamical_properties"}, {"score": 0.0041490029730869345, "phrase": "saturated_piecewise_linear_transfer_function"}, {"score": 0.00368673793612343, "phrase": "external_input"}, {"score": 0.0030171910207671205, "phrase": "new_perspective"}, {"score": 0.002910545717767559, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.002836679611901583, "phrase": "selectable_and_unselectable_sets"}, {"score": 0.0026532596852754525, "phrase": "group_selection"}, {"score": 0.0022047613106966723, "phrase": "selectable_sets"}, {"score": 0.0021049977753042253, "phrase": "external_inputs"}], "paper_keywords": ["Group selection", " recurrent neural networks", " saturated piecewise linear transfer functions", " selectable sets", " unselectable sets"], "paper_abstract": "The concepts of selectable and unselectable sets are proposed to describe some interesting dynamical properties of a class of recurrent neural networks (RNNs) with saturated piecewise linear transfer function. A set of neurons is said to be selectable if it can be co-unsaturated at a stable equilibrium point by some external input. A set of neurons is said to be unselectable if it is not selectable, i.e., such set of neurons can never be co-unsaturated at any stable equilibrium point regardless of what the input is. The importance of such concepts is that they enable a new perspective of the memory in RNNs. Necessary and sufficient conditions for the existence of selectable and unselectable sets of neurons are obtained. As an application, the problem of group selection is discussed by using such concepts. It shows that, under some conditions, each group is a selectable set, and each selectable set is contained in some group. Thus, groups are indicated by selectable sets of the RNNs and can be selected by external inputs. Simulations are carried out to further illustrate the theory.", "paper_title": "Selectable and Unselectable Sets of Neurons in Recurrent Neural Networks with Saturated Piecewise Linear Transfer Function", "paper_id": "WOS:000293442800003"}