{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "economic_analysis"}, {"score": 0.004424268136268051, "phrase": "cellular_users'_ever-increasing_demands"}, {"score": 0.004167653403322565, "phrase": "cellular_operators'_timing"}, {"score": 0.004024863549087511, "phrase": "user_subscription_dynamics"}, {"score": 0.003029643234751066, "phrase": "game_theoretic_model"}, {"score": 0.002984665318717504, "phrase": "operators'_interactions"}, {"score": 0.00286795254228461, "phrase": "different_upgrade_times"}, {"score": 0.0028253682745674608, "phrase": "severe_competition"}, {"score": 0.002634830238219976, "phrase": "larger_market_share"}, {"score": 0.00256993314099902, "phrase": "larger_cost"}, {"score": 0.0025317627242523104, "phrase": "early_upgrade"}, {"score": 0.0022573076362326135, "phrase": "operators'_profits"}, {"score": 0.002223770196464436, "phrase": "increased_competition"}, {"score": 0.0021049977753042253, "phrase": "upgrade_cost"}], "paper_keywords": ["Networks economics", " 4G upgrade timing", " user dynamics", " game theory", " Nash equilibrium"], "paper_abstract": "As the successor to the 3G standard, the 4G cellular standard provides much higher data rates to address cellular users' ever-increasing demands for high-speed multimedia communications. This paper analyzes the cellular operators' timing of network upgrades, by considering user subscription dynamics induced by switching from 3G to 4G technologies. Being the first to upgrade 3G to 4G service, an operator increases its market share but takes more risk or upgrade cost as 4G technology matures over time. This paper first studies a 4G monopoly market with one dominant operator and some small operators, where the monopolist decides its upgrade time by trading off increased market share and upgrade cost. The paper also considers a 4G competitive market and develops a game theoretic model for studying operators' interactions. The analysis shows that operators select different upgrade times to avoid severe competition. One operator takes the lead to upgrade, using the benefit of a larger market share to compensate for the larger cost of an early upgrade. This result matches well with many industry observations of asymmetric 4G upgrades. The paper further shows that the availability of 4G upgrade may decrease both operators' profits due to increased competition. Perhaps surprisingly, the profits can increase with the upgrade cost.", "paper_title": "Economic Analysis of 4G Upgrade Timing", "paper_id": "WOS:000352569700008"}