{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "java_scientific_libraries"}, {"score": 0.049188612914091503, "phrase": "scala_language"}, {"score": 0.048313706083567, "phrase": "scalalab_environment"}, {"score": 0.004551450808315754, "phrase": "java"}, {"score": 0.004328856052035968, "phrase": "academic_and_research_community"}, {"score": 0.00422177384286051, "phrase": "robust_and_effective_scientific_libraries"}, {"score": 0.003771631577951067, "phrase": "average_scientist"}, {"score": 0.0036324746826127997, "phrase": "software_development"}, {"score": 0.002688532127821979, "phrase": "scalalab"}, {"score": 0.0026384167183586015, "phrase": "toolbox_import_mechanism"}, {"score": 0.00241658945942583, "phrase": "on-line_help"}, {"score": 0.0023419588513908783, "phrase": "graphical_control"}, {"score": 0.002255431275670053, "phrase": "specialised_text_editor"}, {"score": 0.0021049977753042253, "phrase": "scientific_software"}], "paper_keywords": [""], "paper_abstract": "Since Java is one of the most popular languages in the academic and research community a lot of robust and effective scientific libraries have been developed. However, the utilisation of these libraries is very awkward especially for the average scientist that does not expertise in software development. The study presents the framework that has constructed for the utilisation of Java scientific libraries within the ScalaLab environment. The flexibility and extensibility of the Scala language allows the implementation of simple, coherent and efficient Matlab-like interfaces to those libraries. Moreover, other specialised Java libraries can be exploited much more easily and productively from within ScalaLab with the toolbox import mechanism that this work describes. Additionally, the system offers facilities such as on-line help, code completion, graphical control of the class-path and a specialised text editor with code colouring facilities that greatly facilitate the development of scientific software.", "paper_title": "Exploiting Java scientific libraries with the Scala language within the ScalaLab environment", "paper_id": "WOS:000298291100005"}