{"auto_keywords": [{"score": 0.03193926993988123, "phrase": "digital_computationalism"}, {"score": 0.00481495049065317, "phrase": "cognitive_science"}, {"score": 0.004585708776142851, "phrase": "five_answers"}, {"score": 0.004394053797771851, "phrase": "classicist_answer"}, {"score": 0.0039854083031404764, "phrase": "sub-symbolic_computation"}, {"score": 0.0038538647865057757, "phrase": "computational_neuroscientist_answer"}, {"score": 0.0034318447871577503, "phrase": "first_four_answers"}, {"score": 0.0033695566513755096, "phrase": "first_approximation"}, {"score": 0.0032483404695661296, "phrase": "last_answer"}, {"score": 0.003046578530654012, "phrase": "symbolic_computation"}, {"score": 0.002482706594054615, "phrase": "connectionist_networks"}, {"score": 0.0024525461181496753, "phrase": "computational_neuroscience"}, {"score": 0.0024153589988125303, "phrase": "neural_computation"}, {"score": 0.0023426638248794643, "phrase": "sui_generis_type"}, {"score": 0.0023071389598419076, "phrase": "extreme_dynamicist"}, {"score": 0.002244543215797895, "phrase": "post-computational_cognitive_science"}], "paper_keywords": ["Computation", " Connectionism", " Dynamicism", " Computationalism", " Classicism", " Computational neuroscience", " Cognitive science", " Mechanistic explanation", " Representation"], "paper_abstract": "Which notion of computation (if any) is essential for explaining cognition? Five answers to this question are discussed in the paper. (1) The classicist answer: symbolic (digital) computation is required for explaining cognition; (2) The broad digital computationalist answer: digital computation broadly construed is required for explaining cognition; (3) The connectionist answer: sub-symbolic computation is required for explaining cognition; (4) The computational neuroscientist answer: neural computation (that, strictly, is neither digital nor analogue) is required for explaining cognition; (5) The extreme dynamicist answer: computation is not required for explaining cognition. The first four answers are only accurate to a first approximation. But the \"devil\" is in the details. The last answer cashes in on the parenthetical \"if any\" in the question above. The classicist argues that cognition is symbolic computation. But digital computationalism need not be equated with classicism. Indeed, computationalism can, in principle, range from digital (and analogue) computationalism through (the weaker thesis of) generic computationalism to (the even weaker thesis of) digital (or analogue) pancomputationalism. Connectionism, which has traditionally been criticised by classicists for being non-computational, can be plausibly construed as being either analogue or digital computationalism (depending on the type of connectionist networks used). Computational neuroscience invokes the notion of neural computation that may (possibly) be interpreted as a sui generis type of computation. The extreme dynamicist argues that the time has come for a post-computational cognitive science. This paper is an attempt to shed some light on this debate by examining various conceptions and misconceptions of (particularly digital) computation.", "paper_title": "The Explanatory Role of Computation in Cognitive Science", "paper_id": "WOS:000310090200004"}