{"auto_keywords": [{"score": 0.040179907029343674, "phrase": "key_concepts"}, {"score": 0.019669164747394583, "phrase": "clonto"}, {"score": 0.00481495049065317, "phrase": "corpus-related_ontologies"}, {"score": 0.004766090327062509, "phrase": "conceptualizing_document_corpora"}, {"score": 0.004669845451682529, "phrase": "greater_volume"}, {"score": 0.0042819270655224916, "phrase": "information_visualization"}, {"score": 0.0037498152007206815, "phrase": "document_corpora"}, {"score": 0.0035997452281985465, "phrase": "conceptual_structures"}, {"score": 0.003250238918180901, "phrase": "document_corpus"}, {"score": 0.0028459677232555176, "phrase": "latent_semantic_analysis"}, {"score": 0.0026494814117217214, "phrase": "wordnet"}, {"score": 0.0025826247025542235, "phrase": "corpus-related_ontology"}, {"score": 0.00235560370536971, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "significant_informative_conceptual_structures"}], "paper_keywords": [""], "paper_abstract": "As a greater volume of information becomes increasingly available across all disciplines, many approaches, such as document clustering and information visualization, have been proposed to help users manage information easily. However, most of these methods do not directly extract key concepts and their semantic relationships from document corpora, which could help better illuminate the conceptual structures within given information. To address this issue, we propose an approach called \"Clonto\" to process a document corpus, identify the key concepts, and automatically generate ontologies based on these concepts for the purpose of conceptualization. For a given document corpus, Clonto applies latent semantic analysis to identify key concepts, allocates documents based on these concepts, and utilizes WordNet to automatically generate a corpus-related ontology. The documents are linked to the ontology through the key concepts. Based on two test collections, the experimental results show that Clonto is able to identify key concepts, and outperforms four other clustering algorithms. Moreover, the ontologies generated by Clonto show significant informative conceptual structures.", "paper_title": "Exploiting Corpus-Related Ontologies for Conceptualizing Document Corpora", "paper_id": "WOS:000271199600009"}