{"auto_keywords": [{"score": 0.04858132305104682, "phrase": "breast_cancer"}, {"score": 0.00481495049065317, "phrase": "computer_support_group"}, {"score": 0.004342430078306461, "phrase": "online_support_groups"}, {"score": 0.0036747384051186937, "phrase": "active_and_inactive_participants"}, {"score": 0.0035881000328587126, "phrase": "active_users"}, {"score": 0.0032355864829403413, "phrase": "active_participants"}, {"score": 0.0030602966787192745, "phrase": "higher_energy_level"}, {"score": 0.0030119758165837625, "phrase": "higher_volumes"}, {"score": 0.002694375425481759, "phrase": "higher_volume"}, {"score": 0.0024101837218440834, "phrase": "higher_perceived_health_competence"}, {"score": 0.0022614266476954467, "phrase": "psychosocial_interventions"}, {"score": 0.0021049977753042253, "phrase": "future_research_objectives"}], "paper_keywords": [""], "paper_abstract": "This study examined what characteristics predict participation in online support groups for women with breast cancer when users are provided free training, computer hardware, and Internet service removing lack of access as a barrier to use. The only significant difference between active and inactive participants was that active users were more likely at pretest to consider themselves active participants in their healthcare. Among active participants, being white and having a higher energy level predicted higher volumes of writing. There were also trends toward the following characteristics predictive of a higher volume of words written, including having a more positive relationship with their doctors, fewer breast cancer concerns, higher perceived health competence, and greater social/family well-being. Implications for improving psychosocial interventions for women with breast cancer are discussed, and future research objectives are suggested.", "paper_title": "An exploratory study of predictors of participation in a computer support group for women with breast cancer", "paper_id": "WOS:000235139600004"}