{"auto_keywords": [{"score": 0.03274188998248394, "phrase": "sdi_assessment"}, {"score": 0.011194328259048104, "phrase": "sdi_coordinators"}, {"score": 0.00481495049065317, "phrase": "spatial_data_infrastructure_assessment"}, {"score": 0.004652845998457721, "phrase": "spatial_data_infrastructures"}, {"score": 0.004382127278148236, "phrase": "sdi_component_coordinators"}, {"score": 0.003692040748097991, "phrase": "new_investment"}, {"score": 0.003537155405923517, "phrase": "projected_performance"}, {"score": 0.0029925402963843282, "phrase": "sdis'_performance"}, {"score": 0.002929056388593134, "phrase": "key_findings"}, {"score": 0.0027940789980683, "phrase": "structured_concept"}, {"score": 0.0026998264237910884, "phrase": "multi-view_framework"}, {"score": 0.0026538960171433985, "phrase": "different_assessment_methodologies"}, {"score": 0.002467228805628948, "phrase": "in-depth_analysis"}, {"score": 0.0024461474613359994, "phrase": "performance_indicators"}, {"score": 0.0023839754995935184, "phrase": "possible_tool"}, {"score": 0.002283839204519042, "phrase": "sdi's_performance"}, {"score": 0.0021322775033565805, "phrase": "intricate_task"}, {"score": 0.002104999969758322, "phrase": "pis"}], "paper_keywords": ["SDI assessment", " Performance Indicators (PIs)", " Framework for PIs"], "paper_abstract": "Funding the reengineering and recapitalisation of Spatial Data Infrastructures (SDIs) will, in part, depend on the ability of SDI component coordinators to comprehend and report on the performance of their initiatives. This is important for both aspects, as for reengineering, the performance of an infrastructure can only be improved if it is measured. For recapitalization, attracting new investment is a function of past, present, and projected performance. Therefore, it is imperative that SDI coordinators develop metrics to evaluate, and report on performance. With this in mind the researchers embark on an initiative to define SDI assessment and recommend tools to assist in measuring SDIs' performance. The paper presents key findings of the research, which includes an overview of a structured concept of SDI assessment. Within this concept a Multi-View Framework for classifying the different assessment methodologies identified according to the purpose of the SDI assessment is delivered. This is followed by an in-depth analysis of Performance Indicators (Pis) as a possible tool to assist in the measuring and reporting of an SDI's performance. The paper then presents and critically analyzes a Framework to guide SDI coordinators in the intricate task of designing Pis for their initiatives. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Performance Indicators a tool to Support Spatial Data Infrastructure assessment", "paper_id": "WOS:000261017400005"}