{"auto_keywords": [{"score": 0.0431953531151574, "phrase": "web_site"}, {"score": 0.03838240989170163, "phrase": "web_pages"}, {"score": 0.02579297215888781, "phrase": "accessibility_models"}, {"score": 0.00481495049065317, "phrase": "web_navigation"}, {"score": 0.004771435352180973, "phrase": "web_sites"}, {"score": 0.00460125407969429, "phrase": "business_competitiveness"}, {"score": 0.004477595431209663, "phrase": "web_technologies"}, {"score": 0.004437115547184535, "phrase": "growing_e-commerce"}, {"score": 0.004070276454809864, "phrase": "efficient_and_effective_manner"}, {"score": 0.0033175095965171674, "phrase": "web_design"}, {"score": 0.003170060683860338, "phrase": "information_retrieval"}, {"score": 0.00297454367746853, "phrase": "web_page_accessibility"}, {"score": 0.0026548344763838213, "phrase": "web_structure"}, {"score": 0.002326669201839705, "phrase": "appropriate_applications"}, {"score": 0.002193013499219711, "phrase": "future_directions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v"}], "paper_keywords": ["accessibility", " internet", " information retrieval", " accessibility-popularity plot"], "paper_abstract": "Web sites have been deployed to create and sustain business competitiveness in a trend of emerging Web technologies and growing e-commerce. One critical success factor of e-commerce is the ability to allow information to be retrieved from a Web site in an efficient and effective manner. Such ability, being determined by both the Web site structure and the Web page organization, can be measured in terms of accessibility and popularity of Web pages. The relationship between accessibility and popularity of web pages is dynamic in nature and can be analyzed to enhance a Web design. Having observed the lack of means to measure information retrieval of a Web site, this paper purports to introduce a guideline to evaluate Web page accessibility based on several structural-based accessibility models where an innovative accessibility -popularity (A-P) analysis is deployed to measure and, thereby, to modify a Web structure. Both push (i.e. demand driven) strategies and pull (i.e. design driven) strategies are incorporated into such guideline. Further, accessibility models are analyzed and compared in order to identify appropriate applications for each model. The paper is concluded by a summary of future directions of the accessibility models. (c) 2006 Elsevier B.V All rights reserved.", "paper_title": "The design and evaluation of accessibility on web navigation", "paper_id": "WOS:000243866300018"}