{"auto_keywords": [{"score": 0.02741076756931841, "phrase": "vertical_bar"}, {"score": 0.0047113960612140335, "phrase": "multidimensional_models"}, {"score": 0.0045108906244892165, "phrase": "powerful_discretization_technique"}, {"score": 0.004256703909255889, "phrase": "highly_multidimensional_models"}, {"score": 0.004016782710006123, "phrase": "separated_representation"}, {"score": 0.0037903327482565097, "phrase": "solution_complexity"}, {"score": 0.0033748847621075536, "phrase": "instead_the_exponentially-growing_complexity_characteristic"}, {"score": 0.0031845069426845235, "phrase": "pgd"}, {"score": 0.0030933709720820605, "phrase": "efficient_solution"}, {"score": 0.0029830992938695033, "phrase": "multidimensional_spaces"}, {"score": 0.002655894070657161, "phrase": "financial_mathematics"}, {"score": 0.002416589459425828, "phrase": "standard_space"}, {"score": 0.002263639474937039, "phrase": "new_extra-coordinates"}, {"score": 0.0021049977753042253, "phrase": "numerous_possibilities"}], "paper_keywords": [""], "paper_abstract": "This paper revisits a powerful discretization technique, the Proper Generalized Decomposition-PGD, illustrating its ability for solving highly multidimensional models. This technique operates by constructing a separated representation of the solution, such that the solution complexity scales linearly with the dimension of the space in which the model is defined, instead the exponentially-growing complexity characteristic of mesh based discretization strategies. The PGD makes possible the efficient solution of models defined in multidimensional spaces, as the ones encountered in quantum chemistry, kinetic theory description of complex fluids, genetics (chemical master equation), financial mathematics, aEuro broken vertical bar but also those, classically defined in the standard space and time, to which we can add new extra-coordinates (parametric models, aEuro broken vertical bar) opening numerous possibilities (optimization, inverse identification, real time simulations, aEuro broken vertical bar).", "paper_title": "Recent Advances and New Challenges in the Use of the Proper Generalized Decomposition for Solving Multidimensional Models", "paper_id": "WOS:000284330200001"}