{"auto_keywords": [{"score": 0.03853122912686658, "phrase": "used_products"}, {"score": 0.03345629096680963, "phrase": "returned_products"}, {"score": 0.00481495049065317, "phrase": "reverse_logistics"}, {"score": 0.00474348728309194, "phrase": "new_and_old_product_modules"}, {"score": 0.004501578643090429, "phrase": "significant_importance"}, {"score": 0.004130535674260502, "phrase": "life_products"}, {"score": 0.0038327445210488355, "phrase": "better_design"}, {"score": 0.003775803846431323, "phrase": "maximum_reuse"}, {"score": 0.0034643747383816164, "phrase": "maximum_value"}, {"score": 0.003324614337607016, "phrase": "network_points"}, {"score": 0.0030847461428168614, "phrase": "remanufactured_products"}, {"score": 0.0028944757265206332, "phrase": "used_product"}, {"score": 0.002788066194685293, "phrase": "complex_network"}, {"score": 0.002675516297446243, "phrase": "rl_network"}, {"score": 0.002463830258460528, "phrase": "reprocessing_centres"}, {"score": 0.0024090550572099688, "phrase": "dismantled_parts"}, {"score": 0.002337906603857861, "phrase": "secondary_market"}, {"score": 0.002320449502337321, "phrase": "spare_parts"}, {"score": 0.0021049977753042253, "phrase": "numerical_example"}], "paper_keywords": ["Reverse logistics", " Network design", " Product modularity", " Cost", " Remanufacturing"], "paper_abstract": "Establishment of reverse logistics (RL) networks for various original equipment manufacturers (OEM's) is gaining significant importance. Various green legislations are forcing OEMs; to take back their used, end-of-lease or end-of-life products, or products under warranty to minimize wastes and conserve resources. Therefore OEMs; have turned to a better design of their products for maximum reuse and recycling and to retrieve back the used products through a network for reuse, remanufacture, recycle or disposal, so that maximum value can be achieved from their used products. However, designing of network points and assigning capacities to them depend not only on the volume of returned products but also on the demand for remanufactured products and the parts of used products. If OEMs are not able to add value to the used product, there would be no incentive to design a complex network. In this paper, a mathematical model for the design of a RL network is proposed. It is assumed that the returned products need to be consolidated in the warehouse before they are sent to reprocessing centres for inspection and dismantling. Dismantled parts are sent for remanufacturing or to the secondary market as spare parts. Recycling and disposal of these modules are also considered in the model. The use of the model is shown through its application in a numerical example. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Strategic network design for reverse logistics and remanufacturing using new and old product modules", "paper_id": "WOS:000262599000041"}