{"auto_keywords": [{"score": 0.03687705932093384, "phrase": "interaction_involvement"}, {"score": 0.011012774460053327, "phrase": "users'_intention"}, {"score": 0.00481495049065317, "phrase": "users'_knowledge_sharing_intention._effective_knowledge_sharing"}, {"score": 0.00414830454375092, "phrase": "members'_willingness"}, {"score": 0.0038242899532391914, "phrase": "user_intention"}, {"score": 0.0036224139706218916, "phrase": "information_system_analysis"}, {"score": 0.0035494788628319903, "phrase": "innovative_organizational_climate"}, {"score": 0.0027616550517346066, "phrase": "systems_analysts"}, {"score": 0.002724428781940696, "phrase": "higher_levels"}, {"score": 0.0023625233416109917, "phrase": "innovative_climate"}, {"score": 0.0021776870246727233, "phrase": "users'_interaction_involvement"}], "paper_keywords": ["Interaction involvement", " innovative climate", " intention to share knowledge"], "paper_abstract": "Effective knowledge sharing among members has become a competitive necessity for organizations. Thus it is essential for organizations to take steps to increase members' willingness to share knowledge. This study explores factors that may affect user intention to share knowledge in the context of information system analysis. An innovative organizational climate and interaction involvement are identified as antecedents of users' intention to share knowledge. Their effects and the relationships among these factors are studied. The results, based on data collected from 182 student analysts and 182 users, indicate that systems analysts demonstrate higher levels of interaction involvement than users, where interaction involvement is measured by responsiveness, perceptiveness and attentiveness. In addition, an innovative climate positively and directly influences users' intention to share knowledge; unexpectedly, users' interaction involvement is negatively related to their intention to share knowledge.", "paper_title": "INVESTIGATING THE ANTECEDENTS OF USERS' KNOWLEDGE SHARING INTENTION", "paper_id": "WOS:000208869000010"}