{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "arbitrary_deadline_real-time_systems"}, {"score": 0.004604023526673226, "phrase": "real-time_system"}, {"score": 0.004251500979153001, "phrase": "hard_real-time_system"}, {"score": 0.003448863509392547, "phrase": "engineering_context"}, {"score": 0.003380791705551809, "phrase": "minimum_speed"}, {"score": 0.0032486392192981944, "phrase": "schedulable_system"}, {"score": 0.003075296862372287, "phrase": "edf-scheduled_systems"}, {"score": 0.00286795254228461, "phrase": "task_periods"}, {"score": 0.0028253682745674608, "phrase": "relative_deadlines"}, {"score": 0.002544422946205545, "phrase": "efficient_and_exact_sensitivity_analysis"}, {"score": 0.002408565679880478, "phrase": "sensitivity_analysis"}, {"score": 0.0022573076362326135, "phrase": "parameter_computations"}, {"score": 0.0021907318950048897, "phrase": "qpa"}, {"score": 0.0021049977753042253, "phrase": "system_design_support_tool"}], "paper_keywords": ["Sensitivity analysis", " EDF: earliest deadline first", " Scheduling"], "paper_abstract": "The correctness of a real-time system depends on not only the system's output but also on the time at which results are produced. A hard real-time system is required to complete its operations before all its timing deadlines. For a given task set it is useful to know what changes can be made to a task that will result in a system that is borderline schedulable. It is also beneficial in an engineering context to know the minimum speed of a processor that will deliver a schedulable system. We address the following sensitivity analysis (parameter computations) for EDF-scheduled systems on a uniprocessor: task execution times, speed of the processor, task periods and task relative deadlines. We prove that an optimal (minimum or maximum) system parameter can be determined by a single run of the Quick convergence Processor demand Analysis (QPA) algorithm. This algorithm provides efficient and exact sensitivity analysis for arbitrary deadline real-time systems. We also improve the implementation of this sensitivity analysis by using various starting values for the algorithms. The approaches developed for task parameter computations are therefore as efficient as QPA, and are easily incorporated into a system design support tool.", "paper_title": "Sensitivity analysis of arbitrary deadline real-time systems with EDF scheduling", "paper_id": "WOS:000289573900003"}