{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ask_demodulators"}, {"score": 0.02085910833928377, "phrase": "passive_wireless_microsystems"}, {"score": 0.0052372391261885165, "phrase": "design_constraints"}, {"score": 0.004272456401437226, "phrase": "low_power_consumption"}, {"score": 0.004184526032558792, "phrase": "large_number"}, {"score": 0.004034962424068988, "phrase": "in-depth_examination"}, {"score": 0.003542976343910816, "phrase": "design_techniques"}, {"score": 0.003015143226706584, "phrase": "information_carriers"}, {"score": 0.0026061419474030633, "phrase": "ask_modulators"}, {"score": 0.002435542816459651, "phrase": "current-mode_and_mixed-mode_ask_demodulators"}, {"score": 0.0021605514226546497, "phrase": "date_rates"}, {"score": 0.0021381565332182773, "phrase": "carrier_frequencies"}, {"score": 0.0021049977753042253, "phrase": "modulation_index"}], "paper_keywords": ["CMOS circuits", " Passive wireless microsystems", " ASK demodulators"], "paper_abstract": "ASK demodulators are widely used in passive wireless microsystems due to their simple design and low power consumption. Although a large number of ASK demodulators emerged recently, an in-depth examination of the pros and cons and design constraints of these ASK demodulators is not available. This paper presents a comprehensive in-depth review of the design techniques for ASK demodulators of passive wireless microsystems. The classification of ASK demodulators of passive wireless microsystems is introduced. We show that ASK demodulators of passive wireless microsystems can be classified into three categories on the basis of the information carriers: voltage-mode, current-mode, and mixed-mode. The design constraints of these ASK demodulators differ fundamentally. Challenges encountered in design of ASK modulators for passive wireless microsystems are examined in detail. The configurations of voltage-mode, current-mode and mixed-mode ASK demodulators for passive wireless microsystems emerged recently are studied and their circuit implementations are examined in detail. The performance of these ASK demodulators such as date rates, carrier frequencies, and modulation index is compared.", "paper_title": "Design techniques for ASK demodulators of passive wireless microsystems: a state-of-the-art review", "paper_id": "WOS:000275398000004"}