{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "markov_equivalence_classes"}, {"score": 0.02541893724447666, "phrase": "markov_equivalence_class"}, {"score": 0.005349847150249427, "phrase": "five_functions"}, {"score": 0.004959483466446176, "phrase": "rooted_subclasses"}, {"score": 0.004778594263962987, "phrase": "directed_acyclic_graphs"}, {"score": 0.004688894532233354, "phrase": "directed_acyclic_graph"}, {"score": 0.004583464412234181, "phrase": "observational_data"}, {"score": 0.00444655284354007, "phrase": "underlying_dag"}, {"score": 0.004059772950454586, "phrase": "causal_effects"}, {"score": 0.003983512316698646, "phrase": "exact_causal_dag"}, {"score": 0.003748937184382714, "phrase": "key_consideration"}, {"score": 0.0037065115435101887, "phrase": "learning_methods"}, {"score": 0.0035820833812158005, "phrase": "equivalence_class"}, {"score": 0.003448705829033573, "phrase": "existing_literature_reports"}, {"score": 0.003371066990851953, "phrase": "equivalence_classes"}, {"score": 0.0033455764382772754, "phrase": "ten_or_fewer_vertices"}, {"score": 0.0030542703032534766, "phrase": "five_types"}, {"score": 0.002820202660128789, "phrase": "new_concept"}, {"score": 0.002788257824525862, "phrase": "rooted_sub-class"}, {"score": 0.0027566738323014, "phrase": "graph_representations"}, {"score": 0.002488001663771768, "phrase": "proposed_size_counting"}, {"score": 0.0024319378563138223, "phrase": "sparse_dags"}], "paper_keywords": ["directed acyclic graphs", " Markov equivalence class", " size distribution", " causality"], "paper_abstract": "When learning a directed acyclic graph (DAG) model via observational data, one generally cannot identify the underlying DAG, but can potentially obtain a Markov equivalence class. The size (the number of DAGs) of a Markov equivalence class is crucial to infer causal effects or to learn the exact causal DAG via further interventions. Given a set of Markov equivalence classes, the distribution of their sizes is a key consideration in developing learning methods. However, counting the size of an equivalence class with many vertices is usually computationally infeasible, and the existing literature reports the size distributions only for equivalence classes with ten or fewer vertices. In this paper, we develop a method to compute the size of a Markov equivalence class. We first show that there are five types of Markov equivalence classes whose sizes can be formulated as five functions of the number of vertices respectively. Then we introduce a new concept of a rooted sub-class. The graph representations of rooted subclasses of a Markov equivalence class are used to partition this class recursively until the sizes of all rooted subclasses can be computed via the five functions. The proposed size counting is efficient for Markov equivalence classes of sparse DAGs with hundreds of vertices. Finally, we explore the size and edge distributions of Markov equivalence classes and find experimentally that, in general, (1) most Markov equivalence classes are half completed and their average sizes are small, and (2) the sizes of sparse classes grow approximately exponentially with the numbers of vertices.", "paper_title": "Counting and Exploring Sizes of Markov Equivalence Classes of Directed Acyclic Graphs", "paper_id": "WOS:000369888000008"}