{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "database_schema_evolution"}, {"score": 0.037496423981350724, "phrase": "application_code"}, {"score": 0.031000150915042827, "phrase": "proposed_approach"}, {"score": 0.010184185300330465, "phrase": "database_schema"}, {"score": 0.008555759937304475, "phrase": "select_statements"}, {"score": 0.0047314049780079765, "phrase": "constant_changes"}, {"score": 0.004616859702338596, "phrase": "continuous_database_revisions"}, {"score": 0.004552648949390462, "phrase": "database_structures"}, {"score": 0.004489327204473076, "phrase": "software_applications"}, {"score": 0.004274527415193801, "phrase": "longer_life_span"}, {"score": 0.004156411748278609, "phrase": "application_programs"}, {"score": 0.0040133278382101885, "phrase": "testing_strategies"}, {"score": 0.003702581068329137, "phrase": "schema_evolution"}, {"score": 0.0036002125374696237, "phrase": "novel_unit_test_approach"}, {"score": 0.0033919477901198716, "phrase": "altered_database"}, {"score": 0.003240826566478551, "phrase": "testing_framework"}, {"score": 0.0031845067058084613, "phrase": "sample_application"}, {"score": 0.003151184191185831, "phrase": "relatively_simple_database_schema"}, {"score": 0.0025087506382067536, "phrase": "database_warehouse_applications"}, {"score": 0.0024307637980373552, "phrase": "unit_test_approach"}, {"score": 0.002306123367679187, "phrase": "evolved_database"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Database schema evolution", " Database testing", " Unit testing", " Mock objects"], "paper_abstract": "Context: The constant changes in today's business requirements demand continuous database revisions. Hence, database structures, not unlike software applications, deteriorate during their lifespan and thus require refactoring in order to achieve a longer life span. Although unit tests support changes to application programs and refactoring, there is currently a lack of testing strategies for database schema evolution. Objective: This work examines the challenges for database schema evolution and explores the possibility of using various testing strategies to assist with schema evolution. Specifically, the work proposes a novel unit test approach for the application code that accesses databases with the objective of proactively evaluating the code against the altered database. Method: The approach was validated through the implementation of a testing framework in conjunction with a sample application and a relatively simple database schema. Although the database schema in this study was simple, it was nevertheless able to demonstrate the advantages of the proposed approach. Results: After changes in the database schema, the proposed approach found all SELECT statements as well as the majority of other statements requiring modifications in the application code. Due to its efficiency with SELECT statements, the proposed approach is expected to be more successful with database warehouse applications where SELECT statements are dominant. Conclusion: The unit test approach that accesses databases has proven to be successful in evaluating the application code against the evolved database. In particular, the approach is simple and straightforward to implement, which makes it easily adoptable in practice. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A unit test approach for database schema evolution", "paper_id": "WOS:000285812700004"}