{"auto_keywords": [{"score": 0.044552909500734754, "phrase": "brp"}, {"score": 0.004628400269774981, "phrase": "block_retrieval_sequence"}, {"score": 0.004513450434595191, "phrase": "relocation_pattern"}, {"score": 0.00446506039438222, "phrase": "total_number"}, {"score": 0.00397996666534913, "phrase": "container_terminal"}, {"score": 0.0038256426589560774, "phrase": "large_number"}, {"score": 0.0037038224217016817, "phrase": "optimal_solutions"}, {"score": 0.0034343965063429447, "phrase": "higher_quality"}, {"score": 0.003161674440750158, "phrase": "fast_heuristic_methods"}, {"score": 0.0030941521409613417, "phrase": "greedy_heuristic_approaches"}, {"score": 0.0028586409810976367, "phrase": "current_state"}, {"score": 0.002747676657869163, "phrase": "new_heuristic_approach"}, {"score": 0.0024399036842105205, "phrase": "min-max_heuristic"}, {"score": 0.0024136908511423875, "phrase": "brp."}, {"score": 0.0023791769068748194, "phrase": "new_heuristic"}, {"score": 0.0022058958906038466, "phrase": "wide_range"}, {"score": 0.002174346780014853, "phrase": "container_bays"}, {"score": 0.0021509807762081145, "phrase": "standard_test_data_sets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Blocks relocation", " Logistics", " Heuristics"], "paper_abstract": "In the Blocks Relocation Problem (BRP) one is given a block retrieval sequence and is concerned with determining a relocation pattern minimizing the total number of moves required to enforce the given retrieval sequence. The importance of the BRP has been constantly growing in recent years, as a consequence of its close connection with the operations inside of a container terminal. Due to the complexity of the BRP, a large number of methods has been developed for finding near optimal solutions. These methods can be divided in two main categories greedy heuristics and more complex methods. The latter achieve results of higher quality, but at the cost of very long execution times. In many cases, this increased calculation time is not an option, and the fast heuristic methods need to be used. Greedy heuristic approaches, in general, apply the heuristic based only on the properties of the block that is being relocated and the current state of the bay. In this paper we propose a new heuristic approach in which when deciding where to relocate a block we also take into account the properties of the block that will be moved next. This idea is illustrated by improving the Min-Max heuristic for the BRP. We compare the new heuristic to several existing methods of this type, and show the effectiveness of our improvements. The tests have been conducted on a wide range of sizes of container bays, using standard test data sets. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A chain heuristic for the Blocks Relocation Problem", "paper_id": "WOS:000341558800008"}