{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "soft_shadows"}, {"score": 0.004621279527317074, "phrase": "user's_edits"}, {"score": 0.003611751858608048, "phrase": "mapping_function"}, {"score": 0.003574830654211291, "phrase": "image_patches"}, {"score": 0.0035201528214608914, "phrase": "shadow_mattes"}, {"score": 0.0028076592725295646, "phrase": "resulting_lit_image"}, {"score": 0.0027223626424366207, "phrase": "believable_shadow-free_version"}, {"score": 0.0025726416100664853, "phrase": "large_set"}, {"score": 0.002546315584783112, "phrase": "soft_shadow_images"}, {"score": 0.00248167018931442, "phrase": "user_study"}, {"score": 0.002309242063033298, "phrase": "real_lit_scenes"}, {"score": 0.0021049977753042253, "phrase": "prior_work"}], "paper_keywords": ["Algorithms", " Experimentation", " Shadow matting", " shadow editing"], "paper_abstract": "Manipulated images lose believability if the user's edits fail to account for shadows. We propose a method that makes removal and editing of soft shadows easy. Soft shadows are ubiquitous, but remain notoriously difficult to extract and manipulate. We posit that soft shadows can be segmented, and therefore edited, by learning a mapping function for image patches that generates shadow mattes. We validate this premise by removing soft shadows from photographs with only a small amount of user input. Given only broad user brush strokes that indicate the region to be processed, our new supervised regression algorithm automatically unshadows an image, removing the umbra and penumbra. The resulting lit image is frequently perceived as a believable shadow-free version of the scene. We tested the approach on a large set of soft shadow images, and performed a user study that compared our method to the state-of-the-art and to real lit scenes. Our results are more difficult to identify as being altered and are perceived as preferable compared to prior work.", "paper_title": "Learning to Remove Soft Shadows", "paper_id": "WOS:000364851400001"}