{"auto_keywords": [{"score": 0.04367732323962223, "phrase": "botflex"}, {"score": 0.0059450766245194115, "phrase": "fpr"}, {"score": 0.00481495049065317, "phrase": "botnet_detection"}, {"score": 0.004506048850130758, "phrase": "networked_systems"}, {"score": 0.003926105480202798, "phrase": "first_open-source_network-based_tool"}, {"score": 0.0036740168936985314, "phrase": "detection_parameters"}, {"score": 0.003636692152882991, "phrase": "decision_elements"}, {"score": 0.0030726480920918097, "phrase": "community_inputs"}, {"score": 0.002831462722290752, "phrase": "ground_truth"}, {"score": 0.0027741761880779535, "phrase": "commercial_security_company"}, {"score": 0.002718047546206485, "phrase": "tpr"}, {"score": 0.0022961534630650347, "phrase": "negligible_detection_delay"}, {"score": 0.002249672943553135, "phrase": "good_throughput"}, {"score": 0.0021705796895687864, "phrase": "low_processing_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Botnet", " Network security", " Correlation"], "paper_abstract": "Botnets currently pose the most potent threat to the security and integrity of networked systems. In this paper, we present our experiences of designing, implementing and evaluating BotFlex, which (to the best of our knowledge) is the first open-source network-based tool for botnet detection. BotFlex is designed to support extensibility (in detection parameters and decision elements), flexibility (in configuration), an easy-to-use interface, and real-time operation. While the tool is designed for extension and improvement by community inputs, we report very encouraging accuracy and performance results of our first-cut BotFlex implementation. On a 500 GB trace captured at an ISP with ground truth provided by a commercial security company, BotFlex provides TPR and FPR of 94.4% and 6.6%, respectively - comparable with our baseline state-of-the-art BotHunter tool (TPR: 79.6%, FPR: 6.6%). In addition to accuracy, we observe that BotFlex incurs negligible detection delay, while having good throughput (47 K packets/second) and low processing overhead. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "BotFlex: A community-driven tool for botnet detection", "paper_id": "WOS:000370459800011"}