{"auto_keywords": [{"score": 0.04327832021381773, "phrase": "consensus_trees"}, {"score": 0.00481495049065317, "phrase": "evolutionary_tree"}, {"score": 0.004282391936827106, "phrase": "common_ancestor"}, {"score": 0.0040622852274783275, "phrase": "popular_approach"}, {"score": 0.003968112038249246, "phrase": "shared_evolutionary_relationships"}, {"score": 0.003742084495435749, "phrase": "consensus_techniques"}, {"score": 0.003633927813203731, "phrase": "pantherine_lineage"}, {"score": 0.0028069426877159642, "phrase": "underlying_computational_techniques"}, {"score": 0.00270978310478061, "phrase": "pantherine_cats"}, {"score": 0.002570296816631395, "phrase": "computational_techniques"}, {"score": 0.0024667783849055634, "phrase": "hashing_functions"}, {"score": 0.0024236964502593254, "phrase": "traversing_trees"}, {"score": 0.0022192891418394514, "phrase": "computational_hood"}, {"score": 0.002193367454830741, "phrase": "consensus_tree_construction"}], "paper_keywords": ["algorithms", " phylogenetic trees", " hashing", " computational thinking"], "paper_abstract": "Phylogenetics seeks to deduce the pattern of relatedness between organisms by using a phylogeny or evolutionary tree. For a given set of organisms or taxa, there may be many evolutionary trees depicting how these organisms evolved from a common ancestor. As a result, consensus trees are a popular approach for summarizing the shared evolutionary relationships in a group of trees. We examine these consensus techniques by studying how the pantherine lineage of cats (clouded leopard, jaguar, leopard, lion, snow leopard, and tiger) evolved, which is hotly debated. While there are many phylogenetic resources that describe consensus trees, there is very little information, written for biologists, regarding the underlying computational techniques for building them. The pantherine cats provide us with a small, relevant example to explore the computational techniques (such as sorting numbers, hashing functions, and traversing trees) for constructing consensus trees. Our hope is that life scientists enjoy peeking under the computational hood of consensus tree construction and share their positive experiences with others in their community.", "paper_title": "Big Cat Phylogenies, Consensus Trees, and Computational Thinking", "paper_id": "WOS:000292193400004"}