{"auto_keywords": [{"score": 0.04970552630194221, "phrase": "electronic_health_records"}, {"score": 0.03996969234404359, "phrase": "signal_detection"}, {"score": 0.030409745434677882, "phrase": "aers"}, {"score": 0.00481495049065317, "phrase": "spontaneous_reports"}, {"score": 0.004703149944841539, "phrase": "adverse_drug_reactions"}, {"score": 0.004666460260366703, "phrase": "objective_data-mining_algorithms"}, {"score": 0.00459393336391459, "phrase": "accurate_signals"}, {"score": 0.004558091785667046, "phrase": "potentially_novel_adverse_drug_reactions"}, {"score": 0.004452228677941085, "phrase": "central_component"}, {"score": 0.004331811712726697, "phrase": "signal-detection_strategy"}, {"score": 0.004264463695140275, "phrase": "adverse_event"}, {"score": 0.0038363485899400285, "phrase": "improved_accuracy"}, {"score": 0.003688892770976908, "phrase": "highly_selective_ranked_set"}, {"score": 0.003424107910734022, "phrase": "well-established_methodologies"}, {"score": 0.00310435218261112, "phrase": "established_and_plausible_adrs"}, {"score": 0.0030084563186769764, "phrase": "proposed_approach"}, {"score": 0.002926973459215349, "phrase": "combined_signaling_system"}, {"score": 0.002892729377519916, "phrase": "statistically_significant_large_improvement"}, {"score": 0.002727409429089543, "phrase": "average_improvement"}, {"score": 0.0026431267487109543, "phrase": "different_evaluation_categories"}, {"score": 0.002551409948440577, "phrase": "new_association"}, {"score": 0.0023680783509308525, "phrase": "clinical_review"}, {"score": 0.002312960805824996, "phrase": "promising_initial_evidence"}, {"score": 0.0021049977753042253, "phrase": "additional_ehr_data"}], "paper_keywords": [""], "paper_abstract": "Objective Data-mining algorithms that can produce accurate signals of potentially novel adverse drug reactions (ADRs) are a central component of pharmacovigilance. We propose a signal-detection strategy that combines the adverse event reporting system (AERS) of the Food and Drug Administration and electronic health records (EHRs) by requiring signaling in both sources. We claim that this approach leads to improved accuracy of signal detection when the goal is to produce a highly selective ranked set of candidate ADRs. Materials and methods Our investigation was based on over 4 million AERS reports and information extracted from 1.2 million EHR narratives. Well-established methodologies were used to generate signals from each source. The study focused on ADRs related to three high-profile serious adverse reactions. A reference standard of over 600 established and plausible ADRs was created and used to evaluate the proposed approach against a comparator. Results The combined signaling system achieved a statistically significant large improvement over AERS (baseline) in the precision of top ranked signals. The average improvement ranged from 31% to almost threefold for different evaluation categories. Using this system, we identified a new association between the agent, rasburicase, and the adverse event, acute pancreatitis, which was supported by clinical review. Conclusions The results provide promising initial evidence that combining AERS with EHRs via the framework of replicated signaling can improve the accuracy of signal detection for certain operating scenarios. The use of additional EHR data is required to further evaluate the capacity and limits of this system and to extend the generalizability of these results.", "paper_title": "Combing signals from spontaneous reports and electronic health records for detection of adverse drug reactions", "paper_id": "WOS:000317477500003"}