{"auto_keywords": [{"score": 0.04841586458101805, "phrase": "electronic_resources"}, {"score": 0.014981767887395641, "phrase": "ellis's_model"}, {"score": 0.00481495049065317, "phrase": "information_behaviors"}, {"score": 0.004506171772318298, "phrase": "information_behavior"}, {"score": 0.004217110862974562, "phrase": "sole_purpose"}, {"score": 0.0037260386566859197, "phrase": "new_tools"}, {"score": 0.003628460216207393, "phrase": "existing_tools"}, {"score": 0.00342568771304873, "phrase": "david_ellis"}, {"score": 0.003163439005885435, "phrase": "electronic_tools"}, {"score": 0.0030399457523108825, "phrase": "ellis"}, {"score": 0.0027094427948305515, "phrase": "ib_evaluation_methods"}, {"score": 0.0025465957200502404, "phrase": "empirically_observed_ibs"}, {"score": 0.0024579623598183355, "phrase": "user-centered_evaluations"}, {"score": 0.002289821830549781, "phrase": "ib_methods"}, {"score": 0.0021049977753042253, "phrase": "specific_features"}], "paper_keywords": [""], "paper_abstract": "Information behavior (IB) research involves examining how people look for and use information, often with the sole purpose of gaining insights into the behavior displayed. However, it is also possible to examine IB with the purpose of using the insights gained to design new tools or improve the design of existing tools to support information seeking and use. This approach is advocated by David Ellis who, over two decades ago, presented a model of information seeking behaviors and made suggestions for how electronic tools might be designed to support these behaviors. Ellis also recognized that IBs might be used as the basis for evaluating as well as designing electronic resources. In this article, we present the IB evaluation methods. These two novel methods, based on an extension of Ellis's model, use the empirically observed IBs of lawyers as a framework for structuring user-centered evaluations of the functionality and usability of electronic resources. In this article, we present the IB methods and illustrate their use through the discussion of two examples. We also discuss benefits and limitations, grounded in specific features of the methods.", "paper_title": "Using Information Behaviors to Evaluate the Functionality and Usability of Electronic Resources: From Ellis's Model to Evaluation", "paper_id": "WOS:000261392000006"}