{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "emerging_leading_papers"}, {"score": 0.029150941158756896, "phrase": "leading_papers"}, {"score": 0.004760765880314089, "phrase": "time_transition"}, {"score": 0.004654210559456924, "phrase": "worldwide_competitions"}, {"score": 0.00447341965028879, "phrase": "current_rapid_increase"}, {"score": 0.004156012879026324, "phrase": "promising_research_fields"}, {"score": 0.003927203683176278, "phrase": "available_data"}, {"score": 0.0035065523764817143, "phrase": "bibliometric_approach"}, {"score": 0.003239114833599948, "phrase": "time_transition_analysis"}, {"score": 0.0031845067058084583, "phrase": "citation_networks"}, {"score": 0.0024673738215365104, "phrase": "in-degree_centrality"}, {"score": 0.002305014991156598, "phrase": "leading_paper"}, {"score": 0.002141134176057931, "phrase": "worthy_research_topic"}], "paper_keywords": ["Emerging technologies", " Citation network", " Network centrality", " Time-series analysis"], "paper_abstract": "To survive worldwide competitions of research and development in the current rapid increase of information, decision-makers and researchers need to be supported to find promising research fields and papers. But finding those fields from an available data in too much heavy flood of information becomes difficult. We aim to develop a methodology supporting to find emerging leading papers with a bibliometric approach. The analyses in this work are about four academic domains using our time transition analysis. In the time transition analysis, after citation networks are constructed, centralities of each paper are calculated and their changes are tracked. Then, the centralities are plotted, and the features of the leading papers are extracted. Based on the features, we proposed ways to detect the leading papers by focusing on in-degree centrality and its transition. This work will contribute to finding the leading paper, and it is useful for decision-makers and researchers to decide the worthy research topic to invest their resources.", "paper_title": "Detection method of emerging leading papers using time transition", "paper_id": "WOS:000343609900037"}