{"auto_keywords": [{"score": 0.037639223013725194, "phrase": "implicit_knowledge"}, {"score": 0.00840483171887565, "phrase": "proof_assistants"}, {"score": 0.0058126883874388986, "phrase": "implicit_background_knowledge"}, {"score": 0.00481495049065317, "phrase": "implicit_assumptions"}, {"score": 0.004780183091824403, "phrase": "mizar_proofs"}, {"score": 0.004745665541429529, "phrase": "property_omission"}, {"score": 0.004576736013757452, "phrase": "mml"}, {"score": 0.004543708337879809, "phrase": "background_knowledge"}, {"score": 0.0045108906244892165, "phrase": "mathematical_concepts"}, {"score": 0.004165105357908494, "phrase": "prover_sessions"}, {"score": 0.002814759530655965, "phrase": "particular_proof"}, {"score": 0.0024968877430444304, "phrase": "formal_mathematical_proofs"}, {"score": 0.002469830206270585, "phrase": "particular_class"}, {"score": 0.002120349374832685, "phrase": "unneeded_ones"}, {"score": 0.0021049977753042253, "phrase": "special_attention"}], "paper_keywords": ["Interactive theorem proving", " Proof dependencies", " Proof analysis", " Large formal libraries", " Formal proofs", " Mizar", " Proof assistants", " Implicit assumptions"], "paper_abstract": "When formalizing proofs with proof assistants, it often happens that background knowledge about mathematical concepts is employed without the formalizer explicitly requesting it. Such mechanisms are warranted in the context of discovery because they can make prover sessions more efficient (less time searching the library) and can compress proofs (the more knowledge that is implicitly available, the less needs to be explicitly said by the formalizer). In the context of justification, though, implicit knowledge may need to be made explicit. To study implicit knowledge in proof assistants, one must first characterize what implicit knowledge should be made explicit. Then, once a class of implicit background knowledge is identified, one needs to determine how to extract it from proofs. When a class of implicit knowledge is made explicit, we may then inquire to what extent the implicit knowledge is needed for any particular proof; it often happens that proofs can be successful even if some of the implicit knowledge is omitted. In this note we describe an experiment conducted on the Mizar Mathematical Library (MML) of formal mathematical proofs concerning a particular class of implicit background knowledge, namely, properties of functions and relations (e.g., commutativity, asymmetry, etc.). In our experiment we separate, for each theorem of the MML, the needed function and relation properties from the unneeded ones. Special attention is paid to those function and relation properties that are significant in discussions of foundations of mathematics.", "paper_title": "Eliciting Implicit Assumptions of Mizar Proofs by Property Omission", "paper_id": "WOS:000313368400002"}