{"auto_keywords": [{"score": 0.04943159058562835, "phrase": "similarity_space"}, {"score": 0.015719716506582538, "phrase": "authorship_attribution"}, {"score": 0.013191802238045251, "phrase": "supervised_learning"}, {"score": 0.011786906697837812, "phrase": "training_data"}, {"score": 0.00460125407969429, "phrase": "authorship_classification"}, {"score": 0.0041637779492720295, "phrase": "common_approach"}, {"score": 0.003767738552860633, "phrase": "large_set"}, {"score": 0.003378385493203297, "phrase": "online_review_domain"}, {"score": 0.0030291453183733897, "phrase": "learned_classifier"}, {"score": 0.0027407299369891502, "phrase": "novel_solution"}, {"score": 0.0026427848602443267, "phrase": "core_idea"}, {"score": 0.002548331088496964, "phrase": "original_document_space"}, {"score": 0.0022537212268979507, "phrase": "online_reviews"}, {"score": 0.002193013499219711, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "unsupervised_baseline_methods"}], "paper_keywords": ["authorship attribution", " supervised learning", " similarity space"], "paper_abstract": "Authorship attribution, also known as authorship classification, is the problem of identifying the authors (reviewers) of a set of documents (reviews). The common approach is to build a classifier using supervised learning. This approach has several issues which hurts its applicability. First, supervised learning needs a large set of documents from each author to serve as the training data. This can be difficult in practice. For example, in the online review domain, most reviewers (authors) only write a few reviews, which are not enough to serve as the training data. Second, the learned classifier cannot be applied to authors whose documents have not been used in training. In this article, we propose a novel solution to deal with the two problems. The core idea is that instead of learning in the original document space, we transform it to a similarity space. In the similarity space, the learning is able to naturally tackle the issues. Our experiment results based on online reviews and reviewers show that the proposed method outperforms the state-of-the-art supervised and unsupervised baseline methods significantly.", "paper_title": "Review Authorship Attribution in a Similarity Space", "paper_id": "WOS:000349577600015"}