{"auto_keywords": [{"score": 0.03179400010852566, "phrase": "interactional_justice"}, {"score": 0.00481495049065317, "phrase": "passive_participation"}, {"score": 0.004375928080972614, "phrase": "new_is"}, {"score": 0.0038695436922618876, "phrase": "distributive_and_procedural_justice"}, {"score": 0.0037140731069193896, "phrase": "current_organizational_settings"}, {"score": 0.002903628734069691, "phrase": "passive_participation_method"}, {"score": 0.0028641729745364952, "phrase": "engaging_users"}, {"score": 0.002730240935688002, "phrase": "large_company"}, {"score": 0.0026749054369512625, "phrase": "usa"}, {"score": 0.002332626862738603, "phrase": "interpersonal_level"}, {"score": 0.002238767763626708, "phrase": "user_assessment"}, {"score": 0.0021049977753042253, "phrase": "interactional_justice_theory"}], "paper_keywords": ["IS implementation", " User satisfaction", " Leadership", " Interactional justice"], "paper_abstract": "Allowing users to actively participate in the development and implementation of a new IS is supposed to increase their satisfaction with it. This type of participation, representing aspects relating to distributive and procedural justice, is increasingly impractical in current organizational settings, because many IS are used by thousands of employees and having them involved is impossible. Nonetheless, there are still benefits to be gained in other ways. Extrapolating from interactional justice, we proposed a passive participation method of engaging users. Its effect was tested in a large company in the USA and proved effective. Interactional justice, the perception of fairness in the way that people were treated at an interpersonal level, was found to increase user assessment of the value of their IS. Implications and expansions to interactional justice theory and how this antecedent affects IS implementation are discussed. (C) 2008 Elsevier B.V. All rights reserved", "paper_title": "Leadership and justice: Increasing non participating users' assessment of an IT through passive participation", "paper_id": "WOS:000261859500001"}