{"auto_keywords": [{"score": 0.010301187624227964, "phrase": "constructivist_learning"}, {"score": 0.008019797690773153, "phrase": "learning_outcomes"}, {"score": 0.004562362497952548, "phrase": "network_infrastructure"}, {"score": 0.004508048086020253, "phrase": "computing_technology"}, {"score": 0.0035051129798529, "phrase": "learning_experience"}, {"score": 0.0032229262928681304, "phrase": "information_security_issues"}, {"score": 0.003053598205821532, "phrase": "second_life"}, {"score": 0.002628362641980801, "phrase": "virtual_environment"}, {"score": 0.002581477142020187, "phrase": "introductory_management_information_system_course"}, {"score": 0.0025051811853674215, "phrase": "students'_learning_experience"}, {"score": 0.0021821915946356168, "phrase": "educational_platform"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["3D virtual environments", " Constructivist learning", " Outcome-based learning"], "paper_abstract": "Advances in network infrastructure and computing technology have made 3D virtual environment increasingly popular and less costly. Many education institutions have shown interests in its application in teaching and learning activities. In this project, we evaluated how the 3D virtual environment can facilitate students in achieving learning outcomes. To provide students with learning experience in 3D virtual environments, we designed a task which requested students to identify some information security issues in a virtual office set-up in Second Life, the most widely adopted 3D virtual environment. In this paper, we report our experience in having students finish the task within the virtual environment in an introductory management information system course. Evaluation on the students' learning experience showed that 3D virtual environments could indeed facilitate students in achieving learning outcomes through constructivist learning. We suggest some recommendations in using 3D virtual environments as an educational platform. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Using 3D virtual environments to facilitate students in constructivist learning", "paper_id": "WOS:000329005000012"}