{"auto_keywords": [{"score": 0.04694160493196955, "phrase": "sp"}, {"score": 0.02731446176722756, "phrase": "road_maps"}, {"score": 0.026845767089225425, "phrase": "usa"}, {"score": 0.00481495049065317, "phrase": "multiconstraint_shortest_path_problems"}, {"score": 0.0045320819060445045, "phrase": "single-source_shortest_path"}, {"score": 0.004342430078306461, "phrase": "k-shortest_time_path_problems"}, {"score": 0.003916098498242888, "phrase": "asymmetric_traversal_time"}, {"score": 0.0031393948330209224, "phrase": "computation_complexity"}, {"score": 0.003061976628792769, "phrase": "globally_optimal_solutions"}, {"score": 0.002975826686621829, "phrase": "iteration_process"}, {"score": 0.0028715299874549245, "phrase": "even_the_sp"}, {"score": 0.0026264601495742295, "phrase": "sequentially_processing_computer"}, {"score": 0.0025892330566358503, "phrase": "synthetic_graphs"}, {"score": 0.0024718415971488627, "phrase": "time_windows"}, {"score": 0.0024368006923629476, "phrase": "mrnn"}, {"score": 0.0023936956017015696, "phrase": "large_scale_sparse_graphs"}, {"score": 0.0023766673143502384, "phrase": "even_dense_graphs"}, {"score": 0.0023346234464901978, "phrase": "e._g."}, {"score": 0.002309754152767196, "phrase": "cpu_time"}, {"score": 0.0022770057597574734, "phrase": "iteration_number"}, {"score": 0.0021049977753042253, "phrase": "dijkstra's_algorithm"}], "paper_keywords": ["Autowave", " minimum resource neural network (MRNN)", " multiconstraint", " shortest path (SP) problems"], "paper_abstract": "Characterized by using minimum hard (structural) and soft (computational) resources, a novel parameter-free minimal resource neural network (MRNN) framework is proposed for solving a wide range of single-source shortest path (SP) problems for various graph types. The problems are the k-shortest time path problems with any combination of three constraints: time, hop, and label constraints, and the graphs can be directed, undirected, or bidirected with symmetric and/or asymmetric traversal time, which can be real and time dependent. Isomorphic to the graph where the SP is to be sought, the network is activated by generating autowave at source neuron and the autowave travels automatically along the paths with the speed of a hop in an iteration. Properties of the network are studied, algorithms are presented, and computation complexity is analyzed. The framework guarantees globally optimal solutions of a series of problems during the iteration process of the network, which provides insight into why even the SP is still too long to be satisfied. The network facilitates very large scale integrated circuit implementation and adapt to very large scale problems due to its massively parallel processing and minimum resource utilization. When implemented in a sequentially processing computer, experiments on synthetic graphs, road maps of cities of the USA, and vehicle routing with time windows indicate that the MRNN is especially efficient for large scale sparse graphs and even dense graphs with some constraints, e. g., the CPU time taken and the iteration number used for the road maps of cities of the USA is even less than similar to 2% and 0.5% that of the Dijkstra's algorithm.", "paper_title": "A Minimum Resource Neural Network Framework for Solving Multiconstraint Shortest Path Problems", "paper_id": "WOS:000340295000012"}