{"auto_keywords": [{"score": 0.030544179854065975, "phrase": "cell_phone_use"}, {"score": 0.00481495049065317, "phrase": "campus_libraries"}, {"score": 0.0047051051659828275, "phrase": "policy_responses"}, {"score": 0.004640398886726948, "phrase": "invasive_mobile_technology"}, {"score": 0.004431041346291019, "phrase": "university_settings"}, {"score": 0.0042506731642425275, "phrase": "patron_mobile_telephone_use"}, {"score": 0.0037696519417841287, "phrase": "america's_best_colleges"}, {"score": 0.0032066653632708965, "phrase": "best_national_universities"}, {"score": 0.002991823455621222, "phrase": "college_and_university_libraries"}, {"score": 0.0027913353347879507, "phrase": "structured_guidelines"}, {"score": 0.0026899455459275575, "phrase": "library_website"}, {"score": 0.0022772782536385717, "phrase": "mobile_phone_policy"}, {"score": 0.002164264600379492, "phrase": "proper_way"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["mobile technologies", " digital technologies", " partron cell phone use"], "paper_abstract": "This study examines how libraries within college and university settings in the United States have dealt with the influx of patron mobile telephone use. We contacted 150 colleges and universities throughout the United States and received 87 responses. These institutions were ranked by US News and World Report in their 2006 Edition of \"America's Best Colleges;\" we sampled from their list stratified within the following categories: \"top public universities;\" \"best liberal arts colleges,'\" \"fourth tier liberal arts colleges;\" \"best national universities;\" and \"fourth tier national universities.\" We found that those college and university libraries adopt an array of stances when approaching cell phone use within their library facilities. These approaches include structured guidelines that specifically address cell phone use posted on the library website, signs displayed throughout the library barring cell phone use, and signage that provides patrons with a list of areas in which use is permitted. Interestingly, we found that several libraries lack any kind of mobile phone policy and instead, assume all patrons will behave in a proper way. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Cell phones in campus libraries: An analysis of policy responses to an invasive mobile technology", "paper_id": "WOS:000245605100020"}