{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multiply-connected_objects"}, {"score": 0.004677108044285109, "phrase": "central_problem"}, {"score": 0.004602233424629559, "phrase": "computer_vision"}, {"score": 0.004286708921931472, "phrase": "efficient_representation"}, {"score": 0.004005645977640982, "phrase": "simply-connected_shapes"}, {"score": 0.0038409323908446297, "phrase": "multiply-connected_shapes"}, {"score": 0.0036006068766833103, "phrase": "conformal_welding"}, {"score": 0.0034974064973871833, "phrase": "proposed_representation_space"}, {"score": 0.003353521531649663, "phrase": "main_idea"}, {"score": 0.0032155369606336206, "phrase": "unit_disks"}, {"score": 0.003194816815998026, "phrase": "circle_domains"}, {"score": 0.002927780883930371, "phrase": "conformal_modules"}, {"score": 0.0028715299874549245, "phrase": "shape_signature"}, {"score": 0.0028438099634371886, "phrase": "shape_distance"}, {"score": 0.002825478348161608, "phrase": "shape_signatures"}, {"score": 0.0026916956768363158, "phrase": "proposed_shape_signature"}, {"score": 0.0025808721879758243, "phrase": "reconstruction_algorithm"}, {"score": 0.0023650305205893353, "phrase": "morphing_algorithm"}, {"score": 0.0022823466001223986, "phrase": "beltrami_coefficients"}, {"score": 0.0021742244283295986, "phrase": "real_images"}, {"score": 0.0021049977753042253, "phrase": "stable_shape_representation_scheme"}], "paper_keywords": ["Shape analysis", " shape signature", " multiply-connected shapes", " conformal welding", " conformal modules", " morphing"], "paper_abstract": "Shape analysis is a central problem in the field of computer vision. In 2D shape analysis, classification and recognition of objects from their observed silhouettes are extremely crucial but difficult. It usually involves an efficient representation of 2D shape space with a metric, so that its mathematical structure can be used for further analysis. Although the study of 2D simply-connected shapes has been subject to a corpus of literatures, the analysis of multiply-connected shapes is comparatively less studied. In this work, we propose a representation for general 2D multiply-connected domains with arbitrary topologies using conformal welding. A metric can be defined on the proposed representation space, which gives a metric to measure dissimilarities between objects. The main idea is to map the exterior and interior of the domain conformally to unit disks and circle domains (unit disk with several inner disks removed), using holomorphic 1-forms. A set of diffeomorphisms of the unit circle S-1 can be obtained, which together with the conformal modules are used to define the shape signature. A shape distance between shape signatures can be defined to measure dissimilarities between shapes. We prove theoretically that the proposed shape signature uniquely determines the multiply-connected objects under suitable normalization. We also introduce a reconstruction algorithm to obtain shapes from their signatures. This completes our framework and allows us to move back and forth between shapes and signatures. With that, a morphing algorithm between shapes can be developed through the interpolation of the Beltrami coefficients associated with the signatures. Experiments have been carried out on shapes extracted from real images. Results demonstrate the efficacy of our proposed algorithm as a stable shape representation scheme.", "paper_title": "Shape Analysis of Planar Multiply-Connected Objects Using Conformal Welding", "paper_id": "WOS:000338209900008"}