{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cell-based_simulation_model"}, {"score": 0.034901135911441054, "phrase": "local_rules"}, {"score": 0.015581461158943833, "phrase": "advanced_ship_evacuation_analysis"}, {"score": 0.004687645903373103, "phrase": "stochastic_methods"}, {"score": 0.0046046429665581555, "phrase": "total_evacuation_time"}, {"score": 0.004523103062368843, "phrase": "computer-based_simulations"}, {"score": 0.0044231966846655394, "phrase": "passenger's_characteristics"}, {"score": 0.003955679223407243, "phrase": "advanced_evacuation_analysis"}, {"score": 0.0037157201349604222, "phrase": "uniform_grid"}, {"score": 0.00298450444597311, "phrase": "behavior_patterns"}, {"score": 0.002741269087816162, "phrase": "combined_discrete_event"}, {"score": 0.0027047136845332917, "phrase": "discrete_time_simulation_model"}, {"score": 0.0026686444508167875, "phrase": "different_variables"}, {"score": 0.002181766829493483, "phrase": "car_ferry"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ship evacuation analysis", " Cell-based simulation model", " Combined discrete event and a discrete time simulation", " Car ferry"], "paper_abstract": "Advanced ship evacuation analysis is one of stochastic methods in which the total evacuation time is calculated via computer-based simulations, by considering each passenger's characteristics (e.g., age, gender, etc.) and the detailed layout of the ship. In this study, simulations for advanced evacuation analysis using a cell-based simulation model are performed. The cell-based simulation model divides the space in a uniform grid, \"cell\". Each passenger in the ship is located in a cell and moves to another cell according to a set of local rules that are supposed to be associated with the individual, crowd, and counterflow-avoiding behavior of the passengers. These behavior patterns are implemented as the local rules and are assigned to each cell. Each cell was implemented using a combined discrete event and a discrete time simulation model that represents different variables of the local rules. To verify the applicability of the advanced ship evacuation analysis, it was applied to 11 tests specified in the IMO/MSC/Circ. 1238, and the result shows that all the requirements of such tests had been met. Finally, the analysis was applied to a car ferry having 2487 persons. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Advanced ship evacuation analysis using a cell-based simulation model", "paper_id": "WOS:000313406200009"}