{"auto_keywords": [{"score": 0.042063006408460835, "phrase": "motor_learning_principles"}, {"score": 0.03101273228713902, "phrase": "haptic_training"}, {"score": 0.00481495049065317, "phrase": "motor_learning_perspectives_on_haptic_training"}, {"score": 0.004721162131188487, "phrase": "recent_developments"}, {"score": 0.004606479650820579, "phrase": "numerous_new_robotic_rehabilitation_therapies"}, {"score": 0.003584025547693836, "phrase": "haptic_training_paradigm"}, {"score": 0.003548905904860611, "phrase": "healthy_participants"}, {"score": 0.003479692058963528, "phrase": "motor_skill"}, {"score": 0.003428665921276366, "phrase": "upper_extremities"}, {"score": 0.0031532895341013297, "phrase": "observational_learning"}, {"score": 0.0031070348334684356, "phrase": "functional_task_difficulty"}, {"score": 0.0028574164693918433, "phrase": "extensive_vocabulary"}, {"score": 0.0022777800735119405, "phrase": "fuller_understanding"}, {"score": 0.0022005118194652704, "phrase": "basic_science_research"}, {"score": 0.002125859121671525, "phrase": "training_techniques"}, {"score": 0.0021049977753042253, "phrase": "clinical_populations"}], "paper_keywords": ["Haptics", " motor skill", " rehabilitation", " review"], "paper_abstract": "Recent developments in neurorehabilitation have spawned numerous new robotic rehabilitation therapies. However, many of the concepts upon which these therapies are based are not fully understood and it may be necessary to explore some of the motor learning principles that apply to the use of haptics for motor learning in non-clinical scenarios/populations. We conducted a review of studies that utilized a haptic training paradigm teaching healthy participants to perform a motor skill involving the upper extremities. We discuss studies in the context of four important motor learning concepts: performance versus learning, feedback, observational learning, and functional task difficulty. Additionally, we note that the proliferation of research in haptic training has led to an extensive vocabulary of terms, some of which may be misnomers or redundant. We propose a classification of terms describing haptic training in an effort to provide clarity and further contextualize the studies. We believe that making connections to motor learning principles and clarifying meanings will facilitate a fuller understanding of the outcomes of studies in basic science research and allow for more directed applications of these training techniques to clinical populations.", "paper_title": "Motor Learning Perspectives on Haptic Training for the Upper Extremities", "paper_id": "WOS:000338514200014"}