{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multiple_clusterings"}, {"score": 0.0497055404009025, "phrase": "chemical_structures"}, {"score": 0.009087495931317668, "phrase": "alogp"}, {"score": 0.008740361771118853, "phrase": "ward"}, {"score": 0.0072186054955128065, "phrase": "consensus_clustering_methods"}, {"score": 0.004558091785667046, "phrase": "multiple_classifiers"}, {"score": 0.004469700997700534, "phrase": "machine_learning"}, {"score": 0.004434824354230475, "phrase": "applied_statistics"}, {"score": 0.004068611852912931, "phrase": "individual_clustering_method"}, {"score": 0.003974071684351861, "phrase": "best_results"}, {"score": 0.0037471850931318942, "phrase": "graph-based_consensus_clusterings"}, {"score": 0.003547084456662448, "phrase": "biologically_active_molecules"}, {"score": 0.00351938145050947, "phrase": "inactive_ones"}, {"score": 0.0031658283119347396, "phrase": "quality_partition_index_method"}, {"score": 0.0029616217177058602, "phrase": "ward's_clustering_method"}, {"score": 0.002915514089373717, "phrase": "mddr"}, {"score": 0.0026954938318408464, "phrase": "voting-based_consensus_clustering_method"}, {"score": 0.0026019646284747024, "phrase": "qpi_method"}, {"score": 0.002531463482341473, "phrase": "graph-based_consensus_clustering_methods"}, {"score": 0.0024340403320192807, "phrase": "qpi._the_jaccard_and_euclidean_distance_measures"}, {"score": 0.0023038997972591193, "phrase": "highest_values"}, {"score": 0.0021467260992026295, "phrase": "chemical_structures_clusterings"}, {"score": 0.0021215910859085146, "phrase": "cumulative_voting-based_aggregation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "cvaa"}], "paper_keywords": [""], "paper_abstract": "Background: Although many consensus clustering methods have been successfully used for combining multiple classifiers in many areas such as machine learning, applied statistics, pattern recognition and bioinformatics, few consensus clustering methods have been applied for combining multiple clusterings of chemical structures. It is known that any individual clustering method will not always give the best results for all types of applications. So, in this paper, three voting and graph-based consensus clusterings were used for combining multiple clusterings of chemical structures to enhance the ability of separating biologically active molecules from inactive ones in each cluster. Results: The cumulative voting-based aggregation algorithm (CVAA), cluster-based similarity partitioning algorithm (CSPA) and hyper-graph partitioning algorithm (HGPA) were examined. The F-measure and Quality Partition Index method (QPI) were used to evaluate the clusterings and the results were compared to the Ward's clustering method. The MDL Drug Data Report (MDDR) dataset was used for experiments and was represented by two 2D fingerprints, ALOGP and ECFP_4. The performance of voting-based consensus clustering method outperformed the Ward's method using F-measure and QPI method for both ALOGP and ECFP_4 fingerprints, while the graph-based consensus clustering methods outperformed the Ward's method only for ALOGP using QPI. The Jaccard and Euclidean distance measures were the methods of choice to generate the ensembles, which give the highest values for both criteria. Conclusions: The results of the experiments show that consensus clustering methods can improve the effectiveness of chemical structures clusterings. The cumulative voting-based aggregation algorithm (CVAA) was the method of choice among consensus clustering methods.", "paper_title": "Voting-based consensus clustering for combining multiple clusterings of chemical structures", "paper_id": "WOS:000314027600001"}