{"auto_keywords": [{"score": 0.04548812433856781, "phrase": "query_points"}, {"score": 0.0320360432115798, "phrase": "aggregate_vknn_query"}, {"score": 0.00481495049065317, "phrase": "incremental_evaluation_of_visible_nearest_neighbor_queries"}, {"score": 0.004682414867878963, "phrase": "spatial_objects"}, {"score": 0.004141093507753515, "phrase": "visible_k_nearest_neighbor"}, {"score": 0.003641713874009232, "phrase": "search_process"}, {"score": 0.0033301694494391643, "phrase": "index_nodes"}, {"score": 0.0029612292670237505, "phrase": "visible_k_nearest_objects"}, {"score": 0.002815864555488112, "phrase": "aggregate_distance_function"}, {"score": 0.002574788013427524, "phrase": "multiple_vknn_queries"}, {"score": 0.0022137465420508785, "phrase": "aggregate_visible_distance_metric"}, {"score": 0.002176887956041267, "phrase": "extensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "latter_approach"}], "paper_keywords": ["Geographical information systems", " spatial databases", " query processing"], "paper_abstract": "In many applications involving spatial objects, we are only interested in objects that are directly visible from query points. In this paper, we formulate the visible k nearest neighbor (VkNN) query and present incremental algorithms as a solution, with two variants differing in how to prune objects during the search process. One variant applies visibility pruning to only objects, whereas the other variant applies visibility pruning to index nodes as well. Our experimental results show that the latter outperforms the former. We further propose the aggregate VkNN query that finds the visible k nearest objects to a set of query points based on an aggregate distance function. We also propose two approaches to processing the aggregate VkNN query. One accesses the database via multiple VkNN queries, whereas the other issues an aggregate k nearest neighbor query to retrieve objects from the database and then re-rank the results based on the aggregate visible distance metric. With extensive experiments, we show that the latter approach consistently outperforms the former one.", "paper_title": "Incremental Evaluation of Visible Nearest Neighbor Queries", "paper_id": "WOS:000275652400005"}