{"auto_keywords": [{"score": 0.04985959609440271, "phrase": "decision_support_system"}, {"score": 0.0179117261739671, "phrase": "appropriate_models"}, {"score": 0.007394196950527404, "phrase": "river_basin_management"}, {"score": 0.004473982381245469, "phrase": "integrated_planning"}, {"score": 0.0036052633308076933, "phrase": "acceptable_ranking"}, {"score": 0.0035722806911457545, "phrase": "river_engineering_measures"}, {"score": 0.0034911335714333507, "phrase": "systematic_approach"}, {"score": 0.0026011706232569316, "phrase": "potential_applications"}, {"score": 0.002318566141177149, "phrase": "decision_makers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["appropriateness framework", " uncertainty analysis", " sensitivity analysis", " decision support systems", " flood safety", " dutch meuse river", " uncertainty reduction"], "paper_abstract": "Models are essential in a decision support system for river basin management. In a decision support system for integrated planning and management, the use of appropriate models is important to avoid models being either too simple or too complex. In this paper, appropriate models refer to models that are good-enough-but-not-more-than-that to obtain an acceptable ranking of river engineering measures under uncertainty. A systematic approach called 'appropriateness framework' is proposed to determine appropriate models that can be used in a decision support system. The approach is applied to a decision support system for the Dutch Meuse River. One important component of this decision support system, flood safety, is used in this paper to demonstrate how this approach works. The results show that the approach is very useful in helping to determine appropriate models. Potential applications of the approach in other decision support systems are discussed. The approach presented in this paper is designed as a tool to stimulate the communication between decision makers and modelers and to promote the use of models in decision-making for river basin management. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "An appropriateness framework for the Dutch Meuse decision support system", "paper_id": "WOS:000248233200010"}