{"auto_keywords": [{"score": 0.014174825654453155, "phrase": "binary_images"}, {"score": 0.011520446400230007, "phrase": "binary_image"}, {"score": 0.004767261858417823, "phrase": "purpose_-_the_purpose"}, {"score": 0.004513255056769647, "phrase": "marked_method"}, {"score": 0.004209369306023422, "phrase": "new_algorithm"}, {"score": 0.003661382948704217, "phrase": "marked_methods"}, {"score": 0.0036250779580069455, "phrase": "complex_signing"}, {"score": 0.003121636289442593, "phrase": "chain_list"}, {"score": 0.0029111767710750117, "phrase": "central_position"}, {"score": 0.0027834145465170292, "phrase": "created_chain_lists"}, {"score": 0.0027148677103585985, "phrase": "findings_-_test_results"}, {"score": 0.002444883254621769, "phrase": "connected_area"}, {"score": 0.0021049977753042253, "phrase": "lumbering_and_steel_industry"}], "paper_keywords": ["Image processing", " Image scanners", " Programming and algorithm theory", " Image recognition", " Chain list", " Identifying the number of bars", " Binary image"], "paper_abstract": "Purpose - The purpose of this paper is to overcome the shortcomings of the marked method in identifying the number of regions in binary images, and to present a new algorithm to identify the number of bars. Design/methodology/approach - Identifying the number of bars automatically is widely used in the lumbering, iron, and steel industry. The marked methods need complex signing and have to scan the binary image several times. An algorithm that uses two chain lists to identify the number of bars is presented. It uses the characteristic of the chain list. When scanning the binary image, it creates two chain lists and then the number and the central position of the bar based on the relations of created chain lists can be determined. Findings - Test results have indicated this algorithm is feasible and effective on recognizing the number of bars. Research limitations/implications - When the connected area has too many pixels in the binary images, recognizing its number needs much more time. Originality/value - The paper presents a very useful approach for identifying the number of the bar, in the lumbering and steel industry.", "paper_title": "Identifying the number of bars based on two chain lists", "paper_id": "WOS:000312434000026"}