{"auto_keywords": [{"score": 0.029139405059332744, "phrase": "ransac"}, {"score": 0.02897216919556621, "phrase": "rpca"}, {"score": 0.00481495049065317, "phrase": "mobile_laser_scanning"}, {"score": 0.004620093797504386, "phrase": "robust_saliency_features"}, {"score": 0.00438105507792004, "phrase": "robust_z-score"}, {"score": 0.004304144138805271, "phrase": "mahalanobis_type_robust_distance"}, {"score": 0.0041666157975446564, "phrase": "orthogonal_distance"}, {"score": 0.004142084961822865, "phrase": "local_surface_point_consistency"}, {"score": 0.004105558123159003, "phrase": "maximum_consistency"}, {"score": 0.004081385289516914, "phrase": "minimum_distance"}, {"score": 0.0037909219941547373, "phrase": "local_neighbourhood"}, {"score": 0.0037463983616303786, "phrase": "normal_and_curvature"}, {"score": 0.002931569771634119, "phrase": "sample_size"}, {"score": 0.0028800314406625996, "phrase": "proposed_mcmd_z"}, {"score": 0.0027796495180095657, "phrase": "existing_methods"}, {"score": 0.002690701018745317, "phrase": "proposed_mcmd_md_method"}, {"score": 0.0025137856138000014, "phrase": "outlier_detection"}, {"score": 0.00246957392654378, "phrase": "mcmd_z"}, {"score": 0.0023554316787703137, "phrase": "ulsif"}, {"score": 0.002246553137021003, "phrase": "misclassification_rates"}, {"score": 0.0022201273900989416, "phrase": "proposed_methods"}, {"score": 0.0022005118194652704, "phrase": "new_methods"}, {"score": 0.002174626466808561, "phrase": "local_surface_reconstruction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Feature extraction", " Plane fitting", " Point cloud denoising", " Robust saliency feature", " Segmentation", " Surface reconstruction"], "paper_abstract": "This paper proposes two robust statistical techniques for outlier detection and robust saliency features, such as surface normal and curvature, estimation in laser scanning 3D point cloud data. One is based on a robust z-score and the other uses a Mahalanobis type robust distance. The methods couple the ideas of point to plane orthogonal distance and local surface point consistency to get Maximum Consistency with Minimum Distance (MCMD). The methods estimate the best-fit-plane based on most probable outlier free, and most consistent, points set in a local neighbourhood. Then the normal and curvature from the best-fit-plane will be highly robust to noise and outliers. Experiments are performed to show the performance of the algorithms compared to several existing well-known methods (from computer vision, data mining, machine learning and statistics) using synthetic and real laser scanning datasets of complex (planar and non-planar) objects. Results for plane fitting, denoising, sharp feature preserving and segmentation are significantly improved. The algorithms are demonstrated to be significantly faster, more accurate and robust. Quantitatively, for a sample size of 50 with 20% outliers the proposed MCMD_Z is approximately 5, 15 and 98 times faster than the existing methods; uLSIF, RANSAC and RPCA, respectively. The proposed MCMD_MD method can tolerate 75% clustered outliers, whereas, RPCA and RANSAC can only tolerate 47% and 64% outliers, respectively. In terms of outlier detection, for the same dataset, MCMD_Z has an accuracy of 99.72%, 0.4% false positive rate and 0% false negative rate; for RPCA, RANSAC and uLSIF, the accuracies are 97.05%, 47.06% and 94.54%, respectively, and they have misclassification rates higher than the proposed methods. The new methods have potential for local surface reconstruction, fitting, and other point cloud processing tasks. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Outlier detection and robust normal-curvature estimation in mobile laser scanning 3D point cloud data", "paper_id": "WOS:000348880300032"}