{"auto_keywords": [{"score": 0.025088017683843628, "phrase": "vod_service_providers"}, {"score": 0.00481495049065317, "phrase": "enormous_popularity"}, {"score": 0.004690694501758065, "phrase": "substantial_research_attention"}, {"score": 0.004654043854386197, "phrase": "effective_use"}, {"score": 0.004475022550508119, "phrase": "high_efficiency"}, {"score": 0.004325426296453136, "phrase": "different_approaches"}, {"score": 0.004104944397138138, "phrase": "limited_scenarios"}, {"score": 0.004030449969901066, "phrase": "research_community"}, {"score": 0.003988487841970088, "phrase": "clear_understanding"}, {"score": 0.0038049789989278463, "phrase": "real_world_conditions"}, {"score": 0.0037164035697565285, "phrase": "heterogeneous_bandwidths"}, {"score": 0.0034628156490003775, "phrase": "common_base"}, {"score": 0.0033999344623871735, "phrase": "different_protocols"}, {"score": 0.003373334961160647, "phrase": "wide_range"}, {"score": 0.003061838370348944, "phrase": "optimal_overall_performance"}, {"score": 0.002875293362426483, "phrase": "malicious_attacks"}, {"score": 0.0027428611381018313, "phrase": "traditional_file_transfer"}, {"score": 0.00256895975568914, "phrase": "early_departures"}, {"score": 0.0024961460732175274, "phrase": "qos"}, {"score": 0.002450602177683066, "phrase": "different_position"}, {"score": 0.002412371116984224, "phrase": "bigger_negative_impact"}, {"score": 0.002374735066990346, "phrase": "important_implications"}, {"score": 0.002343819560536301, "phrase": "future_system_designers"}, {"score": 0.0021894157986654546, "phrase": "current_approaches"}, {"score": 0.0021383680500215267, "phrase": "better_ones"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-to-peer", " Video-on-demand", " BitTorrent"], "paper_abstract": "The enormous popularity of Video on Demand (VoD) has attracted substantial research attention into the effective use of peer-to-peer (P2P) architectures to provide solutions at large-scale. In particular, the high efficiency of BitTorrent has inspired many P2P protocols for VoD. However, these protocols use different approaches to adapt the design of Bittorrent to VoD, and in most cases their performance has been evaluated separately and in limited scenarios. As a consequence, the research community still lacks a clear understanding of how these protocols compare against each other and how well each of them would work in real world conditions, where, for instance, peers have heterogeneous bandwidths, may freeride or may be located behind NAT/firewall. In this paper, we propose a simulation based methodology which aims at putting forward a common base for comparing the performance of these different protocols under a wide range of conditions. We show that, despite their considerable differences: (i) existing BitTorrent-like VoD approaches all share some characteristics, such as that their bandwidth reciprocity based methods to incentivize cooperation do not always yield an optimal overall performance. Furthermore, we demonstrate that (ii) in these protocols there is a trade-off between QoS and resilience to freeriding and malicious attacks. We also discover that, (iii) when peers doing streaming coexist with peers doing traditional file transfer, the latter actually benefit from this coexistence, at the expenses of the former. Finally, we show that (iv) early departures of peers from the system do not significantly affect the QoS delivered, while jumping to a different position in the file has a bigger negative impact. Overall, our findings provide important implications for both VoD service providers and future system designers. On the one hand, our results can guide VoD service providers in selecting the most appropriate protocol for a given environment. On the other hand, exposing the flaws of current approaches will help researchers in improving them and/or designing better ones. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "BitTorrent-like P2P approaches for VoD: A comparative study", "paper_id": "WOS:000317808800013"}