{"auto_keywords": [{"score": 0.00441635700580562, "phrase": "multicriteria_approach"}, {"score": 0.004298666679374568, "phrase": "information_technology"}, {"score": 0.00385832528624328, "phrase": "project_investments"}, {"score": 0.0033888405252810927, "phrase": "final_recommendations"}, {"score": 0.003210446135114967, "phrase": "multicriteria_analysis"}, {"score": 0.002865710140187219, "phrase": "different_characteristics"}, {"score": 0.002714779217561487, "phrase": "tangible_and_intangible_benefits"}, {"score": 0.0026280534600940137, "phrase": "intangible_benefits"}, {"score": 0.002530359917257626, "phrase": "formal_procedure"}, {"score": 0.002198173002125907, "phrase": "numerical_illustration"}, {"score": 0.0021049977753042253, "phrase": "preview_study"}], "paper_keywords": ["Information technology", " investments", " IT projects", " multicriteria decision model"], "paper_abstract": "This paper presents a multicriteria approach to the evaluation of information technology (IT) projects. In this paper, we present the steps of the model to evaluate IT project investments, including the identification of IT project investment, the construction of IT investment or IT project categories, the assessment of the importance of criteria and establishes final recommendations. The methodology proposes a framework, based on multicriteria analysis, that describes the importance of classifying and prioritizing IT projects investments before taking decisions. Decisions on IT investments should consider the different characteristics of each IT project and in each case evaluate the tangible and intangible benefits. However, measurements of intangible benefits are usually subjective and require a formal procedure to minimize the difficulty and consequence of this. Thus, the model enables us to handle this subjectiveness and it is exemplified with a numerical illustration, the data being drawn from a preview study.", "paper_title": "IT Project Investments: An Analysis Based on a Sort and Rank Problem", "paper_id": "WOS:000340430200003"}