{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "game-theoretic_resource_allocation_methods"}, {"score": 0.0047559432344272, "phrase": "device-to-device_communication._device-to-device_communication_underlaying_cellular_networks"}, {"score": 0.00430907756010007, "phrase": "cellular_services"}, {"score": 0.004256243266481051, "phrase": "direct_peer-to-peer_transmission"}, {"score": 0.0033457659530207306, "phrase": "radio_resources"}, {"score": 0.0032240802202623316, "phrase": "resource_allocation"}, {"score": 0.002849442549612025, "phrase": "mathematical_tools"}, {"score": 0.002728847267539957, "phrase": "individual_or_group_behaviors"}, {"score": 0.0025972447844047515, "phrase": "game_models"}, {"score": 0.0025495426598675583, "phrase": "distributed_solutions"}, {"score": 0.0025027144548626975, "phrase": "resource_allocation_problems"}, {"score": 0.0022811346113905295, "phrase": "game-theoretic_models"}, {"score": 0.002225426912273257, "phrase": "radio_resource_allocation_issues"}], "paper_keywords": [""], "paper_abstract": "Device-to-device communication underlaying cellular networks allows mobile devices such as smartphones and tablets to use the licensed spectrum allocated to cellular services for direct peer-to-peer transmission. D2D communication can use either one-hop transmission (i.e. D2D direct communication) or multi-hop cluster-based transmission (i.e. in D2D local area networks). The D2D devices can compete or cooperate with each other to reuse the radio resources in D2D networks. Therefore, resource allocation and access for D2D communication can be treated as games. The theories behind these games provide a variety of mathematical tools to effectively model and analyze the individual or group behaviors of D2D users. In addition, game models can provide distributed solutions to the resource allocation problems for D2D communication. The aim of this article is to demonstrate the applications of game-theoretic models to study the radio resource allocation issues in D2D communication. The article also outlines several key open research directions.", "paper_title": "GAME-THEORETIC RESOURCE ALLOCATION METHODS FOR DEVICE-TO-DEVICE COMMUNICATION", "paper_id": "WOS:000339167500019"}