{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "neural_p_systems"}, {"score": 0.032383891854950435, "phrase": "sn_p_systems"}, {"score": 0.027566499737058017, "phrase": "finite_sets"}, {"score": 0.02553485430271328, "phrase": "finite_sn_p_systems"}, {"score": 0.004636867727899342, "phrase": "sn_p"}, {"score": 0.004478308876320956, "phrase": "electrical_impulses"}, {"score": 0.00421371094333215, "phrase": "firing_rules"}, {"score": 0.0036979855349860134, "phrase": "generative_mode"}, {"score": 0.00327356326590461, "phrase": "previous_proofs"}, {"score": 0.003115908199991072, "phrase": "somewhat_surprising_uniformity"}, {"score": 0.0030267296900520217, "phrase": "turing_machines"}, {"score": 0.0029658232220207254, "phrase": "theoretical_interest"}, {"score": 0.002897710777957041, "phrase": "biological_reality"}, {"score": 0.002542642270762272, "phrase": "generative_case"}, {"score": 0.0024412911465483225, "phrase": "semilinear_sets"}, {"score": 0.002357632753637638, "phrase": "accepting_case"}, {"score": 0.0023101592330916822, "phrase": "generative_one"}, {"score": 0.0022768346311104735, "phrase": "also_certain_arithmetical_progressions"}, {"score": 0.002237477619351199, "phrase": "precise_characterization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Membrane computing", " Spiking neural P system", " Turing computability", " Semilinear set"], "paper_abstract": "Spiking neural P systems (in short, SN P systems) are computing devices based on the way the neurons communicate through electrical impulses (spikes). These systems involve various ingredients; among them, we mention forgetting rules and the delay in firing rules. However, it is known that the universality can be obtained without using these two features. In this paper we improve this result in two respects: (i) each neuron contains at most two rules (which is optimal for systems used in the generative mode), and (ii) the rules in the neurons using two rules have the same regular expression which controls their firing. This result answers a problem left open in the literature, and, in this context, an incompleteness in some previous proofs related to the elimination of forgetting rules is removed. Moreover, this result shows a somewhat surprising uniformity of the neurons in the SN P systems able to simulate Turing machines, which is both of a theoretical interest and it seems to correspond to a biological reality. When a bound is imposed on the number of spikes present in a neuron at any step of a computational (Such SN P systems are called finite), two surprising results are obtained. First, a characterization of finite sets of numbers is obtained in the generative case (this contrasts the case of other classes of SN P systems, where characterizations of semilinear sets of numbers are obtained for finite SN P systems). Second, the accepting case is strictly more powerful than the generative one: all finite sets and also certain arithmetical progressions can be accepted. A precise characterization of the power of accepting finite SN P systems Without forgetting rules and delay remains to be found. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Spiking neural P systems: An improved normal form", "paper_id": "WOS:000274985500008"}