{"auto_keywords": [{"score": 0.049715817986079144, "phrase": "novelty_detection"}, {"score": 0.04724572975778897, "phrase": "automatic_text_summarisation"}, {"score": 0.04472882712454684, "phrase": "source_document"}, {"score": 0.03152938003499142, "phrase": "additional_sentences"}, {"score": 0.00481495049065317, "phrase": "incremental_length_summarisation"}, {"score": 0.004461882369408972, "phrase": "textual_document"}, {"score": 0.004134596278123439, "phrase": "device-friendly_content"}, {"score": 0.00405658135587089, "phrase": "non-traditional_environments"}, {"score": 0.004010477922833839, "phrase": "effective_method"}, {"score": 0.0037020429480068653, "phrase": "novel_parts"}, {"score": 0.00348300993356662, "phrase": "correct_interpretation"}, {"score": 0.0031784407245606704, "phrase": "different_ways"}, {"score": 0.0027918707809612, "phrase": "sufficient_basis"}, {"score": 0.002360381056508366, "phrase": "contextual_information"}, {"score": 0.0022547140008848912, "phrase": "mobile_information_access"}, {"score": 0.0021537671245615286, "phrase": "bandwidth_constraints"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["information retrieval", " results presentation", " novelty detection", " summarisation", " user study"], "paper_abstract": "The paper presents a study investigating the effects of incorporating novelty detection in automatic text summarisation. Condensing a textual document, automatic text summarisation can reduce the need to refer to the source document. It also offers a means to deliver device-friendly content when accessing information in non-traditional environments. An effective method of summarisation could be to produce a summary that includes only novel information. However, a consequence of focusing exclusively on novel parts may result in a loss of context, which may have an impact on the correct interpretation of the summary, with respect to the source document. In this study we compare two strategies to produce summaries that incorporate novelty in different ways: a constant length summary, which contains only novel sentences, and an incremental summary, containing additional sentences that provide context. The aim is to establish whether a summary that contains only novel sentences provides sufficient basis to determine relevance of a document, or if indeed we need to include additional sentences to provide context. Findings from the study seem to suggest that there is only a minimal difference in performance for the tasks we set our users and that the presence of contextual information is not so important. However, for the case of mobile information access, a summary that contains only novel information does offer benefits, given bandwidth constraints. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "'Show me more': Incremental length summarisation using novelty detection", "paper_id": "WOS:000254813200014"}