{"auto_keywords": [{"score": 0.04320512154983126, "phrase": "mainstream_media"}, {"score": 0.021807691740784653, "phrase": "ireport"}, {"score": 0.01399351306026094, "phrase": "news_events"}, {"score": 0.00481495049065317, "phrase": "news_event_detectors"}, {"score": 0.00445783412174435, "phrase": "breaking_news"}, {"score": 0.0033026956021014204, "phrase": "relative_frequencies"}, {"score": 0.0024252458095689847, "phrase": "professional_journalists"}, {"score": 0.0023636038312749245, "phrase": "high_level"}, {"score": 0.0023233800372985686, "phrase": "ireport_contributors"}, {"score": 0.002264321283759897, "phrase": "citizen_journalism"}, {"score": 0.0022449697898020947, "phrase": "national_boundaries"}, {"score": 0.0021049977753042253, "phrase": "local_context"}], "paper_keywords": ["citizen journalism", " event detection", " social tags", " user-generated content"], "paper_abstract": "The objective of this study was to investigate the use of tags in iReport to detect breaking news in terms of coverage and immediacy. Coverage refers to the extent to which news reported in mainstream media can also be detected in iReport, while immediacy refers to the promptness of news reported in mainstream media vis-a-vis those detected in iReport. A total of 10 ground truth events were identified from mainstream media between 1 April 2008 and 31 December 2008. Additionally, 481,455 tags from 118,545 postings were drawn from iReport in the same period. Relative frequencies of the top 200 most frequently-used tags were analysed to check for spikes and bursts. Based on the results, four main findings emerged. First, the performance of using spikes and bursts to detect news events was found to be comparable. Next, news events detected via spikes and bursts were found to lag ranging from a few days to more than a week compared to the dates reported by mainstream media. Third, news events deemed to be significant by professional journalists did not always attract a high level of interest from iReport contributors. Finally, even though citizen journalism transcends national boundaries via the internet, news posted to iReport seemed to show a proclivity towards local context.", "paper_title": "Social tags as news event detectors", "paper_id": "WOS:000286824800001"}