{"auto_keywords": [{"score": 0.038332721236933154, "phrase": "yang"}, {"score": 0.035570895034482554, "phrase": "pixel_expansion"}, {"score": 0.015323684744069673, "phrase": "secret_image"}, {"score": 0.012878138284836648, "phrase": "secret_pixel"}, {"score": 0.008855974613285779, "phrase": "probabilistic_schemes"}, {"score": 0.007403159320466795, "phrase": "probability_factor"}, {"score": 0.00481495049065317, "phrase": "visual_cryptography_schemes"}, {"score": 0.004613175917207636, "phrase": "black_or_white_pixels"}, {"score": 0.004074397977869244, "phrase": "secret_pixels"}, {"score": 0.003598317040926701, "phrase": "probabilistic_model"}, {"score": 0.003522027550662857, "phrase": "pixel_expansion_m"}, {"score": 0.0025207284405252914, "phrase": "big_enough_values"}, {"score": 0.0024461474613359994, "phrase": "deterministic_scheme"}, {"score": 0.002373767863833987, "phrase": "classical_deterministic_model"}, {"score": 0.0021049977753042253, "phrase": "one-to-one_mapping"}], "paper_keywords": ["visual cryptography", " probabilistic schemes", " secret sharing"], "paper_abstract": "Visual cryptography schemes allow the encoding of a secret image, consisting of black or white pixels, into n shares which are distributed to the participants. The shares are such that only qualified subsets of participants can 'visually' recover the secret image. The secret pixels are shared with techniques that subdivide each secret pixel into a certain number m, m >= 2 of subpixels. Such a parameter m is called pixel expansion. Recently Yang introduced a probabilistic model. In such a model the pixel expansion m is 1, that is, there is no pixel expansion. The reconstruction of the image however is probabilistic, meaning that a secret pixel will be correctly reconstructed only with a certain probability. In this paper we propose a generalization of the model proposed by Yang. In our model we fix the pixel expansion m >= 1 that can be tolerated and we consider probabilistic schemes attaining such a pixel expansion. For m = 1 our model reduces to the one of Yang. For big enough values of m, for which a deterministic scheme exists, our model reduces to the classical deterministic model. We show that between these two extremes one can trade the probability factor of the scheme with the pixel expansion. Moreover, we prove that there is a one-to-one mapping between deterministic schemes and probabilistic schemes with no pixel expansion, where contrast is traded for the probability factor.", "paper_title": "Probabilistic visual cryptography schemes", "paper_id": "WOS:000234431900007"}