{"auto_keywords": [{"score": 0.047017255963047636, "phrase": "design_engineer"}, {"score": 0.03759528653367177, "phrase": "direct_problem"}, {"score": 0.03566317662898919, "phrase": "dissipating_energy"}, {"score": 0.03517083259120442, "phrase": "hysteretic_damping"}, {"score": 0.03478167905660463, "phrase": "bending_stress"}, {"score": 0.03235158222751541, "phrase": "finite_elements"}, {"score": 0.029420333683948783, "phrase": "inverse_problem"}, {"score": 0.00481495049065317, "phrase": "damping-stress_relation"}, {"score": 0.004665381744060558, "phrase": "engineering_property"}, {"score": 0.004354910160382692, "phrase": "steady_state_conditions"}, {"score": 0.00428056179663201, "phrase": "resonance_conditions"}, {"score": 0.004053362743156545, "phrase": "important_role"}, {"score": 0.003961330917648707, "phrase": "calculated_stresses"}, {"score": 0.003471135453226184, "phrase": "maximum_bending_stress"}, {"score": 0.0031845067058084613, "phrase": "useful_tool"}, {"score": 0.0030854280671143556, "phrase": "continuum_mechanics_analytical_approach"}, {"score": 0.002938317647182056, "phrase": "iterative_procedure"}, {"score": 0.0029214769181390653, "phrase": "real_stress"}, {"score": 0.0026041635822373265, "phrase": "logarithmic_decrement"}, {"score": 0.0023958326775913165, "phrase": "measured_one"}, {"score": 0.002321234686549485, "phrase": "bending_stresses"}, {"score": 0.002288096980611268, "phrase": "discrete_element"}, {"score": 0.0022424956516376073, "phrase": "mathematical_expression"}, {"score": 0.0021416404045850224, "phrase": "suitably_formed_objective_function"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["hysteretic damping", " damping-stress relation", " damping at resonance", " iterative complex eigensolution method (ICEM)", " damping auto-determination", " hysteretic", " damping", " stress", " resonance", " eigensolution"], "paper_abstract": "In this paper the damping is examined as an engineering property used in analysis and design of structures and machines. The design engineer needs to know not only the stresses of his structure or machine, under steady state conditions but also the stresses under resonance conditions. Then the material damping, as a function of the stress of the structure, has an important role to play and ignoring the damping the calculated stresses are far from reality. The nonlinearity here is due to the dependence of the hysteretic damping on the stress of the structure. Specifically here two problems are investigated in the following way: Firstly the direct problem is solved. The direct problem is to find the maximum bending stress at the resonance when the relation of the dissipating energy (or of the hysteretic damping) vs. the bending stress is known in advance. To perform this calculation, a useful tool for the design engineer, the structure is modelled using the continuum mechanics analytical approach or the finite elements (FE) method. Then the eigenvalues are calculated and using an iterative procedure the real stress. The procedure presented here is called iterative complex eigensolution method (ICEM). Secondly the inverse problem is solved. The inverse problem is to find the relation between the hysteretic damping and the bending stress. For this purpose the logarithmic decrement is experimentally measured, the eigenvalues and the maximum bending stress of the structure, excited at the eigenvalue, when the damping is the same as the measured one, are computed using the finite elements method. Once the bending stresses are found in each discrete element of the structure, then the mathematical expression of the relation of the dissipating energy and the stresses can be specified by minimizing a suitably formed objective function. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Hysteretic damping of structures vibrating at resonance: An iterative complex eigensolution method based on damping-stress relation", "paper_id": "WOS:000251635400010"}