{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "biomedical_domains"}, {"score": 0.004747997855358171, "phrase": "intensive_care_units"}, {"score": 0.004166129325245761, "phrase": "alarm_situation"}, {"score": 0.0035376693476114733, "phrase": "intelligent_system"}, {"score": 0.0032674478600540477, "phrase": "severe_condition"}, {"score": 0.0030604342671868836, "phrase": "decision-making_process"}, {"score": 0.002826562521633885, "phrase": "diagnosis_application"}, {"score": 0.0027483472371835865, "phrase": "alarm_situations"}, {"score": 0.002722758109991685, "phrase": "patient_safety"}, {"score": 0.00263505298504827, "phrase": "retrospective_evaluation"}, {"score": 0.0024336086025284836, "phrase": "mcrdr_technology"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Knowledge-based systems", " Incremental knowledge acquisition", " Medical informatics"], "paper_abstract": "In Intensive Care Units doctors have to manage several alarm situations in patients. When a doctor analyzes the state of the patient, (s)he has to decide if there is an alarm situation and make decisions about what actions to perform. It is desirable to detect these situations before they occur, because the solution could be easier and the doctor has more time to react. An intelligent system could analyze the information, extract conclusions, format and order the causes leading to the severe condition. This would be helpful for a doctor, and would make the decision-making process easier. A system capable of performing such operations is presented here. This is not a diagnosis application but a tool to detect alarm situations for patient safety. A prototype capable of making retrospective evaluation of the condition of the patients has been developed. This system is based on the MCRDR technology, which has been extended to deal with the requirements of this domain. The evaluation of the system is also reported in this paper. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "An incremental knowledge acquisition-based system for supporting decisions in biomedical domains", "paper_id": "WOS:000277863600006"}