{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "automatic_text_summarization"}, {"score": 0.015038671490664327, "phrase": "mobile_devices"}, {"score": 0.01409963458589166, "phrase": "mobile_learning"}, {"score": 0.011757630541393364, "phrase": "text_summarization"}, {"score": 0.004775918707955445, "phrase": "mobile_learning_contexts"}, {"score": 0.004641770842098217, "phrase": "unique_merits"}, {"score": 0.004566805735863274, "phrase": "mobile_technology"}, {"score": 0.003960210592458847, "phrase": "learning_content"}, {"score": 0.0038962096720793443, "phrase": "mobile_environment"}, {"score": 0.0036503460615862574, "phrase": "textual_content"}, {"score": 0.0036207206487324506, "phrase": "mobile_learning_support"}, {"score": 0.003126623133221065, "phrase": "intelligent_tutoring_systems"}, {"score": 0.002677837900473396, "phrase": "mobile_learning_context"}, {"score": 0.0026452734009203764, "phrase": "experimental_results"}, {"score": 0.002508663916554954, "phrase": "generated_summaries"}, {"score": 0.002350152413458658, "phrase": "properly_summarized_learning_content"}, {"score": 0.002283984048569816, "phrase": "learning_achievements"}, {"score": 0.0022196745041124888, "phrase": "content_size"}, {"score": 0.0021926693625590006, "phrase": "unique_characteristics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human-computer interface", " Teaching/learning strategies", " Architectures for educational technology system", " Interactive learning environments"], "paper_abstract": "Mobile learning benefits from the unique merits of mobile devices and mobile technology to give learners capability to access information anywhere and anytime. However, mobile learning also has many challenges, especially in the processing and delivery of learning content. With the aim of making the learning content suitable for the mobile environment, this study investigates automatic text summarization to provide a tool set that reduces the quantity of textual content for mobile learning support. Text summarization is used to condense texts into the most important ideas. However, reducing the amount of content transmitted may negatively impact the meaning conveyed within. Although many solutions of text summarization have been applied by intelligent tutoring systems for learning support, few of them have been quantitatively investigated for learning achievements of learners, especially in mobile learning context. This study focuses on a methodology for investigating the effectiveness of automatic text summarization used in mobile learning context. The experimental results demonstrate that our proposed summarization approach is able to generate summaries effectively, and those generated summaries are perceived as helpful to support mobile learning. The findings of this work indicate that properly summarized learning content is not only able to satisfy learning achievements, but also able to align content size with the unique characteristics and affordances of mobile devices. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The effectiveness of automatic text summarization in mobile learning contexts", "paper_id": "WOS:000324080800022"}