{"auto_keywords": [{"score": 0.04760245961521712, "phrase": "multi-dimensional_network"}, {"score": 0.015719716506582538, "phrase": "multi-dimensional_networks"}, {"score": 0.008290297379492561, "phrase": "proposed_algorithm"}, {"score": 0.004760518730536645, "phrase": "main_aim"}, {"score": 0.004618342952383313, "phrase": "community_discovery_scheme"}, {"score": 0.004531637625717547, "phrase": "data_mining_applications"}, {"score": 0.004480394224548146, "phrase": "online_social_media"}, {"score": 0.00444655284354007, "phrase": "networked_data"}, {"score": 0.003953409087444568, "phrase": "media_entities"}, {"score": 0.0038938807148174975, "phrase": "co-citation_network"}, {"score": 0.003650687199498576, "phrase": "publication_information"}, {"score": 0.003448705829033573, "phrase": "main_contribution"}, {"score": 0.0032578629307203097, "phrase": "seed-based_community"}, {"score": 0.0030196821790309165, "phrase": "different_types"}, {"score": 0.002643888053328987, "phrase": "seed_items"}, {"score": 0.002574523719093119, "phrase": "high_quality"}, {"score": 0.002555040841339798, "phrase": "generated_communities"}, {"score": 0.002459810433812049, "phrase": "local_modularity_measure"}, {"score": 0.0023591417077156555, "phrase": "synthetic_and_real-world_data_sets"}, {"score": 0.0022369407711124775, "phrase": "experimental_results"}], "paper_keywords": ["Multi-dimensional networks", " community", " transition probability tensors", " local modularity", " affinity calculation"], "paper_abstract": "The main aim of this paper is to develop a community discovery scheme in a multi-dimensional network for data mining applications. In online social media, networked data consists of multiple dimensions/entities such as users, tags, photos, comments, and stories. We are interested in finding a group of users who interact significantly on these media entities. In a co-citation network, we are interested in finding a group of authors who relate to other authors significantly on publication information in titles, abstracts, and keywords as multiple dimensions/entities in the network. The main contribution of this paper is to propose a framework (MultiComm) to identify a seed-based community in a multi-dimensional network by evaluating the affinity between two items in the same type of entity (same dimension) or different types of entities (different dimensions) from the network. Our idea is to calculate the probabilities of visiting each item in each dimension, and compare their values to generate communities from a set of seed items. In order to evaluate a high quality of generated communities by the proposed algorithm, we develop and study a local modularity measure of a community in a multi-dimensional network. Experiments based on synthetic and real-world data sets suggest that the proposed framework is able to find a community effectively. Experimental results have also shown that the performance of the proposed algorithm is better in accuracy than the other testing algorithms in finding communities in multi-dimensional networks.", "paper_title": "MultiComm: Finding Community Structure in Multi-Dimensional Networks", "paper_id": "WOS:000333532800012"}