{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "integrated_processes"}, {"score": 0.03155609093259491, "phrase": "overland_regime"}, {"score": 0.004686791459644141, "phrase": "lumped_watershed_models"}, {"score": 0.004592905436175987, "phrase": "integrated_surface"}, {"score": 0.004500891637057374, "phrase": "surface_runoff"}, {"score": 0.0038538167879752137, "phrase": "fundamental_factors"}, {"score": 0.0037133478610481994, "phrase": "mechanistic_predictions"}, {"score": 0.00348263058839775, "phrase": "severe_limitations"}, {"score": 0.0033106223384515546, "phrase": "ad_hoc_approaches"}, {"score": 0.0031258948882273057, "phrase": "excessive_demand"}, {"score": 0.003104849179057156, "phrase": "computational_time"}, {"score": 0.0030118779844670353, "phrase": "integrated_media"}, {"score": 0.002951444412262927, "phrase": "subsurface_media"}, {"score": 0.0027492917990724467, "phrase": "rigorous_coupling_strategies"}, {"score": 0.0025609496151442696, "phrase": "modelling_surface_runoff"}, {"score": 0.0025436978068459565, "phrase": "river_hydraulics"}, {"score": 0.0024758420717852113, "phrase": "characteristic_wave_directions"}, {"score": 0.0024591621759745648, "phrase": "two-dimensional_problems"}, {"score": 0.0024016604071771556, "phrase": "high_performance_computing"}, {"score": 0.0023694065215394593, "phrase": "computational_speed"}, {"score": 0.0022145052062614514, "phrase": "theoretical_benchmark_scale"}, {"score": 0.0021921581733031514, "phrase": "parallel_computing"}, {"score": 0.0021409057190705104, "phrase": "taiwan"}, {"score": 0.0021050049856336838, "phrase": "florida"}], "paper_keywords": ["Watershed modelling", " Groundwater and surface water coupling", " High performance parallel computing", " River hydraulics", " Surface runoff", " Groundwater flow", " St. Venant equations"], "paper_abstract": "Parametric-based, lumped watershed models have been widely employed for integrated surface and groundwater modelling to calculate surface runoff on various temporal and spatial scales of hydrologic regimes. Physics-based, process-level, distributed models that have the design capability to cover multimedia and multi-processes and are applicable to various scales have been practically nonexistent until late 1990s. It has long been recognized that only such models have the potential to further the understanding of the fundamental factors that take place in nature hydrologic regimes: to give mechanistic predictions; and most importantly to be able to couple and interact with weather/climate models. However, there are severe limitations with these models that inhibit their use. These are, among other things, the ad hoc approaches of coupling between various media, the simplification of modelling overland and/or river flow, and the excessive demand of computational time. This paper presents the development of an integrated media (river/stream networks, overland regime, and subsurface media), integrated processes (evaporation, evapotranspiration, infiltration, recharges, and flows) watershed model to address these issues. Rigorous coupling strategies are described for interactions among overland regime, rivers/streams/canals networks, and subsurface media. The necessities to include various options in modelling surface runoff and river hydraulics are emphasized. The options of selecting characteristic wave directions for two-dimensional problems are stated. The implementation of high performance computing to increase the computational speed is discussed. Four examples are used to demonstrate the flexibility and efficiency of the model as applied to a theoretical benchmark scale, a parallel computing, and two project-level large scale problems - one in Taiwan and the other in Florida. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "An integrated media, integrated processes watershed model", "paper_id": "WOS:000293037100002"}