{"auto_keywords": [{"score": 0.047232975924705364, "phrase": "service_quality"}, {"score": 0.004669845451682529, "phrase": "service_providers"}, {"score": 0.00461302961851157, "phrase": "business_users"}, {"score": 0.00428629884026304, "phrase": "previous_research"}, {"score": 0.0041825926310470616, "phrase": "servqual_scale"}, {"score": 0.0041316803676012155, "phrase": "service_marketing_literature"}, {"score": 0.0035233696341819437, "phrase": "it-user_relationship"}, {"score": 0.003097865379563127, "phrase": "organizational_psychology_literature"}, {"score": 0.0030043508031729277, "phrase": "new_construct"}, {"score": 0.002895841197640062, "phrase": "theoretical_model"}, {"score": 0.0025615908073796027, "phrase": "future_empirical_research"}, {"score": 0.0021049977753042253, "phrase": "service_shortfalls"}], "paper_keywords": ["climate", " IT service climate", " service quality", " SERVQUAL"], "paper_abstract": "IT departments are service providers to business users, and service quality has been proposed as one measure of IT effectiveness. Previous research has adapted the SERVQUAL scale from service marketing literature, using it to gauge business users' expected and perceived levels of IT service quality. In this research, we investigate the other side of the IT-user relationship and look inside the IT function to identify variables that could affect IT service quality. Building on research into climate from the organizational psychology literature, we propose a new construct, IT Service Climate, and a theoretical model that links IT Service Climate with antecedents and service quality. A series of propositions are derived from the model to guide future empirical research, and other potential applications of the climate construct in IT research are discussed. By focusing on the IT department's impact on service quality, we hope to assist managers to pinpoint the causes of service shortfalls.", "paper_title": "IT service climate: An extension to IT service quality research", "paper_id": "WOS:000257774500002"}