{"auto_keywords": [{"score": 0.040063879386947346, "phrase": "literature_review"}, {"score": 0.03370683763006188, "phrase": "tiles_model"}, {"score": 0.00481495049065317, "phrase": "contextual_information"}, {"score": 0.00477513738640734, "phrase": "mobile_tourism_applications"}, {"score": 0.004619134710069517, "phrase": "-aware_mobile_applications"}, {"score": 0.004505471345843642, "phrase": "clear_and_in-depth_understanding"}, {"score": 0.004304271837157217, "phrase": "users'_requirements"}, {"score": 0.004198323646273642, "phrase": "case_application"}, {"score": 0.00396110232316167, "phrase": "tourists'_goals"}, {"score": 0.003784120134537663, "phrase": "existing_research"}, {"score": 0.003231191164622055, "phrase": "tourism-related_applications"}, {"score": 0.0029242629306714773, "phrase": "ten_factors"}, {"score": 0.0025385621498128243, "phrase": "better_understanding"}, {"score": 0.002306855521822739, "phrase": "context-aware_computing_and_information_retrieval"}, {"score": 0.002185437847413752, "phrase": "tiles"}], "paper_keywords": ["Mobile communication systems", " Information retrieval", " Tourism"], "paper_abstract": "Purpose - The design of context-aware mobile applications can be improved through a clear and in-depth understanding of context and how it can be used to meet users' requirements. Using tourism as a case application, this paper aims to address the lack of understanding of context and tourists' goals. Design/methodology/approach - This is achieved through a literature review of existing research and focus groups to gather information needs for tasks commonly executed by tourists. Findings - This paper proposes the TILES (temporal, identity, location, environmental and social) model to define and classify five main contextual types, and properties associated with each type for tourism-related applications. The TILES model (with 32 factors) derived from the analysis of the literature review is refined through inputs from two focus groups to incorporate an additional ten factors. Research implications/limitations - The TILES model can be generalised to support domains other than tourism, such as medical and edutainment. Originality/value of paper - The model will help to achieve a better understanding of context, users' information needs and their goals. In addition, this work extends findings in the field of context-aware computing and information retrieval on mobile devices. Solution providers will also be able to adopt TILES as a framework for guiding the design of their context-aware mobile applications.", "paper_title": "TILES: classifying contextual information for mobile tourism applications", "paper_id": "WOS:000273504900003"}