{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uncertain_objects"}, {"score": 0.03971446352508563, "phrase": "road_networks"}, {"score": 0.004768649568826951, "phrase": "nearest_neighbor_queries"}, {"score": 0.004413846562278824, "phrase": "mobile_smart_terminals"}, {"score": 0.004308455856718928, "phrase": "wireless_communication_technologies"}, {"score": 0.004046020290832207, "phrase": "existing_pnn-oriented_studies"}, {"score": 0.00393032656248792, "phrase": "euclidean_space"}, {"score": 0.0036730297909962142, "phrase": "first_step"}, {"score": 0.0036201167891046046, "phrase": "pnn_queries"}, {"score": 0.0034325187732054093, "phrase": "efficient_method"}, {"score": 0.0033830587647810132, "phrase": "network_voronoi_diagram"}, {"score": 0.00317681090697906, "phrase": "possible_nns"}, {"score": 0.0029117710453690827, "phrase": "npnn_queries"}, {"score": 0.002828418443899226, "phrase": "computational_method"}, {"score": 0.0027341763737751467, "phrase": "possible_nearest_object"}, {"score": 0.0025181367444581993, "phrase": "unvd."}, {"score": 0.0023530698447434308, "phrase": "real_road_networks"}], "paper_keywords": ["Nearest neighbor", " Uncertain data", " Road networks", " Voronoi diagram"], "paper_abstract": "In the past decade, probabilistic nearest neighbor (PNN) query processing has received significant research attention due to the development of mobile smart terminals and the advances in wireless communication technologies. However, to the best of our knowledge, most of the existing PNN-oriented studies are aimed, at the Euclidean space and cannot be readily extended to road networks. This paper takes the first step toward processing PNN queries in road Networks (NPNN). We first present an efficient method to construct Network Voronoi Diagram on Uncertain objects (UNVD), in which we first find the possible NNs of all the vertices, and then compute the u-edges as well as their corresponding possible NNs. Next, to process NPNN queries, we first present a computational method to calculate the probabilities for each possible nearest object, and then propose two data structures, namely gIndex and qIndex, to index the u-edges in UNVD. Finally, we evaluate the performance of our NPNN query processing methods via extensive experiments on both real road networks and synthetic 2-dimensional grid networks. Experimental results demonstrate the effectiveness and efficiency of our methods in terms of I/O cost and query time. (c) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Network Voronoi Diagram on uncertain objects for nearest neighbor queries", "paper_id": "WOS:000350929100016"}