{"auto_keywords": [{"score": 0.046363267640327735, "phrase": "existing_knowledge"}, {"score": 0.00481495049065317, "phrase": "structural_bootstrapping-a_novel"}, {"score": 0.004782718554230406, "phrase": "generative_mechanism"}, {"score": 0.003909522412849035, "phrase": "knowledge_base"}, {"score": 0.0035344448639851827, "phrase": "new_information"}, {"score": 0.003498968822873231, "phrase": "guided_guesses"}, {"score": 0.003131393466870228, "phrase": "robot_learning"}, {"score": 0.003079163348079199, "phrase": "slow_and_tedious_process"}, {"score": 0.0030176323936876317, "phrase": "current_study"}, {"score": 0.002957327365538023, "phrase": "first_time"}, {"score": 0.002937493907103812, "phrase": "general_framework"}, {"score": 0.002907992115184249, "phrase": "generative_process"}, {"score": 0.002783527398566117, "phrase": "robot's_cognitive_architecture"}, {"score": 0.0026199146891406, "phrase": "child_language_acquisition"}, {"score": 0.0025761937402886954, "phrase": "probabilistic_process"}, {"score": 0.002524688179363081, "phrase": "new_observations"}, {"score": 0.0023923066544220277, "phrase": "action-relevant_entities"}, {"score": 0.0023603078194781965, "phrase": "kitchen_scenario"}, {"score": 0.0021917966722180132, "phrase": "new_knowledge"}, {"score": 0.0021770860717929192, "phrase": "planning_operators"}, {"score": 0.0021335427588412056, "phrase": "required_motor_pattern"}, {"score": 0.0021049977753042253, "phrase": "structural_bootstrapping"}], "paper_keywords": ["Fast learning", " generative model", " knowledge acquisition"], "paper_abstract": "Humans, but also robots, learn to improve their behavior. Without existing knowledge, learning either needs to be explorative and, thus, slow or-to be more efficient-it needs to rely on supervision, which may not always be available. However, once some knowledge base exists an agent can make use of it to improve learning efficiency and speed. This happens for our children at the age of around three when they very quickly begin to assimilate new information by making guided guesses how this fits to their prior knowledge. This is a very efficient generative learning mechanism in the sense that the existing knowledge is generalized into as-yet unexplored, novel domains. So far generative learning has not been employed for robots and robot learning remains to be a slow and tedious process. The goal of the current study is to devise for the first time a general framework for a generative process that will improve learning and which can be applied at all different levels of the robot's cognitive architecture. To this end, we introduce the concept of structural bootstrapping-borrowed and modified from child language acquisition-to define a probabilistic process that uses existing knowledge together with new observations to supplement our robot's data-base with missing information about planning-, object-, as well as, action-relevant entities. In a kitchen scenario, we use the example of making batter by pouring and mixing two components and show that the agent can efficiently acquire new knowledge about planning operators, objects as well as required motor pattern for stirring by structural bootstrapping.", "paper_title": "Structural Bootstrapping-A Novel, Generative Mechanism for Faster and More Efficient Acquisition of Action-Knowledge", "paper_id": "WOS:000356164500006"}