{"auto_keywords": [{"score": 0.04966447721457641, "phrase": "temporal_logic"}, {"score": 0.028438511268610047, "phrase": "first_process"}, {"score": 0.00481495049065317, "phrase": "mobile_system_ambients"}, {"score": 0.004636867727899342, "phrase": "communicating_processes"}, {"score": 0.00457013354092966, "phrase": "specified_locations"}, {"score": 0.004543708337879809, "phrase": "mobile_telephone_systems"}, {"score": 0.004517435235940661, "phrase": "intelligent_transport_systems"}, {"score": 0.004046020290832207, "phrase": "different_locations"}, {"score": 0.0039531986393405785, "phrase": "communication_channel"}, {"score": 0.0038401488612789963, "phrase": "physical_obstacle"}, {"score": 0.0037738708560271354, "phrase": "possible_solution"}, {"score": 0.0032451751960451214, "phrase": "first_one"}, {"score": 0.003170667618004276, "phrase": "existing_communication_actions"}, {"score": 0.0030709962527878656, "phrase": "process-algebraic_approach"}, {"score": 0.002655894070657161, "phrase": "marking_message"}, {"score": 0.0024770168196064, "phrase": "second_one"}, {"score": 0.002378278511848608, "phrase": "tla"}, {"score": 0.002357632753637638, "phrase": "linear-time_temporal_logic"}, {"score": 0.0021420294823879292, "phrase": "marking_operations"}, {"score": 0.0021049977753042253, "phrase": "connectivity_checking"}], "paper_keywords": ["mobility", " locality connectivity", " possibility property", " temporal logic of actions"], "paper_abstract": "This paper considers systems consisting of communicating processes which can move between specified locations. Mobile telephone systems and intelligent transport systems are examples of them. The processes can exchange data as well as channels (e.g. frequencies) to be used in further communication. It may happen that two processes (e.g., telephones or cars) in different locations could communicate directly because they share a communication channel, but they cannot as there is a physical obstacle between the locations. A possible solution is to allow one process to send a message to another one through other processes and locations. To see if this is possible, a notion of connectivity of processes has been devised in the literature. A process was defined to be connectable to another one if a message from the first one could reach the other one by using any existing communication actions, allowed locations, and process moves in the system. A process-algebraic approach for checking connectivity was proposed. In this paper, it is shown how the temporal logic of actions (TLA) can be employed for the same purpose. In both approaches, connectivity of a process with another one is basically checked as follows. The first process includes a marking message in all its sending actions. Every process that receives this message gets marked and includes it in its own sending actions. The first process is connectable to the second one if there exists such a system execution sequence that the latter gets marked in it. Since TLA is a linear-time temporal logic, it can generally not express such a property. This paper, however, shows that it can be expressed and verified for a given TLA system specification. It also shows how to specify the marking operations and provides an example of connectivity checking.", "paper_title": "Checking connectivity in mobile system ambients with the temporal logic of actions", "paper_id": "WOS:000242507100058"}