{"auto_keywords": [{"score": 0.03220283258333382, "phrase": "amp_algorithm"}, {"score": 0.013696092941818398, "phrase": "incompressible_flow"}, {"score": 0.012868560394026243, "phrase": "structural_shells"}, {"score": 0.00481495049065317, "phrase": "new_stable_partitioned_algorithm"}, {"score": 0.004771977458684802, "phrase": "fsi"}, {"score": 0.004342430078306461, "phrase": "two-part_paper"}, {"score": 0.004133055661437163, "phrase": "compressible_elastic_solids"}, {"score": 0.0038810583785936505, "phrase": "numerical_approach"}, {"score": 0.003531474887552889, "phrase": "governing_equations"}, {"score": 0.0029901699209266435, "phrase": "linearized_fsi_model_problems"}, {"score": 0.00295008998986066, "phrase": "normal_mode_analysis"}, {"score": 0.0028586409810976367, "phrase": "new_amp_algorithm"}, {"score": 0.0027206133859493725, "phrase": "added-mass_effects"}, {"score": 0.0026600905156986317, "phrase": "traveling_wave_solutions"}, {"score": 0.0026009105281485888, "phrase": "fsi_model_problems"}, {"score": 0.0024311346712789553, "phrase": "corresponding_numerical_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Fluid-structure interaction", " Added mass instability", " Incompressible fluid flow", " Structures", " Shells", " Beams"], "paper_abstract": "Stable partitioned algorithms for fluid-structure interaction (FSI) problems are developed and analyzed in this two-part paper. Part I describes an algorithm for incompressible flow coupled with compressible elastic solids, while Part II discusses an algorithm for incompressible flow coupled with structural shells. The numerical approach described here for structural shells uses Robin (mixed) interface conditions for the pressure and velocity in the fluid which are derived directly from the governing equations. The resulting added-mass partitioned (AMP) algorithm is stable even for very light structures, requires no subiterations per time step, and is second-order accurate. The stability and accuracy of the AMP algorithm is evaluated for linearized FSI model problems. A normal mode analysis is performed to show that the new AMP algorithm is stable, even for the case of very light structures when added-mass effects are large. Exact traveling wave solutions are derived for the FSI model problems, and these solutions are used to verify the stability and accuracy of the corresponding numerical results obtained from the AMP algorithm for the cases of light, medium and heavy structures. A summary comparison of the AMP algorithm developed here and the one in Part I is provided. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "An analysis of a new stable partitioned algorithm for FSI problems. Part II: Incompressible flow and structural shells", "paper_id": "WOS:000334586800019"}