{"auto_keywords": [{"score": 0.04709232847739741, "phrase": "theoretical_constructs"}, {"score": 0.004009288598277725, "phrase": "foundational_elements"}, {"score": 0.00393066798511457, "phrase": "field's_core_theories"}, {"score": 0.0037593414153801394, "phrase": "evaluation_metrics"}, {"score": 0.003371220210416809, "phrase": "intellectual_perspective"}, {"score": 0.0033379819706003885, "phrase": "theoretical_orientation"}, {"score": 0.0032887360307856635, "phrase": "intellectual_perspectives"}, {"score": 0.003053159610975692, "phrase": "theoretical_orientations"}, {"score": 0.002336071138145897, "phrase": "contradictory_constructs"}, {"score": 0.002168586864007222, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "information_retrieval_fields"}], "paper_keywords": [""], "paper_abstract": "In this article, we identify, compare, and contrast theoretical constructs for the fields of information searching and information retrieval to emphasize the uniqueness of and synergy between the fields. Theoretical constructs are the foundational elements that underpin a field's core theories, models, assumptions, methodologies, and evaluation metrics. We provide a framework to compare and contrast the theoretical constructs in the fields of information searching and information retrieval using intellectual perspective and theoretical orientation. The intellectual perspectives are information searching, information retrieval, and cross-cutting; and the theoretical orientations are information, people, and technology. Using this framework, we identify 17 significant constructs in these fields contrasting the differences and comparing the similarities. We discuss the impact of the interplay among these constructs for moving research forward within both fields. Although there is tension between the fields due to contradictory constructs, an examination shows a trend toward convergence. We discuss the implications for future research within the information searching and information retrieval fields.", "paper_title": "The Seventeen Theoretical Constructs of Information Searching and Information Retrieval", "paper_id": "WOS:000280019100001"}