{"auto_keywords": [{"score": 0.0044991925146184025, "phrase": "density_functional_theory_calculations"}, {"score": 0.0039281997063335735, "phrase": "possible_improvement"}, {"score": 0.003738973626996355, "phrase": "phase_separation"}, {"score": 0.003204232566468624, "phrase": "corresponding_ones"}, {"score": 0.0030309961956273028, "phrase": "native_electronic_structures"}, {"score": 0.0029937855454238507, "phrase": "phase-separated_homo-lumo_states"}, {"score": 0.002831894638104635, "phrase": "surface_lattices"}, {"score": 0.002678734566245688, "phrase": "homo_and_lumo_levels"}, {"score": 0.0023673186566801102, "phrase": "homo-lumo"}, {"score": 0.002144400314994328, "phrase": "homo_state"}, {"score": 0.0021049977753042253, "phrase": "interface_region"}], "paper_keywords": ["Mixed-phase materials", " Photocatalysis", " Photogenerated electrons/holes", " Titanium dioxide"], "paper_abstract": "In this work, density functional theory calculations have been performed to study the geometric, electronic, and energetic properties of two-phase TiO2 composites built by joining two single-phase TiO2 slabs, aiming at verifying possible improvement of the photo-activities of the composites through phase separation of excitons. We find that such desired electronic properties can be determined by several factors. When both the HOMO and LUMO levels of one of the two single-phase TiO2 slabs are higher than the corresponding ones of the other, the composite may have native electronic structures with phase-separated HOMO-LUMO states, especially when the two slabs exhibit highly matched surface lattices. For those pairs of TiO2 slabs with the HOMO and LUMO levels of one phase being within the range of those of the other, though the energetically favored composite give HOMO-LUMO states within one phase, one may still be able to separate them and move the HOMO state to the interface region by destabilizing the interactions between the two slabs.", "paper_title": "Density functional theory study of mixed-phase TiO2: heterostructures and electronic properties", "paper_id": "WOS:000334934900003"}