{"auto_keywords": [{"score": 0.0496729815270419, "phrase": "model_transformations"}, {"score": 0.03391828205759681, "phrase": "transformation_templates"}, {"score": 0.00481495049065317, "phrase": "flexible_reuse"}, {"score": 0.004633888966463624, "phrase": "graph_transformation"}, {"score": 0.004459605573798577, "phrase": "model-driven_engineering"}, {"score": 0.0037287578312533596, "phrase": "previous_works"}, {"score": 0.0036501160751879784, "phrase": "reutilization_approach"}, {"score": 0.0036191240628152205, "phrase": "graph_transformations"}, {"score": 0.0034532961266947734, "phrase": "structural_requirements"}, {"score": 0.003309124298009635, "phrase": "reusable_transformations"}, {"score": 0.0030645676308053444, "phrase": "concrete_meta-model"}, {"score": 0.0027078974645805736, "phrase": "reuse_opportunities"}, {"score": 0.0026058621464926826, "phrase": "algebraic_adapters"}, {"score": 0.002159623311924437, "phrase": "transformation_reuse"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Model-driven engineering", " Graph transformation", " Meta-modelling", " Genericity", " Reusability"], "paper_abstract": "Model transformations are the heart and soul of Model-Driven Engineering (MDE). However, in order to increase the adoption of MDE by industry, techniques for developing model transformations in the large and raising the quality and productivity in their construction, like reusability, are still needed. In previous works, we developed a reutilization approach for graph transformations based on the definition of concepts, which gather the structural requirements needed by meta-models to qualify for the transformations. Reusable transformations are typed by concepts, becoming transformation templates. Transformation templates are instantiated by binding the concept to a concrete meta-model, inducing a retyping of the transformation for the given meta-model. This paper extends the approach allowing heterogeneities between the concept and the meta-model, thus increasing the reuse opportunities of transformation templates. Heterogeneities are resolved by using algebraic adapters which induce both a retyping and an adaptation of the transformation. As an alternative, the adapters can also be employed to induce an adaptation of the meta-model, and in this work we show the conditions for equivalence of both approaches to transformation reuse. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Towards the flexible reuse of model transformations: A formal approach based on graph transformation", "paper_id": "WOS:000345179400005"}