{"auto_keywords": [{"score": 0.046232683509134974, "phrase": "amail"}, {"score": 0.008713768692145006, "phrase": "iterative_design"}, {"score": 0.006016640628234034, "phrase": "usage_patterns"}, {"score": 0.004770461993586338, "phrase": "field_trial_of"}, {"score": 0.004726382602809228, "phrase": "aphasia-friendly_email_tool"}, {"score": 0.00398028819691605, "phrase": "eight_persons"}, {"score": 0.0036951530348821116, "phrase": "subjective_data"}, {"score": 0.002997735656669146, "phrase": "study_period"}, {"score": 0.0028350413546400703, "phrase": "composed_email_messages"}, {"score": 0.0026195184143518713, "phrase": "email_partners"}, {"score": 0.0022889103976458437, "phrase": "social_contacts"}, {"score": 0.0021049977753042253, "phrase": "field_trial"}], "paper_keywords": ["Aphasia", " email", " field evaluation", " augmentative and alternative communication", " assistive technology"], "paper_abstract": "In this article, we describe the iterative design and field trial of Amail, an email client specifically designed for people with aphasia who have problems expressing themselves verbally. We conducted a 3-month study with eight persons with aphasia to better understand how people with aphasia could integrate Amail in their daily life. Subjective data (questionnaires, interviews, and diaries) and objective data (usage logs) were collected to gain understanding of the usage patterns. All persons with aphasia in our study were able to use Amail independently, and four participants continued using Amail after the study period. The usage patterns, especially the frequency and length of the composed email messages, indicated that, over time, persons with aphasia were able to improve their email communication. Email partners also had the impression that their email partners with aphasia were improving gradually. Last but not least, the use of Amail positively influenced the number and quality of social contacts for the persons with aphasia. We also report some of the challenges encountered while conducting the field trial.", "paper_title": "Iterative Design and Field Trial of an Aphasia-Friendly Email Tool", "paper_id": "WOS:000365223700002"}