{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "authentic_online_reviews"}, {"score": 0.021507508852899912, "phrase": "manipulative_ones"}, {"score": 0.016038172859153054, "phrase": "authentic_and_manipulative_reviews"}, {"score": 0.010088596017003565, "phrase": "textual_characteristics"}, {"score": 0.00974104393451093, "phrase": "positive_and_negative_comments"}, {"score": 0.009553109590740067, "phrase": "theoretical_framework"}, {"score": 0.004777392826700429, "phrase": "purpose_-_the_purpose"}, {"score": 0.00454027551702508, "phrase": "online_reviews"}, {"score": 0.004487241576747549, "phrase": "authentic_entries"}, {"score": 0.0038363485899400285, "phrase": "positive_reviews"}, {"score": 0.003703380599999214, "phrase": "negative_reviews"}, {"score": 0.0036600862989330106, "phrase": "competing_offerings"}, {"score": 0.0036315039559860654, "phrase": "logistic_regression"}, {"score": 0.0034782306784111525, "phrase": "useful_insights"}, {"score": 0.0031658283119347396, "phrase": "negative_entries"}, {"score": 0.0030084563186769764, "phrase": "writing_style"}, {"score": 0.0029500270981001058, "phrase": "positive_entries"}, {"score": 0.002748895580860912, "phrase": "data_sets"}, {"score": 0.002612194827110595, "phrase": "earliest_attempts"}, {"score": 0.0025215486544004134, "phrase": "prior_research"}, {"score": 0.002349561762300369, "phrase": "specific_differences"}, {"score": 0.002129936623155594, "phrase": "nuanced_insights"}, {"score": 0.0021049977753042253, "phrase": "research_area"}], "paper_keywords": ["Informativeness", " Theoretical framework", " Online reviews", " Comprehensibility", " User-generated content", " Writing style"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the extent to which textual characteristics of online reviews help identify authentic entries from manipulative ones across positive and negative comments. Design/methodology/approach - A theoretical framework is proposed to identify authentic online reviews from manipulative ones based on three textual characteristics, namely, comprehensibility, informativeness, and writing style. The framework is tested using two publicly available data sets, one comprising positive reviews to hype own offerings, and the other including negative reviews to slander competing offerings. Logistic regression is used for analysis. Findings - The three textual characteristics offered useful insights to identify authentic online reviews from manipulative ones. In particular, the differences between authentic and manipulative reviews in terms of comprehensibility and informativeness were more conspicuous for negative entries. On the other hand, the differences between authentic and manipulative reviews in terms of writing style were more conspicuous for positive entries. Research limitations/implications - The findings of this paper are somewhat constrained by the scope of the data sets used for analysis. Originality/value - The paper represents one of the earliest attempts to develop a theoretical framework to identify authentic online reviews. Prior research has shed light on ways to classify reviews as authentic or manipulative. However, literature on specific differences between the two in terms of textual characteristics is relatively limited. Moreover, by suggesting differences between authentic and manipulative reviews across positive and negative comments, the findings offer nuanced insights into a research area that is growing in importance.", "paper_title": "A theoretical framework to identify authentic online reviews", "paper_id": "WOS:000342002300003"}