{"auto_keywords": [{"score": 0.04787512667071583, "phrase": "first-order_logic"}, {"score": 0.0074500585692713495, "phrase": "hamiltonicity"}, {"score": 0.00481495049065317, "phrase": "almost_all_graphs"}, {"score": 0.0045543038764903005, "phrase": "lindstrom"}, {"score": 0.00445783412174435, "phrase": "sufficient_conditions"}, {"score": 0.00440093312826378, "phrase": "quantifier_q"}, {"score": 0.004344755264641137, "phrase": "graph_property"}, {"score": 0.003191345219585946, "phrase": "blass"}, {"score": 0.003164096570232296, "phrase": "harary"}, {"score": 0.002665305036900055, "phrase": "abstract_model_theory"}, {"score": 0.0024148618915672353, "phrase": "vectorized_quantifiers"}, {"score": 0.0021692000054033956, "phrase": "positive_results"}, {"score": 0.0021231452870210965, "phrase": "infinitary_logic"}, {"score": 0.0021049977753042253, "phrase": "finitely_many_variables"}], "paper_keywords": [""], "paper_abstract": "We study 0-1 laws for extensions of first-order logic by Lindstrom quantifiers. We state sufficient conditions on a quantifier Q expressing a graph property, for the logic FO[Q] - the extension of first-order logic by means of the quantifier Q - to have a 0-1 law. We use these conditions to show, in particular, that FO[Rig], where Rig is the quantifier expressing rigidity, has a 0-1 law. We also show that extensions of first-order logic with quantifiers for Hamiltonicity, regularity and self-complementarity of graphs do not have a 0-1 law. Blass and Harary pose the question whether there is a logic which is powerful enough to express Hamiltonicity or rigidity and which has a 0-1 law. It is a consequence of our results that there is no such regular logic ( in the sense of abstract model theory) in the case of Hamiltonicity, but there is one in the case of rigidity. We also consider sequences of vectorized quantifiers, and show that the extensions of first-order logic obtained by adding such sequences generated by quantifiers that are closed under substructures have 0-1 laws. The positive results also extend to the infinitary logic with finitely many variables.", "paper_title": "Properties of Almost All Graphs and Generalized Quantifiers", "paper_id": "WOS:000276350500003"}