{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linguistic_decision_analysis"}, {"score": 0.03434389783337282, "phrase": "sensory_evaluation"}, {"score": 0.004713162564945179, "phrase": "evaluation_processes"}, {"score": 0.004548253531664032, "phrase": "quality_inspection"}, {"score": 0.004420472010542188, "phrase": "marketing_exploitation"}, {"score": 0.004296264970612285, "phrase": "industrial_companies"}, {"score": 0.003725470458263889, "phrase": "human_senses"}, {"score": 0.002986461855862617, "phrase": "uncertain_knowledge"}, {"score": 0.002923214590192792, "phrase": "evaluation_process"}, {"score": 0.0027413748388534025, "phrase": "human_perceptions"}, {"score": 0.0025525322651112365, "phrase": "decision_analysis_techniques"}], "paper_keywords": ["sensory evaluation", " decision analysis", " fuzzy linguistic approach", " linguistic variables", " linguistic 2-tuple representation model"], "paper_abstract": "The evaluation processes are widely used for quality inspection, design, marketing exploitation and other fields in industrial companies. In many of these fields the items, products, designs, etc., are evaluated according to the knowledge acquired via human senses (sight, taste, touch, smell and hearing), in such cases, we talk about sensory evaluation, in it an important problem arises as it is the modelling and management of uncertain knowledge in the evaluation process, because the information acquired by our senses throughout human perceptions always involves uncertainty, vagueness and imprecision. The decision analysis techniques have been utilized in many evaluation processes, hence this paper proposes and shows the application of the linguistic decision analysis to sensory evaluation and its advantages, particularly based on the linguistic 2-tuple representation model, in order to model and manage consistently the uncertainty and vagueness of the information in this type of problems. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Sensory evaluation based on linguistic decision analysis", "paper_id": "WOS:000244270900005"}