{"auto_keywords": [{"score": 0.030601603444224315, "phrase": "causal_responsibility"}, {"score": 0.012683688529133819, "phrase": "input_tables"}, {"score": 0.00809421549792572, "phrase": "functional_dependencies"}, {"score": 0.00481495049065317, "phrase": "self-join-free_conjunctive_queries"}, {"score": 0.004658426838467567, "phrase": "data_management"}, {"score": 0.004328494656899359, "phrase": "example_applications"}, {"score": 0.004281053243493438, "phrase": "query_results"}, {"score": 0.004096409451697279, "phrase": "important_aspect"}, {"score": 0.003948613642680196, "phrase": "minimum_number"}, {"score": 0.0034464962568390265, "phrase": "-join-free_conjunctive_queries"}, {"score": 0.003297728079517964, "phrase": "novel_concept"}, {"score": 0.002985988377995789, "phrase": "resilience_bridge"}, {"score": 0.0029100802280971065, "phrase": "deletion_propagation"}, {"score": 0.0027946649584841754, "phrase": "known_complexity_results"}, {"score": 0.0026059610060579145, "phrase": "previously_unknown_tractable_families"}, {"score": 0.002558450494671067, "phrase": "source_side-effects"}, {"score": 0.0023768935613577985, "phrase": "previous_dichotomy"}, {"score": 0.0023164335087514252, "phrase": "revised_characterization"}, {"score": 0.0022741894748181243, "phrase": "structural_form"}], "paper_keywords": [""], "paper_abstract": "Several research thrusts in the area of data management have focused on understanding how changes in the data affect the output of a view or standing query. Example applications are explaining query results, propagating updates through views, and anonymizing datasets. An important aspect of this analysis is the problem of deleting a minimum number of tuples from the input tables to make a given Boolean query false, which we refer to as \"the resilience of a query.\" In this paper, we study the complexity of resilience for self-join-free conjunctive queries with arbitrary functional dependencies. The cornerstone of our work is the novel concept of triads, a simple structural property of a query that leads to the several dichotomy results we show in this paper. The concepts of triads and resilience bridge the connections between the problems of deletion propagation and causal responsibility, and allow us to substantially advance the known complexity results in these topics. Specifically, we show a dichotomy for the complexity of resilience, which identifies previously unknown tractable families for deletion propagation with source side-effects, and we extend this result to account for functional dependencies. Further, we identify a mistake in a previous dichotomy for causal responsibility, and offer a revised characterization based purely on the structural form of the query (presence or absence of triads). Finally, we extend the dichotomy for causal responsibility in two ways: (a) we account for functional dependencies in the input tables, and (b) we compute responsibility for sets of tuples specified via wildcards.", "paper_title": "The Complexity of Resilience and Responsibility for Self-Join-Free Conjunctive Queries", "paper_id": "WOS:000386425900009"}