{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "customer_capital"}, {"score": 0.009990761384397452, "phrase": "causal_relationships"}, {"score": 0.006465539656735535, "phrase": "customers'_needs"}, {"score": 0.006422153978596597, "phrase": "customer_service_capability"}, {"score": 0.0062725695770598465, "phrase": "customer_information_system"}, {"score": 0.006230470664820991, "phrase": "market_intensity"}, {"score": 0.006167848201174854, "phrase": "customer_loyalty"}, {"score": 0.00483910285091615, "phrase": "different_aspects"}, {"score": 0.004577440795549049, "phrase": "unified_framework"}, {"score": 0.004500891637057374, "phrase": "six_aspects"}, {"score": 0.004081385289516914, "phrase": "financial_holding_company"}, {"score": 0.004040275465056206, "phrase": "emerging_market"}, {"score": 0.003999578057088828, "phrase": "successful_customer_relationship_management"}, {"score": 0.003919404114585274, "phrase": "case_study_object"}, {"score": 0.0036883616416213206, "phrase": "junior_sales_manager"}, {"score": 0.003626626504149897, "phrase": "corporate_banking_group"}, {"score": 0.0034944094552943, "phrase": "valid_return_rate"}, {"score": 0.0034359094594153304, "phrase": "total_number"}, {"score": 0.003355645563101351, "phrase": "partial_least_squares_method"}, {"score": 0.00314708280192844, "phrase": "authors'_predictions"}, {"score": 0.003032295420569351, "phrase": "base_aspect"}, {"score": 0.002442594378453517, "phrase": "leading_aspects"}, {"score": 0.002345500021653278, "phrase": "lag_indicators"}, {"score": 0.002306189434657134, "phrase": "proposed_cause-effect_model"}, {"score": 0.002148136905808445, "phrase": "customer_relationship_management"}, {"score": 0.002126458181856629, "phrase": "integrated_perspective"}, {"score": 0.0021049977753042253, "phrase": "causal_relationship_model"}], "paper_keywords": ["Customer relationship management", " Customer service management", " Customer information", " Customer capital", " Causal relationship model", " Business-to-business"], "paper_abstract": "Purpose - The purpose of this paper is to propose and test a unified framework of the causal relationships among six aspects of customer capital: customer targeting, ability to identify customers' needs, customer service capability, construction and management of a customer information system, market intensity, and customer loyalty. Design/methodology/approach - A financial holding company in an emerging market, with successful customer relationship management, is selected as the case study object. The authors interviewed the management and distributed questionnaires to positions equivalent to or higher than the junior sales manager within two divisions of the corporate banking group. A total of 80 questionnaires were distributed, with a valid return rate of 73.75 per cent. The total number of subjects is 59 and the partial least squares method was adopted to examine the causal relationships between the different aspects of customer capital. Findings - The results support the authors' predictions on the causal relationships among the aspects of customer capital. The base aspect, customer targeting, significantly influences the ability to identify customers' needs and construction and management of a customer information system. These two aspects directly affect customer service capability, which further improves customer loyalty and market intensity. The authors also identify several indicators within each aspect to assist management in exploring areas for improvement. Practical implications - The evidence implies that a business should manage and control the leading aspects of customer capital, as this will help to improve and develop lag indicators. Based on the proposed cause-effect model, relevant capital elements can be identified which effectively enhance business-to-business (B2B) customer relationship management. Originality/value - The paper investigates the issue of customer relationship management from an integrated perspective. A causal relationship model of customer capital is developed and evidence provided on how different aspects of customer capital are linked to each other.", "paper_title": "The causal relationships between aspects of customer capital", "paper_id": "WOS:000308336300009"}