{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "neutral_trust_management_framework"}, {"score": 0.004696608876994947, "phrase": "free-rider_problem"}, {"score": 0.004558414405811025, "phrase": "unstructured_networks"}, {"score": 0.004424268136268051, "phrase": "peer-to-peer_networks"}, {"score": 0.004209369306023422, "phrase": "trust_management_framework"}, {"score": 0.0038102613924627647, "phrase": "existing_trust_management_framework"}, {"score": 0.0036980501827538455, "phrase": "establishment_framework"}, {"score": 0.003661382948704217, "phrase": "reputation-based_framework"}, {"score": 0.0032486392192981944, "phrase": "network_system"}, {"score": 0.002634830238219976, "phrase": "trust_management"}, {"score": 0.0025827837420330816, "phrase": "typical_unstructured_networks"}, {"score": 0.002396595990121527, "phrase": "manet"}, {"score": 0.002349228457383314, "phrase": "clarified_design_requirements"}, {"score": 0.0021474369836979048, "phrase": "location-dependent_attack"}, {"score": 0.002105002059666301, "phrase": "manet."}], "paper_keywords": ["Neutrality", " Trust", " Trust management framework", " Unstructured network"], "paper_abstract": "Free-rider problem greatly influences the performance of unstructured networks (like ad hoc or peer-to-peer networks). To solve such problem, we focus on trust management framework, which is intended to stimulate nodes to cooperate with each other and prevent free-riders. Currently, the existing trust management framework can be classified into trust establishment framework and reputation-based framework. None of them, however, was explicitly designed with the considerations on neutrality, which is indispensable issue when devising a network system. Therefore, we attempt to march towards the design of neutral trust management framework in this paper. We firstly investigate the relation between neutrality and trust definition, and identify the requirements for design of neutral trust management framework. Then, we focus on trust management of one kind of typical unstructured networks, mobile ad hoc network (MANET). We design a neutral trust management framework of MANET to meet the clarified design requirements. Further, we perform analysis on our proposed framework, which shows our proposal can achieve neutrality under the location-dependent attack of free-rider in MANET.", "paper_title": "Requirements and design for neutral trust management framework in unstructured networks", "paper_id": "WOS:000319075500004"}