{"auto_keywords": [{"score": 0.04936538823130262, "phrase": "two-way_relay_channel"}, {"score": 0.00783453568823928, "phrase": "optimal_dm-tradeoff"}, {"score": 0.006960644492621748, "phrase": "achievable_rate"}, {"score": 0.00481495049065317, "phrase": "diversity-multiplexing_tradeoff"}, {"score": 0.004020492138367616, "phrase": "optimal_relay_transmission_strategies"}, {"score": 0.0035648266669315943, "phrase": "optimal_diversity-multiplexing_tradeoff"}, {"score": 0.003356760857259213, "phrase": "af"}, {"score": 0.003306559295382181, "phrase": "iterative_algorithm"}, {"score": 0.0032085525502105836, "phrase": "power_minimization_problem"}, {"score": 0.0031606404966938568, "phrase": "minimum_signal-to-interference-and-noise_ratio_constraints"}, {"score": 0.0024842242921857705, "phrase": "capacity_region"}, {"score": 0.0023507916951658455, "phrase": "compress_and_forward_strategy"}, {"score": 0.00223570488212345, "phrase": "full-duplex_two-way_relay_channel"}, {"score": 0.0021049977753042253, "phrase": "half-duplex_case"}], "paper_keywords": ["Capacity", " distributed beamforming", " diversity-multiplexing tradeoff", " relay channel", " two-way relay channel"], "paper_abstract": "In a two-way relay channel, two sources use one or more relay nodes to exchange data with each other. This paper considers a multiple input multiple output (MIMO) two-way relay channel, where each relay node has one or more antennas. Optimal relay transmission strategies for the two-way relay channel are derived to maximize the achievable rate with amplify and forward (AF) at each relay and to achieve the optimal diversity-multiplexing tradeoff (DM-tradeoff). To maximize the achievable rate with AF, an iterative algorithm is proposed which solves a power minimization problem subject to minimum signal-to-interference-and-noise ratio constraints at every step. The power minimization problem is nonconvex. The Karush Kuhn Tucker conditions, however, are shown to be sufficient for optimality. Capacity scaling law of the two-way relay channel with increasing number of relays is also established by deriving a lower and upper bound on the capacity region of the two-way relay channel. To achieve the optimal DM-tradeoff, a compress and forward strategy is proposed and its DM-tradeoff is derived. For the full-duplex two-way relay channel, the proposed strategy achieves the optimal DM-tradeoff, while for the half-duplex case the proposed strategy is shown to achieve the optimal DM-tradeoff under some conditions.", "paper_title": "On the Capacity and Diversity-Multiplexing Tradeoff of the Two-Way Relay Channel", "paper_id": "WOS:000291922500014"}