{"auto_keywords": [{"score": 0.015521816488218496, "phrase": "job_characteristic_preferences"}, {"score": 0.00481495049065317, "phrase": "career_anchors"}, {"score": 0.004263168852219819, "phrase": "excellent_information_systems"}, {"score": 0.004076157223660074, "phrase": "key_issues"}, {"score": 0.003631945391344252, "phrase": "principal_sources"}, {"score": 0.0033629596848275597, "phrase": "taiwan"}, {"score": 0.00315401368091396, "phrase": "mba"}, {"score": 0.0030938932434437178, "phrase": "research_subjects"}, {"score": 0.0023934306706217797, "phrase": "career_development"}, {"score": 0.002347775213789611, "phrase": "job_characteristics"}, {"score": 0.0021597662797996843, "phrase": "useful_understanding"}, {"score": 0.0021322065604537617, "phrase": "future_careers"}, {"score": 0.0021049977753042253, "phrase": "job_positions"}], "paper_keywords": ["career anchors", " job characteristic preferences", " information systems students"], "paper_abstract": "Taiwan's information technology (IT) industry was ranked second worldwide in the 2004 Business Week Information Technology 100. Attracting and retaining excellent Information Systems (IS) employees have become key issues for enterprises which have been discussed in many reasearch papers. Considering that IS students are one of the principal sources of IS employees, this study embraces all types of IS students in Taiwan, namely undergraduate, graduate, and the executive MBA students as research subjects. Their different career anchors and job characteristic preferences are then compared to explore the relationships between these two aspects. From the findings of this study, IS educators can design more appropriate courses while employers could set up strategies and work conditions to accommodate the career development and expected job characteristics of IS students. On the other hand, students themselves may gain a useful understanding for future careers and job positions in organizations.", "paper_title": "A study of career anchors and job characteristic preferences of IS students", "paper_id": "WOS:000246678000004"}