{"auto_keywords": [{"score": 0.04912022901915926, "phrase": "silico_pharmacology"}, {"score": 0.04817933632734092, "phrase": "bioactive_ligands"}, {"score": 0.004815069196485055, "phrase": "ligand"}, {"score": 0.004577440795549049, "phrase": "valuable_and_increasingly_accessible_source"}, {"score": 0.0045160988337296605, "phrase": "protein_targets"}, {"score": 0.004178935413340453, "phrase": "bibliographical_sources"}, {"score": 0.0040951809276235495, "phrase": "annotated_chemical_library"}, {"score": 0.003999578057088828, "phrase": "recently_reported_shed_molecular_descriptors"}, {"score": 0.003932654396285872, "phrase": "ligand_information"}, {"score": 0.0038278890186559276, "phrase": "nuclear_receptor_concern"}, {"score": 0.003401278997237025, "phrase": "nuclear_receptor"}, {"score": 0.0033218213825698417, "phrase": "linkage_map"}, {"score": 0.003255189076644247, "phrase": "interaction_network"}, {"score": 0.0032332756920184177, "phrase": "nuclear_receptors"}, {"score": 0.00314708280192844, "phrase": "ligand-based_approach"}, {"score": 0.002951444412262927, "phrase": "ion_channels"}, {"score": 0.002648974977491828, "phrase": "ligand-based_nuclear_receptor_profiling"}, {"score": 0.0023935561037315375, "phrase": "bibliographical_evidence"}, {"score": 0.0022984065518052476, "phrase": "potential_off-target_residual_affinity"}, {"score": 0.002222004614440872, "phrase": "present_findings"}, {"score": 0.002199582070223336, "phrase": "ligand-based_approaches"}, {"score": 0.0021408862709571615, "phrase": "promising_means"}, {"score": 0.0021049977753042253, "phrase": "novel_tools"}], "paper_keywords": [""], "paper_abstract": "Bioactive ligands are a valuable and increasingly accessible source of information about protein targets. On the basis of this statement, a list of 25 nuclear receptors was described by a series of bioactive ligands extracted directly from bibliographical sources, stored properly in an annotated chemical library, and mathematically represented using the recently reported SHED molecular descriptors. Analysis of this ligand information allowed for derivation of a threshold of nuclear receptor concern. If the similarity of one molecule to any of the molecules annotated to one particular nuclear receptor is below that threshold, the molecule receives an alert on the probability of having affinity below 10 AM for that nuclear receptor. On this basis, a linkage map was constructed that reveals the interaction network of nuclear receptors from the perspective of their active ligands. This ligand-based approach to nuclear receptor profiling was subsequently applied to four external chemical libraries of 10 000 molecules targeted to proteases, kinases, ion channels, and G protein-coupled receptors. The percentage of each library that returned an alert on at least one nuclear receptor was reasonably low and varied between 4.4 and 9.7%. In addition, ligand-based nuclear receptor profiling of a set of 2944 drugs provided an alert for 153 drugs. For some of them, namely, acitretin, telmisartan, phenyltoloxamine, tazarotene, and flumazenil, bibliographical evidence could be found indicating that those drugs may indeed have some potential off-target residual affinity for the nuclear receptors annotated. Overall, the present findings suggest that ligand-based approaches to protein family profiling appear as a promising means toward the establishment of novel tools for in silico pharmacology.", "paper_title": "Ligand-based approach to in silico pharmacology: nuclear receptor profiling", "paper_id": "WOS:000242298100050"}