{"auto_keywords": [{"score": 0.03762867376091313, "phrase": "polynomial_expected_time"}, {"score": 0.03310342048452109, "phrase": "multiplicity_detection"}, {"score": 0.03093166086339985, "phrase": "gathering_algorithm"}, {"score": 0.02889812183092541, "phrase": "local-weak_multiplicity_detection"}, {"score": 0.00481495049065317, "phrase": "polynomial-time_randomized"}, {"score": 0.004762202897268383, "phrase": "oblivious_mobile_robots"}, {"score": 0.004624337472244542, "phrase": "n_anonymous_and_oblivious_mobile_robots"}, {"score": 0.004473982381245469, "phrase": "finite_time"}, {"score": 0.004424953471635011, "phrase": "nonpredefined_point"}, {"score": 0.004360412703519539, "phrase": "gathering_problem"}, {"score": 0.004218602458288531, "phrase": "additional_capabilities"}, {"score": 0.0041418132064539185, "phrase": "randomized_approaches"}, {"score": 0.003977741661623133, "phrase": "randomized_solutions"}, {"score": 0.0039053194919285725, "phrase": "time_complexity"}, {"score": 0.0037921662574137535, "phrase": "additional_assumption"}, {"score": 0.003601951458683923, "phrase": "randomized_gathering_algorithm"}, {"score": 0.003433847524648519, "phrase": "minimal_additional_assumption"}, {"score": 0.003213920601037463, "phrase": "multiplicity-detection_capabilities"}, {"score": 0.002558450494671067, "phrase": "constant-round_gathering_algorithm"}, {"score": 0.002539689093411356, "phrase": "local-strong_multiplicity_detection"}, {"score": 0.0021049977753042253, "phrase": "constant_number"}], "paper_keywords": ["Distributed algorithm", " autonomous mobile robots", " gathering problem", " randomized algorithm"], "paper_abstract": "We consider the problem of gathering n anonymous and oblivious mobile robots, which requires that all robots meet in finite time at a nonpredefined point. While the gathering problem cannot be solved deterministically without assuming any additional capabilities for the robots, randomized approaches easily allow it to be solvable. However, the randomized solutions currently known have a time complexity that is exponential in n with no additional assumption. This fact yields the following two questions: Is it possible to construct a randomized gathering algorithm with polynomial expected time? If it is not possible, what is the minimal additional assumption necessary to obtain such an algorithm? In this paper, we address these questions from the aspect of multiplicity-detection capabilities. We newly introduce two weaker variants of multiplicity detection, called local-strong and local-weak multiplicity, and investigate whether those capabilities permit a gathering algorithm with polynomial expected time or not. The contribution of this paper is to show that any algorithm only assuming local-weak multiplicity detection takes exponential number of rounds in expectation. On the other hand, we can obtain a constant-round gathering algorithm using local-strong multiplicity detection. These results imply that the two models of multiplicity detection are significantly different in terms of their computational power. Interestingly, these differences disappear if we take one more assumption that all robots are scattered (i.e., no two robots stay at the same location) initially. We can obtain a gathering algorithm that takes a constant number of rounds in expectation, assuming local-weak multiplicity detection and scattered initial configurations.", "paper_title": "Feasibility of Polynomial-Time Randomized Gathering for Oblivious Mobile Robots", "paper_id": "WOS:000316223500010"}