{"auto_keywords": [{"score": 0.042766027349518475, "phrase": "decision_making_process"}, {"score": 0.04204224612471482, "phrase": "industrial_systems"}, {"score": 0.037021145852707625, "phrase": "generic_patterns"}, {"score": 0.029011083559047593, "phrase": "maintenance_strategies"}, {"score": 0.02627544444970184, "phrase": "global_model"}, {"score": 0.00481495049065317, "phrase": "maintenance_strategies_assessment"}, {"score": 0.0047906082951008665, "phrase": "high_competitiveness"}, {"score": 0.0047302872942826734, "phrase": "new_information_and_communication_technologies"}, {"score": 0.004706371093110664, "phrase": "industrial_enterprises"}, {"score": 0.004670722261414736, "phrase": "higher_understanding"}, {"score": 0.004588583394515502, "phrase": "expected_performances"}, {"score": 0.004285010985001827, "phrase": "target_performances"}, {"score": 0.004220314322073171, "phrase": "subjective_considerations"}, {"score": 0.003587924960158317, "phrase": "generic_knowledge"}, {"score": 0.0034803228231621687, "phrase": "relevant_solution"}, {"score": 0.003453928576839383, "phrase": "models_capitalization"}, {"score": 0.0034277338119963886, "phrase": "second_issue"}, {"score": 0.0032498315583945163, "phrase": "unrealistic_assumptions"}, {"score": 0.0032251796659158696, "phrase": "complexity_etc"}, {"score": 0.003088965605775215, "phrase": "generic_way"}, {"score": 0.0030655302236416502, "phrase": "key_concepts"}, {"score": 0.0030422720986097865, "phrase": "industrial_system"}, {"score": 0.0029735479904284675, "phrase": "semantic_rules"}, {"score": 0.0028120022457134267, "phrase": "concepts_formalization"}, {"score": 0.002672750634553146, "phrase": "knowledge_capitalization"}, {"score": 0.002632332114727894, "phrase": "components_off"}, {"score": 0.0025533148412439166, "phrase": "probabilistic_relational_model"}, {"score": 0.0024516267507109753, "phrase": "specific_industrial_system"}, {"score": 0.002420685428036557, "phrase": "simulation_step"}, {"score": 0.002300767290603968, "phrase": "patterns_capitalization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Decision making", " Maintenance", " Knowledge capitalization", " Generic patterns", " Performances"], "paper_abstract": "High competitiveness and the emergence of new Information and Communication Technologies in industrial enterprises require a higher understanding and mastering of their operation systems to improve expected performances. In that sense, managers should take decisions about the strategies to be implemented as well as the resources to be used to achieve the target performances. Decisions result either from subjective considerations either from models allowing performances assessment. To help managers in the decision making process, it is necessary to represent industrial systems by means of models to better control them. However, this task underlines two major issues. The first one deals with the development of these models which is time and money consuming for the enterprises. This issue leads the consideration of formalizing generic knowledge by means, for example, of generic patterns, as a relevant solution to support models capitalization. The second issue deals with the degree of confidence of the models regarding to the reality of the industrial systems in order to avoid unrealistic assumptions, decreasing complexity etc. To face these challenges, this paper presents a methodology to represent, in a generic way, the key concepts of an industrial system and the relationships between the concepts materialized by semantic rules. More precisely, this methodology is investigated in the domain of dependability in order to assess performances, from the concepts formalization of both the production system and the maintenance one, based on the maintenance strategies applied. Thus generic patterns are cogent to support knowledge capitalization and reuse for leading to Components Off The Shelf (COTS). Patterns are built on a Probabilistic Relational Model (PRM) and can be instantiated then assembled to form a global model of a specific industrial system. The global model allows simulation step for maintenance strategies assessment helping the decision making process. The feasibility and added-value of this methodology, mainly in terms of patterns capitalization and reuse, are shown on two case studies: a pumping system and a real harvest production system. Moreover, lessons-learned issued from these applications are discussed. (C) 2014 Elsevier Ltd. All rights reserve. .", "paper_title": "Industrial system knowledge formalization to aid decision making in maintenance strategies assessment", "paper_id": "WOS:000346453800029"}