{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "information_literacy"}, {"score": 0.010612387000973441, "phrase": "information_competence"}, {"score": 0.004746263721902197, "phrase": "purpose_-_since"}, {"score": 0.004546000131069232, "phrase": "information_resources"}, {"score": 0.004449045430179066, "phrase": "cognitive_structure"}, {"score": 0.004155399041702324, "phrase": "real_user_communities"}, {"score": 0.0035601676907962626, "phrase": "information_processors"}, {"score": 0.0032774911048411835, "phrase": "conceptual_model"}, {"score": 0.0030499378654797143, "phrase": "translation_practice"}, {"score": 0.002963390095037466, "phrase": "infolit"}, {"score": 0.002931569771634119, "phrase": "starring_role"}, {"score": 0.00284837132359445, "phrase": "broader_research"}, {"score": 0.002708399936381754, "phrase": "solid_instruction"}, {"score": 0.0022540779997940897, "phrase": "authors'_expert_knowledge"}, {"score": 0.0022138542785562444, "phrase": "professional_translation_practice"}, {"score": 0.002143247921132179, "phrase": "first_proposal"}, {"score": 0.0021049977753042253, "phrase": "translation_training"}], "paper_keywords": ["information literacy", " information research", " translation services", " skills"], "paper_abstract": "Purpose - Since every community of practice generates, seeks, retrieves and uses information resources and sources related to the cognitive structure being researched or studied and the tasks being performed, the need arises to undertake studies focused on real user communities, which in the case of this paper is the group of translators. This paper aims to investigate this issue. Design/methodology/approach - In this arena of application, it is important to remember that translators are not only information users, but also information processors and producers. Thus, their documentary competence has to evolve in three dimensions: the informational, the methodological and the strategic. The conceptual model proposed in the paper is based on information literacy (INFOLIT) standards and also the authors' knowledge of translation practice and the competencies it demands, where INFOLIT plays a starring role. This paper is part of a broader research currently in progress, whose main goal is to provide translators and interpreters with a solid instruction in information literacy. Findings - The paper introduces a model for information literacy specifically intended to develop the information competence of this community of users, it reveals that the model is a gathering of skills, competences, knowledge and values, and it is based on the cooperation between the authors' expert knowledge of information science and professional translation practice. Originality/value - This paper puts forward the first proposal for information literacy applied to translation training.", "paper_title": "INFOLITRANS: a model for the development of information competence for translators", "paper_id": "WOS:000258733900008"}