{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "virtual_environments"}, {"score": 0.004737201825299411, "phrase": "interactive_computer_systems"}, {"score": 0.004331393784852601, "phrase": "virtual_environment"}, {"score": 0.004141663280057689, "phrase": "user's_sense"}, {"score": 0.003605997900398767, "phrase": "characterising_latency"}, {"score": 0.0032567057896906314, "phrase": "simple_mechanical_simulator"}, {"score": 0.0029531640201737384, "phrase": "new_latency_measurement_technique"}, {"score": 0.0028236336891860592, "phrase": "high_speed_video"}, {"score": 0.0027108021939930014, "phrase": "mechanical_simulator"}, {"score": 0.0026452734009203764, "phrase": "steed's_and_di_luca's_measurement_techniques"}, {"score": 0.0024281181691350085, "phrase": "interactive_systems"}, {"score": 0.0023121112251855667, "phrase": "significant_level"}, {"score": 0.0021926693625590006, "phrase": "steed's_method"}, {"score": 0.0021049977753042253, "phrase": "specialised_hardware"}], "paper_keywords": ["Latency", " measurement"], "paper_abstract": "Latency of interactive computer systems is a product of the processing, transport and synchronisation delays inherent to the components that create them. In a virtual environment (VE) system, latency is known to be detrimental to a user's sense of immersion, physical performance and comfort level. Accurately measuring the latency of a VE system for study or optimisation, is not straightforward. A number of authors have developed techniques for characterising latency, which have become progressively more accessible and easier to use. In this paper, we characterise these techniques. We describe a simple mechanical simulator designed to simulate a VE with various amounts of latency that can be finely controlled (to within 3ms). We develop a new latency measurement technique called Automated Frame Counting to assist in assessing latency using high speed video (to within 1ms). We use the mechanical simulator to measure the accuracy of Steed's and Di Luca's measurement techniques, proposing improvements where they may be made. We use the methods to measure latency of a number of interactive systems that may be of interest to the VE engineer, with a significant level of confidence. All techniques were found to be highly capable however Steed's Method is both accurate and easy to use without requiring specialised hardware.", "paper_title": "Measuring Latency in Virtual Environments", "paper_id": "WOS:000338120200015"}