{"auto_keywords": [{"score": 0.04930986456658361, "phrase": "fuzzy_logic_systems"}, {"score": 0.004778832405788219, "phrase": "interval"}, {"score": 0.004386637056030611, "phrase": "design_process"}, {"score": 0.004094639048362357, "phrase": "small_deviations"}, {"score": 0.004045157344249484, "phrase": "sampling_points"}, {"score": 0.003900257249255497, "phrase": "great_interest"}, {"score": 0.0038375280115736958, "phrase": "maximum_tolerance"}, {"score": 0.003670157084732341, "phrase": "system's_robustness"}, {"score": 0.003495855671790616, "phrase": "robustness_analysis"}, {"score": 0.003107935254560724, "phrase": "guaranteed_performance"}, {"score": 0.002865710140187219, "phrase": "proposed_methodologies"}, {"score": 0.002685558057339722, "phrase": "robust_behavior"}, {"score": 0.002416589459425828, "phrase": "relatively_small_approximation_errors"}, {"score": 0.0022190974300886467, "phrase": "robust_properties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Robustness", " Interval type-2 fuzzy logic systems", " Type-1 fuzzy logic systems", " TSK", " Tolerance", " Sensitivity", " Function approximation", " Modeling", " Identification", " Control"], "paper_abstract": "Research on the robustness of fuzzy logic systems (FLSs), an imperative factor in the design process, is very limited in the literature. Specifically, when a system is subjected to small deviations of the sampling points (operating points), it is of great interest to find the maximum tolerance of the system, which we refer to as the system's robustness. In this paper, we present a methodology for the robustness analysis of interval type-2 FLSs (IT2 FLSs) that also holds for T1 FLSs, hence, making it more general. A procedure for the design of robust IT2 FLSs with a guaranteed performance better than or equal to their T1 counterparts is then proposed. Several examples are performed to demonstrate the effectiveness of the proposed methodologies. It was concluded that both T1 and IT2 FLSs can be designed to achieve robust behavior in various applications, and preference one or the other, in general, is application-dependant. IT2 FLSs, having a more flexible structure than T1 FLSs, exhibited relatively small approximation errors in the several examples investigated. The methodologies presented in this paper lay the foundation for the design of FLSs with robust properties that will be very useful in many practical modeling and control applications. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "On the robustness of Type-1 and Interval Type-2 fuzzy logic systems in modeling", "paper_id": "WOS:000287269600008"}