{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tv_programs"}, {"score": 0.032490691027297715, "phrase": "collaborative_filtering"}, {"score": 0.004757917303420435, "phrase": "singular_value_decomposition"}, {"score": 0.004645860180714466, "phrase": "new_cable_and_satellite_services"}, {"score": 0.004518442937844318, "phrase": "digital_tv_systems"}, {"score": 0.0043945048085683005, "phrase": "unprecedented_level"}, {"score": 0.00435971969507033, "phrase": "program_choice"}, {"score": 0.0037784540167266497, "phrase": "tv_program_recommendation_systems"}, {"score": 0.0036167509502276294, "phrase": "user's_likes"}, {"score": 0.003503497128638102, "phrase": "higher_user_preference"}, {"score": 0.0031845067058084583, "phrase": "proposed_hybrid_approach"}, {"score": 0.0031342307827666675, "phrase": "content-filtering_techniques"}, {"score": 0.0030119758165837625, "phrase": "typical_advantages"}, {"score": 0.0029762350325031207, "phrase": "social_network"}, {"score": 0.002548331088496964, "phrase": "well-known_matrix_factorization_technique"}, {"score": 0.002488183412451029, "phrase": "item-based_collaborative_filtering_algorithm"}, {"score": 0.002429451930463481, "phrase": "good_behavior"}, {"score": 0.0024006068621542642, "phrase": "tv_domain"}, {"score": 0.0022434880661725493, "phrase": "main_goal"}, {"score": 0.002164505365535068, "phrase": "user_task"}], "paper_keywords": ["Recommender systems", " Contents personalization", " Collaborative filtering", " SVD", " Web 2.0"], "paper_abstract": "With the advent of new cable and satellite services, and the next generation of digital TV systems, people are faced with an unprecedented level of program choice. This often means that viewers receive much more information than they can actually manage, which may lead them to believe that they are missing programs that could likely interest them. In this context, TV program recommendation systems allow us to cope with this problem by automatically matching user's likes to TV programs and recommending the ones with higher user preference. This paper describes the design, development, and startup of queveo.tv: a Web 2.0 TV program recommendation system. The proposed hybrid approach (which combines content-filtering techniques with those based on collaborative filtering) also provides all typical advantages of any social network, such as supporting communication among users as well as allowing users to add and tag contents, rate and comment the items, etc. To eliminate the most serious limitations of collaborative filtering, we have resorted to a well-known matrix factorization technique in the implementation of the item-based collaborative filtering algorithm, which has shown a good behavior in the TV domain. Every step in the development of this application was taken keeping always in mind the main goal: to simplify as much as possible the user task of selecting what program to watch on TV. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "A hybrid content-based and item-based collaborative filtering approach to recommend TV programs enhanced with singular value decomposition", "paper_id": "WOS:000282405000003"}