{"auto_keywords": [{"score": 0.04809176147872219, "phrase": "public_key_pk"}, {"score": 0.00481495049065317, "phrase": "traditional_signature_scheme"}, {"score": 0.004764220976404241, "phrase": "signature_sigma"}, {"score": 0.00469740813902244, "phrase": "message_m"}, {"score": 0.004315670715009727, "phrase": "message_m."}, {"score": 0.004049783994776266, "phrase": "np_statement"}, {"score": 0.0038271712887391015, "phrase": "witness_w"}, {"score": 0.003310813458610484, "phrase": "traditional_definition"}, {"score": 0.003287482882222731, "phrase": "digital_signature_schemes"}, {"score": 0.003241312187060814, "phrase": "canetti's_ideal_signing_functionality"}, {"score": 0.0030847461428168614, "phrase": "alternative_definition"}, {"score": 0.0029670381308395505, "phrase": "necessary_properties"}, {"score": 0.002833689453299307, "phrase": "additional_confidence"}, {"score": 0.0026967596578196325, "phrase": "standard_complexity_assumptions"}, {"score": 0.0026682872124177233, "phrase": "common-random-string_model"}, {"score": 0.0024251568696803177, "phrase": "uc-realizable_ideal_functionality"}, {"score": 0.0022355610034493225, "phrase": "first_delegatable_anonymous_credential_system"}, {"score": 0.0021501863832966966, "phrase": "one's_anonymous_credentials"}, {"score": 0.002127472359795555, "phrase": "secret_key"}, {"score": 0.0021049977753042253, "phrase": "anonymous_credentials"}], "paper_keywords": [""], "paper_abstract": "In a traditional signature scheme, a signature sigma, on a message m is issued under a public key PK, and can be interpreted as follows: \"The owner of the public key PK and its corresponding secret key has signed message m.\" In this paper we consider schemes that allow one to issue signatures on behalf of any NP statement, that can be interpreted as follows: \"A person in possession of a witness w to the statement that x is an element of L has signed message m.\" We refer to such schemes as signatures of knowledge. We formally define the notion of a signature of knowledge. We begin by extending the traditional definition of digital signature schemes, captured by Canetti's ideal signing functionality, to the case of signatures of knowledge. We then give an alternative definition in terms of games that also seems to capture the necessary properties one may expect from a signature of knowledge. We then gain additional confidence in our two definitions by proving them equivalent. We construct signatures of knowledge under standard complexity assumptions in the common-random-string model. We then extend our definition to allow signatures of knowledge to be nested i.e., a signature of knowledge (or another accepting input to a UC-realizable ideal functionality) can itself serve as a witness for another signature of knowledge. Thus, as a corollary, we obtain the first delegatable anonymous credential system, i.e., a system in which one can use one's anonymous credentials as a secret key for issuing anonymous credentials to others.", "paper_title": "On signatures of knowledge", "paper_id": "WOS:000240079900005"}