{"auto_keywords": [{"score": 0.03911792952814384, "phrase": "depth-based_importance_map"}, {"score": 0.010612387000973441, "phrase": "rgb-d_camera"}, {"score": 0.009065870108673659, "phrase": "important_regions"}, {"score": 0.008545388826831602, "phrase": "depth_information"}, {"score": 0.004628101576367193, "phrase": "color_information"}, {"score": 0.004339744430169516, "phrase": "color_and_depth_information"}, {"score": 0.003969784439380027, "phrase": "content-aware_image"}, {"score": 0.0032563083791198534, "phrase": "depth-based_measure"}, {"score": 0.00320826350799124, "phrase": "weight_map"}, {"score": 0.003053159610975692, "phrase": "mean_shift_procedure"}, {"score": 0.002993231973906559, "phrase": "local_peak"}, {"score": 0.0029055323737809825, "phrase": "important_objects"}, {"score": 0.0028484940955893134, "phrase": "gaussian_distribution"}, {"score": 0.002618278365749875, "phrase": "discontinuous_seam_carving_algorithm"}, {"score": 0.002504011301105577, "phrase": "dynamic_programming_method"}, {"score": 0.002147180332779021, "phrase": "proposed_method"}], "paper_keywords": ["Content-aware image resizing", " Depth information", " Discontinuous seam carving"], "paper_abstract": "Forimage retargeting, most approaches only use color information to tackle this problem. In this paper, we analyze both color and depth information captured by a RGB-D camera to maintain the structure and preserve important regions. Particularly, we present a content-aware image retargeting algorithm based on depth information. In addition, we introduce a depth-based importance map, such that deformation of the image is guided by this map. This depth-based importance map is produced automatically by combining gradient, salience, and depth-based measures. More specifically, the depth-based measure is a weight map, in which we analyze depth information and use the mean shift procedure to find the local peak as the central of the important objects, and apply Gaussian distribution to determine the weight. Consequently, this depth-based importance map is used as the input of the discontinuous seam carving algorithm, and the seam is processed by the dynamic programming method. Our experimental results demonstrate the effectiveness of using the depth-based importance map in the discontinuous seam carving algorithm that it can visually behave better in maintaining the structure and preserving important regions. The proposed method produces much better results than other approaches, that are the state-of-the-art in content-aware image resizing.", "paper_title": "Image retargeting using RGB-D camera", "paper_id": "WOS:000352742800015"}