{"auto_keywords": [{"score": 0.04476874280540394, "phrase": "lv_approach"}, {"score": 0.010442173727701709, "phrase": "kanji_learners"}, {"score": 0.00938459310955523, "phrase": "beginning_learners"}, {"score": 0.007981078585600408, "phrase": "different_ways"}, {"score": 0.007701421237752914, "phrase": "cognitive_differences"}, {"score": 0.005284209758399073, "phrase": "intermediate_learners"}, {"score": 0.00481495049065317, "phrase": "cognitive_visualization"}, {"score": 0.00466085208934021, "phrase": "conceptual_and_experimental_analysis"}, {"score": 0.004615587054831451, "phrase": "new_approach"}, {"score": 0.004482400730101345, "phrase": "learner's_visualization"}, {"score": 0.004353040792349733, "phrase": "previous_study"}, {"score": 0.003973887756331297, "phrase": "significant_impact"}, {"score": 0.0034099718632933027, "phrase": "novel_kanji"}, {"score": 0.0032157824854214313, "phrase": "learning_experience"}, {"score": 0.0031741774605681065, "phrase": "learner"}, {"score": 0.0029642298956837764, "phrase": "possible_\"kanji_deconstruction_layouts"}, {"score": 0.002723409977992608, "phrase": "average_number"}, {"score": 0.0026189428303175664, "phrase": "statistical_analysis"}, {"score": 0.0025934566395017424, "phrase": "achieved_performance"}, {"score": 0.0022838006190016263, "phrase": "\"kanji_deconstruction_level"}, {"score": 0.002160640052461594, "phrase": "kanji_retention_score"}], "paper_keywords": ["kanji learning approach", " learning support system", " visual cognition", " kanji deconstruction level", " cognitive maps"], "paper_abstract": "This paper provides conceptual and experimental analysis of a new approach in the study of kanji, our \"Learner's Visualization (LV) Approach\". In a previous study we found that the LV Approach assists beginning learners in significantly updating their personal kanji deconstruction visualization. Additionally, in another study our findings provided evidence that beginning learners also receive a significant impact in the ability to acquire vocabulary. In this study, our research problem examines how beginning and intermediate students use visualization to cognitively deconstruct (divide) kanji in different ways, and how this affects their learning progress. We analyze the cognitive differences in how kanji learners explore and deconstruct novel kanji while using the LV Approach and how these differences affect their learning process while using the LV Approach. During the learning experience, our LILES System (Learner's Introspective Latent Envisionment System), based on the LV Approach, guides learners to choose from a set of possible \"kanji deconstruction layouts\" (layouts showing different ways in which a given kanji can be divided). The system then assists learners in updating their \"kanji deconstruction level\" (the average number of parts they visualize within kanji according to their current abilities). Statistical analysis based on achieved performance was conducted. The analysis of our results proves that there are cognitive differences: beginners deconstruct kanji into more parts (\"blocks\") than intermediate learners do, and while both improve their kanji deconstruction scores, there is a more significant change in \"kanji deconstruction level\" in beginners. However, it was also found that intermediate learners benefit more in \"kanji retention score\" compared with beginners. Suggestions for further research are provided.", "paper_title": "LILES System: Guiding and Analyzing Cognitive Visualization in Beginning and Intermediate Kanji Learners", "paper_id": "WOS:000292619500009"}