{"auto_keywords": [{"score": 0.04971747610320425, "phrase": "relative_information_completeness"}, {"score": 0.015719716506582538, "phrase": "data_complexity"}, {"score": 0.014366499888635137, "phrase": "complete_information"}, {"score": 0.013427547516352943, "phrase": "partially_closed_database"}, {"score": 0.009861765171457827, "phrase": "minimal_completeness_problem"}, {"score": 0.009042266805889739, "phrase": "bounded_extension_problem"}, {"score": 0.0044634416051962545, "phrase": "master_data"}, {"score": 0.004346547997061901, "phrase": "core_business_entities"}, {"score": 0.0039684322717435045, "phrase": "relative_to_master_data"}, {"score": 0.0033582976109650608, "phrase": "query_q"}, {"score": 0.003320277992107974, "phrase": "partially_closed_database_d_master_data_d-m"}, {"score": 0.0029182434479165884, "phrase": "minimal_database"}, {"score": 0.0024319378563138223, "phrase": "combined_complexity_bounds"}, {"score": 0.0024043803470189455, "phrase": "relative_completeness_problem"}, {"score": 0.0022454559805729717, "phrase": "upper_and_lower_bounds"}, {"score": 0.0021049977753042253, "phrase": "query_languages"}], "paper_keywords": ["Incomplete information", " Relative completeness", " Master data management", " Partially closed databases", " Data complexity"], "paper_abstract": "Databases in an enterprise are often partially closed: parts of their data must be contained in master data, which has complete information about the core business entities of the enterprise. With this comes the need for studying relative information completeness: a partially closed database is said to be complete for a query relative to master data if it has complete information to answer the query, i.e., extending the database by adding more tuples either does not change its answer to the query or makes it no longer partially closed w.r.t. the master data. This paper investigates three problems associated with relative information completeness. Given a query Q and a partially closed database D master data D-m, (1) the relative completeness problem is to decide whether D is complete for Q relative to D-m; (2) the minimal completeness problem is to determine whether D is a minimal database that is complete for Q relative to D-m; and (3) the bounded extension problem is to decide whether it suffices to extend D by adding at most K tuples, such that the extension makes a partially closed database that is complete for Q relative to D-m. While the combined complexity bounds of the relative completeness problem and the minimal completeness problem are already known, neither their data complexity nor the bounded extension problem has been studied. We establish upper and lower bounds of these problems for data complexity, all matching, for Q expressed in a variety of query languages. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "On the data complexity of relative information completeness", "paper_id": "WOS:000338613900002"}