{"auto_keywords": [{"score": 0.03584322365535929, "phrase": "tcp_libra"}, {"score": 0.0048150284339538735, "phrase": "tcp"}, {"score": 0.004038183610525504, "phrase": "session_round-trip-times"}, {"score": 0.0036304470230058413, "phrase": "long-rtt_flows"}, {"score": 0.003513443975425428, "phrase": "tcp's_congestion_control_scheme"}, {"score": 0.003197584086259325, "phrase": "rtt"}, {"score": 0.0030818310926031024, "phrase": "main_contributions"}, {"score": 0.002933973181012572, "phrase": "model_derivation"}, {"score": 0.002583931950389087, "phrase": "asymptotic_stability"}, {"score": 0.0025628355581338563, "phrase": "fast_convergence"}, {"score": 0.002459902948098627, "phrase": "real_testbed_comparisons"}, {"score": 0.0021662983565317283, "phrase": "legacy_tcp."}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fairness", " RTT", " TCP", " Transport protocol"], "paper_abstract": "The Transmission Control Protocol (TCP), the most widely used transport protocol over the Internet, has been advertised to implement fairness between flows competing for the same narrow link. However, when session round-trip-times (RTTs) radically differ, the share may be anything but fair. This RTT-unfairness represents a problem that severely affects the performance of long-RTT flows and whose solution requires a revision of TCP's congestion control scheme. To this aim, we discuss TCP Libra, a new transport protocol able to ensure fairness and scalability regardless of the RTT, while remaining friendly towards legacy TCP. As main contributions of this paper: (i) we focus on the model derivation and show how it leads to the design of TCP Libra; (ii) we analyze the role of its parameters and suggest how they may be adjusted to lead to asymptotic stability and fast convergence; (iii) we perform model-based, simulative, and real testbed comparisons with other TCP versions that have been reported as RTT-fair in the literature. Results demonstrate the ability of TCP Libra in ensuring RTT-fairness while remaining throughput efficient and friendly towards legacy TCP. (C) 2010 Published by Elsevier B.V.", "paper_title": "TCP Libra: Derivation, analysis, and comparison with other RTT-fair TCPs", "paper_id": "WOS:000282070800001"}