{"auto_keywords": [{"score": 0.049692788583269344, "phrase": "range_images"}, {"score": 0.048364759730099696, "phrase": "low_resolution"}, {"score": 0.046345717877726705, "phrase": "missing_regions"}, {"score": 0.04338240099693537, "phrase": "long_acquisition_times"}, {"score": 0.00481495049065317, "phrase": "sparse_data"}, {"score": 0.00453113241842654, "phrase": "low-cost_scanners"}, {"score": 0.004386637056030611, "phrase": "poor_reflectivity"}, {"score": 0.004281284532043714, "phrase": "common_problem"}, {"score": 0.004229556887896042, "phrase": "high_quality_scanners"}, {"score": 0.003700037700138249, "phrase": "integrated_super-resolution"}, {"score": 0.0035530197642369464, "phrase": "multiple_relatively-shifted_lr_range_images"}, {"score": 0.003453584878128719, "phrase": "lr_images"}, {"score": 0.0030828215204304473, "phrase": "markov_random_field"}, {"score": 0.0029965060407413898, "phrase": "inhomogeneous_mrf_priors"}, {"score": 0.002674681176379472, "phrase": "range_data"}, {"score": 0.002547535564922075, "phrase": "optical_image"}, {"score": 0.00241658945942583, "phrase": "similar_range_values"}, {"score": 0.0022281257694320433, "phrase": "noisy_scenario"}, {"score": 0.0021569129153653777, "phrase": "alignment_errors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Range images", " Super-resolution", " Markov random fields", " lnpainting", " Mean-shift segmentation"], "paper_abstract": "Range images often suffer from issues such as low resolution (LR) (for low-cost scanners) and presence of missing regions due to poor reflectivity, and occlusions. Another common problem (with high quality scanners) is that of long acquisition times. In this work, we propose two approaches to counter these shortcomings. Our first proposal which addresses the issues of low resolution as well as missing regions, is an integrated super-resolution (SR) and inpainting approach. We use multiple relatively-shifted LR range images, where the motion between the LR images serves as a cue for super-resolution. Our imaging model also accounts for missing regions to enable inpainting. Our framework models the high resolution (HR) range as a Markov random field (MRF), and uses inhomogeneous MRF priors to constrain the solution differently for inpainting and super-resolution. Our super-resolved and inpainted outputs show significant improvements over their LR/interpolated counterparts. Our second proposal addresses the issue of long acquisition times by facilitating reconstruction of range data from very sparse measurements. Our technique exploits a cue from segmentation of an optical image of the same scene, which constrains pixels in the same color segment to have similar range values. Our approach is able to reconstruct range images with as little as 10% data. We also study the performance of both the proposed approaches in a noisy scenario as well as in the presence of alignment errors. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Range map superresolution-inpainting, and reconstruction from sparse data", "paper_id": "WOS:000300481700008"}