{"auto_keywords": [{"score": 0.03864467197500145, "phrase": "universal_distance"}, {"score": 0.03682730010869586, "phrase": "similarity_distances"}, {"score": 0.03224383874903183, "phrase": "first_type"}, {"score": 0.00481495049065317, "phrase": "emerging_area"}, {"score": 0.003784120134537663, "phrase": "stated_precision"}, {"score": 0.0030867203659106727, "phrase": "literal_embodyments"}, {"score": 0.0027588314610845705, "phrase": "computable_distance_measures"}, {"score": 0.002668524425703961, "phrase": "particular_features"}, {"score": 0.002624482632439123, "phrase": "literal_objects"}, {"score": 0.002581165831422692, "phrase": "second_type"}, {"score": 0.002517524071220657, "phrase": "web_users"}, {"score": 0.002486292595645607, "phrase": "particular_semantic_relations"}, {"score": 0.0024149139610228887, "phrase": "designated_objects"}, {"score": 0.002345579707333727, "phrase": "universal_similarity_distance_measures"}, {"score": 0.002306855521822739, "phrase": "particular_distance_measures"}, {"score": 0.00224061675049049, "phrase": "first_case"}, {"score": 0.0021492686054379755, "phrase": "second_case"}, {"score": 0.0021050924405146684, "phrase": "google"}], "paper_keywords": [""], "paper_abstract": "We survey the emerging area of compression-based, parameter-free, similarity distance measures useful in data-mining, pattern recognition, learning and automatic semantics extraction. Given a family of distances on a set of objects, a distance is universal up to a certain precision for that family if it minorizes every distance in the family between every two objects in the set, up to the stated precision (we do not require the universal distance to be an element of the family). We consider similarity distances for two types of objects: literal objects that as such contain all of their meaning, like genomes or books, and names for objects. The latter may have literal embodyments like the first type, but may also be abstract like \"red\" or \"christianity.\" For the first type we consider a family of computable distance measures corresponding to parameters expressing similarity according to particular features between pairs of literal objects. For the second type we consider similarity distances generated by web users corresponding to particular semantic relations between the (names for) the designated objects. For both families we give universal similarity distance measures, incorporating all particular distance measures in the family. In the first case the universal distance is based on compression and in the second case it is based on Google page counts related to search terms. In both cases experiments on a massive scale give evidence of the viability of the approaches.", "paper_title": "Similarity of objects and the meaning of words", "paper_id": "WOS:000238091800002"}