{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "recurrent_neural_networks"}, {"score": 0.049568154654955725, "phrase": "statistical_language_modeling"}, {"score": 0.004055176557424983, "phrase": "good_performance"}, {"score": 0.0036227329311981195, "phrase": "important_drawbacks"}, {"score": 0.0034148795808317555, "phrase": "context_words"}, {"score": 0.00323625520042892, "phrase": "recent_extensions"}, {"score": 0.0032016639006812826, "phrase": "recurrent_neural_network_models"}, {"score": 0.00266693888510356, "phrase": "existing_literature"}, {"score": 0.002382182688788248, "phrase": "language_modeling"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Recurrent neural networks", " Natural language processing", " Language modeling", " Speech recognition", " Machine translation"], "paper_abstract": "In this paper, we present a survey on the application of recurrent neural networks to the task of statistical language modeling. Although it has been shown that these models obtain good performance on this task, often superior to other state-of-the-art techniques, they suffer from some important drawbacks, including a very long training time and limitations on the number of context words that can be taken into account in practice. Recent extensions to recurrent neural network models have been developed in an attempt to address these drawbacks. This paper gives an overview of the most important extensions. Each technique is described and its performance on statistical language modeling, as described in the existing literature, is discussed. Our structured overview makes it possible to detect the most promising techniques in the field of recurrent neural networks, applied to language modeling, but it also highlights the techniques for which further research is required. (C) 2014 The Authors. Published by Elsevier Ltd.", "paper_title": "A survey on the application of recurrent neural networks to statistical language modeling", "paper_id": "WOS:000345556600006"}