{"auto_keywords": [{"score": 0.04251804837439931, "phrase": "multiple-haplotype_ibd_clusters"}, {"score": 0.0068910518983256105, "phrase": "existing_methods"}, {"score": 0.00481495049065317, "phrase": "multiple_individuals"}, {"score": 0.004451546786101008, "phrase": "multiple_haplotypes"}, {"score": 0.004349959409435479, "phrase": "ibd"}, {"score": 0.004290112502811656, "phrase": "equivalence_relation"}, {"score": 0.004096493540086106, "phrase": "ibd_clusters"}, {"score": 0.003966162568548304, "phrase": "pairwise_ibd"}, {"score": 0.003839962121679795, "phrase": "ibd_mapping"}, {"score": 0.0035994372026264478, "phrase": "large_samples"}, {"score": 0.0034210342328868017, "phrase": "clustering_method"}, {"score": 0.0032665093519968083, "phrase": "ibd_segments"}, {"score": 0.0031333949463567554, "phrase": "seed_haplotypes"}, {"score": 0.00309023627455429, "phrase": "qualified_neighbors"}, {"score": 0.0030196181347744372, "phrase": "sliding_windows"}, {"score": 0.0028042741141125712, "phrase": "comparable_performance"}, {"score": 0.0026163210719740847, "phrase": "potential_application"}, {"score": 0.0024636239664210433, "phrase": "low-density_lipoprotein_cholesterol"}, {"score": 0.0023198180380964305, "phrase": "genomic_interval"}, {"score": 0.002204697943520258, "phrase": "standard_single-marker_association_tests"}, {"score": 0.0021049977753042253, "phrase": "low-density_lipoprotein"}], "paper_keywords": [""], "paper_abstract": "Motivation: Most existing identity-by-descent (IBD) detection methods only consider haplotype pairs; less attention has been paid to considering multiple haplotypes simultaneously, even though IBD is an equivalence relation on haplotypes that partitions a set of haplotypes into IBD clusters. Multiple-haplotype IBD clusters may have advantages over pairwise IBD in some applications, such as IBD mapping. Existing methods for detecting multiple-haplotype IBD clusters are often computationally expensive and unable to handle large samples with thousands of haplotypes. Results: We present a clustering method, efficient multiple-IBD, which uses pairwise IBD segments to infer multiple-haplotype IBD clusters. It expands clusters from seed haplotypes by adding qualified neighbors and extends clusters across sliding windows in the genome. Our method is an order of magnitude faster than existing methods and has comparable performance with respect to the quality of clusters it uncovers. We further investigate the potential application of multiple-haplotype IBD clusters in association studies by testing for association between multiple-haplotype IBD clusters and low-density lipoprotein cholesterol in the Northern Finland Birth Cohort. Using our multiple-haplotype IBD cluster approach, we found an association with a genomic interval covering the PCSK9 gene in these data that is missed by standard single-marker association tests. Previously published studies confirm association of PCSK9 with low-density lipoprotein.", "paper_title": "Efficient clustering of identity-by-descent between multiple individuals", "paper_id": "WOS:000334078300004"}