{"auto_keywords": [{"score": 0.009126922849285256, "phrase": "different_levels"}, {"score": 0.00481495049065317, "phrase": "multilevel_parallelism_inside_ssds"}, {"score": 0.004621148492564008, "phrase": "multilevel_internal_ssd_parallelism"}, {"score": 0.004558289038745564, "phrase": "different_four_levels"}, {"score": 0.003265591844292821, "phrase": "internal_factors"}, {"score": 0.0030491497463386924, "phrase": "endurance_enhancement"}, {"score": 0.0029802289354540507, "phrase": "in-depth_experimental_study"}, {"score": 0.0028470123663391104, "phrase": "different_advanced_commands"}, {"score": 0.0028082176224611542, "phrase": "flash_manufacturers"}, {"score": 0.002610043728801011, "phrase": "ssd_performance"}, {"score": 0.0024706232839499546, "phrase": "different_physical-page_allocation_schemes"}, {"score": 0.0022962183207691188, "phrase": "different_performance_and_endurance_impacts"}, {"score": 0.002163600705898299, "phrase": "endurance_impact"}, {"score": 0.0021049977753042253, "phrase": "optimal_priority_order"}], "paper_keywords": ["NAND Flash-based SSD", " advanced commands", " allocation schemes", " internal parallelism", " performance", " endurance"], "paper_abstract": "Given the multilevel internal SSD parallelism at the different four levels: channel-level, chip-level, die-level, and plane-level, how to exploit these levels of parallelism will directly and significantly impact the performance and endurance of SSDs, which is in turn primarily determined by three internal factors, namely, advanced commands, allocation schemes, and the priority order of exploiting the four levels of parallelism. In this paper, we analyze these internal factors to characterize their impacts, interplay, and parallelism for the purpose of performance and endurance enhancement of SSDs through an in-depth experimental study. We come to the following key conclusions: 1) Different advanced commands provided by Flash manufacturers exploit different levels of parallelism inside SSDs, where they can either improve or degrade the SSD performance and endurance depending on how they are used; 2) Different physical-page allocation schemes employ different advanced commands and exploit different levels of parallelism inside SSDs, giving rise to different performance and endurance impacts; 3) The priority order of using the four levels of parallelism has the most significant performance and endurance impact among the three internal factors. The optimal priority order of using the four levels of parallelism in SSDs is found to be: 1) the channel-level parallelism; 2) the die-level parallelism; 3) the plane-level parallelism; and 4) the chip-level parallelism.", "paper_title": "Exploring and Exploiting the Multilevel Parallelism Inside SSDs for Improved Performance and Endurance", "paper_id": "WOS:000318641600008"}