{"auto_keywords": [{"score": 0.025936989045868702, "phrase": "presence_questionnaire"}, {"score": 0.00481495049065317, "phrase": "virtual_reality"}, {"score": 0.004764859786310636, "phrase": "previous_studies"}, {"score": 0.0047152877145889656, "phrase": "significant_correlation"}, {"score": 0.004428452434981208, "phrase": "causal_relationship"}, {"score": 0.0042617859335771615, "phrase": "snake_phobia"}, {"score": 0.004173524877260371, "phrase": "randomized_within-between_design"}, {"score": 0.0038249462699142733, "phrase": "threatening_and_anxiety-inducing_environment"}, {"score": 0.0036553070575015344, "phrase": "nonthreatening_environment"}, {"score": 0.003505378950567746, "phrase": "noanx_environment"}, {"score": 0.0033969686698961713, "phrase": "virtual_egyptian_desert"}, {"score": 0.003212424802083714, "phrase": "anx_immersion"}, {"score": 0.003048502724695561, "phrase": "hidden_and_dangerous_snakes"}, {"score": 0.002842840150239715, "phrase": "anx_and_noanx_immersions"}, {"score": 0.0027071661844502992, "phrase": "vr_immersion"}, {"score": 0.002678944072162297, "phrase": "brief_measures"}, {"score": 0.0025779504911297236, "phrase": "anxious_immersion"}, {"score": 0.0025156683465194967, "phrase": "nonanxious_immersion"}, {"score": 0.0023214036848949876, "phrase": "brief_one-item_measures"}, {"score": 0.002281194103324554, "phrase": "significant_contribution"}, {"score": 0.0022105600003496225, "phrase": "subjective_feeling"}, {"score": 0.002172266188075892, "phrase": "mixed_results"}, {"score": 0.0021049977753042253, "phrase": "psychological_factors"}], "paper_keywords": [""], "paper_abstract": "Given previous studies indicating a significant correlation between anxiety and presence, the purpose of this investigation was to explore the direction of the causal relationship between them. The sample consisted of 31 adults suffering from snake phobia. The study featured a randomized within-between design with two conditions and three counterbalanced immersions: (a) a baseline control immersion (BASELINE), (b) an immersion in a threatening and anxiety-inducing environment (ANX), and (c) an immersion in a nonthreatening environment that should not induce anxiety (NOANX). In the NOANX environment, participants were immersed for 5 min in a virtual Egyptian desert. They were told that the environment was safe and contained no snakes. The ANX immersion was identical, except that participants were led to believe that a multitude of hidden and dangerous snakes were lurking in the environment. A period of distraction (reading a text on relaxation) separated the ANX and NOANX immersions. Experimenters recorded presence and anxiety in the middle of and after each VR immersion, These brief measures of presence supported our hypothesis and were significantly higher in the anxious immersion than in the baseline or the nonanxious immersion, This finding was not corroborated by the presence questionnaire, where scores varied significantly in the opposite direction. The results from the brief one-item measures of presence support the significant contribution of emotions felt during the immersion on the subjective feeling of presence. The mixed results with the presence questionnaire are discussed, along with psychological factors potentially involved in presence.", "paper_title": "Anxiety increases the feeling of presence in virtual reality", "paper_id": "WOS:000258034900004"}