{"auto_keywords": [{"score": 0.03381617825493704, "phrase": "inbound_and_outbound_trucks"}, {"score": 0.032537290552517924, "phrase": "product_items"}, {"score": 0.00481495049065317, "phrase": "cross-docking_system"}, {"score": 0.004644329185633612, "phrase": "inventory_management"}, {"score": 0.004274396662662802, "phrase": "inbound_trucks"}, {"score": 0.004078439401031372, "phrase": "outbound_trucks"}, {"score": 0.0039623243082901214, "phrase": "distribution_network"}, {"score": 0.0039196351785300045, "phrase": "important_fact"}, {"score": 0.003646516176920946, "phrase": "actual_time"}, {"score": 0.0035426543993952184, "phrase": "typical_warehouse"}, {"score": 0.0034918342672996066, "phrase": "total_cost"}, {"score": 0.0034666972896389777, "phrase": "space_requirement"}, {"score": 0.0029041492019217033, "phrase": "best_sequence"}, {"score": 0.002790940765338191, "phrase": "total_operation_time"}, {"score": 0.0026151058979100596, "phrase": "algorithms'_parameters"}, {"score": 0.002549749054599413, "phrase": "performance_measures"}, {"score": 0.0023804491500749106, "phrase": "homogeneous_algorithms"}, {"score": 0.002354762471810519, "phrase": "proposed_algorithms"}, {"score": 0.0021746545596056125, "phrase": "cross-docking_systems"}, {"score": 0.0021202820950055193, "phrase": "high_volume"}, {"score": 0.0021049977753042253, "phrase": "inbound_or_outbound_trucks"}], "paper_keywords": ["Scheduling", " Cross-docking", " Inbound trucks", " Outbound trucks", " Meta-heuristics"], "paper_abstract": "Cross-docking is an approach in inventory management which can reduce inventories, lead times and customer response time. In this strategy, products and shipments are unloaded from inbound trucks, sorted and categorized based on their characteristics, moved and loaded onto outbound trucks for delivery to demand points in a distribution network. The important fact is that, the items are stored in the inventory for a period which is primarily less than the actual time allocated to keep these items in a typical warehouse. Therefore, total cost and space requirement for inventory can be cut down. One of the most important targets in such systems is to establish coordination between the performance of inbound and outbound trucks in that these trucks can be scheduled, and the product items can be allocated to trucks effectively. This paper addresses some meta-heuristics to find the best sequence of inbound and outbound trucks, so that the objective, minimizing the total operation time called makespan, can be satisfied. Furthermore, not only the efficiency and capability of the algorithms' parameters are assessed and analyzed by some performance measures, but also these meta-heuristics are compared with each other in order to find out the set of homogeneous algorithms among all proposed algorithms. By this analysis, it can be shown that the suitability of these meta-heuristics is quite sensible especially for the cross-docking systems with large sizes in which a high volume of inbound or outbound trucks transmit the product items. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Meta-heuristics implementation for scheduling of trucks in a cross-docking system with temporary storage", "paper_id": "WOS:000284863200076"}