{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_portals"}, {"score": 0.004724708238414131, "phrase": "ontology-centred_approach"}, {"score": 0.004271100220705305, "phrase": "european_and_national_level"}, {"score": 0.0035342634200440435, "phrase": "user-friendly_and_effective_search_facilities"}, {"score": 0.003360146665246448, "phrase": "construction_stakeholders"}, {"score": 0.003235193484261443, "phrase": "feasibility_study"}, {"score": 0.0031544754107802413, "phrase": "construction_stakeholders'_perceptions"}, {"score": 0.0031148723927633955, "phrase": "construction-related_information"}, {"score": 0.003037263309893009, "phrase": "ec"}, {"score": 0.002999012736727594, "phrase": "national_institutions"}, {"score": 0.0027451110240633144, "phrase": "knowledge_centred_approach"}, {"score": 0.002576988153314685, "phrase": "existing_information_portals"}, {"score": 0.0023587312574818208, "phrase": "resulting_construction_information_platform"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": [""], "paper_abstract": "Several construction-related information portals have been commissioned and developed by various institutions at a European and national level The information published by these portals is in many cases redundant, overlapping, specialised, and not easy to locate and access Furthermore, these portals do not provide user-friendly and effective search facilities, which results in low adoption from construction stakeholders. The paper describes a feasibility study aimed at analysing construction stakeholders' perceptions of construction-related information published by the EC and national institutions, and identifies barriers to adoption of these information portals It then proposes a knowledge centred approach, using ontology, to federate the plethora of existing information portals to provide a user-friendly, integrated and semantic-based access to the information and documents they publish. The resulting Construction Information Platform (CrIP) is described in terms of specification, architecture and services (C) 2010 Elsevier Ltd All rights reserved.", "paper_title": "Federating information portals through an ontology-centred approach: A feasibility study", "paper_id": "WOS:000280510900010"}