{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cooperative_game_theory"}, {"score": 0.004494570360108983, "phrase": "redundant_features"}, {"score": 0.004438642216475526, "phrase": "high-dimensional_data"}, {"score": 0.004040688646993605, "phrase": "strong_discriminatory_power"}, {"score": 0.0029909851863915283, "phrase": "intricate_and_intrinsic_interrelation"}, {"score": 0.0028805474861014722, "phrase": "general_filter_feature_selection_scheme"}, {"score": 0.0027741761880779535, "phrase": "introduced_framework"}, {"score": 0.0027054473441439422, "phrase": "feature_selection_problem"}, {"score": 0.0025569530630374995, "phrase": "experimental_comparisons"}, {"score": 0.0024780046985475794, "phrase": "uci"}, {"score": 0.0022696277881969896, "phrase": "proposed_algorithm"}, {"score": 0.0022413233627905696, "phrase": "better_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Machine learning", " Feature selection", " Cooperative game theory", " Filter method"], "paper_abstract": "Recent years, various information theoretic based measurements have been proposed to remove redundant features from high-dimensional data set as many as possible. However, most traditional Information-theoretic based selectors will ignore some features which have strong discriminatory power as a group but are weak as individuals. To cope with this problem, this paper introduces a cooperative game theory based framework to evaluate the power of each feature. The power can be served as a metric of the importance of each feature according to the intricate and intrinsic interrelation among features. Then a general filter feature selection scheme is presented based on the introduced framework to handle the feature selection problem. To verify the effectiveness of our method, experimental comparisons with several other existing feature selection methods on fifteen UCI data sets are carried out using four typical classifiers. The results show that the proposed algorithm achieves better results than other methods in most cases. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Feature evaluation and selection with cooperative game theory", "paper_id": "WOS:000303294500011"}