{"auto_keywords": [{"score": 0.004657653216262924, "phrase": "predictable_control"}, {"score": 0.004524220016675624, "phrase": "existing_mapping_method"}, {"score": 0.004376378707877484, "phrase": "consecutive_operations"}, {"score": 0.004198323646273642, "phrase": "new_mapping_method"}, {"score": 0.004112020122418323, "phrase": "internal_model"}, {"score": 0.004061088450663783, "phrase": "human_being"}, {"score": 0.00399415558125301, "phrase": "existing_method"}, {"score": 0.0039446780026489905, "phrase": "polar_coordinate_system"}, {"score": 0.003645192746918234, "phrase": "operating_order"}, {"score": 0.0032717489668326275, "phrase": "existing_joystick_mapping_method"}, {"score": 0.003177892611195514, "phrase": "vertical_axis"}, {"score": 0.0030231983220281836, "phrase": "horizontal_axis"}, {"score": 0.0029981559422442693, "phrase": "direction_control"}, {"score": 0.0028760125558659907, "phrase": "wheelchair_model"}, {"score": 0.0026796495639791426, "phrase": "arm_muscles"}, {"score": 0.002559775585192185, "phrase": "divided_degrees"}, {"score": 0.0021492686054379755, "phrase": "desired_direction"}], "paper_keywords": ["EMG signal", " embodiment", " wheelchair", " human interface"], "paper_abstract": "In this study, we achieved predictable control of a wheelchair by changing the existing mapping method of the joystick, which considers the consecutive operations of a motor of a wheelchair, to a new mapping method that corresponds to the internal model of a human being. Since the existing method uses the polar coordinate system, it is not easy at all to use this method to predict either the direction of motion or the operating order for changing the position of the wheelchair according to the requirements of an operator. In order to improve the embodiment, we divided the existing joystick mapping method into two degrees of freedom-one in the vertical axis that can control the velocity and the other, in the horizontal axis for direction control. Based on this division, we implemented a wheelchair model that can be controlled by the electromyography (EMG) signal from the neck and the arm muscles of an operator. This was achieved by mapping the divided degrees of freedom onto the degrees of freedom of the neck and arm of the operator. In this case, since the operator controls the direction of motion by the joint of his/her neck, he/she can move the wheelchair in the desired direction; thus, a more intuitive human interface is implemented.", "paper_title": "Consideration of the embodiment of a new, human-centered interface", "paper_id": "WOS:000238233300009"}