{"auto_keywords": [{"score": 0.03230360257109344, "phrase": "water_clusters"}, {"score": 0.02685354903224209, "phrase": "n_elements"}, {"score": 0.015370087770275934, "phrase": "supercritical_water_oxidation"}, {"score": 0.015255254617690344, "phrase": "molecular_dynamic_simulations"}, {"score": 0.015028116543153346, "phrase": "reactive_force_field"}, {"score": 0.011771806392743169, "phrase": "reaction_time"}, {"score": 0.011336957062631218, "phrase": "aromatic_rings"}, {"score": 0.00481495049065317, "phrase": "degradation_mechanism"}, {"score": 0.004363058588000252, "phrase": "main_components"}, {"score": 0.0038644521996539466, "phrase": "scwo_system"}, {"score": 0.003748937184382714, "phrase": "molecular_ratio"}, {"score": 0.0035147642199945387, "phrase": "simulated_results"}, {"score": 0.0032826873794020253, "phrase": "oxygen_molecule"}, {"score": 0.0031966173935538992, "phrase": "aromatic_ring-opening_reaction"}, {"score": 0.0031010029460927864, "phrase": "hydroxyl_radicals"}, {"score": 0.0028525124381208705, "phrase": "scw_system"}, {"score": 0.0026640466056415298, "phrase": "oh_radicals"}, {"score": 0.002413531395475291, "phrase": "steric_hindrance"}, {"score": 0.0022369407711124775, "phrase": "n_element"}], "paper_keywords": ["Dyeing wastewater", " Molecular dynamics", " Reaction mechanism", " ReaxFF", " Supercritical water oxidation"], "paper_abstract": "4-[N-(2-cyanoethyl)-N-ethylamino]-4'-nitroazobenzene (disperse orange 25, DO25) is one of the main components in dyeing wastewater. In this work, supercritical water oxidation (SCWO) process of DO25 has been investigated using the molecular dynamic simulations based on the reactive force field (ReaxFF). For the SCWO system, the effects of temperature, the molecular ratio of DO25, O-2 and H2O as well as the reaction time have been analyzed. The simulated results showed that the aromatic rings in DO25 could be attacked by hydroxyl radical, oxygen molecule, and hydroxyl radical together with oxygen molecule, respectively, which caused the aromatic ring-opening reaction to happen mainly through three different pathways. The hydroxyl radicals were mainly from water clusters and H2O2 (which was produced from oxygen-molecules reacting with water clusters). However, for the SCW system as comparison, the aromatic rings in DO25 could be attacked by hydroxyl radical only, and the OH radicals just come from water clusters. During the DO25 SCWO degradation process, we also found that N elements in one DO25 molecule were difficult to be converted into environmentally friendly N-2 molecules because of steric hindrance, but increasing the number of DO25 molecules could improve the possibility for the connection of N elements, thus promoting N element converting into N-2. Extending reaction time could also improve N elements in DO25 to transform into N-2 rather than carbonitride.", "paper_title": "Analysis of degradation mechanism of disperse orange 25 in supercritical water oxidation using molecular dynamic simulations based on the reactive force field", "paper_id": "WOS:000349970900018"}