{"auto_keywords": [{"score": 0.03619647508467271, "phrase": "polymer_density"}, {"score": 0.00481495049065317, "phrase": "polymer_chains"}, {"score": 0.004695183699894267, "phrase": "monte_carlo"}, {"score": 0.004601508848655033, "phrase": "coarse-grained_model"}, {"score": 0.004555371402128666, "phrase": "polymer_star_chains"}, {"score": 0.0043533862892678864, "phrase": "polymer_beads"}, {"score": 0.004245051445971095, "phrase": "flexible_homopolymer_chains"}, {"score": 0.004160319763461951, "phrase": "united_atoms"}, {"score": 0.003955787027818305, "phrase": "simple_cubic_lattice"}, {"score": 0.0038186039088445524, "phrase": "good_solvent_conditions"}, {"score": 0.0036676174658755683, "phrase": "long-range_specific_interactions"}, {"score": 0.003332440548684892, "phrase": "confining_surfaces"}, {"score": 0.0032494292163722065, "phrase": "star-branched_polymers"}, {"score": 0.0023642842046859274, "phrase": "structural_elements"}], "paper_keywords": ["Branched polymers", " Confined polymers", " Lattice models", " Monte Carlo method", " Polymer dynamics"], "paper_abstract": "A coarse-grained model of polymer star chains confined in two parallel impenetrable surfaces, which were attractive for polymer beads was studied. The flexible homopolymer chains were built of united atoms whose positions in space were restricted to vertices of a simple cubic lattice. The chains were modeled in good solvent conditions and, thus, there were no long-range specific interactions between polymer beads-only the excluded volume was present. The influence of the polymer density and the distances between the confining surfaces on the properties of star-branched polymers was studied. It is shown that the chains adsorbed on one surface could change their position so that they swap between both surfaces with frequency depending on the size of the slit and on the density of the system only. The increase of the polymer density diminished the frequency of jumps and caused that chains became only partially adsorbed. The analysis of structural elements of chains showed that the increase of the density of the system leads to increase of the number of bridges connecting the two adsorbing surfaces, thus, the frequency of jumps between them decreases.", "paper_title": "The structure of polymer chains in confinement. A Monte Carlo study", "paper_id": "WOS:000265441900015"}