{"auto_keywords": [{"score": 0.0370524624129902, "phrase": "packet_logging"}, {"score": 0.004653120760786245, "phrase": "people's_attention"}, {"score": 0.00401216440036853, "phrase": "traceback_schemes"}, {"score": 0.0036622637391432143, "phrase": "ip_tracking"}, {"score": 0.0034395119150793787, "phrase": "hybrid_ip_traceback_schemes"}, {"score": 0.0033048445033866795, "phrase": "longer_search"}, {"score": 0.0031393948330209255, "phrase": "new_hybrid_ip_traceback_scheme"}, {"score": 0.002982203248352076, "phrase": "fixed_storage_requirement"}, {"score": 0.0028006988338192375, "phrase": "caida's_skitter_data"}, {"score": 0.0026302120935562568, "phrase": "logged_tracking_information"}, {"score": 0.002570817338292482, "phrase": "zero_false_positive_and_false_negative_rates"}, {"score": 0.002386869729952315, "phrase": "packet's_marking_field"}, {"score": 0.0023463203637929466, "phrase": "attack_traffic"}], "paper_keywords": ["DoS/DDoS attack", " hybrid IP traceback", " IP spoofing", " packet logging", " packet marking"], "paper_abstract": "Because the Internet has been widely applied in various fields, more and more network security issues emerge and catch people's attention. However, adversaries often hide themselves by spoofing their own IP addresses and then launch attacks. For this reason, researchers have proposed a lot of traceback schemes to trace the source of these attacks. Some use only one packet in their packet logging schemes to achieve IP tracking. Others combine packet marking with packet logging and therefore create hybrid IP traceback schemes demanding less storage but requiring a longer search. In this paper, we propose a new hybrid IP traceback scheme with efficient packet logging aiming to have a fixed storage requirement for each router (under 320 KB, according to CAIDA's skitter data set) in packet logging without the need to refresh the logged tracking information and to achieve zero false positive and false negative rates in attack-path reconstruction. In addition, we use a packet's marking field to censor attack traffic on its upstream routers. Lastly, we simulate and analyze our scheme, in comparison with other related research, in the following aspects: storage requirement, computation, and accuracy.", "paper_title": "RIHT: A Novel Hybrid IP Traceback Scheme", "paper_id": "WOS:000301506500037"}