{"auto_keywords": [{"score": 0.03573249625593098, "phrase": "easily_testable_graph_properties"}, {"score": 0.00481495049065317, "phrase": "property_p"}, {"score": 0.004532892812505505, "phrase": "p._a_graph_property_p"}, {"score": 0.004414723336530117, "phrase": "fixed_epsilon"}, {"score": 0.004251210982670317, "phrase": "one-sided_error"}, {"score": 0.003971938976270902, "phrase": "induced_subgraph"}, {"score": 0.003927203683176278, "phrase": "random_subset"}, {"score": 0.0023848164282879885, "phrase": "first_author"}, {"score": 0.0021049977753042253, "phrase": "plausible_conjectured_characterization"}], "paper_keywords": [""], "paper_abstract": "A graph on n vertices is epsilon-far from a property P if one has to add or delete from it at least epsilon n(2) edges to get a graph satisfying P. A graph property P is strongly testable if for every fixed epsilon > 0 it is possible to distinguish, with one-sided error, between graphs satisfying P and ones that are epsilon-far from P by inspecting the induced subgraph on a random subset of at most f(epsilon) vertices. A property is easily testable if it is strongly testable and the function f is polynomial in 1/epsilon, otherwise it is hard. We consider the problem of characterizing the easily testable graph properties, which is wide open, and obtain several results in its study. One of our main results shows that testing perfectness is hard. The proof shows that testing perfectness is at least as hard as testing triangle-freeness, which is hard. On the other hand, we show that being a cograph, or equivalently, induced P-3-freeness where P-3 is a path with 3 edges, is easily testable. This settles one of the two exceptional graphs, the other being C-4 (and its complement), left open in the characterization by the first author and Shapira of graphs H for which induced H-freeness is easily testable. Our techniques yield a few additional related results, but the problem of characterizing all easily testable graph properties, or even that of formulating a plausible conjectured characterization, remains open.", "paper_title": "Easily Testable Graph Properties", "paper_id": "WOS:000358452900005"}