{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mutual_information"}, {"score": 0.043726272486193665, "phrase": "mutual_information_criterion"}, {"score": 0.015446839726517527, "phrase": "feature_selection"}, {"score": 0.004592905436175987, "phrase": "important_preprocessing_step"}, {"score": 0.004278807087784626, "phrase": "relevant_feature_subset"}, {"score": 0.0037797419108291227, "phrase": "regression_error_criterion"}, {"score": 0.003541923233726252, "phrase": "important_lack"}, {"score": 0.003378385493203297, "phrase": "objective_one"}, {"score": 0.003165739628969694, "phrase": "reasonable_assumptions"}, {"score": 0.0025587867729949037, "phrase": "optimal_features"}, {"score": 0.002426137929553722, "phrase": "theoretical_developments"}, {"score": 0.002246553137021003, "phrase": "critical_and_efficient_use"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mutual information", " Feature selection", " Regression", " MSE", " MAE"], "paper_abstract": "Feature selection is an important preprocessing step for many high-dimensional regression problems. One of the most common strategies is to select a relevant feature subset based on the mutual information criterion. However, no connection has been established yet between the use of mutual information and a regression error criterion in the machine learning literature. This is obviously an important lack, since minimising such a criterion is eventually the objective one is interested in. This paper demonstrates that under some reasonable assumptions, features selected with the mutual information criterion are the ones minimising the mean squared error and the mean absolute error. On the contrary, it is also shown that the mutual information criterion can fail in selecting optimal features in some situations that we characterise. The theoretical developments presented in this work are expected to lead in practice to a critical and efficient use of the mutual information for feature selection. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Is mutual information adequate for feature selection in regression?", "paper_id": "WOS:000328923800001"}