{"auto_keywords": [{"score": 0.04913171677961093, "phrase": "divide-and-conquer_strategy"}, {"score": 0.0349694581102903, "phrase": "existing_single-view_systems"}, {"score": 0.00481495049065317, "phrase": "streaming_systems"}, {"score": 0.003916098498242888, "phrase": "network_coding"}, {"score": 0.0038642157757169315, "phrase": "data_block_scheduling"}, {"score": 0.0036390887584943723, "phrase": "fundamental_inter-channel_bandwidth_competition_problem"}, {"score": 0.0032706520949775065, "phrase": "multi-view_systems"}, {"score": 0.0030799988391729464, "phrase": "new_protocol"}, {"score": 0.0027865506182608263, "phrase": "flexible_way"}, {"score": 0.0025892330566358503, "phrase": "dac_protocol"}, {"score": 0.002537880772794665, "phrase": "inter-channel_bandwidth_competition_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-to-peer network", " Multimedia live streaming", " Bandwidth allocation"], "paper_abstract": "Multi-view peer-to-peer (P2P) live streaming systems have recently emerged, where a user is allowed to simultaneously watch one or multiple channels. Previous work on building multi-view P2P streaming systems requires network coding in data block scheduling within each channel, since it solves the fundamental inter-channel bandwidth competition problem at the individual peer level. Therefore, it limits the migration from existing single-view systems to multi-view systems. In this paper, we propose a new protocol, called divide-and-conquer (DAC), which provides a flexible way of building multi-view P2P streaming systems based on existing single-view systems. Specifically, the DAC protocol solves the inter-channel bandwidth competition problem at the channel level based on a divide-and-conquer strategy. Our extensive packet level simulations show that our DAC protocol achieves the three design goals: flexibility, efficiency and scalability. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Improving multi-view peer-to-peer live streaming systems with the divide-and-conquer strategy", "paper_id": "WOS:000297875700008"}