{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "memory_consumption"}, {"score": 0.011986582683049038, "phrase": "subdivision_process"}, {"score": 0.004324985524216987, "phrase": "polygon_mesh"}, {"score": 0.004255902303152008, "phrase": "flat_surfaces"}, {"score": 0.0036227329311981195, "phrase": "adaptive_subdivision"}, {"score": 0.0030834712590249863, "phrase": "refinement_operation"}, {"score": 0.0030017207229983385, "phrase": "upper_level"}, {"score": 0.002890887778279196, "phrase": "increased_number"}, {"score": 0.0028142286985235977, "phrase": "heavy_computational_load"}, {"score": 0.002568435291444709, "phrase": "adaptive_subdivision_surface"}, {"score": 0.002407941567598653, "phrase": "proposed_method"}, {"score": 0.0022941723937662927, "phrase": "previous_method"}, {"score": 0.002127765807039172, "phrase": "smooth_surface"}], "paper_keywords": ["Smooth surfaces", " iterative subdivision surfaces", " adaptive subdivision", " area selected"], "paper_abstract": "Sub-devising a surface refers a process that is carried on polygon mesh to manufacture flat surfaces. Several subdivision schemes had been introduced before but are too consuming in terms of time and memory as it compute and render all of the vertices during the subdivision process. Adaptive subdivision, on the other hand subdivides only the required vertices of selected areas, and maintains the number of polygons for the rest of the meshes. However, the problem in this refinement operation usually happens at the upper level of the subdivision process, where the increased number of polygons led to heavy computational load. This research proposed IteAS (Iterative Adaptive Subdivision Surface), an enhancement of the adaptive subdivision surface to tackle this problem and to further optimize memory consumption. The proposed method can reduce the number of polygons used in previous method by 9%, optimize memory consumption up to 7% and is able to produce smooth surface of 3D object.", "paper_title": "Iterative adaptive subdivision surface approach to reduce memory consumption in rendering process (IteAS)", "paper_id": "WOS:000346978800031"}