{"auto_keywords": [{"score": 0.04271549719392818, "phrase": "agarwal"}, {"score": 0.042420047467754275, "phrase": "sharir"}, {"score": 0.00852787377145664, "phrase": "combinatorial_complexity"}, {"score": 0.008197245698187774, "phrase": "arbitrary_radii"}, {"score": 0.006847658546947202, "phrase": "restricted_case"}, {"score": 0.00679852851228387, "phrase": "nearly_congruent_cylinders"}, {"score": 0.0046276016230633495, "phrase": "n_infinite_cylinders"}, {"score": 0.004182816319761868, "phrase": "worst_case"}, {"score": 0.0036597104126905437, "phrase": "significant_way"}, {"score": 0.003367939885018247, "phrase": "simple_specialization"}, {"score": 0.0027015970441828267, "phrase": "minkowski_sums"}, {"score": 0.0021049977753042253, "phrase": "infinite_cylinders"}], "paper_keywords": ["Union of simply-shaped bodies", " Geometric arrangements", " Lower envelopes", " (1/r)-cuttings"], "paper_abstract": "We show that the combinatorial complexity of the union of n infinite cylinders in a\"e(3), having arbitrary radii, is O(n (2+epsilon) ), for any epsilon > 0; the bound is almost tight in the worst case, thus settling a conjecture of Agarwal and Sharir (Discrete Comput. Geom. 24:645-685, 2000), who established a nearly-quadratic bound for the restricted case of nearly congruent cylinders. Our result extends, in a significant way, the result of Agarwal and Sharir (Discrete Comput. Geom. 24:645-685, 2000), in particular, a simple specialization of our analysis to the case of nearly congruent cylinders yields a nearly-quadratic bound on the complexity of the union in that case, thus significantly simplifying the analysis in Agarwal and Sharir (Discrete Comput. Geom. 24:645-685, 2000). Finally, we extend our technique to the case of \"cigars\" of arbitrary radii (that is, Minkowski sums of line-segments and balls) and show that the combinatorial complexity of the union in this case is nearly-quadratic as well. This problem has been studied in Agarwal and Sharir (Discrete Comput. Geom. 24:645-685, 2000) for the restricted case where all cigars have (nearly) equal radii. Based on our new approach, the proof follows almost verbatim from the analysis for infinite cylinders and is significantly simpler than the proof presented in Agarwal and Sharir (Discrete Comput. Geom. 24:645-685, 2000).", "paper_title": "On the Union of Cylinders in Three Dimensions", "paper_id": "WOS:000286464900003"}