{"auto_keywords": [{"score": 0.027415621232767567, "phrase": "local_output_minimization"}, {"score": 0.004749106104067268, "phrase": "neural_learning_architectures"}, {"score": 0.004417848254181138, "phrase": "sensory_readings"}, {"score": 0.004238993477742183, "phrase": "actual_sensory_inputs"}, {"score": 0.0041666157975446564, "phrase": "supervised_learning"}, {"score": 0.0039841418890102925, "phrase": "necessary_comparisons"}, {"score": 0.0038758293658651237, "phrase": "respective_activities"}, {"score": 0.0033883824438527316, "phrase": "biological_comparators"}, {"score": 0.00307657476125683, "phrase": "unsupervised_neural_circuitry"}, {"score": 0.0030135741897058844, "phrase": "input_comparison"}, {"score": 0.002881450787481037, "phrase": "respective_inputs"}, {"score": 0.002851790448644913, "phrase": "external_influence"}, {"score": 0.002803031561019101, "phrase": "proposed_neural_comparator"}, {"score": 0.00276462370914216, "phrase": "unsupervised_form"}, {"score": 0.0026893753781434618, "phrase": "input_streams"}, {"score": 0.0026252106881752067, "phrase": "multilayer_feedforward_neural_network"}, {"score": 0.0024842242921857705, "phrase": "synaptic_weights"}, {"score": 0.002358917661465133, "phrase": "neural_activities"}, {"score": 0.0023346234464901978, "phrase": "different_neural_populations"}, {"score": 0.002286781334850213, "phrase": "population_size"}, {"score": 0.00226322835801988, "phrase": "neural_encoding"}, {"score": 0.0021490449563443025, "phrase": "sensory_input_streams"}], "paper_keywords": [""], "paper_abstract": "Learning algorithms need generally the ability to compare several streams of information. Neural learning architectures hence need a unit, a comparator, able to compare several inputs encoding either internal or external information, for instance, predictions and sensory readings. Without the possibility of comparing the values of predictions to actual sensory inputs, reward evaluation and supervised learning would not be possible. Comparators are usually not implemented explicitly. Necessary comparisons are commonly performed by directly comparing the respective activities one-to-one. This implies that the characteristics of the two input streams (like size and encoding) must be provided at the time of designing the system. It is, however, plausible that biological comparators emerge from self-organizing, genetically encoded principles, which allow the system to adapt to the changes in the input and the organism. We propose an unsupervised neural circuitry, where the function of input comparison emerges via self-organization only from the interaction of the system with the respective inputs, without external influence or supervision. The proposed neural comparator adapts in an unsupervised form according to the correlations present in the input streams. The system consists of a multilayer feedforward neural network, which follows a local output minimization (anti-Hebbian) rule for adaptation of the synaptic weights. The local output minimization allows the circuit to autonomously acquire the capability of comparing the neural activities received from different neural populations, which may differ in population size and the neural encoding used. The comparator is able to compare objects never encountered before in the sensory input streams and evaluate a measure of their similarity even when differently encoded.", "paper_title": "A Self-Organized Neural Comparator", "paper_id": "WOS:000316055400008"}