{"auto_keywords": [{"score": 0.049754507386661935, "phrase": "collaborative_inquiry_activities"}, {"score": 0.02395612371167522, "phrase": "web_literacy_skills"}, {"score": 0.00481495049065317, "phrase": "web_literacy"}, {"score": 0.004498393285602365, "phrase": "critical_and_meaningful_way"}, {"score": 0.004274650638302117, "phrase": "multiple_case_study"}, {"score": 0.004117647922204903, "phrase": "appropriate_context"}, {"score": 0.004048194450210347, "phrase": "primary_education"}, {"score": 0.003873027670786261, "phrase": "'healthy_food"}, {"score": 0.003718045060236861, "phrase": "content_knowledge_building"}, {"score": 0.003545024951402818, "phrase": "lesson_observations"}, {"score": 0.0034497831301482144, "phrase": "teacher_diaries"}, {"score": 0.003426373820419672, "phrase": "student_questionnaires"}, {"score": 0.003391556348707911, "phrase": "student_assignments"}, {"score": 0.0032336801561165113, "phrase": "varying_degrees"}, {"score": 0.0032117325375830407, "phrase": "contextual_factors"}, {"score": 0.0031360786664165093, "phrase": "project's_goals"}, {"score": 0.003051790083321992, "phrase": "research_questions"}, {"score": 0.0030002605593597966, "phrase": "students'_inquiry_skills"}, {"score": 0.0029596622424171264, "phrase": "teachers'_teaching_styles"}, {"score": 0.002939568952175845, "phrase": "students'_learning_results"}, {"score": 0.0027088011534576856, "phrase": "subject_healthy_food"}, {"score": 0.0025826247025542213, "phrase": "adequate_use"}, {"score": 0.002222994077182071, "phrase": "active_knowledge_builders"}], "paper_keywords": ["Media in education", " Elementary education", " Cooperative/collaborative learning", " Pedagogical issues"], "paper_abstract": "Although many children are technically skilled in using the Web, their competences to use it in a critical and meaningful way are usually less well developed. In this article, we report on a multiple case study focusing on the possibilities and limitations of collaborative inquiry activities as an appropriate context to acquire Web literacy skills in primary education. Four 5th grade school teachers and their students worked with collaborative inquiry activities on the subject of 'healthy food'. The project was aimed at both the development of Web literacy skills and content knowledge building. Data from a variety of sources were collected: videotaped and written lesson observations, interviews with teachers and students, teacher diaries, student questionnaires, and student assignments. The teachers appeared to be able to carry out the program to varying degrees. Contextual factors that influenced the realization of the project's goals and results were the adequacy of the research questions formulated by students, students' inquiry skills, and the teachers' teaching styles. Students' learning results show that it is possible to teach Web literacy skills in the context of collaborative inquiry activities. All classes show knowledge gain with regard to the subject healthy food and all classes but one show knowledge gain with regard to Web literacy skills. Although many students show adequate use of particular Web searching, reading and evaluating skills after the project, inconsistency, impulsiveness and impatience are also typical of their Web behaviour. In the context of collaborative inquiry activities teachers are challenged to deal with the paradox that they want their students to be active knowledge builders with help of the Web, whereas the Web seems to invite students to be more or less passive searchers. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Developing Web literacy in collaborative inquiry activities", "paper_id": "WOS:000263921400016"}