{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "alloy_properties"}, {"score": 0.015198155199501306, "phrase": "alloy_modeling"}, {"score": 0.014804309523682644, "phrase": "quantum_mechanical_energies"}, {"score": 0.010318098203778332, "phrase": "limited_data"}, {"score": 0.004760518730536645, "phrase": "cluster_expansion_method"}, {"score": 0.004724571550328985, "phrase": "parametrized_surrogate_models"}, {"score": 0.004583464412234181, "phrase": "otherwise_expensive_properties"}, {"score": 0.004313713204732449, "phrase": "alloy_quantity"}, {"score": 0.0040290957541568775, "phrase": "data_set"}, {"score": 0.0038498211283780484, "phrase": "increased_uncertainty"}, {"score": 0.0037918465913284478, "phrase": "computer_code"}, {"score": 0.0034618177773967015, "phrase": "alloy_property"}, {"score": 0.003320277992107974, "phrase": "limited_amount"}, {"score": 0.0025941547726803594, "phrase": "fully_bayesian_framework"}, {"score": 0.0025357050267224715, "phrase": "alloy_quantities"}, {"score": 0.002459810433812049, "phrase": "expensive_computer_code"}, {"score": 0.0024319378563138223, "phrase": "fast_surrogate"}], "paper_keywords": ["Bayesian cluster expansion", " Uncertainty quantification", " Alloy modeling", " High posterior density"], "paper_abstract": "Parametrized surrogate models are used in alloy modeling to quickly obtain otherwise expensive properties such as quantum mechanical energies, and thereafter used to optimize, or simply compute, some alloy quantity of interest, e.g., a phase transition, subject to given constraints. Once learned on a data set, the surrogate can compute alloy properties fast, but with an increased uncertainty compared to the computer code. This uncertainty propagates to the quantity of interest and in this work we seek to quantify it. Furthermore, since the alloy property is expensive to compute, we only have available a limited amount of data from which the surrogate is to be learned. Thus, limited data further increases the uncertainties in the quantity of interest, and we show how to capture this as well. We cannot, and should not, trust the surrogate before we quantify the uncertainties in the application at hand. Therefore, in this work we develop a fully Bayesian framework for quantifying the uncertainties in alloy quantities of interest, originating from replacing the expensive computer code with the fast surrogate, and from limited data. We consider a particular surrogate popular in alloy modeling, the cluster expansion, and aim to quantify how well it captures quantum mechanical energies. Our framework is applicable to other surrogates and alloy properties. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Bayesian uncertainty quantification in the evaluation of alloy properties with the cluster expansion method", "paper_id": "WOS:000342244900012"}