{"auto_keywords": [{"score": 0.04408711241958952, "phrase": "integral-differential_wave_equation"}, {"score": 0.00481495049065317, "phrase": "atmospheric_pressure_plasma_layer"}, {"score": 0.004381749459671914, "phrase": "atmospheric_pressure_plasma"}, {"score": 0.003921610578990403, "phrase": "fdtd"}, {"score": 0.0035684266744407485, "phrase": "app_layer"}, {"score": 0.0034324073240680213, "phrase": "wave_electric_field"}, {"score": 0.0030715948036518603, "phrase": "passed_wave_behaviors"}, {"score": 0.002794802975530612, "phrase": "app_layer_characteristics"}, {"score": 0.002445865715873089, "phrase": "appleton's_equation"}, {"score": 0.0022007302738063566, "phrase": "one-dimensional_numerical_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["attenuation of microwave", " atmospheric pressure plasmas"], "paper_abstract": "The propagation of a microwave in an atmospheric pressure plasma (APP) layer is described numerically with an integral-differential wave equation in one dimension (normal incident) case and with the Finite Difference Time Domain (FDTD) method in two dimension (oblique incident) case. When the microwave passes through the APP layer, its amplitude and phase of the wave electric field are obviously modulated by both the electron density and the collisions between the electrons and neutrals. The dependencies of the passed wave behaviors (i.e. the phase shift, the reflectivity, the transmissivity and absorptivity) on the APP layer characteristics (width, electron density, and collision frequency) and microwave characteristics (incident angle and polarization) are presented. The Appleton's Equation can be derived from the Wentzel-Kramers-Brillouin (WKB) solution of the integral-differential wave equation and is compared with the one-dimensional numerical solution. (C) 2007 Published by Elsevier B.V.", "paper_title": "The propagation of a microwave in an atmospheric pressure plasma layer: one- and two-dimensional numerical solutions", "paper_id": "WOS:000248161700031"}