{"auto_keywords": [{"score": 0.04961597900198376, "phrase": "rdf_graphs"}, {"score": 0.04355159126538614, "phrase": "database_contents"}, {"score": 0.03379806871285082, "phrase": "incremental_generation"}, {"score": 0.03300977049985164, "phrase": "rdf_graph"}, {"score": 0.004520132822496416, "phrase": "rdf_views"}, {"score": 0.0040027552011993005, "phrase": "latter_category"}, {"score": 0.0038876302202924644, "phrase": "better_performance"}, {"score": 0.003614119402055604, "phrase": "rdf"}, {"score": 0.003018468582368033, "phrase": "relational_database_contents"}, {"score": 0.0027651847105654363, "phrase": "resulting_rdf_graph"}, {"score": 0.002366110899738696, "phrase": "source_relational_database_contents"}, {"score": 0.002231747358665628, "phrase": "extensive_set"}, {"score": 0.0021049977753042253, "phrase": "authors'_most_important_findings"}], "paper_keywords": ["Linked open data", " incremental", " RDF", " relational databases", " mapping"], "paper_abstract": "Several approaches have been proposed in the literature for offering RDF views over databases. In addition to these, a variety of tools exist that allow exporting database contents into RDF graphs. The approaches in the latter category have often been proved demonstrating better performance than the ones in the former. However, when database contents are exported into RDF, it is not always optimal or even necessary to export, or dump as this procedure is often called, the whole database contents every time. This paper investigates the problem of incremental generation and storage of the RDF graph that is the result of exporting relational database contents. In order to express mappings that associate tuples from the source database to triples in the resulting RDF graph, an implementation of the R2RML standard is subject to testing. Next, a methodology is proposed and described that enables incremental generation and storage of the RDF graph that originates from the source relational database contents. The performance of this methodology is assessed, through an extensive set of measurements. The paper concludes with a discussion regarding the authors' most important findings.", "paper_title": "An Approach for the Incremental Export of Relational Databases into RDF Graphs", "paper_id": "WOS:000352909400010"}