{"auto_keywords": [{"score": 0.028697477560441075, "phrase": "collaborative_learning_process"}, {"score": 0.02771436929865281, "phrase": "group_members"}, {"score": 0.00481495049065317, "phrase": "online_shared_workspaces"}, {"score": 0.004741845603430361, "phrase": "group_collaborative_learning"}, {"score": 0.004483120978156604, "phrase": "today's_workplace"}, {"score": 0.0040481944502103505, "phrase": "individual_efforts"}, {"score": 0.003966388754366831, "phrase": "learning_process"}, {"score": 0.003906116922372891, "phrase": "effective_collaboration"}, {"score": 0.003563172322934695, "phrase": "national_institute_of_education"}, {"score": 0.00350902899993704, "phrase": "singapore"}, {"score": 0.0033004240095380623, "phrase": "online_shared_workspace"}, {"score": 0.002392008392892289, "phrase": "weekly_progress_reports"}, {"score": 0.0023197517832705297, "phrase": "progress_reports"}, {"score": 0.0021705796895687864, "phrase": "additional_information"}], "paper_keywords": ["Computer supported collaborative learning (CSCL)", " Coordination", " Monitoring learning process", " Progress report"], "paper_abstract": "The ability to work collaboratively is highly valued in today's workplace. However, collaboration does not often naturally happen in a group. Certain strategies must be applied to coordinate individual efforts and monitor the learning process so that effective collaboration can take place. 34 groups from 4 PGDE (Post Graduate Diploma in Education) classes at NIE (National Institute of Education) in Singapore participated in this study. Each group of four members used an online shared workspace to collaborate. Results showed that about half groups actively used the workspaces to share resources, negotiate ideas, and coordinate their collaboration. On the other hand, using the workspaces helped the teacher to easily track and monitor the collaborative learning process, as the workspaces documented what group members did and how they gradually completed the assignment. The students were also required to write weekly progress reports. Results showed that writing progress reports helped group members to reflect on what they had done and also provided additional information for the teacher to confirm their individual contributions. Issues involved in coordinating and monitoring the collaborative learning process are discussed. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Using online shared workspaces to support group collaborative learning", "paper_id": "WOS:000280985600033"}