{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_healthcare_applications"}, {"score": 0.04261346602453255, "phrase": "fieldwork_data"}, {"score": 0.004776484866276242, "phrase": "ethnographic_approaches"}, {"score": 0.004533806239310673, "phrase": "hcl_researchers"}, {"score": 0.004425979295788883, "phrase": "work_settings"}, {"score": 0.00401961206251868, "phrase": "design_process"}, {"score": 0.003908246778916674, "phrase": "large-scale_field_investigation"}, {"score": 0.003769567397860168, "phrase": "previous_work"}, {"score": 0.003301733505307784, "phrase": "influential_studies"}, {"score": 0.0031337465656628132, "phrase": "healthcare_work"}, {"score": 0.0030962064913500164, "phrase": "patient_review_process"}, {"score": 0.0029034358982402346, "phrase": "analyse_fieldwork_data"}, {"score": 0.0027890803075309926, "phrase": "previous_interpretation"}, {"score": 0.002733598121537801, "phrase": "prototypical_requirements"}, {"score": 0.002711714675297321, "phrase": "associated_critique"}, {"score": 0.0022001958412800745, "phrase": "methodological_implications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": ["Healthcare", " Mobile applications", " Requirements", " Conceptual frameworks", " Fieldwork"], "paper_abstract": "Ethnographic approaches to study of work in the field have been widely adopted by HCl researchers as resources for investigation of work settings and for requirements elicitation Although the value of fieldwork for design is widely recognised. difficulties surround the exploitation of fieldwork data within the design process Since not every development project can support or justify large-scale field investigation, the issue of how to build on previous work within a domain is particularly important In this paper we consider this issue in the context of development of mobile healthcare applications Many such systems will be built in the coming years. and already a number of influential studies have derived concepts from fieldwork data and used them to support analysis of healthcare work Using a patient review process as an example. we examine how the concepts from such exemplar studies can be leveraged to analyse fieldwork data, and to facilitate requirements elicitation The concepts. previous interpretation within the domain, prototypical requirements and associated critique together provide a framework for analysis. The concepts are used to highlight issues that must be addressed and to derive requirements We make the case that these concepts are not \"value free\" and that the course of our analysts is significantly altered through the palette of concepts used The methodological implications of this proposition are also considered (C) 2010 Elsevier Ltd All rights reserved", "paper_title": "Fieldwork for requirements: Frameworks for mobile healthcare applications", "paper_id": "WOS:000281509200011"}