{"auto_keywords": [{"score": 0.0426592730356598, "phrase": "chemical_entities"}, {"score": 0.00481495049065317, "phrase": "turing-inspired_approach"}, {"score": 0.004641890423057823, "phrase": "chemical_basis"}, {"score": 0.004522080178250592, "phrase": "alan_turing"}, {"score": 0.003926359151817743, "phrase": "embryonic_development"}, {"score": 0.003629882559085245, "phrase": "turing's_concepts"}, {"score": 0.0033910448175165004, "phrase": "turing's_ideas"}, {"score": 0.003303412571939192, "phrase": "state-based_modeling"}, {"score": 0.0031678720736808574, "phrase": "fully_executable_program"}, {"score": 0.0029905104479072482, "phrase": "representative_example"}, {"score": 0.0029131986574478046, "phrase": "pancreatic_organogenesis"}, {"score": 0.002867771524071872, "phrase": "complex_developmental_process"}, {"score": 0.0027936239349923464, "phrase": "flat_sheet"}, {"score": 0.002374735066990346, "phrase": "experimental_data"}, {"score": 0.002253461585851626, "phrase": "original_turing-test"}, {"score": 0.002218299213266519, "phrase": "machine's_ability"}, {"score": 0.0021049977753042253, "phrase": "computerized_biological_models"}], "paper_keywords": [""], "paper_abstract": "In his pioneering 1952 paper, \"The chemical basis of morphogenesis\", Alan Turing introduced, perhaps for the first time, a model of the morphogenesis of embryo development. Central to his theory is the concept of cells with chemical entities that interact with morphogens to drive embryonic development through changes in what he termed 'the state of the system'. Turing's concepts have inspired many mathematical and computational models proposed since then. Here we discuss the way Turing's ideas inspired our approach to the state-based modeling of morphogenesis, which results in a fully executable program for the interactions between chemical entities and morphogens. As a representative example we describe our modeling of pancreatic organogenesis, a complex developmental process that develops from a flat sheet of cells into a 3D cauliflower-like shape. We show how we constructed the model and tested the relations between morphogens and cells, and illustrate the analysis of the model against experimental data. Finally, we discuss a variant of the original Turing-Test for a machine's ability to demonstrate intelligence as a future means to validate computerized biological models, like the one presented here.", "paper_title": "Executable Modeling of Morphogenesis: A Turing-Inspired Approach", "paper_id": "WOS:000305296900006"}