{"auto_keywords": [{"score": 0.04967298152704187, "phrase": "car-sequencing_problem"}, {"score": 0.00481495049065317, "phrase": "constraint_programming_heuristics"}, {"score": 0.004562080863250721, "phrase": "assembly_line"}, {"score": 0.004310173770196077, "phrase": "optimization_problem"}, {"score": 0.004153910878671754, "phrase": "car_sequencing_problem"}, {"score": 0.004095323392273661, "phrase": "systematic_way"}, {"score": 0.003847162309175584, "phrase": "relevant_combinations"}, {"score": 0.003750012556296276, "phrase": "common_heuristics"}, {"score": 0.0035832979466583017, "phrase": "earlier_findings"}, {"score": 0.0035629847652158663, "phrase": "specific_heuristics"}, {"score": 0.00343378783528272, "phrase": "smith"}, {"score": 0.003290360233643709, "phrase": "propagation_method"}, {"score": 0.0032347019652642635, "phrase": "criteria_analysis"}, {"score": 0.003126185164931282, "phrase": "good_heuristic"}, {"score": 0.002928236333640633, "phrase": "best_choice"}, {"score": 0.002620732961022912, "phrase": "relatively_high_confidence"}, {"score": 0.002539978170928796, "phrase": "small_set"}, {"score": 0.0025255644226584856, "phrase": "potentially_best_strategies"}, {"score": 0.002468720916457013, "phrase": "regin"}, {"score": 0.00235213013487844, "phrase": "pruning_rule"}, {"score": 0.0021412594173592513, "phrase": "car-sequencing_benchmarks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Car-sequencing", " Heuristics", " Tree search methods", " Constraint programming"], "paper_abstract": "In the car-sequencing problem, a number of cars have to be sequenced on an assembly line respecting several constraints. This problem was addressed by both Operations Research (OR) and Constraint Programming (CP) communities, either as a decision problem or as an optimization problem. In this paper, we consider the decision variant of the car sequencing problem and we propose a systematic way to classify heuristics for solving it. This classification is based on a set of four criteria, and we consider all relevant combinations for these criteria. Some combinations correspond to common heuristics used in the past, whereas many others are novel. Not surprisingly, our empirical evaluation confirms earlier findings that specific heuristics are very important for efficiently solving the car-sequencing problem (see for instance Smith, 1996), in fact, often as important or more than the propagation method. Moreover, through a criteria analysis, we are able to get several new insights into what makes a good heuristic for this problem. In particular, we show that the criterion used to select the most constrained option is critical, and the best choice is fairly reliably the \"load\" of an option. Similarly, branching on the type of vehicle is more efficient than branching on the use of an option. Overall, we can therefore indicate with a relatively high confidence which is the most robust strategy, or at least outline a small set of potentially best strategies. Last, following a remark in Regin and Puget (1997) stating that the notion of slack used in heuristics induces a pruning rule, we propose an algorithm for this method and experimentally evaluate it, showing that, although computationally cheap and easy to implement, this is in practice a very efficient way to solve car-sequencing benchmarks. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A study of constraint programming heuristics for the car-sequencing problem", "paper_id": "WOS:000348748200004"}