{"auto_keywords": [{"score": 0.047045721055493844, "phrase": "energy_consumption"}, {"score": 0.015432071866640206, "phrase": "data_aggregation_tree"}, {"score": 0.01494110945581709, "phrase": "minimum_spanning_tree"}, {"score": 0.0125326630097638, "phrase": "delay_time"}, {"score": 0.00481495049065317, "phrase": "degree-constrained_adaptive_algorithm"}, {"score": 0.004638462976078815, "phrase": "pedap_algorithm"}, {"score": 0.004385733482617193, "phrase": "kruskal_algorithm"}, {"score": 0.003488556851623159, "phrase": "adaptive"}, {"score": 0.0031919592786945126, "phrase": "weight_model"}, {"score": 0.0030319482153908037, "phrase": "node_degree"}, {"score": 0.0029069972482610403, "phrase": "average_degree"}, {"score": 0.0026722904884984348, "phrase": "child_nodes"}, {"score": 0.00263505298504827, "phrase": "red_nodes"}, {"score": 0.0023996890513009743, "phrase": "update_rounds'_impact"}, {"score": 0.0023662411481713682, "phrase": "network_lifetime"}, {"score": 0.0023442013458139497, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "lower_latency"}], "paper_keywords": [""], "paper_abstract": "In the PEDAP algorithm, a minimum spanning tree considering the energy consumption is established based on the Kruskal algorithm, and updated every 100 rounds. There exists a defect that the energy of some nodes rapidly expires because the degrees of nodes differ significantly, and the delay time is not considered. Based on the above analysis, a new algorithm called DADAT (a Degree-based Adaptive algorithm for Data Aggregation Tree) is proposed. The energy consumption and the delay time are both considered, and a weight model to construct a minimum spanning tree is established. Furthermore, the node degree on the tree is readjusted according to the average degree of the network, and nodes are labeled by red, yellow, and green colors according to their remaining energy; the child nodes of the red nodes are adaptively transferred to their neighbor nodes which are labeled as green. Finally, we discuss the weight and the update rounds' impact on the network lifetime. Experimental results show that the algorithm can effectively balance the energy consumption and prolong the lifetime of the network, as well as achieving a lower latency.", "paper_title": "The Degree-Constrained Adaptive Algorithm Based on the Data Aggregation Tree", "paper_id": "WOS:000332648400001"}