{"auto_keywords": [{"score": 0.05007816044775789, "phrase": "unified_conceptual_model"}, {"score": 0.042396670476865794, "phrase": "mde"}, {"score": 0.004730338746443662, "phrase": "new_trend"}, {"score": 0.004406436661912347, "phrase": "software_engineering_field"}, {"score": 0.004313643010028869, "phrase": "automatic_execution"}, {"score": 0.00428314621261913, "phrase": "software_systems"}, {"score": 0.004075596668736259, "phrase": "-driven_engineering"}, {"score": 0.003989742144066683, "phrase": "common_concepts"}, {"score": 0.0035867530188337933, "phrase": "essential_concepts"}, {"score": 0.0030462191741660346, "phrase": "earlier_work"}, {"score": 0.0028474035592052052, "phrase": "respective_terminology"}, {"score": 0.0027577972695911825, "phrase": "key_questions"}, {"score": 0.0025413743933379185, "phrase": "key_facets"}, {"score": 0.0025144238077014114, "phrase": "modeling_language"}, {"score": 0.0024094425220967273, "phrase": "software_development_process"}, {"score": 0.0023006418600072325, "phrase": "software_platforms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Model", " Metamodel", " Modeling language", " Software system", " Model-driven engineering", " Model-driven approaches"], "paper_abstract": "During the last decade a new trend of approaches has emerged, which considers models not just documentation artefacts, but also central artefacts in the software engineering field, allowing the creation or automatic execution of software systems starting from those models. These proposals have been classified generically as Model-Driven Engineering (MDE) and share common concepts and terms that need to be abstracted, discussed and understood. This paper presents a survey on MDE based on a unified conceptual model that clearly identifies and relates these essential concepts, namely the concepts of system, model, metamodel, modeling language, transformations, software platform, and software product. In addition, this paper discusses the terminologies relating MDE, MDD, MDA and others. This survey is based on earlier work, however, contrary to those, it intends to give a simple, broader and integrated view of the essential concepts and respective terminology commonly involved in the MDE, answering to key questions such as: What is a model? What is the relation between a model and a metamodel? What are the key facets of a modeling language? How can I use models in the context of a software development process? What are the relations between models and source code artefacts and software platforms? and What are the relations between MDE, MDD, MDA and other MD approaches? (C) 2015 The Author. Published by Elsevier Ltd.", "paper_title": "Model-driven engineering: A survey supported by the unified conceptual model", "paper_id": "WOS:000360513500006"}