{"auto_keywords": [{"score": 0.029027825485525773, "phrase": "other's_rhythms"}, {"score": 0.00481495049065317, "phrase": "better_aging"}, {"score": 0.004577869668211548, "phrase": "key_challenge"}, {"score": 0.004412780054037622, "phrase": "trained_personnel"}, {"score": 0.004352411290383643, "phrase": "increased_age"}, {"score": 0.004253618550301311, "phrase": "innovative_approaches"}, {"score": 0.0031845067058084583, "phrase": "user_study"}, {"score": 0.003097865379563127, "phrase": "existing_role"}, {"score": 0.0028914057633212045, "phrase": "peer_support_relationships"}, {"score": 0.002530359917257626, "phrase": "technology_probe"}, {"score": 0.002427732996314194, "phrase": "elderly_friends"}, {"score": 0.0021441057555396013, "phrase": "elderly_peers"}], "paper_keywords": ["aging in place", " awareness", " computer-mediated communication", " communication appliances", " elderly", " markerClock", " PeerCare", " rhythms", " routines", " technology probes"], "paper_abstract": "Caring for the elderly is becoming a key challenge for society, given the shortage of trained personnel and the increased age of the population. Innovative approaches are needed to help the elderly remain at home longer and more safely, that is, to age in place. One popular strategy is to monitor the activity of the elderly: this focuses on obtaining information for caregivers rather than supporting the elderly directly. We propose an alternative, i.e. to enhance their inter-personal communication. We report the results of a user study with 14 independent elderly women and discuss the existing role that communication plays in maintaining their independence and wellbeing. We highlight the importance of peer support relationships, which we call PeerCare, and how awareness of each other's rhythms and routines helps them to stay in touch. We then describe the deployment of a technology probe, called markerClock, which a pair of elderly friends used to improve their awareness of each other's rhythms and routines. We conclude with a discussion of how such communication appliances enhance the awareness of rhythms and routines among elderly peers and can improve their quality of life and provide safer and more satisfying aging in place.", "paper_title": "PeerCare: Supporting Awareness of Rhythms and Routines for Better Aging in Place", "paper_id": "WOS:000276928300003"}