{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "universal_leader_election"}, {"score": 0.04552339465490532, "phrase": "randomized_algorithms"}, {"score": 0.03418581481601838, "phrase": "general_case"}, {"score": 0.004740873186016305, "phrase": "fundamental_task"}, {"score": 0.004719917344135166, "phrase": "distributed_computing"}, {"score": 0.004606297427044977, "phrase": "elected_leader"}, {"score": 0.004505371025533241, "phrase": "time_complexity"}, {"score": 0.004485451470437543, "phrase": "randomized_implicit_leader_election"}, {"score": 0.004465619590418205, "phrase": "synchronous_distributed_networks"}, {"score": 0.004050743135889622, "phrase": "network_diameter"}, {"score": 0.0037234771151164942, "phrase": "complete_networks"}, {"score": 0.00358572906076028, "phrase": "basic_lower_bounds"}, {"score": 0.0035304960572823544, "phrase": "deterministic_algorithms"}, {"score": 0.003491563740760818, "phrase": "restricted_case"}, {"score": 0.0034761108707871856, "phrase": "comparison_algorithms"}, {"score": 0.0032813181498895887, "phrase": "fundamental_lower_bounds"}, {"score": 0.0032093291406787303, "phrase": "randomized_monte_carlo_algorithms"}, {"score": 0.0031180920172345456, "phrase": "universal_algorithms"}, {"score": 0.0028030574811595092, "phrase": "node's_identities"}, {"score": 0.0026754088142058904, "phrase": "slight_adaptation"}, {"score": 0.00259931078176189, "phrase": "randomized_broadcast_algorithms"}, {"score": 0.002582058550135715, "phrase": "interesting_fundamental_problem"}, {"score": 0.0025592331085507267, "phrase": "upper_bounds"}, {"score": 0.002491957321468446, "phrase": "randomized_setting"}, {"score": 0.0024156954165579963, "phrase": "deterministic_setting"}, {"score": 0.002362652332717059, "phrase": "randomized_algorithm"}, {"score": 0.002265050844948198, "phrase": "deterministic_ones"}, {"score": 0.0021049977753042253, "phrase": "distributed_networks"}], "paper_keywords": ["Theory", " Algorithms", " Leader election", " lower bound", " distributed algorithm"], "paper_abstract": "Electing a leader is a fundamental task in distributed computing. In its implicit version, only the leader must know who is the elected leader. This article focuses on studying the message and time complexity of randomized implicit leader election in synchronous distributed networks. Surprisingly, the most \"obvious\" complexity bounds have not been proven for randomized algorithms. In particular, the seemingly obvious lower bounds of Omega(m) messages, where m is the number of edges in the network, and Omega(D) time, where D is the network diameter, are nontrivial to show for randomized (Monte Carlo) algorithms. (Recent results, showing that even Omega(n), where n is the number of nodes in the network, is not a lower bound on the messages in complete networks, make the above bounds somewhat less obvious). To the best of our knowledge, these basic lower bounds have not been established even for deterministic algorithms, except for the restricted case of comparison algorithms, where it was also required that nodes may not wake up spontaneously and that D and n were not known. We establish these fundamental lower bounds in this article for the general case, even for randomized Monte Carlo algorithms. Our lower bounds are universal in the sense that they hold for all universal algorithms (namely, algorithms that work for all graphs), apply to every D, m, and n, and hold even if D, m, and n are known, all the nodes wake up simultaneously, and the algorithms can make any use of node's identities. To show that these bounds are tight, we present an O(m) messages algorithm. An O(D) time leader election algorithm is known. A slight adaptation of our lower bound technique gives rise to an Omega(m) message lower bound for randomized broadcast algorithms. An interesting fundamental problem is whether both upper bounds (messages and time) can be reached simultaneously in the randomized setting for all graphs. The answer is known to be negative in the deterministic setting. We answer this problem partially by presenting a randomized algorithm that matches both complexities in some cases. This already separates (for some cases) randomized algorithms from deterministic ones. As first steps towards the general case, we present several universal leader election algorithms with bounds that tradeoff messages versus time. We view our results as a step towards understanding the complexity of universal leader election in distributed networks.", "paper_title": "On the Complexity of Universal Leader Election", "paper_id": "WOS:000350563000007"}