{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "hard-deadline_scheduling"}, {"score": 0.00450020161335541, "phrase": "time-varying_channel"}, {"score": 0.00419016653753787, "phrase": "equivalently_how_much_power"}, {"score": 0.004081385289516914, "phrase": "causal_channel_knowledge"}, {"score": 0.003771631577951067, "phrase": "future_slots"}, {"score": 0.0036461569988218267, "phrase": "opportunistic_scheduling_problem"}, {"score": 0.003591733916159209, "phrase": "expected_transmission_energy"}, {"score": 0.003407549468745519, "phrase": "transmission_rate"}, {"score": 0.003306559295382181, "phrase": "underlying_additive_white_gaussian_noise_channel"}, {"score": 0.003220643255032943, "phrase": "channel_quality"}, {"score": 0.0028553693643045795, "phrase": "good_channel_quality"}, {"score": 0.002688532127821979, "phrase": "final_slot"}, {"score": 0.002502995662011305, "phrase": "finite-horizon_dynamic_program"}, {"score": 0.0024014759148123736, "phrase": "limiting_regimes"}, {"score": 0.0021049977753042253, "phrase": "optimal_scheduling"}], "paper_keywords": ["Asymptotic analysis", " delay effects", " dynamic programming", " scheduling"], "paper_abstract": "A hard-deadline, opportunistic scheduling problem in which B bits must be transmitted within T time slots over a time-varying channel is studied: at the beginning of each slot the transmitter must decide how many bits to serve, or equivalently how much power to transmit with, based on causal channel knowledge where the channel varies from slot to slot (i.e., the channel in the current slot is known, but the channels in future slots are unknown). The objective of the opportunistic scheduling problem is to minimize expected transmission energy. It is assumed that no other packets are concurrently scheduled and that the transmission rate is equal to the capacity of the underlying additive white Gaussian noise channel within each slot, where the channel quality is fixed within a slot but varies in from slot to slot. Thus, the scheduler should be opportunistic, in the sense of transmitting more bits in slot(s) with good channel quality, while also being aware of the deadline so that not too many bits are left to the final slot. No closed-form solution for the optimal policy is known for this problem, which is naturally formulated as a finite-horizon dynamic program, but three different policies are shown to be optimal in the limiting regimes where T is fixed and B is large, T is fixed and B is small, and where B and T are simultaneously taken to infinity. In addition, the advantage of optimal scheduling is quantified relative to a nonopportunistic (i.e., channel blind) equal-bit policy.", "paper_title": "Asymptotically Optimal Policies for Hard-Deadline Scheduling Over Fading Channels", "paper_id": "WOS:000316407900036"}