{"auto_keywords": [{"score": 0.05007808235736474, "phrase": "classifier_combining_problem"}, {"score": 0.0490047077785489, "phrase": "mil"}, {"score": 0.004749824776508639, "phrase": "multiple-instance_learning"}, {"score": 0.004397000006837371, "phrase": "feature_vectors"}, {"score": 0.003978866233891427, "phrase": "unknown_labels"}, {"score": 0.003584025547693833, "phrase": "mixture_distribution"}, {"score": 0.0033937776228549557, "phrase": "convenient_way"}, {"score": 0.003015401937358271, "phrase": "classification_posteriors"}, {"score": 0.0029610472910087176, "phrase": "instance_labels"}, {"score": 0.002765776659294382, "phrase": "optimal_decision_rule"}, {"score": 0.002525248554951453, "phrase": "concept_class"}, {"score": 0.0021632743048552536, "phrase": "state-of-the-art_mil_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiple instance learning", " Classifier combining"], "paper_abstract": "In multiple-instance learning (MIL), an object is represented as a bag consisting of a set of feature vectors called instances. In the training set, the labels of bags are given, while the uncertainty comes from the unknown labels of instances in the bags. In this paper, we study MIL with the assumption that instances are drawn from a mixture distribution of the concept and the non-concept, which leads to a convenient way to solve MIL as a classifier combining problem. It is shown that instances can be classified with any standard supervised classifier by re-weighting the classification posteriors. Given the instance labels, the label of a bag can be obtained as a classifier combining problem. An optimal decision rule is derived that determines the threshold on the fraction of instances in a bag that is assigned to the concept class. We provide estimators for the two parameters in the model. The method is tested on a toy data set and various benchmark data sets, and shown to provide results comparable to state-of-the-art MIL methods. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Multiple-instance learning as a classifier combining problem", "paper_id": "WOS:000313385700022"}