{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "markov"}, {"score": 0.0491348634864544, "phrase": "metadata_extraction"}, {"score": 0.04853239165840599, "phrase": "heterogeneous_references"}, {"score": 0.004456044928556639, "phrase": "efficient_and_accurate_extraction"}, {"score": 0.0040708542958968605, "phrase": "hidden_markov_models"}, {"score": 0.003916098498242888, "phrase": "major_contributions"}, {"score": 0.003310447652300423, "phrase": "corresponding_new_viterbi_algorithm"}, {"score": 0.003163985877966426, "phrase": "new_smoothing_technique"}, {"score": 0.0031233388358844188, "phrase": "transition_probabilities"}, {"score": 0.002927780883930371, "phrase": "back-off_shrinkage_technique"}, {"score": 0.0026570998719084153, "phrase": "training_procedure"}, {"score": 0.002319566486828135, "phrase": "overall_accuracy"}], "paper_keywords": ["Metadata extraction", " Hidden Markov models", " Bibliography", " Second order", " Shrinkage"], "paper_abstract": "Our objective was to explore an efficient and accurate extraction of metadata such as author, title and institution from heterogeneous references, using hidden Markov models (HMMs). The major contributions of the research were the (i) development of a trigram, full second order hidden Markov model with more priority to words emitted in transitions to the same state, with a corresponding new Viterbi algorithm (ii) introduction of a new smoothing technique for transition probabilities and (iii) proposal of a modification of back-off shrinkage technique for emission probabilities. The effect of the size of data set on the training procedure was also measured. Comparisons were made with other related works and the model was evaluated with three different data sets. The results showed overall accuracy, precision, recall and F1 measure of over 95% suggesting that the method outperforms other related methods in the task of metadata extraction from references. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A trigram hidden Markov model for metadata extraction from heterogeneous references", "paper_id": "WOS:000288774700003"}