{"auto_keywords": [{"score": 0.049090663946911924, "phrase": "internet_usage"}, {"score": 0.015272020668295702, "phrase": "interpersonal_relationship"}, {"score": 0.012837915127756777, "phrase": "interpersonal_relationships"}, {"score": 0.005177863923979087, "phrase": "net-friend_relationship"}, {"score": 0.005049886462602708, "phrase": "teacher-student_relationship"}, {"score": 0.00481495049065317, "phrase": "physical_and_cyber_interpersonal_relationships"}, {"score": 0.0045878006961193735, "phrase": "lower_extent"}, {"score": 0.004283913685201902, "phrase": "quick_evolution"}, {"score": 0.004248294537944227, "phrase": "internet_functions"}, {"score": 0.004143196873246147, "phrase": "latest_years"}, {"score": 0.0040916230716372265, "phrase": "interpersonal_interactions"}, {"score": 0.0033482708495261864, "phrase": "gender_difference"}, {"score": 0.0032112354575523317, "phrase": "structural_equation"}, {"score": 0.0030414140732789186, "phrase": "social_interaction"}, {"score": 0.0028926147550022607, "phrase": "online_game_playing"}, {"score": 0.002660574167091781, "phrase": "parent-child_relationships"}, {"score": 0.0025730425700096365, "phrase": "higher_game_playing"}, {"score": 0.0023764959294052964, "phrase": "lower_video_watching"}, {"score": 0.00231759652007697, "phrase": "peer_relationship"}, {"score": 0.002298288831092204, "phrase": "parent-child_relationship"}, {"score": 0.0022696277881969896, "phrase": "proposed_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Gender study", " Pedagogical issues", " Media in education", " Post-secondary education"], "paper_abstract": "The effect of Internet usage on interpersonal relationship has attracted researchers for decades. Much research indicated that the Internet usage is harmful to the interpersonal relationship. Yet with the quick evolution of Internet functions, Internet provides more channels in latest years for conducting interpersonal interactions, which makes researchers argue that Internet usage can enhance interpersonal relationships. In sum, the past research findings were inconsistent. To explain the contradiction, this study explored the effect on the interpersonal relationships in terms of peer, parent-child, teacher-student, and net-friend from the gender difference and various Internet usage perspectives. Data were gathered from 444 college students for structural equation modeling analysis. The results of this study revealed that Internet usage on social interaction and information seeking can positively affect all kinds of interpersonal relationships. Online game playing can enhance net-friend relationship, but is harmful to teacher-student relationship. Surprisingly, video watching can positively affect peer and parent-child relationships. Besides, through the intermediation of higher game playing, males have lower extent of teacher-student relationship and higher level of net-friend relationship. Contrarily, through the intermediation of lower video watching, males have lower extent of peer relationship and parent-child relationship. This proposed model may more clarify the association of Internet usage and interpersonal relationship than past research. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The effect of gender and Internet usage on physical and cyber interpersonal relationships", "paper_id": "WOS:000325600400026"}