{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "networked_machines"}, {"score": 0.004760394308239882, "phrase": "internet_technologies"}, {"score": 0.0044967055264893184, "phrase": "external_and_internal_attackers"}, {"score": 0.0039216854691927865, "phrase": "unlawful_activities"}, {"score": 0.003789763907758991, "phrase": "organizational_information"}, {"score": 0.0036622637391432143, "phrase": "previous_research"}, {"score": 0.0033811403330431897, "phrase": "first_time"}, {"score": 0.003193606324727067, "phrase": "intrusion_detection_problems"}, {"score": 0.003068537223324389, "phrase": "new_network_intrusion_system"}, {"score": 0.002999274091205852, "phrase": "bc_searching_algorithm"}, {"score": 0.0028167336373711494, "phrase": "proposed_anomaly-based_nids"}, {"score": 0.002706383680762465, "phrase": "abc_algorithm"}, {"score": 0.002442025065383455, "phrase": "mit_lincoln_labs"}, {"score": 0.0023463203637929466, "phrase": "proposed_a-nids-abc"}, {"score": 0.002216054733102974, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "network_intrusion_detection"}], "paper_keywords": ["Network intrusion detection systems", " Artificial bee colony algorithm", " Classification"], "paper_abstract": "Network Intrusion Detection Systems (NIDSs) are increasingly in demand today as the widespread of networked machines and Internet technologies emerge rapidly. As a result, many unauthorized activities by external and internal attackers within organizations need to be detected in recent years. Thus, it is crucial that organizations should have the capability to detect these unlawful activities so that the integrity of organizational information can be protected. In previous research, NIDSs have been approached by various machine learning techniques. From our knowledge, it is first time applying the Artificial Bee Colony (A BC) to solve the intrusion detection problems. In this paper, a new network intrusion system based on A BC searching algorithm has been proposed and implemented. The performance of the proposed Anomaly-based NIDS (A-NIDS) using ABC algorithm (called A-NIDS-ABC for short) has been tested using KDD-99 datasets developed by MIT Lincoln Labs. We have also compared the proposed A-NIDS-ABC with other five traditional classification algorithms. The experimental results showed that the proposed method can outperform other five popular benchmark classifiers and is suitable for the network intrusion detection.", "paper_title": "A NOVEL ANOMALY-NETWORK INTRUSION DETECTION SYSTEM USING ABC ALGORITHMS", "paper_id": "WOS:000312435200014"}