{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grey_numbers"}, {"score": 0.046081391722127746, "phrase": "existing_attribute_values"}, {"score": 0.0450260882774516, "phrase": "development_trend"}, {"score": 0.004745665541429529, "phrase": "existing_state_and_future_development_trend"}, {"score": 0.004205570965859848, "phrase": "whole_period"}, {"score": 0.003949377440799037, "phrase": "dynamic_nature"}, {"score": 0.0037811784409635023, "phrase": "dynamic_grey_target_method"}, {"score": 0.0037267132967205136, "phrase": "new_viewpoint"}, {"score": 0.0036553070575015344, "phrase": "attribute_values"}, {"score": 0.0034995881411519925, "phrase": "proposed_method"}, {"score": 0.002814759530655965, "phrase": "comprehensive_approaching_degree"}, {"score": 0.0025673856614952854, "phrase": "new_concept"}, {"score": 0.0025059724686541263, "phrase": "grey_target_method"}, {"score": 0.0021049977753042253, "phrase": "proposed_method's_effectiveness"}], "paper_keywords": ["Dynamic decision making", " grey numbers", " grey target", " development trend of alternatives"], "paper_abstract": "The classic dynamic decision making methods mainly focus on aggregating the existing attribute values, not considering the development trend of alternatives through the whole period. Both the two aspects should be taken into account for reflecting the dynamic nature comprehensively. This paper is to present a dynamic grey target method from a new viewpoint, where the attribute values take the form of grey numbers. In the proposed method, an extended grey target technique based on approaching degree is applied twice, which is firstly applied in seeking the ranking of alternatives with existing attribute values in each period, and secondly applied in exploring the ranking of fluctuation of alternatives with respect to each attribute. Then the comprehensive approaching degree of alternative is to be aggregated concerning the two aspects with respect to all attributes through all the periods. The new concept of approaching degree in grey target method reflects the similarity and closeness of sequence. Both the information performance and the development trend of alternatives through the multi-periods are reflected. An evaluation of sub-companies in an enterprise and discussion are given to demonstrate the proposed method's effectiveness and superiority.", "paper_title": "Dynamic grey target decision making method with grey numbers based on existing state and future development trend of alternatives", "paper_id": "WOS:000357312800018"}