{"auto_keywords": [{"score": 0.04664571852812289, "phrase": "data_transmission"}, {"score": 0.014831375486088386, "phrase": "power_consumption"}, {"score": 0.008067795309504043, "phrase": "mtpcr"}, {"score": 0.007152368807539886, "phrase": "wireless_multi-hop_networks"}, {"score": 0.006479412588623098, "phrase": "transmission_bandwidth"}, {"score": 0.005218764329883488, "phrase": "routing_path"}, {"score": 0.004653815971302021, "phrase": "high_transmission_bandwidth"}, {"score": 0.004610809404212932, "phrase": "high_delivery_rate"}, {"score": 0.004582832968403414, "phrase": "path_maintenance_mechanism"}, {"score": 0.0044980495194868525, "phrase": "transmission_delay"}, {"score": 0.004267468074128779, "phrase": "received_packets"}, {"score": 0.004201917651000657, "phrase": "contention-based_mac_layer"}, {"score": 0.003937379670109389, "phrase": "power-aware_routing_protocol"}, {"score": 0.0038648914374241447, "phrase": "desired_routing_path"}, {"score": 0.003712362078915926, "phrase": "desired_path"}, {"score": 0.003140401552000472, "phrase": "neighboring_nodes"}, {"score": 0.003054009753601139, "phrase": "good_path_bandwidth"}, {"score": 0.0027827907725673845, "phrase": "proposed_path_maintenance_mechanism"}, {"score": 0.0026399046763432906, "phrase": "path_breakages"}, {"score": 0.002481149990680295, "phrase": "aodv"}, {"score": 0.0024658107825954166, "phrase": "dsr"}, {"score": 0.0023979236879995425, "phrase": "mmbcr"}, {"score": 0.002383094469215288, "phrase": "xmbcr"}, {"score": 0.002317487656681634, "phrase": "pamp."}, {"score": 0.002205271162193116, "phrase": "path_discovery"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Wireless multi-hop network", " Transmission bandwidth", " Signal strength", " Power consumption", " Power-aware routing", " Path maintenance mechanism"], "paper_abstract": "In wireless multi-hop networks, selecting a path that has a high transmission bandwidth or a high delivery rate of packets can reduce power consumption and shorten transmission delay during data transmission. There are two factors that influence the transmission bandwidth: the signal strength of the received packets and contentions in the contention-based MAC layer. These two factors may cause more power to be consumed during data transmission. We analyze these two factors and propose a power-aware routing protocol called MTPCR. MTPCR discovers the desired routing path that has reduced power consumption during data transmission. In addition to finding a desired path to reduce power consumption, MTPCR also takes into account the situations in which the transmission bandwidth of the routing path may decrease, resulting in much power consumption during data transmission because of the mobility of nodes in a network. MTPCR is thus useful in a network: it analyzes power consumption during data transmission with the help of neighboring nodes, and it uses a path maintenance mechanism to maintain good path bandwidth. The density of nodes in a network is used to determine when to activate the path maintenance mechanism in order to reduce the overhead of this mechanism. With the proposed path maintenance mechanism, power consumption during data transmission can be efficiently reduced, as well as the number of path breakages. In our simulation, we compared our proposed routing protocol, MTPCR, with the following protocols: two classical routing protocols. AODV and DSR; two power-aware routing protocols, MMBCR and xMBCR; and one multiple path routing protocol, PAMP. The comparisons are made in terms of throughput of the routing path, power consumption in path discovery, power consumption in data transmission, and network lifetime. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A power efficiency routing and maintenance protocol in wireless multi-hop networks", "paper_id": "WOS:000297892900007"}