{"auto_keywords": [{"score": 0.04112289743676209, "phrase": "api"}, {"score": 0.015719506963250585, "phrase": "computational_photography"}, {"score": 0.004267896572751978, "phrase": "sufficient_image_quality"}, {"score": 0.004229927464182562, "phrase": "computing_power"}, {"score": 0.003991196463806465, "phrase": "open_architecture"}, {"score": 0.003955679223407243, "phrase": "application_programming_interface"}, {"score": 0.0038167308978417306, "phrase": "frankencamera"}, {"score": 0.0037157201349604222, "phrase": "base_hardware_specification"}, {"score": 0.003601276473805547, "phrase": "linux"}, {"score": 0.0033525843225012918, "phrase": "image_processing_pipeline"}, {"score": 0.0033079039414389833, "phrase": "microsecond_timescale"}, {"score": 0.003149094460617212, "phrase": "external_hardware"}, {"score": 0.0026095920086044145, "phrase": "extended_dynamic_range_panoramas"}, {"score": 0.002354302193867031, "phrase": "frankencameras"}, {"score": 0.0021049977753042253, "phrase": "computational_cameras"}], "paper_keywords": [""], "paper_abstract": "Although there has been much interest in computational photography within the research and photography communities, progress has been hampered by the lack of a portable, programmable camera with sufficient image quality and computing power. To address this problem, we have designed and implemented an open architecture and application programming interface (API) for such cameras: the Frankencamera. It consists of a base hardware specification, a software stack based on Linux, and an API for C++. Our architecture permits control and synchronization of the sensor and image processing pipeline at the microsecond timescale, as well as the ability to incorporate and synchronize external hardware like lenses and flashes. This paper specifies our architecture and API, and it describes two reference implementations we have built. Using these implementations, we demonstrate several computational photography applications: high dynamic range (HDR) viewfinding and capture, automated acquisition of extended dynamic range panoramas, foveal imaging, and inertial measurement unit (IMU)-based hand shake detection. Our goal is to standardize the architecture and distribute Frankencameras to researchers and students, as a step toward creating a community of-photographer-programmers who develop algorithms, applications, and hardware for computational cameras.", "paper_title": "The Frankencamera: An Experimental Platform for Computational Photography", "paper_id": "WOS:000311293300029"}