{"auto_keywords": [{"score": 0.041949740247732056, "phrase": "mi"}, {"score": 0.010612204820882615, "phrase": "mutual_information"}, {"score": 0.006031122903766257, "phrase": "sampling_variance"}, {"score": 0.004731754442072492, "phrase": "prior_assumptions"}, {"score": 0.004666228956744244, "phrase": "correct_estimate"}, {"score": 0.004246947739596565, "phrase": "wide_variety"}, {"score": 0.004217425501814589, "phrase": "bioinformatic_problems"}, {"score": 0.004030449969901066, "phrase": "computed_values"}, {"score": 0.003919515745050147, "phrase": "striking_differences"}, {"score": 0.0037719307016238998, "phrase": "'true'_value"}, {"score": 0.0036937768530367647, "phrase": "straightforward_procedure"}, {"score": 0.0035920758080335655, "phrase": "remarkably_different_estimates"}, {"score": 0.0033498651263935194, "phrase": "non-equal_values"}, {"score": 0.003303412571939192, "phrase": "exact_frequencies"}, {"score": 0.0032689949867583633, "phrase": "mi_estimates"}, {"score": 0.003091381857342703, "phrase": "implausibly_large_datasets"}, {"score": 0.0029852932802967224, "phrase": "biologically_reasonable_estimates"}, {"score": 0.002862767868795934, "phrase": "kullback-leibler_divergence"}, {"score": 0.002803398730609738, "phrase": "equally_plausible_hypotheses"}, {"score": 0.002754863452181364, "phrase": "sparse_contingency_tables"}, {"score": 0.0026883186885595127, "phrase": "protein_coevolution_studies"}, {"score": 0.0025779504911297236, "phrase": "physical_phenomena"}, {"score": 0.002378887754874809, "phrase": "expected_frequencies"}, {"score": 0.0021049977753042253, "phrase": "frequency_parameters"}], "paper_keywords": [""], "paper_abstract": "Motivation: Mutual information (MI) is a quantity that measures the dependence between two arbitrary random variables and has been repeatedly used to solve a wide variety of bioinformatic problems. Recently, when attempting to quantify the effects of sampling variance on computed values of MI in proteins, we encountered striking differences among various novel estimates of MI. These differences revealed that estimating the 'true' value of MI is not a straightforward procedure, and minor variations of assumptions yielded remarkably different estimates. Results: We describe four formally equivalent estimates of MI, three of which explicitly account for sampling variance, that yield non-equal values of MI given exact frequencies. These MI estimates are essentially non-predictive of each other, converging only in the limit of implausibly large datasets. Lastly, we show that all four estimates are biologically reasonable estimates of MI, despite their disparity, since each is actually the Kullback-Leibler divergence between random variables conditioned on equally plausible hypotheses. Conclusions: For sparse contingency tables of the type universally observed in protein coevolution studies, our results show that estimates of MI, and hence inferences about physical phenomena such as coevolution, are critically dependent on at least three prior assumptions. These assumptions are: (i) how observation counts relate to expected frequencies; (ii) the relationship between joint and marginal frequencies; and (iii) how non-observed categories are interpreted. In any biologically relevant data, these assumptions will affect the MI estimate as much or more-so than observed data, and are independent of uncertainty in frequency parameters.", "paper_title": "Mutual information is critically dependent on prior assumptions: would the correct estimate of mutual information please identify itself?", "paper_id": "WOS:000277225400001"}