{"auto_keywords": [{"score": 0.027847958163343272, "phrase": "high_percentage"}, {"score": 0.00481495049065317, "phrase": "adaptive_coalitions"}, {"score": 0.0047292449487169345, "phrase": "competitive_environments"}, {"score": 0.004695389394526107, "phrase": "internet-based_scenarios"}, {"score": 0.004354149483556514, "phrase": "service_tasks"}, {"score": 0.0042459818200777846, "phrase": "service_requests"}, {"score": 0.004023120753104693, "phrase": "service_worldoad"}, {"score": 0.0033249931673591457, "phrase": "key_contribution"}, {"score": 0.0032893028281789287, "phrase": "decision_making_mechanism"}, {"score": 0.003161674440750158, "phrase": "competitive_environment"}, {"score": 0.0028792911886505526, "phrase": "empirical_evidence"}, {"score": 0.0027378045447760705, "phrase": "high_levels"}, {"score": 0.0027181663098561066, "phrase": "customer_satisfaction"}, {"score": 0.002529347938294228, "phrase": "unreliable_workers"}, {"score": 0.0024050158199950024, "phrase": "varying_distribution"}, {"score": 0.002387758958649797, "phrase": "customers'_incoming_tasks"}, {"score": 0.0022218413146898887, "phrase": "individual_agents"}, {"score": 0.0021821915946356168, "phrase": "new_coalitions"}, {"score": 0.0021509807762081145, "phrase": "high_task_demand"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Coalitions", " Collaboration", " Reputation", " Crowdsourcing", " Competitive environments"], "paper_abstract": "Internet-based scenarios, like co-working, e-freelancing, or crowdsourcing, usually need supporting collaboration among several actors that compete to service tasks. Moreover, the distribution of service requests, i.e., the arrival rate, varies overtime, as well as the service worldoad required by each customer. In these scenarios, coalitions can be used to help agents to manage tasks they cannot tackle individually. In this paper we present a model to build and adapt coalitions with the goal of improving the quality and the quantity of tasks completed. The key contribution is a decision making mechanism that uses reputation and adaptation to allow agents in a competitive environment to autonomously enact and sustain coalitions, not only its composition, but also its number, i.e., how many coalitions are necessary. We provide empirical evidence showing that when agents employ our mechanism it is possible for them to maintain high levels of customer satisfaction. First, we show that coalitions keep a high percentage of tasks serviced on time despite a high percentage of unreliable workers. Second, coalitions and agents demonstrate that they successfully adapt to a varying distribution of customers' incoming tasks. This occurs because our decision making mechanism facilitates coalitions to disband when they become non-competitive, and individual agents detect opportunities to start new coalitions in scenarios with high task demand. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Using reputation and adaptive coalitions to support collaboration in competitive environments", "paper_id": "WOS:000362130500025"}