{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed"}, {"score": 0.003980531478122155, "phrase": "adaptive_complex_systems"}, {"score": 0.003728966994353039, "phrase": "engineered_systems"}, {"score": 0.003399466007862412, "phrase": "nature-inspired_engineering_methods"}, {"score": 0.003290237137651949, "phrase": "three-phase_model"}, {"score": 0.0027491084541806823, "phrase": "manufacturing_world"}, {"score": 0.0024386325347607674, "phrase": "particular_emphasis"}, {"score": 0.0022718774783143203, "phrase": "powerful_concepts"}, {"score": 0.0022472527731744974, "phrase": "crucial_enablers"}, {"score": 0.0021987994275190314, "phrase": "'invisible_hand"}, {"score": 0.0021049977753042253, "phrase": "big_challenges"}], "paper_keywords": ["distributed systems", " bio-inspiration", " autonomy", " complex adaptive systems", " CAS", " self-organisation", " complexity theory", " nature-inspired engineering", " self-* properties"], "paper_abstract": "So far, most nature-inspired applications concern single components and non-distributed systems. However, distributed adaptive complex systems in nature also exhibit many properties which could be highly useful in engineered systems. The most important are clarified in this article, to contribute to a framework of nature-inspired engineering methods. This article proposes a three-phase model which includes 1 understanding natural systems 2 lab experimentation 3 industrial engineering. There are many examples of the transition from 1 to 2, but only few examples of the transition from phase 2 towards 3. Especially in the manufacturing world, this link is missing. Moreover, this article illustrates how concepts from nature can be useful for engineering. Particular emphasis is given to emergence, self-organisation and other self-* properties. These powerful concepts are crucial enablers for creating the 'invisible hand', which is one of the big challenges for the future.", "paper_title": "Distributed systems - from natural to engineered: three phases of inspiration by nature", "paper_id": "WOS:000208451900011"}