{"auto_keywords": [{"score": 0.04482062968194629, "phrase": "argumentation_verification"}, {"score": 0.02758346348962749, "phrase": "abstract_argumentation"}, {"score": 0.00481495049065317, "phrase": "abstract_argumentation_frameworks"}, {"score": 0.004418192459607072, "phrase": "dung's_abstract_argumentation_frameworks"}, {"score": 0.004320156581220516, "phrase": "decision_problems"}, {"score": 0.00399378014373321, "phrase": "political_requirement"}, {"score": 0.003556345965454902, "phrase": "acceptable_arguments"}, {"score": 0.0034643747383816164, "phrase": "argumentation_framework"}, {"score": 0.003324614337607016, "phrase": "framework_specification"}, {"score": 0.0030847461428168614, "phrase": "model_checking"}, {"score": 0.0028728747019026485, "phrase": "modal_framework"}, {"score": 0.0028090313440881937, "phrase": "multiple_extensions"}, {"score": 0.0027057544777834086, "phrase": "attack_relation"}, {"score": 0.002436289099444074, "phrase": "fibring_methodology"}, {"score": 0.002391067964886602, "phrase": "attack_relations"}, {"score": 0.0022018377054878534, "phrase": "argumentation_frameworks"}, {"score": 0.002185394402074883, "phrase": "higher-order_attacks"}, {"score": 0.0021448202319775634, "phrase": "preliminary_version"}, {"score": 0.0021049977753042253, "phrase": "argumentation_compliance"}], "paper_keywords": ["Abstract argumentation theory", " Higher-order argumentation", " Modelling"], "paper_abstract": "In this paper, we propose a logic of argumentation for the specification and verification (LA4SV) of requirements on Dung's abstract argumentation frameworks. We distinguish three kinds of decision problems for argumentation verification, called extension verification, framework verification, and specification verification respectively. For example, given a political requirement like \"if the argument to increase taxes is accepted, then the argument to increase services must be accepted too,\" we can either verify an extension of acceptable arguments, or all extensions of an argumentation framework, or all extensions of all argumentation frameworks satisfying a framework specification. We introduce the logic of argumentation verification to specify such requirements, and we represent the three verification problems of argumentation as model checking and theorem proving properties of the logic. Moreover, we recast the logic of argumentation verification in a modal framework, in order to express multiple extensions, and properties like transitivity and reflexivity of the attack relation. Finally, we introduce a logic of meta-argumentation where abstract argumentation is used to reason about abstract argumentation itself. We define the logic of meta-argumentation using the fibring methodology in such a way to represent attack relations not only among arguments but also among attacks. We show how to use this logic to verify the requirements of argumentation frameworks where higher-order attacks are allowed [A preliminary version of the logic of argumentation compliance was called the logic of abstract argumentation (2005).].", "paper_title": "A logic of argumentation for specification and verification of abstract argumentation frameworks", "paper_id": "WOS:000312272700007"}