{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "universal_access"}, {"score": 0.015183644664927868, "phrase": "social_networking_sites"}, {"score": 0.010974387710869556, "phrase": "online_deaf_communities"}, {"score": 0.010116835633059651, "phrase": "hearing_loss"}, {"score": 0.004594951819987416, "phrase": "numerous_studies"}, {"score": 0.0045415338200109345, "phrase": "online_activities"}, {"score": 0.004333973355873714, "phrase": "limited_research"}, {"score": 0.002619748321217153, "phrase": "written_language"}, {"score": 0.002549096826249, "phrase": "sign_language"}, {"score": 0.0025292620341476283, "phrase": "better_reading_comprehension_skills"}, {"score": 0.002490053106007765, "phrase": "written_communication"}, {"score": 0.002223351523626989, "phrase": "educational_purposes"}, {"score": 0.0021215125099937663, "phrase": "communication_tools"}, {"score": 0.0021049977753042253, "phrase": "personal_learning_environments"}], "paper_keywords": ["Social networking sites", " Deaf", " Hard of hearing", " Communication", " Motivation", " Identity"], "paper_abstract": "Despite numerous studies into the online activities of deaf and hard of hearing (D/HH) users, there has been limited research into their experiences on social networking sites (SNSs), a domain where psychology and computer science intersects. The purpose of this study is to illustrate how one can enhance universal access for D/HH users on the example of SNSs. A model for examining the experiences and preferences of D/HH users of SNSs has been proposed. The model consists of three identity-relevant aspects: (1) belonging to online Deaf communities, (2) communication affinity/preferences for sign and/or written language, and (3) the stigma associated with hearing loss. Based on these aspects, a questionnaire was developed and applied to a study with 46 participants. The findings revealed that the motivation to communicate on SNSs is positively associated with identification with online Deaf communities, an affinity for communication in written language and an affinity/preference for communication in sign language. Better reading comprehension skills, crucial for written communication, are associated with less stigmatic experiences with regard to hearing loss. The model and the findings of this study can help improve understanding D/HH users' online social interactions and can be used for educational purposes. It may contribute to the discussion of integrating SNSs as communication tools in personal learning environments, which can be an advantage for universal access.", "paper_title": "Enhancing universal access: deaf and hard of hearing people on social networking sites", "paper_id": "WOS:000361003800006"}