{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "tag_localization"}, {"score": 0.04775741297060809, "phrase": "web_videos"}, {"score": 0.04379677900638105, "phrase": "event_query"}, {"score": 0.004623224002010226, "phrase": "explosive_growth"}, {"score": 0.004037370832877034, "phrase": "vast_quantity"}, {"score": 0.003947186611084043, "phrase": "search_engines"}, {"score": 0.0037219886365287085, "phrase": "user_experience"}, {"score": 0.0035095935622207956, "phrase": "web_video"}, {"score": 0.0034311578789991363, "phrase": "key-shot_mining"}, {"score": 0.002955533639862811, "phrase": "shot-level_tags"}, {"score": 0.002712131567923321, "phrase": "high_relevance_scores"}, {"score": 0.0026634937939104177, "phrase": "repeated_occurrence_characteristic"}, {"score": 0.002639502113350897, "phrase": "key_sub-events"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Event-driven summarization", " key-shot identification", " tag localization", " web videos"], "paper_abstract": "With the explosive growth of web videos on the Internet, it becomes challenging to efficiently browse hundreds or even thousands of videos. When searching an event query, users are often bewildered by the vast quantity of web videos returned by search engines. Exploring such results will be time consuming and it will also degrade user experience. In this paper, we present an approach for event driven web video summarization by tag localization and key-shot mining. We first localize the tags that are associated with each video into its shots. Then, we estimate the relevance of the shots with respect to the event query by matching the shot-level tags with the query. After that, we identify a set of key-shots from the shots that have high relevance scores by exploring the repeated occurrence characteristic of key sub-events. Following the scheme in [6] and [22], we provide two types of summaries, i.e., threaded video skimming and visual-textual storyboard. Experiments are conducted on a corpus that contains 60 queries and more than 10 000 web videos. The evaluation demonstrates the effectiveness of the proposed approach.", "paper_title": "Event Driven Web Video Summarization by Tag Localization and Key-Shot Identification", "paper_id": "WOS:000306599300004"}