{"auto_keywords": [{"score": 0.04403946274076501, "phrase": "learning_management_systems"}, {"score": 0.015719716506582538, "phrase": "service-based_framework"}, {"score": 0.0047547526023100665, "phrase": "personal_and_institutional_learning_environments"}, {"score": 0.004105435059094976, "phrase": "institutional_contexts"}, {"score": 0.004054071599735255, "phrase": "wide_set"}, {"score": 0.0035148319209810128, "phrase": "learners'_needs"}, {"score": 0.003398714712611042, "phrase": "personal_learning_environments"}, {"score": 0.002789763110395331, "phrase": "personal_environment"}, {"score": 0.0026525671788921205, "phrase": "personal_activities"}, {"score": 0.002500987934534128, "phrase": "interoperability_specifications"}, {"score": 0.0024284701569889113, "phrase": "interoperability_scenarios"}, {"score": 0.0023284972218506157, "phrase": "real_learning_contexts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Learning platform", " Personal learning environment", " Interoperability", " Web services", " SOA"], "paper_abstract": "The landscape of teaching and learning has changed in recent years because of the application of Information and Communications technology. Among the most representative innovations in this regard are Learning Management Systems. Despite of their popularity in institutional contexts and the wide set of tools and services that they provide to learners and teachers, they present several issues. Learning Management Systems are linked to an institution and a period of time, and are not adapted to learners' needs. In order to address these problems Personal Learning Environments are defined, but it is clear that these will not replace Learning Management Systems and other institutional contexts. Both types of environment should therefore coexist and interact. This paper presents a service-based framework to facilitate such interoperability. It supports the export of functionalities from the institutional to the personal environment and also the integration within the institution of learning outcomes from personal activities. In order to achieve this in a flexible, extensible and open way, web services and interoperability specifications are used. In addition some interoperability scenarios are posed. The framework has been tested in real learning contexts and the results show that interoperability is possible, and that it benefits learners, teachers and institutions. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Implementation and design of a service-based framework to integrate personal and institutional learning environments", "paper_id": "WOS:000336476900004"}