{"auto_keywords": [{"score": 0.03403112053370177, "phrase": "integer_powers"}, {"score": 0.00481495049065317, "phrase": "low-voltage_low-power_sigma_delta_dac."}, {"score": 0.004192078165260057, "phrase": "aid_audio_back-end_application"}, {"score": 0.003920780681351006, "phrase": "oversampling_ratio"}, {"score": 0.0037556843869894566, "phrase": "pound_modulator"}, {"score": 0.003632080001489739, "phrase": "integer_power"}, {"score": 0.003429544382524185, "phrase": "interpolation_filter"}, {"score": 0.003253791343615811, "phrase": "osr_factors"}, {"score": 0.0029147869733574844, "phrase": "dac_designs"}, {"score": 0.002661474607275484, "phrase": "new_design_freedom"}, {"score": 0.0025861368747446324, "phrase": "operating_frequency"}, {"score": 0.002549269480908849, "phrase": "whole_back-end"}, {"score": 0.002512926336312949, "phrase": "considerable_amount"}], "paper_keywords": ["Sigma-delta modulator", " Interpolation filter", " Class D", " Hearing aid", " Low voltage", " low power"], "paper_abstract": "This paper presents the power optimization of a sigma-delta (I I\") pound modulator based digital-to-analog converter (DAC) for hearing aid audio back-end application. In a number of state-of-the-art publications the oversampling ratio (OSR) of the I I\" pound modulator is chosen as a factor of integer power of two. The reason given is the simplicity of the interpolation filter (IF). However, being able to choose OSR factors of integer powers of two only, might be restricting and not necessarily optimal. Therefore the I I\" pound modulator based DAC designs with multistage IF that include a stage performing oversampling by a factor of 3 are investigated. This new design freedom is used to lower the operating frequency of the whole back-end and save considerable amount of power. It is shown that the figure-of-merit of such designs can be lower than designs using oversampling by a factor of integer powers of two. The same optimization approach can be used for other low voltage low power portable audio applications (mobile phones, notebook computers etc.).", "paper_title": "Interpolating by a factor of 3 in low-voltage low-power Sigma Delta DAC", "paper_id": "WOS:000342079400006"}