{"auto_keywords": [{"score": 0.0351506449664449, "phrase": "mknf"}, {"score": 0.031203923653975646, "phrase": "well-founded_semantics"}, {"score": 0.00481495049065317, "phrase": "hybrid_mknf_knowledge_bases"}, {"score": 0.004565007074039171, "phrase": "knowledge_representation_formalisms"}, {"score": 0.00439777299939725, "phrase": "open-world_reasoning"}, {"score": 0.004304963945457799, "phrase": "leading_semantics"}, {"score": 0.003995226376780718, "phrase": "tightly_coupled_framework"}, {"score": 0.003952828685048176, "phrase": "minimal_knowledge"}, {"score": 0.0033680968918579717, "phrase": "practical_usefulness"}, {"score": 0.0031930184711888867, "phrase": "recent_work"}, {"score": 0.0031255543155487234, "phrase": "general_resolution-based_method"}, {"score": 0.0028089634624677957, "phrase": "general_oracle"}, {"score": 0.002317533977770783, "phrase": "query-driven_system"}, {"score": 0.002292899459813554, "phrase": "cdf-rules"}, {"score": 0.002256435842862802, "phrase": "hybrid_knowledge_bases"}], "paper_keywords": ["knowledge representation", " well-founded semantics", " description logics", " implementation"], "paper_abstract": "Ontologies and rules are usually loosely coupled in knowledge representation formalisms. In fact, ontologies use open-world reasoning, while the leading semantics for rules use non-monotonic, closed-world reasoning. One exception is the tightly coupled framework of Minimal Knowledge and Negation as Failure (MKNF), which allows statements about individuals to be jointly derived via entailment from ontology and inferences from rules. Nonetheless, the practical usefulness of MKNF has not always been clear, although recent work has formalized a general resolution-based method for querying MKNF when rules are taken to have the well-founded semantics, and the ontology is modeled by a general oracle. That work leaves open what algorithms should be used to relate the entailments of the ontology and the inferences of rules. In this paper we provide such algorithms, and describe the implementation of a query-driven system, CDF-Rules, for hybrid knowledge bases combining both (non-monotonic) rules under the well-founded semantics and a (monotonic) ontology, represented by the Coherent Description Framework Type-1 (ALC2) theory.", "paper_title": "A goal-directed implementation of query answering for hybrid MKNF knowledge bases", "paper_id": "WOS:000338293300004"}