{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "closed-loop_supply_chain_network"}, {"score": 0.00450456611645112, "phrase": "complicated_supply_chain"}, {"score": 0.004289686492089571, "phrase": "single_supplier"}, {"score": 0.004251728624599691, "phrase": "multiple_demand_markets"}, {"score": 0.004139858081040979, "phrase": "tpl"}, {"score": 0.0038728151007982378, "phrase": "market's_demand_scale"}, {"score": 0.0034807976670686628, "phrase": "supply_chain_network"}, {"score": 0.0031845067058084583, "phrase": "actual_numerical_simulations"}, {"score": 0.0031562971707460802, "phrase": "matlab_software"}, {"score": 0.002824005136794786, "phrase": "buyback_contract"}, {"score": 0.0021049977753042253, "phrase": "retail_prices"}], "paper_keywords": ["Closed-loop supply chain", " Quantity discount", " Buy-back contract", " Disruption coordination"], "paper_abstract": "To investigate how to coordinate the complicated supply chain, a closed-loop supply chain network is studied, which consists of a single supplier, multiple demand markets, many retailers and one third party logistics (TPL) entity in every market. Three kinds of situations, while the deviation of market's demand scale is negative and great, positive and also great, and last smaller and smaller, are respectively considered theoretically, when the supply chain network is disrupted by sudden, disruptive events. In this paper, the feasibility of the models formulated before are demonstrated with actual numerical simulations using Matlab software. The results show that the models in each situation are effective. When deviation of demand is sufficiently large and negative, the buyback contract T(b(s), b(i)) should be adopted; when the deviation is positive, AWQD(w(i), w(2), {Q'(i)}) is more appropriate. On the other hand, if the deviation is small, both of the two contracts mentioned above are not appropriate. It is feasible to deal with the disruption so that the retailers just adjust retail prices appropriately.", "paper_title": "DISRUPTION COORDINATION OF CLOSED-LOOP SUPPLY CHAIN NETWORK (II) - ANALYSIS AND SIMULATIONS -", "paper_id": "WOS:000263795500025"}