{"auto_keywords": [{"score": 0.02595165128723031, "phrase": "proposed_framework"}, {"score": 0.00481495049065317, "phrase": "multimodal_biometry"}, {"score": 0.004600228893803583, "phrase": "identity_management_systems"}, {"score": 0.004328689762198895, "phrase": "research_area"}, {"score": 0.00409382470158851, "phrase": "available_biometric_solutions"}, {"score": 0.003462704420080129, "phrase": "open_source_solutions"}, {"score": 0.0032088487124106936, "phrase": "possible_solution"}, {"score": 0.00309681702203087, "phrase": "multimodal_approach"}, {"score": 0.002769483748975581, "phrase": "existing_biometric_solutions"}, {"score": 0.0027414948679658816, "phrase": "acquisition_devices"}, {"score": 0.002540377258232509, "phrase": "interoperability_framework"}, {"score": 0.002342048999008582, "phrase": "development_platform"}, {"score": 0.002294929467537814, "phrase": "multimodal_biometric_application"}, {"score": 0.002126502291103601, "phrase": "future_development"}, {"score": 0.0021049977753042253, "phrase": "biometric_solutions"}], "paper_keywords": ["Interoperability", " Multimodal biometry", " Open Source", " Framework", " Security"], "paper_abstract": "In recent years identity management systems significantly increased the use of biometry. This process shifted this research area towards academia that in turn resulted with the rise of available biometric solutions, especially open source ones. Most of these solutions deal with only one biometric modality. The problem is that the price of the solution affects the precision and performances of the system. Open source solutions usually struggle with this issue since the funds for development are very limited. Possible solution can be found in using the multimodal approach that involves using several biometric modalities to improve preciseness and performances of the system. Unfortunately this opens another issue of interoperability among existing biometric solutions, acquisition devices and databases. This paper focuses on solving this issue, by proposing the interoperability framework for this purpose. Efficiency of the proposed framework was evaluated by using it as a development platform for developing a multimodal biometric application that combined three separate biometric modalities: fingerprint, face and voice. Proposed framework should further accelerate future development of biometric solutions.", "paper_title": "Interoperability Framework for Multimodal Biometry: Open Source in Action", "paper_id": "WOS:000307496400009"}