{"auto_keywords": [{"score": 0.046025485136474434, "phrase": "knowledge_combination_capability"}, {"score": 0.018584659379410205, "phrase": "process_innovation"}, {"score": 0.018077086577836028, "phrase": "organizational_performance"}, {"score": 0.00481495049065317, "phrase": "technology_firms"}, {"score": 0.004347465567143374, "phrase": "technology_smes"}, {"score": 0.004217925382695912, "phrase": "small_and_medium-sized_enterprises"}, {"score": 0.004068302313449334, "phrase": "spanish_technology-based_firms"}, {"score": 0.003923965929636472, "phrase": "structural_equation_model"}, {"score": 0.003892621134388797, "phrase": "sem"}, {"score": 0.0034232607917050392, "phrase": "significant_impact"}, {"score": 0.0030591147406390986, "phrase": "technology_sector"}, {"score": 0.003034633345146293, "phrase": "future_studies"}, {"score": 0.002891793055307152, "phrase": "wider_sample"}, {"score": 0.002722634472231842, "phrase": "better_performance"}, {"score": 0.002502264043067568, "phrase": "excellent_business_performance"}, {"score": 0.002327594516681507, "phrase": "mediating_effects"}, {"score": 0.0021049977753042253, "phrase": "firm_performance"}], "paper_keywords": ["Knowledge combination capability", " Product innovation", " Process management", " Innovation", " Organizational performance", " Small to medium-sized enterprises", " Spain"], "paper_abstract": "Purpose - The purpose of this paper is to explore the effects of product and process innovation on the relationships between knowledge combination capability and organizational performance. Design/methodology/approach - The data were collected from small and medium-sized enterprises (SMEs) belonging to the sector of Spanish technology-based firms (TBFs). This study employs the structural equation model (SEM) to examine the relationships between product and process innovation, knowledge combination capability, and organizational performance. Findings - The findings of this study suggest, first, that knowledge combination capability has a significant impact on product and process innovation. Second, product and process innovation mediate the relations between knowledge combination capability and organizational performance. Research limitations/implications - The sample includes only firms in the technology sector; future studies could analyze another kind of organization Further studies might also use a wider sample that encompasses several countries. Practical implications - This paper implies that, to achieve better performance in technology SMEs, the managers should focus more on knowledge combination capability to improve innovation, as this is the key to excellent business performance. Originality/value - This study contributes to the literature on innovation and knowledge. It examines the mediating effects of product and process innovation, knowledge combination capability, and organizational performance in technology SMEs. The research demonstrates empirically that innovation strengthens the effect of knowledge on firm performance in the sector studied.", "paper_title": "Knowledge combination, innovation, organizational performance in technology firms", "paper_id": "WOS:000318207100003"}