{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wigner_tomographic_qkd"}, {"score": 0.004650519511749445, "phrase": "quantum_information"}, {"score": 0.004509057381424944, "phrase": "elementary_quantum_systems_e.g._qubits"}, {"score": 0.0043215158337835706, "phrase": "entangled_systems"}, {"score": 0.0040002088320302935, "phrase": "higher_dimensional_systems"}, {"score": 0.0036038701178581403, "phrase": "generalized_ekert_protocol"}, {"score": 0.003374655868348244, "phrase": "quantum_key_distribution"}, {"score": 0.0031599739264865554, "phrase": "optimal_cloning"}, {"score": 0.0029589086332593674, "phrase": "possible_generalization"}, {"score": 0.00292477450010107, "phrase": "so-called_singapore_protocol"}, {"score": 0.0025445415633818472, "phrase": "wigner_tomography"}, {"score": 0.0024574537875026634, "phrase": "qutrit_version"}, {"score": 0.002429090371567499, "phrase": "singapore_protocol"}, {"score": 0.002382541887825168, "phrase": "ekert's_protocol"}, {"score": 0.0022394839933089074, "phrase": "effective_information_rate"}], "paper_keywords": ["Quantum key distribution", " SIC POVM", " discrete Wigner distribution"], "paper_abstract": "Traditionally, quantum information is formulated and implemented in terms of elementary quantum systems e.g. qubits. Now, it has been shown that certain appealing properties of entangled systems, like for instance nonlocality, are more robust against noise when they are realized at the level of higher dimensional systems, like qutrits (or more generally qudits with d strictly larger than 2). It has also been shown, in the case of the generalized Ekert protocol, (a so-called entanglement-based protocol) that confidentiality is enhanced when Quantum Key Distribution is realized with carriers of information of dimensionality strictly higher than 2 (this is because optimal cloning is less effective when the dimension d increases). This brought us to consider the possible generalization of the so-called Singapore protocol, a full tomographic qubit protocol, to dimensions strictly higher than 2. As we shall show, dimension 3 is, like dimension 2, privileged regarding the connections of the protocol with Wigner tomography. We also show that, although the qutrit version of the Singapore protocol is, just like Ekert's protocol, more robust against noise than its qubit counterpart, it is less appealing for what concerns the effective information rate (e.g. the number of qudits to be sent in average in order to exchange one classical bit of the key).", "paper_title": "WIGNER TOMOGRAPHIC QKD IN DIMENSION STRICTLY LARGER THAN 2", "paper_id": "WOS:000294861400001"}