{"auto_keywords": [{"score": 0.030064278747033397, "phrase": "feature-based_roles"}, {"score": 0.00481495049065317, "phrase": "node-level_connectivity_patterns"}, {"score": 0.004709193603747991, "phrase": "star-edge_nodes"}, {"score": 0.00446471538346719, "phrase": "different_regions"}, {"score": 0.0035908627899097407, "phrase": "graph_equivalences"}, {"score": 0.003449972561293443, "phrase": "early_notions"}, {"score": 0.0032416819339366712, "phrase": "feature_representation"}, {"score": 0.0031562971707460802, "phrase": "graph_representation"}, {"score": 0.0027252240573281163, "phrase": "flexible_framework"}, {"score": 0.0025950024597986366, "phrase": "feature-based_representation"}, {"score": 0.002352886041381761, "phrase": "learned_feature_representation"}, {"score": 0.0023010815714140467, "phrase": "different_possibilities"}, {"score": 0.002123831297790248, "phrase": "potential_applications"}, {"score": 0.0021049977753042253, "phrase": "future_directions"}], "paper_keywords": ["Roles", " role discovery", " role learning", " feature-based roles", " structural similarity", " unsupervised learning"], "paper_abstract": "Roles represent node-level connectivity patterns such as star-center, star-edge nodes, near-cliques or nodes that act as bridges to different regions of the graph. Intuitively, two nodes belong to the same role if they are structurally similar. Roles have been mainly of interest to sociologists, but more recently, roles have become increasingly useful in other domains. Traditionally, the notion of roles were defined based on graph equivalences such as structural, regular, and stochastic equivalences. We briefly revisit these early notions and instead propose a more general formulation of roles based on the similarity of a feature representation (in contrast to the graph representation). This leads us to propose a taxonomy of three general classes of techniques for discovering roles that includes (i) graph-based roles, (ii) feature-based roles, and (iii) hybrid roles. We also propose a flexible framework for discovering roles using the notion of similarity on a feature-based representation. The framework consists of two fundamental components: (a) role feature construction and (b) role assignment using the learned feature representation. We discuss the different possibilities for discovering feature-based roles and the tradeoffs of the many techniques for computing them. Finally, we discuss potential applications and future directions and challenges.", "paper_title": "Role Discovery in Networks", "paper_id": "WOS:000351393500018"}