{"auto_keywords": [{"score": 0.04312685577856799, "phrase": "adaptive_refinement"}, {"score": 0.004815340879031441, "phrase": "adaptive"}, {"score": 0.0046240999614456605, "phrase": "high-quality_tetrahedral_meshes"}, {"score": 0.004492406361795448, "phrase": "adaptive_subdivision_scheme"}, {"score": 0.004440780432053927, "phrase": "unstructured_tetrahedral"}, {"score": 0.004264697351852424, "phrase": "triangular_meshes"}, {"score": 0.004215677131963292, "phrase": "existing_tetrahedral_subdivision_schemes"}, {"score": 0.0038654774211631564, "phrase": "smooth_three-dimensional_deformations"}, {"score": 0.0037121208432871118, "phrase": "edge_bisections"}, {"score": 0.003156984631072011, "phrase": "subdivision_step"}, {"score": 0.003066945490483524, "phrase": "new_topology-based_refinement_operator"}, {"score": 0.002432971714608409, "phrase": "geometric_quality"}, {"score": 0.0022305310659333864, "phrase": "sharp_geometric_features"}, {"score": 0.0021049977753042253, "phrase": "physical_domain"}], "paper_keywords": ["solid modeling", " tetrahedral subdivision"], "paper_abstract": "We present an adaptive subdivision scheme for unstructured tetrahedral meshes inspired by the root 3-subdivision scheme for triangular meshes. Existing tetrahedral subdivision schemes do not support adaptive refinement and have traditionally been driven by the need to generate smooth three-dimensional deformations of solids. These schemes use edge bisections to subdivide tetrahedra, which generates octahedra in addition to tetrahedra. To split octahedra into tetrahedra one routinely chooses a direction for the diagonals for the subdivision step. We propose a new topology-based refinement operator that generates only tetrahedra and supports adaptive refinement. Our tetrahedral subdivision algorithm is motivated by the need to have one representation for the modeling, the simulation and the visualization and so to bridge the gap between CAD and CAE. Our subdivision algorithm design emphasizes on geometric quality of the tetrahedral meshes, local and adaptive refinement operations, and preservation of sharp geometric features on the boundary and in the interior of the physical domain.", "paper_title": "Adaptive and Feature-Preserving Subdivision for High-Quality Tetrahedral Meshes", "paper_id": "WOS:000274388400010"}