{"auto_keywords": [{"score": 0.039510674444560676, "phrase": "human_experts"}, {"score": 0.00481495049065317, "phrase": "metaphorical_and_automatic_text_analysis"}, {"score": 0.00459165923324494, "phrase": "public_health_system"}, {"score": 0.004175533280178052, "phrase": "methodology_-_pedesis_-_harvests"}, {"score": 0.0040969285074699, "phrase": "metaphorical_relations"}, {"score": 0.003925414526537783, "phrase": "relevant_conceptual_domains"}, {"score": 0.0036553070575015344, "phrase": "\"depression_lexicon"}, {"score": 0.003051073364818384, "phrase": "mental_health_site"}, {"score": 0.0027742228414076617, "phrase": "blogs"}, {"score": 0.0024984517279573906, "phrase": "system's_prediction"}, {"score": 0.0022181655497912796, "phrase": "mental_health_system"}, {"score": 0.0021659920594094407, "phrase": "screening_ability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Depression", " Mental health", " Automatic screening", " Natural language processing"], "paper_abstract": "Objective: Proactive and automatic screening for depression is a challenge facing the public health system. This paper describes a system for addressing the above challenge. Materials and method: The system implementing the methodology - Pedesis - harvests the Web for metaphorical relations in which depression is embedded and extracts the relevant conceptual domains describing it. This information is used by human experts for the construction of a \"depression lexicon\". The lexicon is used to automatically evaluate the level of depression in texts or whether the text is dealing with depression as a topic. Results: Tested on three corpora of questions addressed to a mental health site the system provides 9% improvement in prediction whether the question is dealing with depression. Tested on a corpus of Blogs, the system provides 84.2% correct classification rate (p < .001) whether a post includes signs of depression. By comparing the system's prediction to the judgment of human experts we achieved an average 78% precision and 76% recall. Conclusion: Depression can be automatically screened in texts and the mental health system may benefit from this screening ability. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Proactive screening for depression through metaphorical and automatic text analysis", "paper_id": "WOS:000308841500002"}