{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "interval-valued_fuzzy_sets"}, {"score": 0.00849261637241277, "phrase": "inclusion_measure"}, {"score": 0.00539361770890731, "phrase": "similarity_measure"}, {"score": 0.004436116555817464, "phrase": "axiomatic_definition"}, {"score": 0.004346139434813299, "phrase": "interval-valued_fuzzy_sets'_inclusion_measure"}, {"score": 0.0040869663676860535, "phrase": "inclusion_grade"}, {"score": 0.0037651925588909783, "phrase": "international_journal_of_approximate_reasoning"}, {"score": 0.0034215569542785907, "phrase": "normalized_distance"}, {"score": 0.002984173420996039, "phrase": "six_theorems"}, {"score": 0.002620424858132324, "phrase": "interval-valued_fuzzy_sets'_normalized_distance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["interval-valued fuzzy set", " normalized distance", " similarity measure", " inclusion measure", " entropy"], "paper_abstract": "In this paper, we introduce an axiomatic definition of an interval-valued fuzzy sets' inclusion measure which is different from Bustince's [H. Bustince, Indicator of inclusion grade for interval-valued fuzzy sets, Applications to approximate reasoning based on interval-valued fuzzy sets, International Journal of Approximate Reasoning, 23 (2000) 137-209]. The relationship among the normalized distance, the similarity measure, the inclusion measure, and the entropy of interval-valued fuzzy sets is investigated in detail. Furthermore, six theorems are proposed showing how the similarity measure, the inclusion measure, and the entropy of interval-valued fuzzy sets can be deduced by the interval-valued fuzzy sets' normalized distance based on their axiomatic definitions. Some formulas have also been put forward to calculate the similarity measure, the inclusion measure, and the entropy of interval-valued fuzzy sets. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Normalized distance, similarity measure, inclusion measure and entropy of interval-valued fuzzy sets and their relationship", "paper_id": "WOS:000253032200006"}