{"auto_keywords": [{"score": 0.036627143704968404, "phrase": "ltl"}, {"score": 0.009998809749964322, "phrase": "mtl"}, {"score": 0.00481495049065317, "phrase": "novel_approach"}, {"score": 0.0047409388179452255, "phrase": "temporal_logic_verification_problem"}, {"score": 0.004692227830462433, "phrase": "continuous_dynamical_systems"}, {"score": 0.0045726187330434025, "phrase": "distinctive_feature"}, {"score": 0.004410248125081398, "phrase": "temporal_properties"}, {"score": 0.004342430078306461, "phrase": "continuous_system"}, {"score": 0.003855849747095327, "phrase": "metric_spaces"}, {"score": 0.0032510690712452147, "phrase": "topological_information"}, {"score": 0.0030554300179552415, "phrase": "recently_developed_notion"}, {"score": 0.0030239842475439814, "phrase": "bisimulation_functions"}, {"score": 0.0026986685585382347, "phrase": "latter_set"}, {"score": 0.0023225701080913388, "phrase": "simulated_trajectory"}, {"score": 0.002286781334850213, "phrase": "interesting_and_promising_feature"}, {"score": 0.0021049977753042253, "phrase": "temporal_logic_specification"}], "paper_keywords": [""], "paper_abstract": "In this paper, we consider a novel approach to the temporal logic verification problem of continuous dynamical systems. Our methodology has the distinctive feature that enables the verification of the temporal properties of a continuous system by verifying only a finite number of its (simulated) trajectories. The proposed framework comprises two main ideas. First, we take advantage of the fact that in metric spaces we can quantify how close are two different states. Based on that, we define robust, multi-valued semantics for MTL (and LTL) formulas. These capture not only the usual Boolean satisfiability of the formula, but also topological information regarding the distance from unsatisfiability. Second, we use the recently developed notion of bisimulation functions to infer the behavior of a set of trajectories that lie in the neighborhood of the simulated one. If the latter set of trajectories is bounded by the tube of robustness, then we can infer that all the trajectories in the neighborhood of the simulated one satisfy the same temporal specification as the simulated trajectory. The interesting and promising feature of our approach is that the more robust the system is with respect to the temporal logic specification, the less is the number of simulations that are required in order to verify the system.", "paper_title": "Temporal logic verification using simulation", "paper_id": "WOS:000241576400013"}