{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "one-class_classifiers"}, {"score": 0.0047277417909824745, "phrase": "fuzzy_logic."}, {"score": 0.004608284537368354, "phrase": "multiple_classifier_systems"}, {"score": 0.0043305354943056875, "phrase": "large_variety"}, {"score": 0.004190305872545087, "phrase": "individual_classifiers"}, {"score": 0.0039665679106594106, "phrase": "multi-class_classifier"}, {"score": 0.0037961770933599135, "phrase": "compound_classifier"}, {"score": 0.0035671997165370403, "phrase": "training_algorithm"}, {"score": 0.002992313172550772, "phrase": "new_scheme"}, {"score": 0.002895291306821514, "phrase": "fuzzy_inference_system"}, {"score": 0.002720505061804933, "phrase": "classifiers'_outputs"}, {"score": 0.002613056713968863, "phrase": "fuzzy_engine"}, {"score": 0.0024106932919085097, "phrase": "used_classifiers"}, {"score": 0.0023843376332011936, "phrase": "proposed_model"}, {"score": 0.00234104879370883, "phrase": "computer_experiments"}, {"score": 0.002298544073884724, "phrase": "mat_lab_environment"}, {"score": 0.002248553559414903, "phrase": "binary_classifiers"}, {"score": 0.0022158306933307685, "phrase": "valuable_classifier"}, {"score": 0.0021049977753042253, "phrase": "new_research_frontiers"}], "paper_keywords": ["Multiple classifier systems", " pattern recognition", " fuzzy logic", " one-class classifiers"], "paper_abstract": "Combining classifiers, so-called Multiple Classifier Systems (MCSs), gained a lot of interest has recent years. Researchers, developed a large variety of methods in order to exploit strengths of individual classifiers. In this paper, we address the problem of how to implement a multi-class classifier by an ensemble of one-class classifiers. To improve performance of a compound classifier, different individual classifiers (which may, e.g., differ in complexity, type, training algorithm or other) can be combined and that could increase its both performance, and robustness. The model of one-class classifiers can only recognize one of the classes, therefore, it is quite difficult to produce MCSs on the basis of one-class classifiers. Thus, we introduce a new scheme for decision-making in MCSs through a fuzzy inference system. Specifically, we address two important open problems in the context: model selection and combiner training. Classifiers' outputs as supports for given classes are combined by means of a fuzzy engine. Thus, we are interested in such individual classifiers which can return support for given classes. There are no other restrictions on the used classifiers. The proposed model has been evaluated by computer experiments on several benchmark datasets in the Mat lab environment. Their results prove that fuzzy combination of binary classifiers may be a valuable classifier itself. Additionally, there are indicated both some application areas of the models, and new research frontiers to be examined.", "paper_title": "COMBINATION OF ONE-CLASS CLASSIFIERS FOR MULTICLASS PROBLEMS BY FUZZY LOGIC", "paper_id": "WOS:000287783300005"}