{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "v_formation"}, {"score": 0.009057122507034743, "phrase": "isolated_cylinder"}, {"score": 0.00466016686289196, "phrase": "flow_forces"}, {"score": 0.004406260054779782, "phrase": "elementary_comparison"}, {"score": 0.00436530211426514, "phrase": "flocking_birds"}, {"score": 0.004185632403886255, "phrase": "two-dimensional_square_bodies"}, {"score": 0.004069963083642548, "phrase": "reynolds_number"}, {"score": 0.0038301525703886585, "phrase": "streamwise_spacing"}, {"score": 0.0034398445347109396, "phrase": "lateral_force"}, {"score": 0.0033919477901198716, "phrase": "strouhal_number"}, {"score": 0.0030178044717552605, "phrase": "leading_cylinder"}, {"score": 0.00297576670831646, "phrase": "smallest_drag"}, {"score": 0.0025741370320813968, "phrase": "average_drag"}, {"score": 0.0022058510091498666, "phrase": "substantial_lateral_force"}, {"score": 0.002154835714714195, "phrase": "simple_model"}], "paper_keywords": ["Simulations", " drag force", " lateral force", " wake", " V formation", " model bird"], "paper_abstract": "A model for studying the flow forces experienced by cylinders placed in V formation is presented, and an elementary comparison with flocking birds is made. The cylinders are modeled as two-dimensional square bodies exposed to incoming flow at Reynolds number 100. The effects of angle of formation (a), streamwise spacing (Ss), and number of cylinders (N) on parameters such as the coefficient of drag, coefficient of lateral force, and Strouhal number are studied. It is observed that the drag experienced by the cylinders decreases with a decrease in the angle of formation. The leading cylinder experiences the smallest drag, irrespective of the angle. The drag becomes less than the drag on an isolated cylinder at certain angles depending on the position of the cylinder in the formation. The average drag on cylinders in V formation is found to be less than on an isolated cylinder, leading to energy saving when flying in formation. It is also noted that the cylinders experience a substantial lateral force. Study of this simple model may help better understand certain features of flocking birds.", "paper_title": "A First Attempt to Numerically Compute Forces on Birds in V Formation", "paper_id": "WOS:000281445200004"}