{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_anonymity"}, {"score": 0.04645434007699365, "phrase": "virtual_world"}, {"score": 0.028077937194618523, "phrase": "network_performance"}, {"score": 0.004737328254103122, "phrase": "ever-increasing_variety"}, {"score": 0.004548678477638377, "phrase": "experience_level"}, {"score": 0.004403158130041613, "phrase": "viable_alternative"}, {"score": 0.004250737522551095, "phrase": "personal_services"}, {"score": 0.004137075934831388, "phrase": "personal_web_site"}, {"score": 0.004048329928140021, "phrase": "freely_available_information"}, {"score": 0.003918753609879776, "phrase": "real_world"}, {"score": 0.0037219886365287085, "phrase": "absolute_solitude"}, {"score": 0.0036619212990454788, "phrase": "private_rooms"}, {"score": 0.0030122115889639626, "phrase": "true_network_privacy"}, {"score": 0.0029635649192235555, "phrase": "anonymity_services"}, {"score": 0.0026299659007534516, "phrase": "user_experience"}, {"score": 0.002594510142298757, "phrase": "deployable_systems"}, {"score": 0.0025525920037051952, "phrase": "strong_anonymity"}, {"score": 0.0025318869445353654, "phrase": "strong_attacker_model"}, {"score": 0.002497750121448195, "phrase": "network_anonymity_techniques"}, {"score": 0.0023721653920334676, "phrase": "possible_anonymity_techniques"}, {"score": 0.0023211909152089606, "phrase": "accepted_terminology"}, {"score": 0.002198485165633691, "phrase": "particular_attention"}, {"score": 0.002139581380750111, "phrase": "anonymity_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "The Internet promises an ever-increasing variety of services available anytime, almost anywhere, to anyone of just about any experience level. Thus, in many respects, the virtual world has become a viable alternative to our real world, where we can buy anything from a dishwasher to personal services, or publish any information we choose on a personal web site. With all of the convenience and freely available information that this virtual world provides, it has one major problem: in the real world people can nearly always exert some control over their privacy. If they choose, they can study in absolute solitude or meet with others in private rooms, or they can anonymously buy a magazine. However, on the Internet, users have few controls, if any, over the privacy of their actions. Each communication leaves trails here or there and there is always someone who can follow these trails back to the user. Thus, should we just forget about having privacy in the Internet as others have proclaimed? The one path towards enabling true network privacy is to provide anonymity. Anonymity services can allow users to carry out their activities anonymously and unobservably on the Internet. In this work, we investigate the following technical questions: what is network anonymity, what are the various techniques for reliably achieving anonymity, and what are their associated impacts on network performance and user experience. Our emphasis is on deployable systems for the Internet that provide strong anonymity against a strong attacker model. We present the network anonymity techniques (algorithms) suggested in the past and the ones Currently in use, and then we discuss possible anonymity techniques of the future. We present the accepted terminology for discussing anonymity, and the definition and different measures of anonymity. However, throughout our discussions we pay particular attention to the analysis of network performance in the presence of anonymity mechanisms. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Technical challenges of network anonymity", "paper_id": "WOS:000235322800004"}