{"auto_keywords": [{"score": 0.039902027959403466, "phrase": "statistical_tests"}, {"score": 0.03535741275361774, "phrase": "experiment_design"}, {"score": 0.00481495049065317, "phrase": "classifier_learning_experiments"}, {"score": 0.004772350491505958, "phrase": "bioinformatics"}, {"score": 0.0038338299812503, "phrase": "resulting_data"}, {"score": 0.003474694300991964, "phrase": "performance_measures"}, {"score": 0.0028032928749970026, "phrase": "single_training"}, {"score": 0.002729029534060092, "phrase": "different_performance_metrics"}, {"score": 0.00259793885118959, "phrase": "statistical_test"}, {"score": 0.0025291018422967083, "phrase": "third_part"}, {"score": 0.0024075916292945715, "phrase": "bioinformatics_literature"}, {"score": 0.002364865100579589, "phrase": "proper_statistical_methodology"}, {"score": 0.0023021895404322767, "phrase": "example_case_study"}, {"score": 0.002241171326888997, "phrase": "supplementary_software"}, {"score": 0.0021239335561699106, "phrase": "important_role"}, {"score": 0.0021049977753042253, "phrase": "future_studies"}], "paper_keywords": ["Statistical tests", " classification", " model selection"], "paper_abstract": "In many bioinformatics applications, it is important to assess and compare the performances of algorithms trained from data, to be able to draw conclusions unaffected by chance and are therefore significant. Both the design of such experiments and the analysis of the resulting data using statistical tests should be done carefully for the results to carry significance. In this paper, we first review the performance measures used in classification, the basics of experiment design and statistical tests. We then give the results of our survey over 1,500 papers published in the last two years in three bioinformatics journals (including this one). Although the basics of experiment design are well understood, such as resampling instead of using a single training set and the use of different performance metrics instead of error, only 21 percent of the papers use any statistical test for comparison. In the third part, we analyze four different scenarios which we encounter frequently in the bioinformatics literature, discussing the proper statistical methodology as well as showing an example case study for each. With the supplementary software, we hope that the guidelines we discuss will play an important role in future studies.", "paper_title": "Design and Analysis of Classifier Learning Experiments in Bioinformatics: Survey and Case Studies", "paper_id": "WOS:000312558400011"}