{"auto_keywords": [{"score": 0.04942227314966019, "phrase": "walking_robot"}, {"score": 0.03997222839339853, "phrase": "neural_dynamics"}, {"score": 0.036017951366346, "phrase": "neural_mechanisms"}, {"score": 0.00481495049065317, "phrase": "recurrent_neural_network"}, {"score": 0.004788416208637939, "phrase": "versatile_and_adaptive_behaviors"}, {"score": 0.004581315009194603, "phrase": "complex_behaviors"}, {"score": 0.004158847144705244, "phrase": "unknown_situation"}, {"score": 0.004012011375577782, "phrase": "versatile_and_adaptive_abilities"}, {"score": 0.0038703397652790237, "phrase": "biological_studies"}, {"score": 0.003764762246246238, "phrase": "sensory_feedback"}, {"score": 0.003522936431140836, "phrase": "bio-inspired_approach"}, {"score": 0.0033797211728461584, "phrase": "exteroceptive_sensory_feedback"}, {"score": 0.003296592659436661, "phrase": "adaptive_neural_sensory_processing"}, {"score": 0.0032783981960897196, "phrase": "modular_neural_locomotion_control"}, {"score": 0.0032512939985881784, "phrase": "sensory_processing"}, {"score": 0.003206615786563051, "phrase": "small_recurrent_neural_network"}, {"score": 0.0031538090440906873, "phrase": "correlation-based_learning"}, {"score": 0.0028389242954210254, "phrase": "different_turning_angles"}, {"score": 0.002823248627721077, "phrase": "short-term_memory"}, {"score": 0.002776737611968975, "phrase": "turning_information"}, {"score": 0.00273856268065539, "phrase": "steering_signals"}, {"score": 0.0027159094186967247, "phrase": "neural_locomotion_control"}, {"score": 0.0026711620032802683, "phrase": "motor_actions"}, {"score": 0.00254128377909922, "phrase": "different_situations"}, {"score": 0.0024582171957247385, "phrase": "sharp_corners"}, {"score": 0.0024244106761995812, "phrase": "backbone_joint_control"}, {"score": 0.0023516600276539557, "phrase": "small_obstacles"}, {"score": 0.002281087456676369, "phrase": "complex_environments"}, {"score": 0.0022310928580761592, "phrase": "physical_simulation_environment"}, {"score": 0.0021049977753042253, "phrase": "real_world"}], "paper_keywords": ["neural dynamics", " hysteresis", " correlation-based learning", " navigation", " walking robots", " autonomous robots"], "paper_abstract": "Walking animals, like insects, with little neural computing can effectively perform complex behaviors. For example, they can walk around their environment, escape from corners/deadlocks, and avoid or climb over obstacles. While performing all these behaviors, they can also adapt their movements to deal with an unknown situation. As a consequence, they successfully navigate through their complex environment. The versatile and adaptive abilities are the result of an integration of several ingredients embedded in their sensorimotor loop. Biological studies reveal that the ingredients include neural dynamics, plasticity, sensory feedback, and biomechanics. Generating such versatile and adaptive behaviors for a many degrees-of-freedom (DOFs) walking robot is a challenging task. Thus, in this study, we present a bio-inspired approach to solve this task. Specifically, the approach combines neural mechanisms with plasticity, exteroceptive sensory feedback, and biomechanics. The neural mechanisms consist of adaptive neural sensory processing and modular neural locomotion control. The sensory processing is based on a small recurrent neural network consisting of two fully connected neurons. Online correlation-based learning with synaptic scaling is applied to adequately change the connections of the network. By doing so, we can effectively exploit neural dynamics (i.e., hysteresis effects and single attractors) in the network to generate different turning angles with short-term memory for a walking robot. The turning information is transmitted as descending steering signals to the neural locomotion control which translates the signals into motor actions. As a result, the robot can walk around and adapt its turning angle for avoiding obstacles in different situations. The adaptation also enables the robot to effectively escape from sharp corners or deadlocks. Using backbone joint control embedded in the the locomotion control allows the robot to climb over small obstacles. Consequently, it can successfully explore and navigate in complex environments. We firstly tested our approach on a physical simulation environment and then applied it to our real biomechanical walking robot AMOSI I with 19 DOFs to adaptively avoid obstacles and navigate in the real world.", "paper_title": "Synaptic plasticity in a recurrent neural network for versatile and adaptive behaviors of a walking robot", "paper_id": "WOS:000370403900001"}