{"auto_keywords": [{"score": 0.0434557459867938, "phrase": "current_study"}, {"score": 0.004819840642422695, "phrase": "characteristics"}, {"score": 0.004777569299319633, "phrase": "motivations_of_health_answerers"}, {"score": 0.004594951819987416, "phrase": "online_environments"}, {"score": 0.0044192837023190445, "phrase": "personal_experiences"}, {"score": 0.003931402465972151, "phrase": "health-related_answers"}, {"score": 0.0038554737609608255, "phrase": "anonymous_others"}, {"score": 0.0037810430314445197, "phrase": "yahoo"}, {"score": 0.0037079710789139305, "phrase": "online_survey_questionnaire"}, {"score": 0.0036221822903900725, "phrase": "recent_answerers"}, {"score": 0.0035245918797629804, "phrase": "health_expertise"}, {"score": 0.0028436364707396613, "phrase": "personal_gain"}, {"score": 0.0025690867646665835, "phrase": "different_groups"}, {"score": 0.0025292620341476283, "phrase": "motivational_factors"}, {"score": 0.0025095811903520274, "phrase": "top_answerers"}, {"score": 0.002490053106007765, "phrase": "health_experts"}, {"score": 0.002385326947545194, "phrase": "practical_implications"}, {"score": 0.002357535807803925, "phrase": "health_answerers"}, {"score": 0.0022939396079753463, "phrase": "social_contexts"}, {"score": 0.0022495644368875686, "phrase": "study_design"}], "paper_keywords": [""], "paper_abstract": "In Web 2.0 environments, people commonly share their knowledge and personal experiences with others, but little is known about their background characteristics and motivations. Thus, the current study examines some of the characteristics and motivations common among answerers, who produce health-related answers to questions asked by anonymous others in a social Q&A site, Yahoo! Answers. An online survey questionnaire was distributed to top and recent answerers to investigate their demographics, areas of health expertise, and other characteristics related to answering behaviors online. Also, 10 motivation factors are proposed and tested in the survey: enjoyment, efficacy, learning, personal gain, altruism, community interest, social engagement, empathy, reputation, and reciprocity. Findings show that altruism is the most influential motivation, while personal gain is the least. Enjoyment and efficacy are more influential than other social motivations, such as reputation or reciprocity, although there are some variations across different groups of answerers. Motivational factors among top answerers or health experts are further analyzed. The findings of this study have practical implications for promoting health answerers to share knowledge and experiences in social contexts. Furthermore, the study design of the current study can be used to examine motivations of answerers in other topic areas as well as other social contexts.", "paper_title": "The Characteristics and Motivations of Health Answerers for Sharing Information, Knowledge, and Experiences in Online Environments", "paper_id": "WOS:000301038300009"}