{"auto_keywords": [{"score": 0.04926219622874721, "phrase": "finfet"}, {"score": 0.00481495049065317, "phrase": "finfet_system_simulation"}, {"score": 0.004773692073488661, "phrase": "pvt_variations"}, {"score": 0.004652130102005098, "phrase": "cmos"}, {"score": 0.004475266375001531, "phrase": "planar_cmos"}, {"score": 0.004286708921931472, "phrase": "lower_leakage"}, {"score": 0.0041773934798743405, "phrase": "finfet-based_system_simulation_framework"}, {"score": 0.0040186038781533946, "phrase": "early-stage_design-space_exploration"}, {"score": 0.003441352119167824, "phrase": "existing_lower-level_finfet_simulators"}, {"score": 0.003324743991757282, "phrase": "thermal_studies"}, {"score": 0.003296212583539166, "phrase": "finfet-based_chip_multiprocessor_systems"}, {"score": 0.00307657476125683, "phrase": "bottom-up_modeling_approach"}, {"score": 0.002934098412396701, "phrase": "tcad_device_simulation"}, {"score": 0.002810292047426252, "phrase": "system_level"}, {"score": 0.002680114113899346, "phrase": "system_designers"}, {"score": 0.0022651818270925704, "phrase": "particular_finfet_logic_style"}, {"score": 0.0022168460543913787, "phrase": "core-to-core_frequency_and_power_variations"}, {"score": 0.0021049977753042253, "phrase": "variation-aware_scheduling_schemes"}], "paper_keywords": ["Core-to-core variation", " FinFET", " gem5-PVT", " PVT variation", " system simulation"], "paper_abstract": "FinFET has begun replacing CMOS at the 22nm technology node and beyond. Compared to planar CMOS, FinFET has a higher on-current and lower leakage due to its double-gate structure. A FinFET-based system simulation framework can be very helpful to system architects for early-stage design-space exploration using this new technology. However, such a simulator does not exist. We fill this gap by presenting the details of one such simulation framework, called gem5-PVT, that we have developed. Our simulation framework combines and extends existing lower-level FinFET simulators to support timing, power, and thermal studies of FinFET-based chip multiprocessor systems under process, voltage, and temperature (PVT) variations. It uses a bottom-up modeling approach based on logic/memory cell libraries that have been very accurately characterized using TCAD device simulation. This allows accuracy to bubble up to the system level. The framework is modular and automated, hence enables system designers the flexibility to evaluate various system implementations. It is currently targeted at the 22nm FinFET technology. We report results for two case studies to demonstrate its usefulness. One study shows that more than 62.1x system-level leakage reduction, at the same performance, is possible when using a particular FinFET logic style. Another study characterizes core-to-core frequency and power variations that result from underlying PVT variations and compares the effectiveness of variation-aware scheduling schemes.", "paper_title": "gem5-PVT: A Framework for FinFET System Simulation under PVT Variations", "paper_id": "WOS:000361670400009"}