{"auto_keywords": [{"score": 0.04427272492942206, "phrase": "equivalence_classes"}, {"score": 0.010612387000973441, "phrase": "full-dimensional_-polytopes"}, {"score": 0.005862111872495241, "phrase": "aichholzer"}, {"score": 0.004657653216262924, "phrase": "-dimensional_hypercube"}, {"score": 0.004619134710069517, "phrase": "vertex_set"}, {"score": 0.004486800020569973, "phrase": "convex_hull"}, {"score": 0.003977594755967813, "phrase": "computer_program"}, {"score": 0.0027703320456201074, "phrase": "cycle_index"}, {"score": 0.002735972929840289, "phrase": "hyperoctahedral_group"}, {"score": 0.0021049977753042253, "phrase": "complete_solution"}], "paper_keywords": ["Full-dimensional 0/1-polytope", " Symmetry", " Hyperplane", " Polya theory"], "paper_abstract": "Let denote the -dimensional hypercube with vertex set . A -polytope of is the convex hull of a subset of . This paper is concerned with the enumeration of equivalence classes of full-dimensional -polytopes under the symmetries of the hypercube. With the aid of a computer program, Aichholzer obtained the number of equivalence classes of full-dimensional -polytopes of and with any given number of vertices and those of up to 12 vertices. Let denote the number of equivalence classes of full-dimensional 0/1-polytopes of with vertices. We present a method to compute for . Let denote the number of equivalence classes of -polytopes of with vertices, and let denote the number of equivalence classes of -polytopes of with vertices that are not full-dimensional. So we have . It is known that can be computed by using the cycle index of the hyperoctahedral group. We show that for , can be determined by the number of equivalence classes of -polytopes with vertices that are contained in every hyperplane spanned by a subset of . We also find a way to compute when is close to . For the case of , we can compute for . Together with the computation of Aichholzer, we reach a complete solution to the enumeration of equivalence classes of full-dimensional 0/1-polytopes of Q(6).", "paper_title": "Equivalence Classes of Full-Dimensional -Polytopes with Many Vertices", "paper_id": "WOS:000345330700003"}