{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multiple_perspectives"}, {"score": 0.027945684067985234, "phrase": "supplier_selection"}, {"score": 0.01474784419734718, "phrase": "single_model"}, {"score": 0.014176124607228429, "phrase": "decision_makers"}, {"score": 0.01206300156775016, "phrase": "decision-making_process"}, {"score": 0.009136487631720409, "phrase": "knowledge_sharing"}, {"score": 0.004741575909417311, "phrase": "purpose_-_the_purpose"}, {"score": 0.004626484449627423, "phrase": "traditional_supplier_selection_methods"}, {"score": 0.004507089880383148, "phrase": "final_decisions"}, {"score": 0.004472760779811399, "phrase": "multiple_models"}, {"score": 0.004431725879033857, "phrase": "unstructured_decision-making_context"}, {"score": 0.004297630834375944, "phrase": "informed_decisions"}, {"score": 0.0039070805769954005, "phrase": "final_decision"}, {"score": 0.0038474874533431977, "phrase": "biased_decision"}, {"score": 0.0033297542331358057, "phrase": "less-biased_decision"}, {"score": 0.003278937848591921, "phrase": "commonly_applied_supplier_selection_models"}, {"score": 0.0030268930660241563, "phrase": "supplier_selection_system"}, {"score": 0.0029898699347664635, "phrase": "proposed_approach"}, {"score": 0.002935180093286085, "phrase": "web_portal"}, {"score": 0.0028550099401780803, "phrase": "proposed_multiple_perspective_system_approach"}, {"score": 0.002743048133491456, "phrase": "general_finding"}, {"score": 0.002508816084407055, "phrase": "high_quality"}, {"score": 0.0024704972295365164, "phrase": "practical_implications_-_supplier_selection_decision_makers"}, {"score": 0.0023956021950024124, "phrase": "decision-making_participants"}, {"score": 0.002344527570417709, "phrase": "supply_chain_managers"}, {"score": 0.0023229723740009604, "phrase": "potentially_positive_effect"}, {"score": 0.002218126296988689, "phrase": "novel_approach"}, {"score": 0.0021049977753042253, "phrase": "supplier_relations"}], "paper_keywords": ["Supply chain management", " Supplier evaluation", " Knowledge sharing"], "paper_abstract": "Purpose - The purpose of this paper is to change the traditional supplier selection methods by shifting the emphasis from using a single model to using multiple models in the unstructured decision-making context and to provide a tool for decision makers to make informed decisions of supplier selection in the multiple perspectives. Design/methodology/approach - There are various supplier selection models available in the literature. However, using the result of a single model as a basis for making the final decision could lead to a biased decision given the fact that any model has its limitations. The qualities of the decision-making process and the decision itself increase by applying a multiple perspectives approach rather than a single model. The multiple perspectives decision-making allows collaboration and knowledge sharing among the participants which leads to a less-biased decision. This study examines commonly applied supplier selection models, formulates general perspectives of these models, and proposes a framework of multiple perspectives decision making for supplier selection. It further provides a structure of supplier selection system based on the proposed approach. Through a prototype of web portal, the study demonstrates the usefulness of the proposed multiple perspective system approach in the decision context of collaboration and knowledge sharing. Findings - The general finding from this study is that the multiple perspectives approach to supplier selection enables the decision makers to actively participate and fully understand the decision-making process through knowledge sharing which in turn ensures high quality of the final decisions. Practical implications - Supplier selection decision makers can make more informed decisions through collaboration among all decision-making participants in the multiple perspectives. It informs supply chain managers of the potentially positive effect of knowledge sharing on the decision-making process in supplier selection. Originality/value - Multiple perspectives decision making provides a novel approach that emphasizes on the knowledge sharing and collaboration between the experts, who are familiar with the supplier relations, and the decision makers who are responsible for the final decisions.", "paper_title": "A multiple perspectives approach to supplier selection", "paper_id": "WOS:000291136900016"}