{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "transient_simulation"}, {"score": 0.013535010661734757, "phrase": "binary_analysis"}, {"score": 0.008655664533106028, "phrase": "feedback-free_circuits"}, {"score": 0.008259551156010838, "phrase": "signal_changes"}, {"score": 0.006360273201872214, "phrase": "arbitrary_gates"}, {"score": 0.004655924035639928, "phrase": "gate_circuit"}, {"score": 0.0046092435167207095, "phrase": "efficient_method"}, {"score": 0.004280861452668641, "phrase": "classical_binary_analysis"}, {"score": 0.0038186039088445524, "phrase": "wire_delays"}, {"score": 0.0035463496793144748, "phrase": "feedback-free_circuit"}, {"score": 0.003452218803245602, "phrase": "expanded_circuit"}, {"score": 0.0031845067058084583, "phrase": "n._for"}, {"score": 0.002888488567436329, "phrase": "singular_circuit_k"}, {"score": 0.0024909230668523847, "phrase": "forks."}, {"score": 0.002400383939897181, "phrase": "xor"}, {"score": 0.0022215160785078797, "phrase": "n._we"}], "paper_keywords": ["analysis", " binaxy", " circuit", " hazard", " simulation", " transient"], "paper_abstract": "Transient simulation of a gate circuit is an efficient method of counting signal changes occurring during a transition of the circuit. It is known that this simulation covers the results of classical binary analysis, in the sense that all signal changes appearing in binary analysis are also predicted by the simulation. For feedback-free circuits of 1- and 2-input gates, it had been shown that the converse also holds, if wire delays are taken into account. In this paper we generalize this result. First, we prove that, for any feedback-free circuit N of arbitrary gates, there exists an expanded circuit 1, constructed by adding a number of delays to each wire of N, such that binary analysis of 9 covers transient simulation of N. For this result, the number of delays added to a wire is obtained from the transient simulation. Our second result involves adding only one delay per wire, which leads to the singular circuit k of N. This result is restricted to circuits consisting only of gates realizing functions from the set H = {IDENTITY, AND, OR, XOR}, functions obtained by complementing any number of inputs and/or the output of a function from %, and FORKS. The numbers of inputs of the AND, OR and XOR gates are arbitrary, and all functions of two variables are included. We show that binary analysis of such a circuit 1 covers transient simulation of N. We also show that this result cannot be extended to arbitrary gates, if we allow only a constant number of delays per wire.", "paper_title": "Covering of transient simulation of feedback-free circuits by binary analysis", "paper_id": "WOS:000239874300015"}