{"auto_keywords": [{"score": 0.045521727399967155, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "novel_colorization_technique"}, {"score": 0.004205395707787349, "phrase": "black-and-white_manga"}, {"score": 0.0035949949979695063, "phrase": "intensity-based_colorization_methods"}, {"score": 0.0032534479356111706, "phrase": "gabor"}, {"score": 0.002881793492919646, "phrase": "level_set_method"}, {"score": 0.0027218799769229596, "phrase": "open_boundaries"}, {"score": 0.002683304054823427, "phrase": "multiple_disjointed_regions"}, {"score": 0.0026452734009203764, "phrase": "similar_patterns"}, {"score": 0.002516350372379076, "phrase": "single_scribble"}, {"score": 0.002445514186654732, "phrase": "segmented_regions"}, {"score": 0.0022447206386952126, "phrase": "stroke_preservation"}], "paper_keywords": ["colorization", " manga", " segmentation"], "paper_abstract": "This paper proposes a novel colorization technique that propagates color over regions exhibiting pattern-continuity as well as intensity-continuity. The proposed method works effectively on colorizing black-and-white manga which contains intensive amount of strokes, hatching, halftoning and screening. Such fine details and discontinuities in intensity introduce many difficulties to intensity-based colorization methods. Once the user scribbles on the drawing, a local, statistical based pattern feature obtained with Gabor wavelet filters is applied to measure the pattern-continuity. The boundary is then propagated by the level set method that monitors the pattern-continuity. Regions with open boundaries or multiple disjointed regions with similar patterns can be sensibly segmented by a single scribble. With the segmented regions, various colorization techniques can be applied to replace colors, colorize with stroke preservation, or even convert pattern to shading. Several results are shown to demonstrate the effectiveness and convenience of the proposed method.", "paper_title": "Manga colorization", "paper_id": "WOS:000239817400087"}