{"auto_keywords": [{"score": 0.0376801493962264, "phrase": "sufficient_statistics"}, {"score": 0.010519569757466537, "phrase": "vector_sets"}, {"score": 0.00481495049065317, "phrase": "sufficient_statistics_of_least-squares_superposition"}, {"score": 0.004446823283475876, "phrase": "fundamental_task"}, {"score": 0.004330450801016359, "phrase": "notably_structural_molecular_biology"}, {"score": 0.003946519058822334, "phrase": "efficient_solution"}, {"score": 0.003877329308854808, "phrase": "widespread_use"}, {"score": 0.003826231150275071, "phrase": "superposition_task"}, {"score": 0.0037260386566859197, "phrase": "macromolecular_structures"}, {"score": 0.00353342812142574, "phrase": "least-squares_superposition_problem"}, {"score": 0.0031079352545607267, "phrase": "deletion_operation"}, {"score": 0.003013129637451091, "phrase": "constituent_sets"}, {"score": 0.00289546142998427, "phrase": "constituent_vector_sets"}, {"score": 0.0027578496677536373, "phrase": "drastic_improvement"}, {"score": 0.002721464488351771, "phrase": "run_time"}, {"score": 0.0025806490053534316, "phrase": "deletion_operations"}, {"score": 0.0024798279465139688, "phrase": "ab_initio"}, {"score": 0.002289821830549781, "phrase": "protein_structural_alignment_programs"}, {"score": 0.0022496114364599328, "phrase": "reliable_structural_alignment"}, {"score": 0.0021049977753042253, "phrase": "open-source_license"}], "paper_keywords": ["RMSD", " superposition", " alignment", " sufficient statistics"], "paper_abstract": "The problem of superposition of two corresponding vector sets by minimizing their sum-of-squares error under orthogonal transformation is a fundamental task in many areas of science, notably structural molecular biology. This problem can be solved exactly using an algorithm whose time complexity grows linearly with the number of correspondences. This efficient solution has facilitated the widespread use of the superposition task, particularly in studies involving macromolecular structures. This article formally derives a set of sufficient statistics for the least-squares superposition problem. These statistics are additive. This permits a highly efficient (constant time) computation of superpositions (and sufficient statistics) of vector sets that are composed from its constituent vector sets under addition or deletion operation, where the sufficient statistics of the constituent sets are already known (that is, the constituent vector sets have been previously superposed). This results in a drastic improvement in the run time of the methods that commonly superpose vector sets under addition or deletion operations, where previously these operations were carried out ab initio (ignoring the sufficient statistics). We experimentally demonstrate the improvement our work offers in the context of protein structural alignment programs that assemble a reliable structural alignment from well-fitting (substructural) fragment pairs. A C++ library for this task is available online under an open-source license.", "paper_title": "On Sufficient Statistics of Least-Squares Superposition of Vector Sets", "paper_id": "WOS:000363939600003"}