{"auto_keywords": [{"score": 0.04922237591220716, "phrase": "real-time_systems"}, {"score": 0.00481495049065317, "phrase": "stochastic_metrics"}, {"score": 0.004771672073078768, "phrase": "debugging_temporal_behaviour"}, {"score": 0.004499647408293102, "phrase": "functional_behaviour"}, {"score": 0.004262273304740847, "phrase": "stochastic_analysis_techniques"}, {"score": 0.004204904449336037, "phrase": "execution_time"}, {"score": 0.004129607015893271, "phrase": "random_variables"}, {"score": 0.003983016985197904, "phrase": "temporal_behaviour"}, {"score": 0.0036224139706218916, "phrase": "measurement_techniques"}, {"score": 0.0034937647771945803, "phrase": "implemented_system"}, {"score": 0.003400274964240732, "phrase": "monitoring_tool"}, {"score": 0.0032943503835334547, "phrase": "posix."}, {"score": 0.002915701586760994, "phrase": "timing_behaviour"}, {"score": 0.0028376361457661415, "phrase": "stochastic_analysis_technique"}, {"score": 0.0022940375532231145, "phrase": "debugging_tools"}, {"score": 0.00222249726328354, "phrase": "measured_system"}], "paper_keywords": ["Debugging aids", " Real-time Systems", " Monitors"], "paper_abstract": "In real-time systems, temporal behaviour is as important as functional behaviour, so several techniques have been especially developed for these systems. Stochastic analysis techniques model the execution time of tasks as random variables and constitute a very powerful tool to study the temporal behaviour of real-time systems. However, as they can not avoid all the timing bugs in the implementation, they must be combined with measurement techniques in order to gain more confidence in the implemented system. This paper presents a monitoring tool which can measure real-time systems developed using POSIX. The corresponding analysis and a visualization tool that makes it possible to find errors easily is also introduced. In order to find bugs in the timing behaviour of the system when an stochastic analysis technique is used, two metrics, called \"pessimism\" and \"optimism\", are proposed. They are based on two random variables, the optimistic and the pessimistic execution time, which are also introduced in this paper. These metrics are used in the debugging tools to compare the model and the measured system in order to find errors. The metrics are examined in four case studies.", "paper_title": "Tools and Stochastic Metrics for Debugging Temporal Behaviour of Real-Time Systems", "paper_id": "WOS:000269283600002"}