{"auto_keywords": [{"score": 0.010985018032136324, "phrase": "material_properties"}, {"score": 0.009448856555518012, "phrase": "temperature_errors"}, {"score": 0.00481495049065317, "phrase": "interface_equilibrium_conditions"}, {"score": 0.004652016085325825, "phrase": "accurate_treatment"}, {"score": 0.004620093797504386, "phrase": "material_interfaces"}, {"score": 0.004525629293824217, "phrase": "important_challenges"}, {"score": 0.004494570360108983, "phrase": "high-resolution_numerical_methods"}, {"score": 0.00443308765153716, "phrase": "interface-capturing_schemes"}, {"score": 0.004283019592801715, "phrase": "euler_equations"}, {"score": 0.004180992206290323, "phrase": "temperature_spikes"}, {"score": 0.004152288616186981, "phrase": "material_discontinuities"}, {"score": 0.004025531820226182, "phrase": "euler_simulations"}, {"score": 0.0039431758381711125, "phrase": "numerical_errors"}, {"score": 0.003916098498242888, "phrase": "heat_conduction"}, {"score": 0.003483120583663528, "phrase": "\"single-fluid\"_formulation"}, {"score": 0.003108565704097622, "phrase": "stiffened_equation"}, {"score": 0.0029620573986902416, "phrase": "numerical_approaches"}, {"score": 0.002931569771634119, "phrase": "pressure_oscillations"}, {"score": 0.00276462370914216, "phrase": "heat_conduction_term"}, {"score": 0.0026071599759743833, "phrase": "suitable_transport_equations"}, {"score": 0.0025892330566358503, "phrase": "conservative_or_non-conservative_forms"}, {"score": 0.0024842242921857705, "phrase": "appropriate_properties"}, {"score": 0.0022015970225369975, "phrase": "shock-induced_bubble_collapse"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Compressible multiphase flows", " Shock waves and interfaces", " Stiffened equation of state", " Interface capturing", " Solution-adaptive method"], "paper_abstract": "An accurate treatment of material interfaces in compressible multiphase flows poses important challenges for high-resolution numerical methods. Although high-order interface-capturing schemes have been used to accurately simulate gas/liquid interfaces with the Euler equations, these methods can result in temperature spikes at material discontinuities. While this phenomenon is not problematic for Euler simulations, it gives rise to numerical errors when heat conduction is included. In this work, we identify the source of these errors and propose a methodology to prevent their occurrence for various models Used to represent gas/liquid interfaces in compressible flows based on a \"single-fluid\" formulation, in which interfaces are represented by discontinuities in the material properties. Our focus lies in materials (gases and liquids primarily, but also solids) that can be described by a stiffened equation of state, though our approach is generalizable to other equations. We show that numerical approaches that prevent pressure oscillations at interfaces may generate temperature errors, which affect the energy (and pressure) through the heat conduction term. We demonstrate that the material properties entering the equation of state must be computed according to suitable transport equations in conservative or non-conservative forms; the pressure and temperature must be calculated based on the appropriate properties. To verify the analysis and compute problems with gas/liquid interfaces of relevance, we develop a three-dimensional, high-order accurate, solution-adaptive finite difference framework. In particular, we show that temperatures and pressures may be significantly overestimated in calculations of shock-induced bubble collapse in water if temperature errors are not prevented. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Maintaining interface equilibrium conditions in compressible multiphase flows using interface capturing", "paper_id": "WOS:000364256100030"}