{"auto_keywords": [{"score": 0.04902194563396072, "phrase": "touchscreen_inputs"}, {"score": 0.00481495049065317, "phrase": "user_gestures"}, {"score": 0.004666756595735701, "phrase": "multi-touch_interfaces"}, {"score": 0.004563691742821759, "phrase": "widespread_use"}, {"score": 0.0038855864345030563, "phrase": "design_creation_process"}, {"score": 0.0037997077863530897, "phrase": "user_study"}, {"score": 0.0037157201349604222, "phrase": "non-technical_users"}, {"score": 0.003293142761521425, "phrase": "sixteen_users"}, {"score": 0.0028284924551705516, "phrase": "proposed_cube_transformations"}, {"score": 0.00269263690712392, "phrase": "predominant_one"}, {"score": 0.0025518429503461736, "phrase": "mouse_interaction"}, {"score": 0.0023125191783901367, "phrase": "proposed_tasks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D", " Touchscreen", " Human factors", " User study", " User-centered design"], "paper_abstract": "Multi-touch interfaces have emerged with the widespread use of smartphones. Although a lot of people interact with 2D applications through touchscreens, interaction with 3D applications remains little explored. Most 3D object manipulation techniques have been created by designers who have generally put users aside from the design creation process. We conducted a user study to better understand how non-technical users tend to interact with a 3D object from touchscreen inputs. The experiment consists of 3D cube manipulations along three viewpoints for rotations, scaling and translations (RST). Sixteen users participated and 432 gestures were analyzed. To classify data, we introduce a taxonomy for 3D manipulation gestures with touchscreens. Then, we identify a set of strategies employed by users to perform the proposed cube transformations. Our findings suggest that each participant uses several strategies with a predominant one. Furthermore, we conducted a study to compare touchscreen and mouse interaction for 3D object manipulations. The results suggest that gestures are different according to the device, and touchscreens are preferred for the proposed tasks. Finally, we propose some guidelines to help designers in the creation of more user friendly tools. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Beyond the mouse: Understanding user gestures for manipulating 3D objects from touchscreen inputs", "paper_id": "WOS:000313766500022"}