{"auto_keywords": [{"score": 0.009001718602888559, "phrase": "large_numbers"}, {"score": 0.00481495049065317, "phrase": "semantic_web_trust_ratings"}, {"score": 0.00466102244911872, "phrase": "semantic_web"}, {"score": 0.00415019999222481, "phrase": "information_source"}, {"score": 0.003678023470672862, "phrase": "consumer's_private_reputations"}, {"score": 0.0033828748627992193, "phrase": "public_reputations"}, {"score": 0.002997735656669146, "phrase": "private_and_public_reputations"}, {"score": 0.002874870266177579, "phrase": "experimental_results"}, {"score": 0.0026687115458522326, "phrase": "unfair_ratings"}, {"score": 0.0021848422732893926, "phrase": "possibly_unreliable_sources"}, {"score": 0.0021049977753042253, "phrase": "semantic_web_attempt"}], "paper_keywords": ["trust on the Semantic Web", " content of Web sources", " information sharing", " unfair ratings", " Web of Trust"], "paper_abstract": "In the context of the Semantic Web, it may be beneficial for a user (consumer) to receive ratings from other users (advisors) regarding the reliability of an information source (provider). We offer a method for building more effective social networks of trust by critiquing the ratings provided by the advisors. Our approach models the consumer's private reputations of advisors based on ratings for providers whom the consumer has had experience with. It models public reputations of the advisors according to all ratings from these advisors for providers, including those who are unknown to the consumer. We then combine private and public reputations by assigning weights for each of them. Experimental results demonstrate that our approach is robust even when there are large numbers of advisors providing large numbers of unfair ratings. We show that we can effectively model the trustworthiness of advisors even when the population of providers grows increasingly large and discuss how our approach is beneficial in modeling providers. As such, we present a framework for sharing ratings of possibly unreliable sources, of value as users on the Semantic Web attempt to critique the trustworthiness of the information they seek.", "paper_title": "A comprehensive approach for sharing Semantic Web trust ratings", "paper_id": "WOS:000248270600002"}