{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "skin_effect"}, {"score": 0.039347074321304416, "phrase": "proposed_method"}, {"score": 0.014752237995916096, "phrase": "current_distribution"}, {"score": 0.014509651008389125, "phrase": "electrical_machine"}, {"score": 0.013881804746357381, "phrase": "solid_conductor"}, {"score": 0.01320745781218223, "phrase": "magnetic_potential_vector"}, {"score": 0.012846893392296293, "phrase": "finite_sum"}, {"score": 0.0047881480263782675, "phrase": "separated_representations"}, {"score": 0.004175935415610626, "phrase": "externally_imposed_density_current"}, {"score": 0.003960101604693806, "phrase": "separate_representation"}, {"score": 0.003776424440919605, "phrase": "boundary_conditions"}, {"score": 0.0037136443127486684, "phrase": "transient_and_permanent_distribution"}, {"score": 0.0035811651542886746, "phrase": "transient_and_steady_regime"}, {"score": 0.0034727526607880883, "phrase": "analytic_ones"}, {"score": 0.003453395626161181, "phrase": "permanent_regime"}, {"score": 0.0031403029065308766, "phrase": "transient_and_permanent_regime"}, {"score": 0.0030537219424151066, "phrase": "space_and_time_functions"}, {"score": 0.002911961514073769, "phrase": "multiple_field_problems"}, {"score": 0.0028715299874549245, "phrase": "time_instant"}, {"score": 0.002784540221128404, "phrase": "time_domain"}, {"score": 0.0026552425134383963, "phrase": "non-sinusoidal_currents"}, {"score": 0.002603758927691463, "phrase": "variable_speed-drives"}, {"score": 0.0023807981747706376, "phrase": "currents_envelope"}, {"score": 0.002195240062575067, "phrase": "electromagnetic_problems"}, {"score": 0.002176887956041267, "phrase": "new_method"}, {"score": 0.0021168128007470833, "phrase": "transient_fields"}, {"score": 0.0021049977753042253, "phrase": "multidimensional_time_and_space_domains"}], "paper_keywords": ["Modelling", " Computer applications", " Electric current", " Electromagnetism", " Transient voltages", " Simulation"], "paper_abstract": "Purpose - The purpose of this paper is to apply the method of separation of variables to obtain the current distribution in the slot of an electrical machine, taking into account the skin effect. Design/methodology/approach - A slot in an electrical machine, filled with a solid conductor, and fed with an externally imposed density current, presents a current distribution that depends on the skin effect. The magnetic potential vector is formulated and solved using a separate representation as a finite sum of unidimensional (space and time) functions, taking into account the boundary conditions. The proposed method obtains the transient and permanent distribution of the current in the interior of the slot, both in transient and steady regime, and the results at the end of the transient are compared with the analytic ones in permanent regime. Findings - The magnetic potential vector in the interior of a slot filled with a solid conductor can be expressed as a finite sum of just 16 modes, which capture the evolution of the field during the transient and permanent regime. These modes are expressed as the product of space and time functions, which have been obtained automatically by the separation of variables algorithm. Instead of solving multiple field problems, one for each time instant, the proposed method just solves two single-variable differential equations, one in the time domain and other in the spatial one. Research limitations/implications - The application of the proposed method to non-sinusoidal currents, such as those generated by variable speed-drives, would allow to compute the field taking into account both the very small time scale of the pulse width modulation pulses, in the range of kiloHz, and the wide time scale of the currents envelope, in the range of 0-100 Hz. Extension to 2D and 3D spatial configurations is also under consideration. Originality/value - Using the method of separation of variables to solve electromagnetic problems provides a new method which can simplify and speed up the computation of transient fields in multidimensional time and space domains.", "paper_title": "Simulation of skin effect via separated representations", "paper_id": "WOS:000281975700003"}