{"auto_keywords": [{"score": 0.042717350250577366, "phrase": "personalization_agent"}, {"score": 0.008553677687078935, "phrase": "web_personalization"}, {"score": 0.006985324578521637, "phrase": "user's_attitude"}, {"score": 0.00481495049065317, "phrase": "web_personalization_on_user_attitude_and_behavior"}, {"score": 0.00471811808206897, "phrase": "elaboration_likelihood"}, {"score": 0.004702168843383725, "phrase": "model_and_consumer_search_theory._web_personalization"}, {"score": 0.004592016716046632, "phrase": "increased_advertising_revenue"}, {"score": 0.004349791059765796, "phrase": "user_behavior"}, {"score": 0.004120289747942224, "phrase": "attitude_formation"}, {"score": 0.0037984549828326106, "phrase": "advertising_revenues"}, {"score": 0.003772793879444995, "phrase": "sales_revenues"}, {"score": 0.003671865026158296, "phrase": "current_research"}, {"score": 0.0036101552409969037, "phrase": "theoretical_model"}, {"score": 0.003585761649472705, "phrase": "user_attitudes"}, {"score": 0.003195324728141602, "phrase": "integrated_model"}, {"score": 0.0026157259734105, "phrase": "lab_study"}, {"score": 0.0025892330566358503, "phrase": "field_study"}, {"score": 0.0025630077791393125, "phrase": "six_hypotheses"}, {"score": 0.0024029583021102255, "phrase": "personalized_recommendations"}, {"score": 0.0023148964315569866, "phrase": "online_merchants"}, {"score": 0.002252880693912436, "phrase": "item_sampling"}, {"score": 0.0022074592164608134, "phrase": "practical_guidance"}], "paper_keywords": ["Elaboration likelihood model", " consumer search theory", " web personalization", " attitude persistence", " attitude confidence"], "paper_abstract": "Web personalization can achieve two business goals: increased advertising revenue and increased sales revenue. The realization of the two goals is related to two kinds of user behavior: item sampling and item selection. Prior research does not provide a model of attitude formation toward a personalization agent nor of how attitudes relate to these two behaviors. This limits our understanding of how web personalization can be managed to increase advertising revenues and/or sales revenues. To fill this gap, the current research develops and tests a theoretical model of user attitudes and behaviors toward a personalization agent. The model is based on an integration of two theories: the elaboration likelihood model (ELM) and consumer search theory (CST). In the integrated model, a user's attitude toward a personalization agent is influenced by both the number of items he/she has sampled so far (from CST) and the degree to which he/she cognitively processes each one (from ELM). In turn, attitude is modeled to influence both behaviors-that is, item selection and any further item sampling. We conducted a lab study and a field study to test six hypotheses. This research extends the theory on web personalization by providing a more complete picture of how sampling and processing of personalized recommendations influence a user's attitude and behavior toward the personalization agent. For online merchants, this research highlights the trade-off between item sampling and item selection and provides practical guidance on how to steer users toward the attitudes and behaviors that will realize their business goals.", "paper_title": "THE EFFECTS OF WEB PERSONALIZATION ON USER ATTITUDE AND BEHAVIOR: AN INTEGRATION OF THE ELABORATION LIKELIHOOD MODEL AND CONSUMER SEARCH THEORY", "paper_id": "WOS:000344971000009"}