{"auto_keywords": [{"score": 0.04795274928516732, "phrase": "service-oriented_system"}, {"score": 0.045912844607109565, "phrase": "performance_problem"}, {"score": 0.00481495049065317, "phrase": "service-oriented_system_performance"}, {"score": 0.004664352260912174, "phrase": "initial_use"}, {"score": 0.004357245559948974, "phrase": "query_response_time"}, {"score": 0.004201774694043468, "phrase": "single_data_source"}, {"score": 0.0031845067058084583, "phrase": "inherent_difficulty"}, {"score": 0.0029209233709517634, "phrase": "jdbc-odbc_driver"}, {"score": 0.0028813415821988156, "phrase": "java_code"}, {"score": 0.0028422946420821075, "phrase": "microsoft_access_database"}, {"score": 0.0025833500717948343, "phrase": "local_data_source"}, {"score": 0.002559951153813876, "phrase": "networking_problems"}, {"score": 0.00245724480030654, "phrase": "performance_measurements"}, {"score": 0.002193013499219711, "phrase": "detrimental_effect"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["performance", " investigation", " service-oriented", " services", " systematic process", " SOA"], "paper_abstract": "The initial use of a service-oriented system, which collates information from three databases, highlighted a performance problem with query response time for queries that selected more than ten attributes from a single data source. Our aim was to find the cause of the performance problem within the service-oriented system. The challenges that were encountered when attempting to locate such a problem are described. Our approach to finding the performance problem, while addressing these challenges, was based on systematically devising and applying measurements to the system. We developed strategies that addressed the challenges and the inherent difficulty of measuring performance in a service-oriented system. The cause of the performance problem was a buffer used by a JDBC-ODBC driver to connect Java code to a Microsoft Access database. Three strategies successfully addressed the challenges of measuring performance in the service-oriented system. In particular, routing queries to a local data source eliminated networking problems. Creating a model of the system allowed performance measurements to continue concurrently with demonstrations of the system, and with its further development. Finally, porting the system identified the part that had a detrimental effect on performance. Copyright (c) 2006 John Wiley & Sons, Ltd.", "paper_title": "Investigating service-oriented system performance: a systematic study", "paper_id": "WOS:000244211800003"}