{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coalition_structure_generation_problem"}, {"score": 0.004736045157669388, "phrase": "natural_abstraction"}, {"score": 0.004556901872357751, "phrase": "multi-agent_systems"}, {"score": 0.003841263262252044, "phrase": "mutually_disjoint_coalitions"}, {"score": 0.003757480190200645, "phrase": "total_reward"}, {"score": 0.0036958398682001015, "phrase": "resulting_coalitions"}, {"score": 0.003459191419478298, "phrase": "quite_restrictive_assumptions"}, {"score": 0.0032198357970567595, "phrase": "heuristic_approaches"}, {"score": 0.002851790448644913, "phrase": "main_dynamic-programming_approaches"}, {"score": 0.002758907973783665, "phrase": "coalition_structure_generation"}, {"score": 0.0025963890234079333, "phrase": "compact_representation_schemes"}, {"score": 0.0025678829712650437, "phrase": "coalitional_games"}], "paper_keywords": ["Coalitional games", " Set partitioning", " Coalition structure generation"], "paper_abstract": "The coalition structure generation problem is a natural abstraction of one of the most important challenges in multi-agent systems: How can a number of agents divide themselves into groups in order to improve their performance? More precisely, the coalition structure generation problem focuses on partitioning the set of agents into mutually disjoint coalitions so that the total reward from the resulting coalitions is maximized. This problem is computationally challenging, even under quite restrictive assumptions. This has prompted researchers to develop a range of algorithms and heuristic approaches for solving the problem efficiently. This article presents a survey of these approaches. In particular, it surveys the main dynamic-programming approaches and anytime algorithms developed for coalition structure generation, and considers techniques specifically developed for a range of compact representation schemes for coalitional games. It also considers settings where there are constraints on the coalitions that are allowed to form, as well as settings where the formation of one coalition could influence the performance of other co-existing coalitions. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Coalition structure generation: A survey", "paper_id": "WOS:000363071100005"}