{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_units"}, {"score": 0.01006800117673282, "phrase": "distributional_asymmetry"}, {"score": 0.009902775241815808, "phrase": "domain_terms"}, {"score": 0.004455272634364756, "phrase": "preliminary_requirement"}, {"score": 0.004406121974246201, "phrase": "navigation_learning"}, {"score": 0.004285594361623147, "phrase": "link_mining"}, {"score": 0.00396530196547293, "phrase": "linear_way"}, {"score": 0.0035290250358997904, "phrase": "text_document"}, {"score": 0.002970914475538276, "phrase": "local_nature"}, {"score": 0.002718231974492536, "phrase": "document_association_relationship"}, {"score": 0.00251478366610296, "phrase": "candidate_ku-pairs"}, {"score": 0.0023394947463129642, "phrase": "classification_algorithm"}, {"score": 0.0021049977753042253, "phrase": "computational_complexity"}], "paper_keywords": ["Knowledge unit", " Learning-dependency", " Text", " Locality"], "paper_abstract": "Identifying learning-dependency among the knowledge units (KU) is a preliminary requirement of navigation learning. Methods based on link mining lack the ability of discovering such dependencies among knowledge units that are arranged in a linear way in the text. In this paper, we propose a method of mining the learning-dependencies among the KU from text document. This method is based on two features that we found and studied from the KU and the learning-dependencies among them. They are the distributional asymmetry of the domain terms and the local nature of the learning-dependency, respectively. Our method consists of three stages, (1) Build document association relationship by calculating the distributional asymmetry of the domain terms. (2) Generate the candidate KU-pairs by measuring the locality of the dependencies. (3) Use classification algorithm to identify the learning-dependency between KU-pairs. Our experimental results show that our method extracts the learning-dependency efficiently and reduces the computational complexity.", "paper_title": "Mining learning-dependency between knowledge units from text", "paper_id": "WOS:000290802400002"}