{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ship_specifications"}, {"score": 0.041996689288621714, "phrase": "heterogeneous_systems"}, {"score": 0.0047057084749407485, "phrase": "shipbuilding_process"}, {"score": 0.00452043800760441, "phrase": "ship_specification_files"}, {"score": 0.004243862930012258, "phrase": "different_file_formats"}, {"score": 0.003634371940842838, "phrase": "different_stages"}, {"score": 0.003471135453226184, "phrase": "integrated_information"}, {"score": 0.003221316290858497, "phrase": "service-oriented_architecture_concept"}, {"score": 0.0031481164109237636, "phrase": "knowledge-sharing_architecture"}, {"score": 0.0029722900280316216, "phrase": "extensible_mark-up_language"}, {"score": 0.0028550709503536494, "phrase": "ksass"}, {"score": 0.002726740692380339, "phrase": "full_and_construction_specification_files"}, {"score": 0.002321234686549485, "phrase": "integrated_specification_files"}, {"score": 0.0021049977753042253, "phrase": "open_system"}], "paper_keywords": ["extensible mark-up language", " ship specifications", " knowledge-sharing", " Web services", " service-oriented architecture", " interoperability", " heterogeneous data"], "paper_abstract": "In the shipbuilding process, the information flow connected with ship specification files is very complex. These files are usually scattered as different file formats in various departments or stored as a database in the heterogeneous systems within a shipyard. Therefore, it is extremely difficult to integrate the information coming from different stages of shipbuilding, much less to share integrated information among various departments. To address that problem, the authors employ the service-oriented architecture concept to develop the knowledge-sharing architecture for ship specifications (KSASS). Equipped with extensible mark-up language and Web services technology, the KSASS is used to integrate the outline, full and construction specification files, which originate from three phases of shipbuilding. In this way, the database of ship specifications is established which is easily accessible and highly interoperable. The integrated specification files can not only be structurally preserved but also conveniently transmitted among the heterogeneous systems, with the open system achieved. Eventually, the knowledge owned by the shipyard will be efficiently managed, applied and shared.", "paper_title": "The service-oriented, interoperable and knowledge-sharing architecture for ship specifications", "paper_id": "WOS:000299881400005"}