{"auto_keywords": [{"score": 0.0496729815270419, "phrase": "digital_formats"}, {"score": 0.03254376137231176, "phrase": "quantitative_assessment_model"}, {"score": 0.015719716506582538, "phrase": "preservation_durability"}, {"score": 0.014819203729667019, "phrase": "digital_preservation"}, {"score": 0.0046141941030386525, "phrase": "appropriate_measures"}, {"score": 0.004459605573798577, "phrase": "digital_data"}, {"score": 0.004148014765950199, "phrase": "format_obsolescence"}, {"score": 0.003858110309630846, "phrase": "measurement_method"}, {"score": 0.0038253590626087237, "phrase": "format_obsolescence_risk"}, {"score": 0.0036501160751879784, "phrase": "preservation_risk"}, {"score": 0.003527712410706358, "phrase": "self-improving_assessment_model"}, {"score": 0.0030515222178491923, "phrase": "format_risk"}, {"score": 0.0029744042270542655, "phrase": "non-quantifiable_knowledge"}, {"score": 0.002924074850256874, "phrase": "field_experts"}, {"score": 0.0022828795331819025, "phrase": "status_quo_situation"}, {"score": 0.002187464225869713, "phrase": "fine_tune"}, {"score": 0.0021049977753042253, "phrase": "self-learning_and_self-improving_style"}], "paper_keywords": ["Digital preservation", " Format obsolescence", " Risk assessment model", " Risk value"], "paper_abstract": "It is now widely recognized that appropriate measures are required for digital preservation to ensure that digital data can be accessed and used currently and in the future. Among all the risks of digital preservation, format obsolescence is one of the most important. There have been several projects or initiatives dealing with the measurement method of format obsolescence risk, but there has been no mechanism to quantify the preservation risk or durability of digital formats based on a self-improving assessment model, executed with the aid of computers. This paper deals with a methodology for measuring the preservation durability of digital formats, especially for their risk assessment. This method is based on a quantitative assessment model for format risk, and can shift the non-quantifiable knowledge or experiences of field experts to a machine identifiable and processible form, or 'risk scores'. Results can be recognized and communicated by computers automatically and formally, which can assist in the automatic/semi-automatic risk management for digital preservation, sharing this quantified knowledge among communities. Because technologies are changing quickly, the quantitative assessment model for risks will not be a status quo situation. Thus, also presented is a method to fine tune the quantitative assessment model for risk of formats through a self-learning and self-improving style.", "paper_title": "A methodology for measuring the preservation durability of digital formats", "paper_id": "WOS:000285586900006"}