{"auto_keywords": [{"score": 0.0464180267105254, "phrase": "blind_flooding"}, {"score": 0.03588852397931544, "phrase": "weighted_rng"}, {"score": 0.00481495049065317, "phrase": "internet_graphs"}, {"score": 0.004780334370089564, "phrase": "peer-to-peer_computing_systems"}, {"score": 0.004399616575575586, "phrase": "classical_mechanism"}, {"score": 0.004305364955542171, "phrase": "node_retransmits"}, {"score": 0.004034504342397309, "phrase": "network_size"}, {"score": 0.003976656675903324, "phrase": "communication_overheads"}, {"score": 0.003808024029417427, "phrase": "dynamic_topologies"}, {"score": 0.003766991006640731, "phrase": "optimal_solution"}, {"score": 0.003712964709503484, "phrase": "minimal_spanning_trees"}, {"score": 0.003504470784139224, "phrase": "local_knowledge"}, {"score": 0.003110579040263398, "phrase": "weighted_rngq"}, {"score": 0.0028832306043717637, "phrase": "weighted_mst"}, {"score": 0.00283158908387463, "phrase": "weighted_lmst"}, {"score": 0.002320943211698446, "phrase": "lmst"}, {"score": 0.0022711207841260767, "phrase": "rngq"}, {"score": 0.0022547593038130974, "phrase": "rng"}, {"score": 0.002222365485177405, "phrase": "based_broadcasting_schemes"}, {"score": 0.0021825348057711628, "phrase": "overall_advantage"}, {"score": 0.00216680270402079, "phrase": "lmst."}, {"score": 0.0021049977753042253, "phrase": "existing_protocols"}], "paper_keywords": ["Peer-to-peer systems", " Internet networks", " Broadcasting", " Searching"], "paper_abstract": "In a broadcasting problem, a message is sent from a source to all the other nodes in the network. Blind flooding is a classical mechanism for broadcasting, where each node retransmits received message to all its neighbors. Despite its important advantages, an increase in the number of requests or the network size or density produces communication overheads that limit the scalability of blind flooding, especially in networks with dynamic topologies. Theoretically optimal solution is based on minimal spanning trees (MST), but its construction is expensive. We discuss here protocols based on local knowledge and newly proposed sparse structures. In weighted RNG (Relative Neighborhood Graph), messages are forwarded only on links which are not the 'longest' in any triangle. In weighted RNGQ, messages are forwarded to links which are not the longest in any triangle or quadrangle. Each node constructs weighted MST based on its 2-hop knowledge. Weighted LMST (Localized LMST) preserves only edges that are selected by both endpoints, and messages are forwarded on these links. Any available metric, such as delay, reliability, reputation etc. can be used as weight. Analysis and simulation show that weighted RNG performs better than existing Flooding and Rumor Mongering (or Gossip) schemes. The parameterless weighted LMST, MST, RNG and RNGQ (RNG over Quadrangle) based broadcasting schemes are compared, showing overall advantage for LMST. We also hint that a number of existing protocols can be simplified by applying concept from this article.", "paper_title": "Sparse structures for searching and broadcasting algorithms over internet graphs and peer-to-peer computing systems", "paper_id": "WOS:000290276500002"}