{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "aeneas"}, {"score": 0.047564923275673396, "phrase": "distributed_programs"}, {"score": 0.009658023955736839, "phrase": "transmission_time"}, {"score": 0.0044277810648955624, "phrase": "novel_approach"}, {"score": 0.0041703614123283165, "phrase": "execution_state"}, {"score": 0.0038348235692738783, "phrase": "real-time_performance_analysis"}, {"score": 0.003321008590273796, "phrase": "available_data_file"}, {"score": 0.003109031770476385, "phrase": "data_file"}, {"score": 0.002893140560765452, "phrase": "transmission_path"}, {"score": 0.0028076592725295646, "phrase": "aggregate_expression"}, {"score": 0.002708399936381754, "phrase": "fastest_response_time"}, {"score": 0.0026600905156986317, "phrase": "slowest_response_time"}, {"score": 0.0021049977753042253, "phrase": "real-time_performance"}], "paper_keywords": ["distributed program", " reliability", " real-time performance", " response time"], "paper_abstract": "A novel approach, called Aeneas, which is based on the execution state of distributed programs, is proposed in this paper. It is for the real-time performance analysis of distributed programs with reliability-constrains. In Aeneas, there are two important factors, the available data files and the transmission paths of each available data file. Some algorithms are designed to find all the transmission paths of each data file needed while the program executes, count the transmission time for each transmission path, then get the aggregate expression of transmission time, calculate the fastest response time and the slowest response time of distributed programs with reliability-constrains. In order to justify the feasibility and the availability of this approach, a series of experiments have been done. The results show that it is feasible and efficient to evaluate the real-time performance for distributed software with reliability-constrains.", "paper_title": "Aeneas: real-time performance evaluation approach for distributed programs with reliability-constrains", "paper_id": "WOS:000246830500007"}