{"auto_keywords": [{"score": 0.04468012994164412, "phrase": "istanbul_strait"}, {"score": 0.00481495049065317, "phrase": "collision_avoidance"}, {"score": 0.004554488671294504, "phrase": "narrow_waterways"}, {"score": 0.004429566229017728, "phrase": "serious_problem"}, {"score": 0.004377077848734575, "phrase": "disturbance_factors"}, {"score": 0.004342430078306461, "phrase": "geographic_structure"}, {"score": 0.00405873677211836, "phrase": "decision_support_system"}, {"score": 0.004010624853427534, "phrase": "guidance_method"}, {"score": 0.003885085477351673, "phrase": "main_purpose"}, {"score": 0.003808619097554076, "phrase": "artificial_neural_network"}, {"score": 0.003674738405118697, "phrase": "manually_controlled_vessels"}, {"score": 0.003588100032858716, "phrase": "future_locations"}, {"score": 0.0032614351951327455, "phrase": "vts"}, {"score": 0.0030000149283621286, "phrase": "vessels'_data"}, {"score": 0.002882980094838904, "phrase": "environmental_conditions"}, {"score": 0.0028487656293168795, "phrase": "neural_networks"}, {"score": 0.00267301171407926, "phrase": "initial_point"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Decision support", " Neural networks", " Levenberg-Marquardt learning algorithm", " Collision avoidance"], "paper_abstract": "Although there are many advanced systems to assist vessels with passing through narrow waterways, it continues to be a serious problem because of disturbance factors and geographic structure. By taking Istanbul Strait as a model for this study, we aimed to develop a decision support system and/or a guidance method to assist reciprocally passing vessels. The main purpose is to develop an Artificial Neural Network (ANN) that uses the data of manually controlled vessels to generate predictions about the future locations of those vessels. If there is any possibility of collision, this system is aimed to warn the operators in the Vessel Traffic Services (VTS) centre and to guide the personnel of the vessels. In this study, manually controlled and reciprocally passing vessels' data were used (including coordinates, speed, and environmental conditions), neural networks were trained, and predictions were made about the locations of vessels three minutes after the initial point of evaluation (this duration was determined by considering the conditions of Istanbul Strait). With this purpose, we used data gathered from vessels and proved the success of the system, especially concerning predictions made during turnings, by determining the possibility of collision between two vessels three minutes after the data was gathered. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Decision support system for collision avoidance of vessels", "paper_id": "WOS:000344460600031"}