{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dynamic_multi-attribute_decision"}, {"score": 0.004709333998298903, "phrase": "intuitionistic_fuzzy_information"}, {"score": 0.004530023871441992, "phrase": "intuitionistic_fuzzy_variable"}, {"score": 0.0044800522651664695, "phrase": "uncertain_intuitionistic_fuzzy_variable"}, {"score": 0.003509487090932835, "phrase": "exponential_distribution_based_method"}, {"score": 0.0034707339811048403, "phrase": "average_age_method"}, {"score": 0.0033384259516301223, "phrase": "weight_vectors"}, {"score": 0.0031405975280029913, "phrase": "difwa_operator"}, {"score": 0.0030376623293574905, "phrase": "dynamic_intuitionistic_fuzzy_multi-attribute_decision"}, {"score": 0.002763919794139171, "phrase": "intuitionistic_fuzzy_numbers"}, {"score": 0.002718231974492536, "phrase": "different_periods"}, {"score": 0.0026000466400112974, "phrase": "udifwa_operator"}, {"score": 0.002542890176213921, "phrase": "dif-madm"}, {"score": 0.00251478366610296, "phrase": "interval_uncertainty"}, {"score": 0.0023656467839555458, "phrase": "interval-valued_intuitionistic_fuzzy_numbers"}, {"score": 0.0022502133699402018, "phrase": "practical_case"}, {"score": 0.0021763973978248005, "phrase": "developed_procedures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["dynamic intuitionistic fuzzy multi-attribute decision making (DIF-MADM)", " dynamic intuitionistic fuzzy weighted averaging (DIFWA) operator", " uncertain dynamic intuitionistic fuzzy weighted averaging (UDIFWA) operator"], "paper_abstract": "The dynamic multi-attribute decision making problems with intuitionistic fuzzy information are investigated. The notions of intuitionistic fuzzy variable and uncertain intuitionistic fuzzy variable are defined, and two new aggregation operators: dynamic intuitionistic fuzzy weighted averaging (DIFWA) operator and uncertain dynamic intuitionistic fuzzy weighted averaging (UDIFWA) operator are presented. Some methods, including the basic unit-interval monotonic (BUM) function based method, normal distribution based method, exponential distribution based method and average age method, are introduced to determine the weight vectors associated with these operators. A procedure based on the DIFWA operator is developed to solve the dynamic intuitionistic fuzzy multi-attribute decision making (DIF-MADM) problems where all the decision information about attribute values takes the form of intuitionistic fuzzy numbers collected at different periods, and a procedure based on the UDIFWA operator is developed for DIF-MADM under interval uncertainty in which all the decision information about attribute values takes the form of interval-valued intuitionistic fuzzy numbers collected at different periods. Finally, a practical case is used to illustrate the developed procedures. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Dynamic intuitionistic fuzzy multi-attribute decision making", "paper_id": "WOS:000255074500016"}