{"auto_keywords": [{"score": 0.032501446262619214, "phrase": "partition_approach"}, {"score": 0.015719716506582538, "phrase": "first-last_fit_spectrum_allocation"}, {"score": 0.009388923162790887, "phrase": "first-last_fit_allocation_policy"}, {"score": 0.009010637910673342, "phrase": "simulation_results"}, {"score": 0.004647442352794694, "phrase": "bandwidth_fragmentation"}, {"score": 0.004485735417293941, "phrase": "non-aligned_and_non-contiguous_available_subcarrier_slots"}, {"score": 0.004105558123159003, "phrase": "contiguous_slots"}, {"score": 0.003986103192038901, "phrase": "routing_path"}, {"score": 0.00384731849108269, "phrase": "non-aligned_available_slots"}, {"score": 0.003626626504149897, "phrase": "subcarrier-slot_partition_scheme"}, {"score": 0.002966438503447793, "phrase": "spectrum_allocation"}, {"score": 0.002914288956035066, "phrase": "non-disjoint_connections"}, {"score": 0.0025137856138000014, "phrase": "non-partition_approach"}, {"score": 0.0023277282036119106, "phrase": "blocking_probability"}, {"score": 0.002246553137021003, "phrase": "proposed_scheme"}], "paper_keywords": ["Elastic optical networks", " Spectrum allocation", " Blocking probability"], "paper_abstract": "Bandwidth fragmentation refers to the existence of non-aligned and non-contiguous available subcarrier slots in elastic optical networks. Since spectrum for a connection must be allocated to contiguous slots and aligned along the routing path, non-contiguous and non-aligned available slots could cause call blocking. This paper proposes a subcarrier-slot partition scheme with first-last fit spectrum allocation for elastic optical networks in order to increase the number of contiguous aligned available slots, and hence the blocking probability in the network is suppressed. The partition approach creates more aligned available slots by separating the spectrum allocation of the non-disjoint connections. The first-last fit allocation policy creates more contiguous aligned available slots between two partitions. Simulation results show that the partition approach with first-last fit allocation policy provides lower blocking probability than that of the non-partition approach and the partition approach with other spectrum allocation-policies. Furthermore, simulation results indicate that the blocking probability in the network using the proposed scheme improves as the number of partitions is reduced. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A subcarrier-slot partition scheme with first-last fit spectrum allocation for elastic optical networks", "paper_id": "WOS:000364436900045"}