{"auto_keywords": [{"score": 0.035935416587620665, "phrase": "local_outliers"}, {"score": 0.02660751524225159, "phrase": "data_items"}, {"score": 0.00481495049065317, "phrase": "centric_local_outliers"}, {"score": 0.0047283116134926645, "phrase": "outlier_detection_techniques"}, {"score": 0.004559661374976129, "phrase": "credit-card_fraud_detection"}, {"score": 0.004437115547184535, "phrase": "electronic_commerce"}, {"score": 0.004015182362035361, "phrase": "existing_density-based_local_outlier_detection"}, {"score": 0.0037848978618663684, "phrase": "numerical_space"}, {"score": 0.0036332251283046997, "phrase": "novel_mutual-reinforcement-based_local_outlier_detection_approach"}, {"score": 0.002988101395789399, "phrase": "bank_investment"}, {"score": 0.002934237411711622, "phrase": "unique_body"}, {"score": 0.002423931101340771, "phrase": "similar_but_different_user-defined_relationships"}, {"score": 0.002124247104243502, "phrase": "extensive_experimental_studies"}, {"score": 0.0021049977753042253, "phrase": "real_datasets"}], "paper_keywords": ["data mining", " clustering", " outlier detection"], "paper_abstract": "Outlier detection techniques are widely used in many applications such as credit-card fraud detection, monitoring criminal activities in electronic commerce, etc. These applications attempt to identify outliers as noises, exceptions, or objects around the border. The existing density-based local outlier detection assigns the degree to which an object is an outlier in a numerical space. In this paper, we propose a novel mutual-reinforcement-based local outlier detection approach. Instead of detecting local outliers as noise, we attempt to identify local outliers in the center, where they are similar to some clusters of objects on one hand, and are unique on the other. Our technique can be used for bank investment to identify a unique body, similar to many good competitors, in which to invest. We attempt to detect local outliers in categorical, ordinal as well as numerical data. In categorical data, the challenge is that there are many similar but different ways to specify relationships among the data items. Our mutual-reinforcement-based approach is stable, with similar but different user-defined relationships. Our technique can reduce the burden for users to determine the relationships among data items, and find the explanations why the outliers are found. We conducted extensive experimental studies using real datasets.", "paper_title": "Finding centric local outliers in categorical/numerical spaces", "paper_id": "WOS:000236717100003"}