{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grid"}, {"score": 0.013731951166679303, "phrase": "large_scale"}, {"score": 0.008506553039821814, "phrase": "large_scale_distributed_systems"}, {"score": 0.004728502036432143, "phrase": "single_entity"}, {"score": 0.0047256726869051805, "phrase": "new_level"}, {"score": 0.004527747831940216, "phrase": "widely_separated_computational_resources"}, {"score": 0.004326488232412809, "phrase": "theoretical_virtual_supercomputer"}, {"score": 0.00426900754050533, "phrase": "cloud_computing"}, {"score": 0.004223570987311188, "phrase": "new_type"}, {"score": 0.004189809878977535, "phrase": "distributed_system"}, {"score": 0.0039821434917729145, "phrase": "main_characteristics"}, {"score": 0.0037344208641063637, "phrase": "technical_specifics"}, {"score": 0.003511442334080525, "phrase": "distributed_computing"}, {"score": 0.0034554889970700993, "phrase": "completely_new_level"}, {"score": 0.0034004242101610556, "phrase": "cloud_management_mechanisms"}, {"score": 0.0033732206350186086, "phrase": "key_role"}, {"score": 0.003292904448034129, "phrase": "system_behavior"}, {"score": 0.003171740347925348, "phrase": "autonomic_features"}, {"score": 0.0030796662379760573, "phrase": "traditional_distributed_computing_management_mechanisms"}, {"score": 0.003022465992278672, "phrase": "specific_parameters"}, {"score": 0.0027593514919815407, "phrase": "distributed_systems_complexity"}, {"score": 0.0026294345532129368, "phrase": "cloud_behavior"}, {"score": 0.002512342528545883, "phrase": "different_understanding"}, {"score": 0.002472269923319476, "phrase": "large_scale_behavior"}, {"score": 0.00245905458142094, "phrase": "global_events"}, {"score": 0.00234324312505334, "phrase": "theoretical_framework"}, {"score": 0.0023058614702473877, "phrase": "multiple_resources"}, {"score": 0.0022690748070048764, "phrase": "large_scale_distributed_systems_management_techniques"}, {"score": 0.0022090603669919187, "phrase": "quality_of_service"}, {"score": 0.0021738146596180404, "phrase": "resulting_synergy"}, {"score": 0.0021049977753042253, "phrase": "cloud_management"}], "paper_keywords": ["Grid computing", " Cloud computing", " Autonomic computing", " Theoretical models"], "paper_abstract": "Over the last decade, Grid computing paved the way for a new level of large scale distributed systems. This infrastructure made it possible to securely and reliably take advantage of widely separated computational resources that are part of several different organizations. Resources can be incorporated to the Grid, building a theoretical virtual supercomputer. In time, cloud computing emerged as a new type of large scale distributed system, inheriting and expanding the expertise and knowledge that have been obtained so far. Some of the main characteristics of Grids naturally evolved into clouds, others were modified and adapted and others were simply discarded or postponed. Regardless of these technical specifics, both Grids and clouds together can be considered as one of the most important advances in large scale distributed computing of the past ten years; however, this step in distributed computing has came along with a completely new level of complexity. Grid and cloud management mechanisms play a key role, and correct analysis and understanding of the system behavior are needed. Large scale distributed systems must be able to self-manage, incorporating autonomic features capable of controlling and optimizing all resources and services. Traditional distributed computing management mechanisms analyze each resource separately and adjust specific parameters of each one of them. When trying to adapt the same procedures to Grid and cloud computing, the vast complexity of these systems can make this task extremely complicated. But large scale distributed systems complexity could only be a matter of perspective. It could be possible to understand the Grid or cloud behavior as a single entity, instead of a set of resources. This abstraction could provide a different understanding of the system, describing large scale behavior and global events that probably would not be detected analyzing each resource separately. In this work we define a theoretical framework that combines both ideas, multiple resources and single entity, to develop large scale distributed systems management techniques aimed at system performance optimization, increased dependability and Quality of Service (QoS). The resulting synergy could be the key to address the most important difficulties of Grid and cloud management.", "paper_title": "Riding Out the Storm: How to Deal with the Complexity of Grid and Cloud Management", "paper_id": "WOS:000308554100002"}