{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "rdis"}, {"score": 0.010027808179750486, "phrase": "resistive_memories"}, {"score": 0.004635477242873163, "phrase": "high_scalability"}, {"score": 0.004441517985511521, "phrase": "promising_technology"}, {"score": 0.004357927940322685, "phrase": "physical_limitations"}, {"score": 0.004296264970612285, "phrase": "charge-based_dram"}, {"score": 0.004136044939878838, "phrase": "main_burden"}, {"score": 0.004077508669922702, "phrase": "successful_adoption"}, {"score": 0.003906804492585634, "phrase": "process_variation"}, {"score": 0.0038698476651328898, "phrase": "limited_write_endurance"}, {"score": 0.0037969755088553326, "phrase": "faulty_and_worn-out_cells"}, {"score": 0.0034526191487098093, "phrase": "robust_error_correction_scheme"}, {"score": 0.002923214590192792, "phrase": "correct_retrieval"}, {"score": 0.002486589906779091, "phrase": "read_time"}, {"score": 0.0022181655497912796, "phrase": "relative_increase"}], "paper_keywords": ["Hard faults", " phase change memory", " fault tolerance", " reliability"], "paper_abstract": "With their potential for high scalability and density, resistive memories are foreseen as a promising technology that overcomes the physical limitations confronted by charge-based DRAM and flash memory. Yet, a main burden towards the successful adoption and commercialization of resistive memories is their low cell reliability caused by process variation and limited write endurance. Typically, faulty and worn-out cells are permanently stuck at either '0' or '1'. To overcome the challenge, a robust error correction scheme that can recover from many hard faults is required. In this paper, we propose and evaluate RDIS, a novel scheme to efficiently tolerate memory stuck-at faults. RDIS allows for the correct retrieval of data by recursively determining and efficiently keeping track of the positions of the bits that are stuck at a value different from the ones that are written, and then, at read time, by inverting the values read from those positions. RDIS is characterized by a very low probability of failure that increases slowly with the relative increase in the number of faults. Moreover, RDIS tolerates many more faults than the best existing scheme-by up to 95 percent on average at the same overhead level.", "paper_title": "RDIS: Tolerating Many Stuck-At Faults in Resistive Memory", "paper_id": "WOS:000349672000019"}