{"auto_keywords": [{"score": 0.04666425988951751, "phrase": "positive_integer"}, {"score": 0.004597754207658615, "phrase": "demand_vertex"}, {"score": 0.003839962121679795, "phrase": "exactly_one_supply"}, {"score": 0.002896535621940078, "phrase": "exactly_one_supply_vertex"}, {"score": 0.0026163210719740847, "phrase": "supply_vertex"}, {"score": 0.002498053212249228, "phrase": "total_cost"}, {"score": 0.002441416885122905, "phrase": "t."}, {"score": 0.0023305762840188145, "phrase": "minimization_problem"}, {"score": 0.0023100515109451703, "phrase": "np"}, {"score": 0.002225196379204285, "phrase": "pseudo-polynomial-time_algorithm"}, {"score": 0.0021245712108461227, "phrase": "fully_polynomial-time_approximation_scheme"}, {"score": 0.0021050190924531364, "phrase": "fptas"}], "paper_keywords": ["Approximation algorithm", " Demand vertex", " Directed edge", " FPTAS", " Graph partition", " Supply vertex", " Tree"], "paper_abstract": "Let T be a given tree. Each vertex of T is either a supply vertex or a demand vertex, and is assigned a positive integer, called the supply or the demand. Every demand vertex v of T must be supplied an amount of \"power,\" equal to the demand of v, from exactly one supply vertex through edges in T. Each edge e of T has a direction, and is assigned a positive integer which represents the cost required to delete e from T or reverse the direction of e. Then one wishes to obtain subtrees of T by deleting edges or reversing the directions of edges so that (a) each subtree contains exactly one supply vertex whose supply is no less than the sum of all demands in the subtree and (b) every edge is directed away from the supply vertex in each subtree. One wishes to minimize the total cost to obtain such subtrees from T. In the paper, we first show that this minimization problem is NP-hard, and then give a pseudo-polynomial-time algorithm to solve the problem. We finally give a fully polynomial-time approximation scheme (FPTAS) for the problem.", "paper_title": "Minimum Cost Partitions of Trees with Supply and Demand", "paper_id": "WOS:000308228400005"}