{"auto_keywords": [{"score": 0.0500785012217586, "phrase": "cloud_computing"}, {"score": 0.0337144289008937, "phrase": "acps"}, {"score": 0.0047707093928203, "phrase": "cloud_computing_adoption"}, {"score": 0.004640398886726948, "phrase": "unresolved_security_issues"}, {"score": 0.004492841495994535, "phrase": "cloud_user"}, {"score": 0.004077616905584829, "phrase": "guest_virtual_machines"}, {"score": 0.0040215052006051235, "phrase": "cloud_infrastructure_components"}, {"score": 0.0038756055612167942, "phrase": "novel_architecture"}, {"score": 0.003839962121679795, "phrase": "advanced_cloud_protection_system"}, {"score": 0.0037006243674469657, "phrase": "increased_security"}, {"score": 0.0033739270918502285, "phrase": "infrastructure_components"}, {"score": 0.003281643474564305, "phrase": "virtual_machines"}, {"score": 0.003118942369691329, "phrase": "security_breaches"}, {"score": 0.002396179086883189, "phrase": "different_types"}, {"score": 0.0022355167967736326, "phrase": "introduced_overhead"}, {"score": 0.002164264600379492, "phrase": "provided_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Security", " Cloud computing", " Virtualization technologies"], "paper_abstract": "Cloud computing adoption and diffusion are threatened by unresolved security issues that affect both the cloud provider and the cloud user. In this paper, we show how virtualization can increase the security of cloud computing, by protecting both the integrity of guest virtual machines and the cloud infrastructure components. In particular, we propose a novel architecture, Advanced Cloud Protection System (ACPS), aimed at guaranteeing increased security to cloud resources. ACPS can be deployed on several cloud solutions and can effectively monitor the integrity of guest and infrastructure components while remaining fully transparent to virtual machines and to cloud users. ACPS can locally react to security breaches as well as notify a further security management layer of such events. A prototype of our ACPS proposal is fully implemented on two current open source solutions: Eucalyptus and OpenECP. The prototype is tested against effectiveness and performance. In particular: (a) effectiveness is shown testing our prototype against attacks known in the literature; (b) performance evaluation of the ACPS prototype is carried out under different types of workload. Results show that our proposal is resilient against attacks and that the introduced overhead is small when compared to the provided features. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Secure virtualization for cloud computing", "paper_id": "WOS:000291846700010"}