{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "object_class_segmentation"}, {"score": 0.004580550308652044, "phrase": "dense_stereo_reconstruction"}, {"score": 0.004381749459671914, "phrase": "random_field_labeling_problems"}, {"score": 0.0039433581938239926, "phrase": "object_class"}, {"score": 0.0033384259516301223, "phrase": "flexible_framework"}, {"score": 0.002970914475538276, "phrase": "real_world_data"}, {"score": 0.0028417741269408194, "phrase": "joint_optimization"}, {"score": 0.002614534850703364, "phrase": "leuven_data_set"}, {"score": 0.0025008468316682036, "phrase": "stereo_video_shot"}, {"score": 0.00237883279257538, "phrase": "leuven"}, {"score": 0.002152332983488664, "phrase": "challenging_domain"}, {"score": 0.0021285340816566906, "phrase": "street-view_analysis"}, {"score": 0.0021049977753042253, "phrase": "complete_source_code"}], "paper_keywords": ["Object class segmentation", " Dense stereo reconstruction", " Random fields"], "paper_abstract": "The problems of dense stereo reconstruction and object class segmentation can both be formulated as Random Field labeling problems, in which every pixel in the image is assigned a label corresponding to either its disparity, or an object class such as road or building. While these two problems are mutually informative, no attempt has been made to jointly optimize their labelings. In this work we provide a flexible framework configured via cross-validation that unifies the two problems and demonstrate that, by resolving ambiguities, which would be present in real world data if the two problems were considered separately, joint optimization of the two problems substantially improves performance. To evaluate our method, we augment the Leuven data set (http://cms.brookes.ac.uk/research/visiongroup/files/Leuven.zip), which is a stereo video shot from a car driving around the streets of Leuven, with 70 hand labeled object class and disparity maps. We hope that the release of these annotations will stimulate further work in the challenging domain of street-view analysis. Complete source code is publicly available (http://cms.brookes.ac.uk/staff/Philip-Torr/ale.htm).", "paper_title": "Joint Optimization for Object Class Segmentation and Dense Stereo Reconstruction", "paper_id": "WOS:000308364500002"}