{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cell_cycle-regulated_genes"}, {"score": 0.00465964893087681, "phrase": "biological_studies"}, {"score": 0.004568871736067739, "phrase": "statistical_approaches"}, {"score": 0.003400640983719424, "phrase": "null_hypothesis"}, {"score": 0.003142955332566736, "phrase": "logit"}, {"score": 0.0031019376648943647, "phrase": "stouffer"}, {"score": 0.0030614565460256897, "phrase": "liptak"}, {"score": 0.0029238768315330305, "phrase": "independent_microarray_experiments"}, {"score": 0.00268452026617243, "phrase": "better_set"}, {"score": 0.002497319603143104, "phrase": "budding_yeast"}, {"score": 0.0023694065215394593, "phrase": "time_series_data"}, {"score": 0.0022928018832993387, "phrase": "fission_yeast"}, {"score": 0.0021753413850499467, "phrase": "go_terms"}, {"score": 0.0021049977753042253, "phrase": "cell_cycle"}], "paper_keywords": [""], "paper_abstract": "Most of the biological studies have embraced statistical approaches to make inferences. It is common to have several independent experiments to test the same null hypothesis. The goal of research on pooling evidence is to combine the results of these tests to ask if there is evidence from the collection of studies to reject the null hypothesis. In this study, we evaluated four different pooling techniques (Fisher, Logit, Stouffer and Liptak) to combine the evidence from independent microarray experiments in order to identify cell cycle-regulated genes. We were able to identify a better set of cell cycle-regulated genes using the pooling techniques based on our benchmark study on budding yeast (Saccharomyces cerevisiae). Our gene ontology study on time series data of both the budding yeast and the fission yeast (Schizosaccharomyces pombe) showed that the GO terms that are related to cell cycle are significantly enriched in the cell cycle-regulated genes identified using pooling techniques.", "paper_title": "Pooling evidence to identify cell cycle-regulated genes", "paper_id": "WOS:000238389400094"}