{"auto_keywords": [{"score": 0.04606292823894879, "phrase": "information_systems"}, {"score": 0.021483638231094504, "phrase": "qualitative_research"}, {"score": 0.009024955213009807, "phrase": "constructive_knowledge"}, {"score": 0.00481495049065317, "phrase": "qualitative_information_systems_research"}, {"score": 0.004518442937844318, "phrase": "critical_research"}, {"score": 0.0044826811976193485, "phrase": "sometimes_positivism"}, {"score": 0.0037188360359702182, "phrase": "ideal-typical_fashion"}, {"score": 0.0034895911869254146, "phrase": "qualitative_researcher"}, {"score": 0.0034208822062692127, "phrase": "interpretive_stance"}, {"score": 0.002882980094838904, "phrase": "research_case"}, {"score": 0.002837451022172113, "phrase": "action_research"}, {"score": 0.0027815466400771768, "phrase": "design_research"}, {"score": 0.002468450551616404, "phrase": "fairly_large_extent"}, {"score": 0.002419798694301991, "phrase": "rather_implicit_way"}, {"score": 0.002391067964886602, "phrase": "paradigmatic_foundations"}, {"score": 0.0022345720876241044, "phrase": "explicit_research_paradigm"}, {"score": 0.0021049977753042253, "phrase": "dr._european_journal_of_information_systems"}], "paper_keywords": ["qualitative research", " interpretivism", " pragmatism", " paradigm", " information systems"], "paper_abstract": "Qualitative research is often associated with interpretivism, but alternatives do exist. Besides critical research and sometimes positivism, qualitative research in information systems can be performed following a paradigm of pragmatism. This paradigm is associated with action, intervention and constructive knowledge. This paper has picked out interpretivism and pragmatism as two possible and important research paradigms for qualitative research in information systems. It clarifies each paradigm in an ideal-typical fashion and then conducts a comparison revealing commonalities and differences. It is stated that a qualitative researcher must either adopt an interpretive stance aiming towards an understanding that is appreciated for being interesting; or a pragmatist stance aiming for constructive knowledge that is appreciated for being useful in action. The possibilities of combining pragmatism and interpretivism in qualitative research in information systems are analysed. A research case (conducted through action research (AR) and design research (DR)) that combines interpretivism and pragmatism is used as an illustration. It is stated in the paper that pragmatism has influenced IS research to a fairly large extent, albeit in a rather implicit way. The paradigmatic foundations are seldom known and explicated. This paper contributes to a further clarification of pragmatism as an explicit research paradigm for qualitative research in information systems. Pragmatism is considered an appropriate paradigm for AR and DR. European Journal of Information Systems (2012) 21, 135-146. doi:10.1057/ejis.2011.54; published online 20 December 2011", "paper_title": "Pragmatism vs interpretivism in qualitative information systems research", "paper_id": "WOS:000301619100003"}