{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unemployment_rate_prediction"}, {"score": 0.019707614141004144, "phrase": "unemployment_rate"}, {"score": 0.015187686232118502, "phrase": "proposed_framework"}, {"score": 0.007255501991666168, "phrase": "government_officials"}, {"score": 0.005771335821164022, "phrase": "domain_ontology"}, {"score": 0.004454237726525018, "phrase": "appropriate_labor_market_related_policies"}, {"score": 0.004358903464536199, "phrase": "current_economic_situation"}, {"score": 0.004049709080817396, "phrase": "main_contribution"}, {"score": 0.003894963476923956, "phrase": "novel_ontology-based_web_mining_framework"}, {"score": 0.0035410467987580484, "phrase": "unemployment_related_concepts"}, {"score": 0.003361702510958392, "phrase": "relevant_search_engine_queries"}, {"score": 0.0032896745636186824, "phrase": "state-of-the-art_feature_selection_methods"}, {"score": 0.0031502008922533894, "phrase": "support_vector_regressions"}, {"score": 0.002754208576828914, "phrase": "search_engine_queries"}, {"score": 0.0026146109167103655, "phrase": "unique_advantage"}, {"score": 0.0025036862991477437, "phrase": "prediction_performance"}, {"score": 0.0024606422183102382, "phrase": "human_comprehensible_explanations"}, {"score": 0.0023767561522363367, "phrase": "business_implication"}, {"score": 0.0023056996845692355, "phrase": "human_resources_managers"}, {"score": 0.0021604924928015283, "phrase": "labor_market_related_policies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Unemployment rate prediction", " Search engine query data", " Domain ontology", " Web mining", " Neural networks", " Support vector regressions"], "paper_abstract": "Unemployment rate is one of the most critical economic indicators. By analyzing and predicting unemployment rate, government officials can develop appropriate labor market related policies in response to the current economic situation. Accordingly, unemployment rate prediction has attracted a lot of attention from researchers in recent years. The main contribution of this paper is the illustration of a novel ontology-based Web mining framework that leverages search engine queries to improve the accuracy of unemployment rate prediction. The proposed framework is underpinned by a domain ontology which captures unemployment related concepts and their semantic relationships to facilitate the extraction of useful prediction features from relevant search engine queries. In addition, state-of-the-art feature selection methods and data mining models such as neural networks and support vector regressions are exploited to enhance the effectiveness of unemployment rate prediction. Our experimental results show that the proposed framework outperforms other baseline forecasting approaches that have been widely used for unemployment rate prediction. Our empirical findings also confirm that domain ontology and search engine queries can be exploited to improve the effectiveness of unemployment rate prediction. A unique advantage of the proposed framework is that it not only improves prediction performance but also provides human comprehensible explanations for the changes of unemployment rate. The business implication of our research work is that government officials and human resources managers can utilize the proposed framework to effectively analyze unemployment rate, and hence to better develop labor market related policies. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "An ontology-based Web mining method for unemployment rate prediction", "paper_id": "WOS:000344204800011"}