{"auto_keywords": [{"score": 0.03757753897006022, "phrase": "theta"}, {"score": 0.014408635406905484, "phrase": "qualitative_spatial_reasoning"}, {"score": 0.004567596860086148, "phrase": "randell_et_al"}, {"score": 0.004371160978838441, "phrase": "gis_communities"}, {"score": 0.00431388720289049, "phrase": "recent_observation"}, {"score": 0.004110204424518665, "phrase": "renz"}, {"score": 0.004074213821626242, "phrase": "nebel"}, {"score": 0.003968112038249246, "phrase": "computational_complexity"}, {"score": 0.0031845067058084583, "phrase": "weak_composition"}, {"score": 0.002646880721119838, "phrase": "b._nebel"}, {"score": 0.002488604965680912, "phrase": "region_connection_calculus"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["qualitative spatial reasoning", " computational complexity", " region connection calculus", " binary", " constraint network", " extensionality", " path-consistency"], "paper_abstract": "The RCC8 constraint language developed by Randell et al. has been popularly adopted by the Qualitative Spatial Reasoning and GIS communities. The recent observation that RCC8 composition table describes only weak composition instead of composition raises questions about Renz and Nebel's maximality results about the computational complexity of reasoning with RCC8. This paper shows that any consistent RCC8 binary constraint network (RCC8 network for short) can be consistently extended. Given Theta, an RCC8 network, and z, a fresh variable, suppose xTy is an element of Theta and T is contained in the weak composition of R and S. This means that we can add two new constraints xRz and zSy to Theta without changing the consistency of the network. The result guarantees the applicability to RCC8 of one key technique, (Theorem 5) of [J. Renz, B. Nebel, On the complexity of qualitative spatial reasoning: A maximal tractable fragment of the Region Connection Calculus. Artificial Intelligence 108 (1999) 69-123], which allows the transfer of tractability of a set of RCC8 relations to its closure under composition, intersection, and converse. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "RCC8 binary constraint network can be consistently extended", "paper_id": "WOS:000233852700001"}