{"auto_keywords": [{"score": 0.04716744507704791, "phrase": "cvd"}, {"score": 0.014167479013135757, "phrase": "normal_trichromats"}, {"score": 0.00810978165052791, "phrase": "color_identification"}, {"score": 0.007768969477392662, "phrase": "color_information"}, {"score": 0.00481495049065317, "phrase": "encode_color_information_for_dichromats"}, {"score": 0.00459393336391459, "phrase": "visualization_applications"}, {"score": 0.004558091785667046, "phrase": "color_vision_deficiency"}, {"score": 0.004281202319048493, "phrase": "red-green_or_blue-yellow_ambiguities"}, {"score": 0.0038363485899400285, "phrase": "large_variety"}, {"score": 0.0033314049082500794, "phrase": "first_content-independent_method"}, {"score": 0.0032667240408191015, "phrase": "colored_visualization_contents"}, {"score": 0.003020279889535487, "phrase": "underlying_original_colors"}, {"score": 0.0026431267487109543, "phrase": "multiple_categories"}, {"score": 0.0024920359789965783, "phrase": "broader_set"}, {"score": 0.0021636476333109144, "phrase": "positive_manner"}, {"score": 0.0021049977753042253, "phrase": "greater_accuracy"}], "paper_keywords": ["Color vision deficiency", " visual aids", " patterns in visualization", " color visualization"], "paper_abstract": "Color is one of the most common ways to convey information in visualization applications. Color vision deficiency (CVD) affects approximately 200 million individuals worldwide and considerably degrades their performance in understanding such contents by creating red-green or blue-yellow ambiguities. While several content-specific methods have been proposed to resolve these ambiguities, they cannot achieve this effectively in many situations for contents with a large variety of colors. More importantly, they cannot facilitate color identification. We propose a technique for using patterns to encode color information for individuals with CVD, in particular for dichromats. We present the first content-independent method to overlay patterns on colored visualization contents that not only minimizes ambiguities but also allows color identification. Further, since overlaying patterns does not compromise the underlying original colors, it does not hamper the perception of normal trichromats. We validated our method with two user studies: one including 11 subjects with CVD and 19 normal trichromats, and focused on images that use colors to represent multiple categories; and another one including 16 subjects with CVD and 22 normal trichromats, which considered a broader set of images. Our results show that overlaying patterns significantly improves the performance of dichromats in several color-based visualization tasks, making their performance almost similar to normal trichromats'. More interestingly, the patterns augment color information in a positive manner, allowing normal trichromats to perform with greater accuracy.", "paper_title": "Using Patterns to Encode Color Information for Dichromats", "paper_id": "WOS:000311124600011"}