{"auto_keywords": [{"score": 0.0408423831596249, "phrase": "decision_principles"}, {"score": 0.004786211598268987, "phrase": "day_life_decisions"}, {"score": 0.004441059405327222, "phrase": "already_adopted_choice"}, {"score": 0.0043619799095455415, "phrase": "first_general_and_abstract_argument-based_framework"}, {"score": 0.004208002469225673, "phrase": "first_step"}, {"score": 0.004035190488387378, "phrase": "classical_acceptability_semantics"}, {"score": 0.003987126862293129, "phrase": "second_step"}, {"score": 0.0038119123317396954, "phrase": "accepted_arguments"}, {"score": 0.003311067956326299, "phrase": "abstract_model"}, {"score": 0.0032326031622964477, "phrase": "mental_states"}, {"score": 0.0031559919178954644, "phrase": "decision_maker"}, {"score": 0.003118367740261359, "phrase": "proposed_framework"}, {"score": 0.0030262520433471333, "phrase": "stratified_set"}, {"score": 0.002981216610222911, "phrase": "bipolar_nature"}, {"score": 0.002910545717767559, "phrase": "explicit_distinction"}, {"score": 0.002893140560765452, "phrase": "prioritized_goals"}, {"score": 0.0025660347613972573, "phrase": "certainly_satisfied_and_rejections"}, {"score": 0.0024384399939984163, "phrase": "certainly_missed_goals"}, {"score": 0.0023171750718791713, "phrase": "optimistic_and_pessimistic_decision_criteria"}, {"score": 0.002228519136218028, "phrase": "argumentation_process"}, {"score": 0.0022019274077124795, "phrase": "different_decision_principles"}, {"score": 0.0021821915946356168, "phrase": "multiple_criteria"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Decision making", " Argumentation"], "paper_abstract": "Arguments play two different roles in day life decisions, as well as in the discussion of more crucial issues. Namely, they help to select one or several alternatives, or to explain and justify an already adopted choice. This paper proposes the first general and abstract argument-based framework for decision making. This framework follows two main steps, At the first step, arguments for beliefs and arguments for options are built and evaluated using classical acceptability semantics. At the second step, pairs of options are compared using decision principles. Decision principles are based on the accepted arguments supporting the options. Three classes of decision principles are distinguished: unipolar, bipolar or non-polar principles depending on whether i) only arguments pros or only arguments cons, or ii) both types, or iii) an aggregation of them into a meta-argument are used. The abstract model is then instantiated by expressing formally the mental states (beliefs and preferences) of a decision maker. In the proposed framework, information is given in the form of a stratified set of beliefs. The bipolar nature of preferences is emphasized by making an explicit distinction between prioritized goals to be pursued, and prioritized rejections that are stumbling blocks to be avoided. A typology that identifies four types of argument is proposed. indeed, each decision is supported by arguments emphasizing its positive consequences in terms of goals certainly satisfied and rejections certainly avoided. A decision can also be attacked by arguments emphasizing its negative consequences in terms of certainly missed goals, or rejections certainly led to by that decision. Finally, this paper articulates the optimistic and pessimistic decision criteria defined in qualitative decision making under uncertainty, in terms of an argumentation process. Similarly, different decision principles identified in multiple criteria decision making are restated in our argumentation-based framework. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Using arguments for making and explaining decisions", "paper_id": "WOS:000263763900001"}