{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cooperative_content_distribution"}, {"score": 0.004777034835192062, "phrase": "content_distribution"}, {"score": 0.00450198136261303, "phrase": "commercial_content_providers"}, {"score": 0.0042426974826585695, "phrase": "peak_demands"}, {"score": 0.004176102823067887, "phrase": "online_content_provider"}, {"score": 0.004046020290832207, "phrase": "incentive_issue"}, {"score": 0.003828012944870472, "phrase": "dandelion"}, {"score": 0.003664963414801933, "phrase": "previous_incentive-compatible_systems"}, {"score": 0.0035507457285983268, "phrase": "non-manipulable_incentives"}, {"score": 0.0029595657769783314, "phrase": "paid_content"}, {"score": 0.002867268370615848, "phrase": "client's_peers"}, {"score": 0.002788865808981643, "phrase": "appropriate_uplink_capacity"}, {"score": 0.0027126012542151015, "phrase": "reciprocal_uploads"}, {"score": 0.002546002312015341, "phrase": "robust_incentives"}, {"score": 0.0023801608396295374, "phrase": "dandelion_server"}, {"score": 0.0023427323356117365, "phrase": "commodity_hardware"}, {"score": 0.0023150468182777813, "phrase": "moderate_access_link"}, {"score": 0.0022162970216404927, "phrase": "download_completion_time"}, {"score": 0.0021301766910531137, "phrase": "additional_upload_capacity"}, {"score": 0.0021049977753042253, "phrase": "strongly_incentivized_uploaders"}], "paper_keywords": ["Content distribution", " fair-exchange", " incentives", " peer-to-peer (P2P)", " symmetric cryptography"], "paper_abstract": "Content distribution via the Internet is becoming increasingly popular. To be cost-effective, commercial content providers are now using peer-to-peer (P2P) protocols such as BitTorrent to save bandwidth costs and to handle peak demands. When an online content provider uses a P2P protocol, it faces an incentive issue: how to motivate its clients to upload to their peers. This paper presents Dandelion, a system designed to address this issue. Unlike previous incentive-compatible systems, such as BitTorrent, our system provides non-manipulable incentives for clients to upload to their peers. A client that honestly uploads to its peers is rewarded in the following two ways. First, if its peers are unable to reciprocate its uploads, the content provider rewards the client's service with credit. This credit can be redeemed for discounts on paid content or other monetary rewards. Second, if the client's peers possess content of interest and have appropriate uplink capacity, the client is rewarded with reciprocal uploads from its peers. In designing Dandelion, we trade scalability for the ability to provide robust incentives for cooperation. The evaluation of our prototype system on PlanetLab demonstrates the viability of our approach. A Dandelion server that runs on commodity hardware with a moderate access link is capable of supporting up to a few thousand clients. The download completion time for these clients is substantially reduced due to the additional upload capacity offered by strongly incentivized uploaders.", "paper_title": "Robust and Efficient Incentives for Cooperative Content Distribution", "paper_id": "WOS:000272844300006"}