{"auto_keywords": [{"score": 0.042825414352000296, "phrase": "limited_vision"}, {"score": 0.012258305040635404, "phrase": "exploration_algorithm"}, {"score": 0.00481495049065317, "phrase": "mobile_robot"}, {"score": 0.004664789535862072, "phrase": "unknown_flat_terrain"}, {"score": 0.004642105253191792, "phrase": "impassable_obstacles"}, {"score": 0.004541377162789232, "phrase": "arbitrary_polygons"}, {"score": 0.003584650242992921, "phrase": "unlimited_vision"}, {"score": 0.003455816485737094, "phrase": "total_perimeter"}, {"score": 0.003315374849824563, "phrase": "convex_hull"}, {"score": 0.002934434236130622, "phrase": "exploration_algorithms"}, {"score": 0.0027338249729203746, "phrase": "arbitrary_terrains"}, {"score": 0.0026354893341425617, "phrase": "c-fat_terrains"}, {"score": 0.0025406818152943853, "phrase": "additional_knowledge"}, {"score": 0.002503718318120927, "phrase": "terrain_t"}, {"score": 0.0023843376332011936, "phrase": "smallest_disc"}, {"score": 0.002326794132784762, "phrase": "largest_disc"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Mobile robot", " Exploration", " Polygon", " Obstacle"], "paper_abstract": "A mobile robot represented by a point moving in the plane has to explore an unknown flat terrain with impassable obstacles. Both the terrain and the obstacles are modeled as arbitrary polygons. We consider two scenarios: the unlimited vision, when the robot situated at a point p of the terrain explores (sees) all points q of the terrain for which the segment pq belongs to the terrain, and the limited vision, when we require additionally that the distance between p and q is at most 1. All points of the terrain (except obstacles) have to be explored and the performance of an exploration algorithm, called its complexity, is measured by the length of the trajectory of the robot. For unlimited vision we show an exploration algorithm with complexity O(P + D root k), where P is the total perimeter of the terrain (including perimeters of obstacles), D is the diameter of the convex hull of the terrain, and k is the number of obstacles. We do not assume knowledge of these parameters. We also prove a matching lower bound showing that the above complexity is optimal, even if the terrain is known to the robot. For limited vision we show exploration algorithms with complexity O(P + A + root Ak), where A is the area of the terrain (excluding obstacles). Our algorithms work either for arbitrary terrains (if one of the parameters A or k is known) or for c-fat terrains, where c is any constant (unknown to the robot) and no additional knowledge is assumed. (A terrain T with obstacles is c-fat if R/r <= c, where R is the radius of the smallest disc containing T and r is the radius of the largest disc contained in T.) We also prove a matching lower bound Omega(P + A + root Ak) on the complexity of exploration for limited vision, even if the terrain is known to the robot. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Worst-case optimal exploration of terrains with obstacles", "paper_id": "WOS:000317371800002"}