{"auto_keywords": [{"score": 0.04622434726748134, "phrase": "total_power_consumption"}, {"score": 0.015547084727554788, "phrase": "multihop_wireless_networks"}, {"score": 0.00481495049065317, "phrase": "distributed_energy_minimization"}, {"score": 0.004354572391793908, "phrase": "multihop_wireless_network"}, {"score": 0.003829548069657859, "phrase": "power_control"}, {"score": 0.0037869901077566526, "phrase": "link_scheduling"}, {"score": 0.0036214184763804034, "phrase": "known_optimal_cross-layer_solution"}, {"score": 0.0034630606658026595, "phrase": "high_computational_complexity"}, {"score": 0.0030113280682863234, "phrase": "node-exclusive_interference_model"}, {"score": 0.002895721231882758, "phrase": "power-rate_function"}, {"score": 0.0025461386232786356, "phrase": "power_consumption"}, {"score": 0.0022893422054387235, "phrase": "first_such_distributed_solution"}, {"score": 0.0021049977753042253, "phrase": "suboptimal_centralized_algorithm"}], "paper_keywords": ["Cross-layer optimization", " duality", " energy-aware routing", " mathematical programming/optimization"], "paper_abstract": "In this work, we study the problem of minimizing the total power consumption in a multihop wireless network subject to a given offered load. It is well-known that the total power consumption of multihop wireless networks can be substantially reduced by jointly optimizing power control, link scheduling, and routing. However, the known optimal cross-layer solution to this problem is centralized and with high computational complexity. In this paper, we develop a low-complexity and distributed algorithm that is provably power-efficient. In particular, under the node-exclusive interference model and with suitable assumptions on the power-rate function, we can show that the total power consumption of our algorithm is at most (2 + epsilon) times as large as the power consumption of the optimal (but centralized and complex) algorithm, where epsilon is an arbitrarily small positive constant. Our algorithm is not only the first such distributed solution with provable performance bound, but its power-efficiency ratio is also tighter than that of another suboptimal centralized algorithm in the literature.", "paper_title": "Low-Complexity and Distributed Energy Minimization in Multihop Wireless Networks", "paper_id": "WOS:000276685300013"}