{"auto_keywords": [{"score": 0.04880833597060665, "phrase": "fahp"}, {"score": 0.011814118279917515, "phrase": "lcd_level"}, {"score": 0.009948630880825876, "phrase": "topsis"}, {"score": 0.004633429997452688, "phrase": "topsis_method"}, {"score": 0.004580314008293946, "phrase": "low_carbon_economy"}, {"score": 0.0045452472665882685, "phrase": "lce"}, {"score": 0.004407599980762272, "phrase": "development_mode"}, {"score": 0.003650622777534568, "phrase": "indicators'_system"}, {"score": 0.0035263833746562788, "phrase": "five_main_indicators"}, {"score": 0.003328611206488653, "phrase": "numerical_case"}, {"score": 0.0032777653153451265, "phrase": "empirical_research_process"}, {"score": 0.003105824909705158, "phrase": "order_performance"}, {"score": 0.003058371727071558, "phrase": "ideal_solution_method"}, {"score": 0.002909084545999271, "phrase": "main_and_sub-indicators'_weights"}, {"score": 0.0027247727563746694, "phrase": "whole_calculation_process"}, {"score": 0.0022388390432214415, "phrase": "reasonable_policy_suggestions"}, {"score": 0.0021792693001152896, "phrase": "future_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Low carbon development level", " FAHP", " TOPSIS"], "paper_abstract": "The low carbon economy (LCE) is considered as a kind of development mode (low carbon development, LCD) in this paper. So several problems appear, e.g., what kind of development is LCD? And, how to evaluate the level of LCD? The aim of this study is just to answer these questions. Firstly, the indicators' system of the LCD level was constructed, which contains five main indicators and 10 sub-indicators. Then, 47 representative countries (areas) worldwide were taken as the numerical case. In the empirical research process, a two step methodology of combining the Fuzzy Analytic Hierarchy Process (FAHP) with the Technique for Order Performance by Similarity to Ideal Solution method (TOPSIS) is proposed. FAHP was used to determinate the main and sub-indicators' weights of the 47 countries' (areas') LCD level, then the TOPSIS method used these weights as its own input weights to complete the whole calculation process. The results indicate that the method proposed can be successfully used in the study and the concept of the LCD level be considered as a very useful tool because the conclusions related to it have some certain directive significances when we have to take decisions on some items. In the end, some reasonable policy suggestions are proposed and some directions for future studies are put forward. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The low carbon development (LCD) levels' evaluation of the world's 47 countries (areas) by combining the FAHP with the TOPSIS method", "paper_id": "WOS:000301025300035"}