{"auto_keywords": [{"score": 0.04926219622874721, "phrase": "ring_signature"}, {"score": 0.021200224738701635, "phrase": "real_signer"}, {"score": 0.008972754699922376, "phrase": "ordinary_signature"}, {"score": 0.004916883828201915, "phrase": "possible_signers"}, {"score": 0.00481495049065317, "phrase": "gradual_revelation"}, {"score": 0.004283019592801715, "phrase": "convertible_ring_signature"}, {"score": 0.003731673223879279, "phrase": "new_convertible_ring_signature"}, {"score": 0.00369329349984294, "phrase": "additional_property"}, {"score": 0.0025892330566358503, "phrase": "possible_signer"}, {"score": 0.002544954159844482, "phrase": "shamir"}, {"score": 0.0025187465644347725, "phrase": "tauman"}, {"score": 0.0023670716500937667, "phrase": "computational_anonymity"}, {"score": 0.00227890329511847, "phrase": "unconditional_anonymity"}, {"score": 0.0021864526544323184, "phrase": "random_oracle_model"}, {"score": 0.0021564750534280863, "phrase": "formal_definition"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["convertible ring signature", " hash function", " privacy protection", " random oracle model", " reveal non-signers", " ring signature"], "paper_abstract": "A ring signature enables a member of a group to sign any message on behalf of the group while hiding the identity of the real signer. On the other hand, a convertible ring signature is a kind of ring signature in which the real signer can convert it into an ordinary signature. In this way, the real signer can prove the ownership of a ring signature if necessary. In this paper, we introduce a new convertible ring signature with an additional property. That is, before converting a ring signature into an ordinary signature, we allow the real signer to reveal the identity of non-signers gradually. In other words, if there are n possible signers in a ring, then, by revealing one non-signer, it will become a ring signature with n-1 possible signers. By revealing n-1 non-signers, then, the ring signature comes to an ordinary signature, and anyone can verify who is the real signer. This property is useful when some non-signers of a ring signature are not trusted by a verifier (i.e., the signature will not be accepted if someone is a possible signer). Rivest, Shamir, and Tauman first mentioned this problem and gave a solution as their modified ring signature scheme. However, their modified scheme can only guarantee computational anonymity. Our new scheme provides the same property on one hand and still guarantees unconditional anonymity on the other hand. The security is rigorously proved in the random oracle model according to the formal definition. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Convertible ring signatures with gradual revelation of non-signers", "paper_id": "WOS:000300710800007"}