{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "plain_so-tgds"}, {"score": 0.010414813371086731, "phrase": "right_language"}, {"score": 0.004649302313891199, "phrase": "schema_mappings"}, {"score": 0.004563288673057544, "phrase": "tuple-generating_dependencies"}, {"score": 0.004385733482617193, "phrase": "fundamental_importance"}, {"score": 0.004334832612029898, "phrase": "bernstein's_metadata_management_framework"}, {"score": 0.004264558080356621, "phrase": "composition_operator"}, {"score": 0.004234788773502459, "phrase": "natural_semantics"}, {"score": 0.004156411748278609, "phrase": "second-order_tuple"}, {"score": 0.003939033374807842, "phrase": "inverse_operator"}, {"score": 0.0037566259941207896, "phrase": "maximum_recoveries"}, {"score": 0.0030461580449080553, "phrase": "conjunctive_queries"}, {"score": 0.0026105159490849364, "phrase": "plain_so-tgd"}, {"score": 0.0025922628410838208, "phrase": "maximum_recovery"}, {"score": 0.002544207840990836, "phrase": "good_behavior"}, {"score": 0.00246800641971897, "phrase": "plain_so-tgds_shares"}, {"score": 0.002349692021391602, "phrase": "polynomial-time_algorithm"}, {"score": 0.002170015433265059, "phrase": "good_alternative"}, {"score": 0.0021447748132703078, "phrase": "data_exchange"}, {"score": 0.0021347607855562102, "phrase": "data_integration_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Schema mappings", " Inverse", " Composition", " Plain SO-tgds", " Data exchange"], "paper_abstract": "The problems of composing and inverting schema mappings specified by source-to-target tuple-generating dependencies (st-tgds) have attracted a lot of attention, as they are of fundamental importance for the development of Bernstein's metadata management framework. In the case of the composition operator, a natural semantics has been proposed and the language of second-order tuple generating dependencies (SO-tgds) has been identified as the right language to express it. In the case of the inverse operator, several semantics have been proposed, most notably the maximum recovery, the only inverse notion that guarantees that every mapping specified by st-tgds is invertible. Unfortunately, less attention has been paid to combining both operators, which is the motivation of this paper. More precisely, we start our investigation by showing that SO-tgds are not good for inversion, as there exist mappings specified by SO-tgds that are not invertible under any of the notions of inversion proposed in the literature. To overcome this limitation, we borrow the notion of CQ-composition, which is a relaxation obtained by parameterizing the composition of mappings by the class of conjunctive queries (CQ), and we propose a restriction over the class of SO-tgds that gives rise to the language of plain SO-tgds. Then we show that plain SO-tgds are the right language to express the CQ-composition of mappings given by st-tgds, in the same sense that SO-tgds are the right language to express the composition of st-tgds, and we prove that every mapping specified by a plain SO-tgd admits a maximum recovery, thus showing that plain SO-tgds have a good behavior w.r.t. inversion. Moreover, we show that the language of plain SO-tgds shares some fundamental structural properties with the language of st-tgds, but being much more expressive, and we provide a polynomial-time algorithm to compute maximum recoveries for mappings specified by plain SO-tgds (which can also be used to compute maximum recoveries for mappings given by st-tgds). All these results suggest that the language of plain SO-tgds is a good alternative to be implemented in data exchange and data integration applications. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "The language of plain SO-tgds: Composition, inversion and structural properties", "paper_id": "WOS:000319368900003"}