{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_interface"}, {"score": 0.048636009815037955, "phrase": "elderly_and_disabled_people"}, {"score": 0.004717723626157272, "phrase": "independent_living"}, {"score": 0.004529093447865156, "phrase": "usability_evaluation"}, {"score": 0.004303830426772906, "phrase": "kitchen_appliances"}, {"score": 0.004068907083697369, "phrase": "evaluation_exercises"}, {"score": 0.003966388754366831, "phrase": "project's_development"}, {"score": 0.003906116922372891, "phrase": "user-participative_workshops"}, {"score": 0.003711723285313348, "phrase": "summative_usability_evaluation_exercise"}, {"score": 0.0036181717017041387, "phrase": "laboratory-based_study"}, {"score": 0.003563172322934695, "phrase": "simulated_home_environment"}, {"score": 0.0033173234105492895, "phrase": "potentially_vulnerable_participants"}, {"score": 0.0028459677232555176, "phrase": "post-session_questionnaire"}, {"score": 0.0026091594819333654, "phrase": "usability_testing"}, {"score": 0.0023079225317714815, "phrase": "laboratory-based_studies"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": ["Laboratory-based study", " Vulnerable users", " Assisted living", " Ethical issues"], "paper_abstract": "This paper reports the usability evaluation of interfaces developed to enable elderly and disabled people interact remotely with kitchen appliances in the home to enhance their independent living. A number of evaluation exercises were undertaken throughout the project's development, including user-participative workshops and focus groups. This paper focuses on the summative usability evaluation exercise, which comprised a laboratory-based study in a simulated home environment, with a view to determining the appropriateness of employing this approach with potentially vulnerable participants. The study involved 27 participants interacting with the user interface. Their behaviour was observed and recorded, and their interaction with the system was analysed. They were also given a post-session questionnaire, where their opinions of the usability of the interface were solicited. The results of the usability testing were positive, and insight has been gained into how products of this nature can be further improved. The experience of conducting laboratory-based studies with vulnerable users was positive and led to propose in this paper a set of guidelines for future work in evaluating usability for work in this domain.", "paper_title": "The Easyline+ project: evaluation of a user interface developed to enhance independent living of elderly and disabled people", "paper_id": "WOS:000304613500001"}