{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "argument_interchange_format"}, {"score": 0.004250302819248558, "phrase": "significant_progress"}, {"score": 0.004098397888277889, "phrase": "theoretical_properties"}, {"score": 0.004055998173160551, "phrase": "different_argumentation_logics"}, {"score": 0.003870541730075597, "phrase": "practical_deployment"}, {"score": 0.0038304902197108643, "phrase": "argumentation_systems"}, {"score": 0.0036743708250589484, "phrase": "'interchange_format"}, {"score": 0.0034162643819889054, "phrase": "draft_specification"}, {"score": 0.0031270239691197515, "phrase": "agent-based_applications"}, {"score": 0.002847339938387273, "phrase": "artificial_intelligence"}, {"score": 0.0028178463431115562, "phrase": "multi-agent_systems"}, {"score": 0.0026471739851621143, "phrase": "starting_point"}, {"score": 0.0022524959504997303, "phrase": "use_case_scenario"}, {"score": 0.0021049977753042253, "phrase": "abstract_model"}], "paper_keywords": [""], "paper_abstract": "The theory of argumentation is a rich, interdisciplinary area of research straddling the fields of artificial intelligence, philosophy, communication studies, linguistics and psychology. In the last few years, significant progress has been made in understanding the theoretical properties of different argumentation logics. However, one major barrier to the development and practical deployment of argumentation systems is the lack of a shared, agreed notation or 'interchange format' for argumentation and arguments. In this paper, we describe a draft specification for an argument interchange format (AIF) intended for representation and exchange of data between various argumentation tools and agent-based applications. It represents a consensus 'abstract model' established by researchers across fields of argumentation, artificial intelligence and multi-agent systems'. In its current form, this specification is intended as a starting point for further discussion and elaboration by the community, rather than an attempt at a definitive, all-encompassing model. However, to demonstrate proof of concept, a use case scenario is briefly described. Moreover, three concrete realizations or 'reifications' of the abstract model are illustrated.", "paper_title": "Towards an argument interchange format", "paper_id": "WOS:000243097900001"}