{"auto_keywords": [{"score": 0.04609200376025507, "phrase": "electronic_outlining"}, {"score": 0.00481495049065317, "phrase": "writing_strategy"}, {"score": 0.004727837281331949, "phrase": "students'_writing_products"}, {"score": 0.004374772264092067, "phrase": "students'_writing_performance"}, {"score": 0.004085115444878828, "phrase": "students'_final_writing_products"}, {"score": 0.00393852508392789, "phrase": "writing_process"}, {"score": 0.0029128614098881253, "phrase": "argumentative_structure"}, {"score": 0.0027322025124213566, "phrase": "text_structure"}, {"score": 0.002610043728801011, "phrase": "students'_argumentation"}, {"score": 0.0025862736445290088, "phrase": "process_data"}, {"score": 0.0024147474002390763, "phrase": "students'_overall_planning"}, {"score": 0.0022649119108225564, "phrase": "students'_perceived_mental_effort"}, {"score": 0.0022238315004700607, "phrase": "repeated_use"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Secondary education", " Writing strategies", " Writing process", " Electronic outlining", " Mental effort"], "paper_abstract": "This study addresses to what extent and how electronic outlining enhances students' writing performance. To this end, the focus of this study is not only on students' final writing products but also on the organisation of the writing process (i.e., planning, translating, and reviewing) and perceived mental effort during writing. In addition, effects of repeated electronic outlining were examined. A combined within and between subjects design was implemented in which 93 10th-grade students wrote two argumentative texts with or without using electronic outlining. Analyses showed that using electronic outlining for planning and writing significantly improved the presentation of the argumentative structure. However, effects were less clear for correctly and completely establishing a text structure and no effects were found on the elaboration of students' argumentation. Process data showed that electronic outlining increased total process time, but no effect was found on students' overall planning and revision activities. Finally, self-reports showed no effect of electronic outlining on students' perceived mental effort. Nevertheless, repeated use of the same writing strategy enhanced writing fluency. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Electronic outlining as a writing strategy: Effects on students' writing products, mental effort and writing process", "paper_id": "WOS:000341675100032"}