{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "potential_deviations"}, {"score": 0.004543046350523362, "phrase": "multi-agent_systems"}, {"score": 0.0042864307215634756, "phrase": "game-theoretic_terms"}, {"score": 0.004233347974930148, "phrase": "strong_equilibrium"}, {"score": 0.0034678302347682694, "phrase": "reliable_entity"}, {"score": 0.0031647054743284947, "phrase": "pre-specified_way"}, {"score": 0.0027818804382539444, "phrase": "mediator's_help"}, {"score": 0.0027133032795773697, "phrase": "new_game"}, {"score": 0.002581165831422692, "phrase": "general_results"}, {"score": 0.0024656866249273125, "phrase": "strong_mediated_equilibrium"}, {"score": 0.0023948981440134478, "phrase": "mediated_game"}, {"score": 0.002345579707333727, "phrase": "desired_behaviors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-agent systems", " Game theory", " Mediator", " Mediated equilibrium", " Strong equilibrium"], "paper_abstract": "Stability against potential deviations by sets of agents is a most desired property in the design and analysis of multi-agent systems. However, unfortunately, this property is typically not satisfied. In game-theoretic terms, a strong equilibrium, which is a strategy profile immune to deviations by coalition, rarely exists. This paper suggests the use of mediators in order to enrich the set of situations where we can obtain stability against deviations by coalitions. A mediator is defined to be a reliable entity, which can ask the agents for the right to play on their behalf, and is guaranteed to behave in a pre-specified way based on messages received from the agents. However, a mediator cannot enforce behavior; that is, agents can play in the game directly, without the mediator's help. A mediator generates a new game for the players, the mediated game. We prove some general results about mediators, and mainly concentrate on the notion of strong mediated equilibrium, which is just a strong equilibrium at the mediated game. We show that desired behaviors, which are stable against deviations by coalitions, can be obtained using mediators in several classes of settings. (C) 2008 Published by Elsevier B.V.", "paper_title": "Strong mediated equilibrium", "paper_id": "WOS:000261931400007"}