{"auto_keywords": [{"score": 0.04540493651240884, "phrase": "related_list"}, {"score": 0.0428614620458835, "phrase": "related_lists"}, {"score": 0.010282334609845347, "phrase": "youtube_caches"}, {"score": 0.008809419025467672, "phrase": "cached_content"}, {"score": 0.005732306334524549, "phrase": "hit_rate"}, {"score": 0.00481495049065317, "phrase": "cache-centric_video_recommendation"}, {"score": 0.004486640769041646, "phrase": "user_behavior"}, {"score": 0.00430047664982262, "phrase": "youtube"}, {"score": 0.004136548839735555, "phrase": "local_caches"}, {"score": 0.004049783994776266, "phrase": "youtube_videos"}, {"score": 0.0039648318122148555, "phrase": "noncached_content"}, {"score": 0.003241312187060814, "phrase": "selection_criterion"}, {"score": 0.0031176485976102688, "phrase": "user_study"}, {"score": 0.0030414140732789186, "phrase": "random_related_lists"}, {"score": 0.002784007794229784, "phrase": "university_campus"}, {"score": 0.0027255350933549703, "phrase": "proposed_reordering_approach"}, {"score": 0.0024251568696803177, "phrase": "server_load"}, {"score": 0.002408052242408488, "phrase": "backend_bandwidth_usage"}, {"score": 0.002219790619936024, "phrase": "overall_performance"}, {"score": 0.0022041312401435346, "phrase": "youtube's_content_distribution_system"}, {"score": 0.0021654633404434623, "phrase": "youtube's_recommendation_system"}, {"score": 0.0021049977753042253, "phrase": "small_pool"}], "paper_keywords": ["Measurement", " Performance", " Caching", " YouTube", " recommendation"], "paper_abstract": "In this article, we take advantage of the user behavior of requesting videos from the top of the related list provided by YouTube to improve the performance of YouTube caches. We recommend that local caches reorder the related lists associated with YouTube videos, presenting the cached content above noncached content. We argue that the likelihood that viewers select content from the top of the related list is higher than selection from the bottom, and pushing contents already in the cache to the top of the related list would increase the likelihood of choosing cached content. To verify that the position on the list really is the selection criterion more dominant than the content itself, we conduct a user study with 40 YouTube-using volunteers who were presented with random related lists in their everyday YouTube use. After confirming our assumption, we analyze the benefits of our approach by an investigation that is based on two traces collected from a university campus. Our analysis shows that the proposed reordering approach for related lists would lead to a 2 to 5 times increase in cache hit rate compared to an approach without reordering the related list. This increase in hit rate would lead to reduction in server load and backend bandwidth usage, which in turn reduces the latency in streaming the video requested by the viewer and has the potential to improve the overall performance of YouTube's content distribution system. An analysis of YouTube's recommendation system reveals that related lists are created from a small pool of videos, which increases the potential for caching content from related lists and reordering based on the content in the cache.", "paper_title": "Cache-Centric Video Recommendation: An Approach to Improve the Efficiency of YouTube Caches", "paper_id": "WOS:000355933700001"}