{"auto_keywords": [{"score": 0.04445718982496923, "phrase": "concise_regular_expressions"}, {"score": 0.00481495049065317, "phrase": "inference_of_concise_regular_expressions"}, {"score": 0.004585332915477379, "phrase": "concise_document_type_definition"}, {"score": 0.004544799279208163, "phrase": "dtd"}, {"score": 0.00421410521089045, "phrase": "positive_examples_strings"}, {"score": 0.003770869401884267, "phrase": "far_majority"}, {"score": 0.003687960013746783, "phrase": "practical_dtds"}, {"score": 0.003389136094439662, "phrase": "example_strings"}, {"score": 0.002965684305115369, "phrase": "novel_automaton"}, {"score": 0.0029394074636168435, "phrase": "regular_expression_rewrite_technique"}, {"score": 0.0028875481626754696, "phrase": "independent_interest"}, {"score": 0.002641621667026613, "phrase": "web_service_requests"}, {"score": 0.002515384834484012, "phrase": "regular_expressions"}, {"score": 0.002395166073437286, "phrase": "novel_learning_algorithm_crx"}, {"score": 0.002220551141101661, "phrase": "automaton_representation"}, {"score": 0.0021716546480286722, "phrase": "crx"}], "paper_keywords": ["Algorithms", " Languages", " Theory", " Regular expressions", " schema inference", " XML"], "paper_abstract": "We consider the problem of inferring a concise Document Type Definition (DTD) for a given set of XML-documents, a problem that basically reduces to learning concise regular expressions from positive examples strings. We identify two classes of concise regular expressions-the single occurrence regular expressions (SOREs) and the chain regular expressions (CHAREs)-that capture the far majority of expressions used in practical DTDs. For the inference of SOREs we present several algorithms that first infer an automaton for a given set of example strings and then translate that automaton to a corresponding SORE, possibly repairing the automaton when no equivalent SORE can be found. In the process, we introduce a novel automaton to regular expression rewrite technique which is of independent interest. When only a very small amount of XML data is available, however ( for instance when the data is generated by Web service requests or by answers to queries), these algorithms produce regular expressions that are too specific. Therefore, we introduce a novel learning algorithm CRX that directly infers CHAREs ( which form a subclass of SOREs) without going through an automaton representation. We show that CRX performs very well within its target class on very small datasets.", "paper_title": "Inference of Concise Regular Expressions and DTDs", "paper_id": "WOS:000277925600004"}