{"auto_keywords": [{"score": 0.03920077607219174, "phrase": "np"}, {"score": 0.007407770579308243, "phrase": "cycle_factor"}, {"score": 0.004788327412856401, "phrase": "integer_capacities"}, {"score": 0.004696295109780416, "phrase": "prescribed_balance_vectors"}, {"score": 0.004381749459671914, "phrase": "well-studied_problems"}, {"score": 0.004031865694174726, "phrase": "prescribed_degree_sequences"}, {"score": 0.003329170045231001, "phrase": "positive_side"}, {"score": 0.0029957820617023444, "phrase": "pen"}, {"score": 0.002818190970208061, "phrase": "k-linkage_problem"}, {"score": 0.0022944208287589375, "phrase": "spanning_connected_eulerian_subdigraph"}, {"score": 0.0022191579011386553, "phrase": "even_length"}, {"score": 0.002140400526572388, "phrase": "odd_length"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Arc-disjoint flows", " Linkages", " Spanning connected Eulerian digraph", " Even cycle factor", " Odd cycle factor", " Acyclic digraph"], "paper_abstract": "We consider the problem of deciding whether a given network with integer capacities has two feasible flows x and y with prescribed balance vectors such that the arcs that carry flow in x are arc-disjoint from the arcs that carry flow in y. This generalizes a number of well-studied problems such as the existence of arc-disjoint out-branchings B-s(+), B-t(+) where the roots s, t may be the same vertex, existence of arc-disjoint spanning subdigraphs D-1, D-2 with prescribed degree sequences in a digraph (e.g. arc-disjoint cycle factors), the weak-2-linkage problem, the number partitioning problem, etc. Hence the problem is NP-complete in general. We show that the problem remains hard even for very restricted cases such as two arc-disjoint (s, t)-flows each of value 2 in a network with capacities 1 and 2 on the arcs. On the positive side, we prove that the above problem is polynomially solvable if the network is acyclic and the arc capacities as well as the desired flow values are bounded. Our algorithm for this case generalizes the algorithm (by Pen and Shiloach [14] for k = 2 and Fortune, Hoperoft and Wyllie [11] for k >= 3) for the k-linkage problem in acyclic digraphs. Besides, the problem is polynomial in general digraphs if all capacities are 1 and the two flows have the same balance for all vertices in N, but remains NP-complete if the network contains at least one arc with capacity 2 (and the others have capacity 1). Finally, we also show that the following properties are NP-complete to decide on digraphs: the existence of a spanning connected Eulerian subdigraph, the existence of a cycle factor in which all cycles have even length and finally the existence of a cycle factor in which all cycles have odd length. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "(Arc-)disjoint flows in networks", "paper_id": "WOS:000334006400003"}