{"auto_keywords": [{"score": 0.04058473010662897, "phrase": "pcs_system"}, {"score": 0.005090432082967364, "phrase": "affine_model"}, {"score": 0.004907944699879777, "phrase": "fundamental_matrix"}, {"score": 0.00481495049065317, "phrase": "planar_catadioptric_stereo_systems"}, {"score": 0.004621148492564008, "phrase": "catadioptric_stereo_systems"}, {"score": 0.004558289038745564, "phrase": "stereo_images"}, {"score": 0.004496280772084575, "phrase": "single_camera"}, {"score": 0.00429558848734449, "phrase": "traditional_two-camera_stereo"}, {"score": 0.004085115444878828, "phrase": "stereoscopic_video"}, {"score": 0.003221111762383486, "phrase": "affine_epipolar_geometry"}, {"score": 0.003177235604998673, "phrase": "affine_property"}, {"score": 0.002953097497434808, "phrase": "narrow_field"}, {"score": 0.0028995879416666838, "phrase": "fov"}, {"score": 0.0026461080202599694, "phrase": "conventional_stereo_system"}, {"score": 0.002551022760887132, "phrase": "experimental_results"}, {"score": 0.002193509835371438, "phrase": "significant_advantages"}, {"score": 0.0021340985236583017, "phrase": "affine_fundamental_matrix_model"}, {"score": 0.0021049977753042253, "phrase": "pcs_systems"}], "paper_keywords": [""], "paper_abstract": "Planar mirror has been used successfully in catadioptric stereo systems to capture stereo images with a single camera. These planar catadioptric stereo (PCS) systems not only provide radiometric advantages over traditional two-camera stereo, but also reduce the complexity and cost of acquiring stereoscopic video. Although many papers have been published on the design of the PCS system, few studies have been conducted for the analysis of its epipolar geometry, that is, the fundamental matrix. In this study, the authors investigated features of two types of PCS system and verified that they both can be approximated by affine epipolar geometry. This affine property is either because of constraints on the structure of the PCS system or because of the narrow field of view (FOV) of the mirror. This affine model reduces the number of parameters in the fundamental matrix from seven in the conventional stereo system to only four in the PCS system. Experimental results based on various criteria verify that by using the affine model with fewer parameters, estimation of the fundamental matrix for a PCS system can be more robust, precise and much easier to implement. These significant advantages confirm the usefulness of an affine fundamental matrix model for the PCS systems.", "paper_title": "Fundamental matrix of planar catadioptric stereo systems", "paper_id": "WOS:000279105200002"}