{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "decision-making_method_trustworthy"}, {"score": 0.004682414867878963, "phrase": "multi-criteria_decision-making_methods"}, {"score": 0.004528156929805637, "phrase": "complicated_decision_problems"}, {"score": 0.004477870190590885, "phrase": "intangible_and_conflicting_criteria"}, {"score": 0.0039380388343479384, "phrase": "best_alternative"}, {"score": 0.003501991125315889, "phrase": "decision_problem"}, {"score": 0.003405472159599445, "phrase": "decision_makers"}, {"score": 0.0031845067058084583, "phrase": "comparative_analysis"}, {"score": 0.002618366076489732, "phrase": "first_important_issue"}, {"score": 0.0021049977753042253, "phrase": "mcdm_methods"}], "paper_keywords": ["Multi-criteria decision-making methods", " conflicting criteria", " decision problems", " evaluation"], "paper_abstract": "Decision makers often face complicated decision problems with intangible and conflicting criteria. Numerous multi-criteria decision-making (MCDM) methods have been proposed to handle the measurement of the priorities of conflicting tangible/intangible criteria and in turn use them to choose the best alternative for a decision. However, the presence of many MCDM methods bewilders users. The existence of these methods becomes a decision problem in itself, and decision makers may be uncertain about which one to use. Thus the comparative analysis and evaluation of various MCDM methods has come under scrutiny by both researchers and practitioners in order to discover if there are logical, mathematical, social or practical reasons why one method is better than another. Criteria for their evaluation are the first important issue that needs to be resolved. In this paper, 16 criteria are introduced that may be used to judge and evaluate various MCDM methods. The criteria proposed and some guidelines for their evaluation are given to help readers evaluate these MCDM methods.", "paper_title": "When is a Decision-Making Method Trustworthy? Criteria for Evaluating Multi-Criteria Decision-Making Methods", "paper_id": "WOS:000383676200002"}