{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "health_research"}, {"score": 0.004581373625744533, "phrase": "large-scale_information_systems"}, {"score": 0.004529093447865156, "phrase": "long-term_use"}, {"score": 0.004211504818267892, "phrase": "effective_sharing"}, {"score": 0.003991774582021095, "phrase": "knowledge-based_work"}, {"score": 0.003585986761045987, "phrase": "often-problematic_experience"}, {"score": 0.003334309053314909, "phrase": "theoretical_and_methodological_weakness"}, {"score": 0.0032460913210906783, "phrase": "work_organisation"}, {"score": 0.0031723302551782324, "phrase": "relatively_short-term"}, {"score": 0.003088384809415812, "phrase": "technology_implementation"}, {"score": 0.002938317647182056, "phrase": "infrastructural_technologies"}, {"score": 0.00283870598459543, "phrase": "recent_developments"}, {"score": 0.0026698611202305715, "phrase": "strategic_ethnography"}, {"score": 0.002444544487772349, "phrase": "empirical_research"}, {"score": 0.002416589459425828, "phrase": "long-term_evolution"}, {"score": 0.0023981301755351607, "phrase": "corporate_e-infrastructures"}, {"score": 0.002361632539339945, "phrase": "current_enterprise_resource_planning_systems"}, {"score": 0.002316788811533867, "phrase": "new_conceptual_tools"}, {"score": 0.002290291401956985, "phrase": "recent_research"}, {"score": 0.0021539955106204354, "phrase": "current_and_ongoing_difficulties"}, {"score": 0.0021049977753042253, "phrase": "large-scale_health_infrastructures"}], "paper_keywords": ["e-infrastructures", " Biography of artefacts (BoA) approach", " Strategic ethnography", " Enterprise resource planning (ERP) systems", " Health infrastructures"], "paper_abstract": "In health research and services, and in many other domains, we note the emergence of large-scale information systems intended for long-term use with multiple users and uses. These e-infrastructures are becoming more widespread and pervasive and, by enabling effective sharing of information and coordination of activities between diverse, dispersed groups, are expected to transform knowledge-based work. Social scientists have sought to analyse the significance of these systems and the processes by which they are created. Much current attention has been drawn to the often-problematic experience of those attempting to establish them. By contrast, this paper is inspired by concerns about the theoretical and methodological weakness of many studies of technology and work organisation-particularly the dominance of relatively short-term, often single site studies of technology implementation. These weaknesses are particularly acute in relation to the analysis of infrastructural technologies. We explore the relevance to such analysis of recent developments in what we call the Biography of Artefacts (BoA) perspective-which emphasises the value of strategic ethnography: theoretically-informed, multi-site and longitudinal studies: We seek to draw insights here from a programme of empirical research into the long-term evolution of corporate e-infrastructures (reflected in current Enterprise Resource Planning systems) and review some new conceptual tools arising from recent research into e-Infrastructures (e-Is). These are particularly relevant to understanding the current and ongoing difficulties encountered in attempts to develop large-scale Health Infrastructures.", "paper_title": "e-Infrastructures: How Do We Know and Understand Them? Strategic Ethnography and the Biography of Artefacts", "paper_id": "WOS:000285102700002"}