{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_social_networks"}, {"score": 0.010872852845511469, "phrase": "information_sharing_norms"}, {"score": 0.007899099393477695, "phrase": "inappropriate_information"}, {"score": 0.007750379287216117, "phrase": "sensitive_information"}, {"score": 0.0075803806881327655, "phrase": "contextual_integrity"}, {"score": 0.0056260442032185585, "phrase": "implicit_contextual_integrity"}, {"score": 0.005555046103161573, "phrase": "information_model"}, {"score": 0.004504104287114781, "phrase": "different_contexts"}, {"score": 0.004146791234307539, "phrase": "privacy_theory"}, {"score": 0.004068427912211707, "phrase": "information_sharing"}, {"score": 0.003891268447737902, "phrase": "computational_models"}, {"score": 0.003805591825381666, "phrase": "well-defined_contexts"}, {"score": 0.0037336520904376687, "phrase": "pre-defined_roles"}, {"score": 0.003639835714755229, "phrase": "explicit_set"}, {"score": 0.0033937776228549557, "phrase": "users_relationships"}, {"score": 0.003256246326294201, "phrase": "current_contextual_integrity_models"}, {"score": 0.0031242709509664837, "phrase": "first_computational_model"}, {"score": 0.0029691377785333872, "phrase": "information_assistant_agent"}, {"score": 0.0029037051302566942, "phrase": "implicit_contexts"}, {"score": 0.0027948626965516947, "phrase": "inappropriate_information_exchanges"}, {"score": 0.0027771220289115675, "phrase": "undesired_information_disseminations"}, {"score": 0.0027419768837926885, "phrase": "experimental_evaluation"}, {"score": 0.0026224255640133758, "phrase": "information_assistant_agents"}, {"score": 0.002508073621696602, "phrase": "small_proportion"}, {"score": 0.002421726275597666, "phrase": "malicious_users"}, {"score": 0.0021049977753042253, "phrase": "unnecessary_alerts"}], "paper_keywords": ["Contextual integrity", " Online social networks", " Norms", " Agents", " Privacy"], "paper_abstract": "Many real incidents demonstrate that users of Online Social Networks need mechanisms that help them manage their interactions by increasing the awareness of the different contexts that coexist in Online Social Networks and preventing them from exchanging inappropriate information in those contexts or disseminating sensitive information from some contexts to others. Contextual integrity is a privacy theory that conceptualises the appropriateness of information sharing based on the contexts in which this information is to be shared. Computational models of Contextual Integrity assume the existence of well-defined contexts, in which individuals enact pre-defined roles and information sharing is governed by an explicit set of norms. However, contexts in Online Social Networks are known to be implicit, unknown a priori and ever changing; users relationships are constantly evolving; and the information sharing norms are implicit. This makes current Contextual Integrity models not suitable for Online Social Networks. In this paper, we propose the first computational model of Implicit Contextual Integrity, presenting an information model for Implicit Contextual Integrity as well as a so-called Information Assistant Agent that uses the information model to learn implicit contexts, relationships and the information sharing norms in order to help users avoid inappropriate information exchanges and undesired information disseminations. Through an experimental evaluation, we validate the properties of the model proposed. In particular, Information Assistant Agents are shown to: (i) infer the information sharing norms even if a small proportion of the users follow the norms and in presence of malicious users; (ii) help reduce the exchange of inappropriate information and the dissemination of sensitive information with only a partial view of the system and the information received and sent by their users; and (iii) minimise the burden to the users in terms of raising unnecessary alerts. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Implicit Contextual Integrity in Online Social Networks", "paper_id": "WOS:000362380600004"}