{"auto_keywords": [{"score": 0.004719664411221952, "phrase": "expected_high_churn"}, {"score": 0.00450456611645112, "phrase": "highly_transient_populations"}, {"score": 0.004075946554498088, "phrase": "organizational_protocols"}, {"score": 0.0038642157757169315, "phrase": "expected_session_times"}, {"score": 0.0035908627899097407, "phrase": "performance_characteristics"}, {"score": 0.0034730657554172405, "phrase": "natural_instability"}, {"score": 0.0032489004068215407, "phrase": "lifespan-based_organizational_protocols"}, {"score": 0.003163326114997034, "phrase": "end-application_performance"}, {"score": 0.0030391594477173485, "phrase": "dynamic_and_heterogeneous_internet_environments"}, {"score": 0.0027865506182608263, "phrase": "query-related_strategies"}, {"score": 0.0026950674053179404, "phrase": "query_distribution"}, {"score": 0.0024875444192203485, "phrase": "trace-driven_simulation"}, {"score": 0.0024545413637350765, "phrase": "wide-area_experimentation"}, {"score": 0.0021476098263617954, "phrase": "peers'_session_time"}], "paper_keywords": ["lifespan", " session time", " resilience", " peer-to-peer (P2P)"], "paper_abstract": "We address the problem of highly transient populations in unstructured and loosely structured peer-to-peer (P2P) systems. We propose a number of illustrative query-related strategies and organizational protocols that, by taking into consideration the expected session times of peers (their lifespans), yield systems with performance characteristics more resilient to the natural instability of their environments. We first demonstrate the benefits of lifespan-based organizational protocols in terms of end-application performance and in the context of dynamic and heterogeneous Internet environments. We do this using a number of currently adopted and proposed query-related strategies, including methods for query distribution, caching, and replication. We then show, through trace-driven simulation and wide-area experimentation, the performance advantages of lifespan-based, query-related strategies when layered over currently employed and lifespan-based organizational protocols. While merely illustrative, the evaluated strategies and protocols clearly demonstrate the advantages of considering peers' session time in designing widely-deployed P2P systems.", "paper_title": "Designing less-structured P2P systems for the expected high Churn", "paper_id": "WOS:000256967100010"}