{"auto_keywords": [{"score": 0.048223267193393836, "phrase": "large_cohorts"}, {"score": 0.00481495049065317, "phrase": "pooled_high-throughput_sequencing"}, {"score": 0.00471228691115201, "phrase": "rapid_decline"}, {"score": 0.00467855218490191, "phrase": "sequencing_costs"}, {"score": 0.004338530593157634, "phrase": "rare_alleles"}, {"score": 0.004261268957001927, "phrase": "significantly_smaller_number"}, {"score": 0.004037608759610068, "phrase": "combinatorial_pooling_designs"}, {"score": 0.003385336776758738, "phrase": "cost_reduction"}, {"score": 0.0033490008882413103, "phrase": "'weighted'_designs"}, {"score": 0.0033011569787033297, "phrase": "different_individuals"}, {"score": 0.0032774911048411804, "phrase": "different_amounts"}, {"score": 0.0030941521409613417, "phrase": "mutant_reads"}, {"score": 0.00284837132359445, "phrase": "powerful_example"}, {"score": 0.002797572252783356, "phrase": "non-overlapping_pools"}, {"score": 0.0025660347613972573, "phrase": "combinatorial_designs"}, {"score": 0.002538470301402269, "phrase": "rare_variants"}, {"score": 0.00247529638625566, "phrase": "common_variants"}, {"score": 0.0023791769068748194, "phrase": "existing_combinatorial_designs"}, {"score": 0.0023199580436336163, "phrase": "resulting_improvement"}, {"score": 0.002245975340642921, "phrase": "weighted_designs"}, {"score": 0.002190064650401852, "phrase": "common_alleles"}, {"score": 0.0021049977753042253, "phrase": "whole-exome_sequencing_projects"}], "paper_keywords": [""], "paper_abstract": "Motivation: Despite the rapid decline in sequencing costs, sequencing large cohorts of individuals is still prohibitively expensive. Recently, several sophisticated pooling designs were suggested that can identify carriers of rare alleles in large cohorts with a significantly smaller number of pools, thus dramatically reducing the cost of such large-scale sequencing projects. These approaches use combinatorial pooling designs where each individual is either present or absent from a pool. One can then infer the number of carriers in a pool, and by combining information across pools, reconstruct the identity of the carriers. Results: We show that one can gain further efficiency and cost reduction by using 'weighted' designs, in which different individuals donate different amounts of DNA to the pools. Intuitively, in this situation, the number of mutant reads in a pool does not only indicate the number of carriers, but also their identity. We describe and study a powerful example of such weighted designs, using non-overlapping pools. We demonstrate that this approach is not only easier to implement and analyze but is also competitive in terms of accuracy with combinatorial designs when identifying rare variants, and is superior when sequencing common variants. We then discuss how weighting can be incorporated into existing combinatorial designs to increase their accuracy and demonstrate the resulting improvement using simulations. Finally, we argue that weighted designs have enough power to facilitate detection of common alleles, so they can be used as a cornerstone of whole-exome sequencing projects.", "paper_title": "Weighted pooling-practical and cost-effective techniques for pooled high-throughput sequencing", "paper_id": "WOS:000305419800025"}