{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "biochemical_pathways"}, {"score": 0.004692227830462433, "phrase": "sbml_models"}, {"score": 0.00443308765153716, "phrase": "explicit_the_different_molecular_components"}, {"score": 0.004297795905522757, "phrase": "molecular_component"}, {"score": 0.004231699728933577, "phrase": "biological_entity"}, {"score": 0.003816197777388722, "phrase": "component_identification"}, {"score": 0.0036616109902631293, "phrase": "mass_conservation_principle"}, {"score": 0.0032510690712452147, "phrase": "previously-defined_component_identification_algorithm"}, {"score": 0.003168079471049896, "phrase": "real-world_models"}, {"score": 0.0024333239726872604, "phrase": "dynamic_model_correction_procedure"}, {"score": 0.0023711591828229736, "phrase": "erroneous_situations"}, {"score": 0.0022283519468680475, "phrase": "preprocessing_phase"}, {"score": 0.0021049977753042253, "phrase": "erroneous_reactions"}], "paper_keywords": ["Cellular pathways", " Modularization", " Systems biology"], "paper_abstract": "Reactions forming a pathway can be rewritten by making explicit the different molecular components involved in them. A molecular component represents a biological entity, such as a protein, in all its states (free, bound, degraded, etc.). Component identification, which is made possible by the mass conservation principle, allows subpathways to be computed to better understand the pathway functioning. In this paper we show the application of a previously-defined component identification algorithm to a number of real-world models to experimentally validate the approach; precisely, we have processed all the curated SBML models of the BioModels repository. In order to extend the applicability of our approach, we propose both (i) a preprocessing phase aiming at transforming a given pathway into a format suitable as input for the algorithm, and (ii) a dynamic model correction procedure that could allow some erroneous situations to be solved. We also prove the correctness of the preprocessing phase, and a property characterizing the structure of pathways with erroneous reactions.", "paper_title": "Identification of components in biochemical pathways: extensive application to SBML models", "paper_id": "WOS:000341089700007"}