{"auto_keywords": [{"score": 0.03617430564615387, "phrase": "diagnostic_tools"}, {"score": 0.00481495049065317, "phrase": "diagnostic_tools_for_wireless_sensor_networks"}, {"score": 0.004545240514015278, "phrase": "key_success_factor"}, {"score": 0.003957735532719663, "phrase": "growing_number"}, {"score": 0.003622642432563435, "phrase": "underlying_causes"}, {"score": 0.003011641380351577, "phrase": "existing_post-deployment_wsn_diagnostic_tools"}, {"score": 0.002820850247525606, "phrase": "basic_understating"}, {"score": 0.0027143009946473937, "phrase": "multi-dimensional_comparative_analysis"}, {"score": 0.0026218430041123164, "phrase": "proposed_classification_scheme"}, {"score": 0.002601727192945944, "phrase": "evaluation_criteria"}, {"score": 0.0025130941721410558, "phrase": "main_open_research_issues"}, {"score": 0.0024368411484675823, "phrase": "high_and_considerable_work"}, {"score": 0.0022911901892022847, "phrase": "post-deployment_wsn_diagnostic_tools"}, {"score": 0.0021050563949413553, "phrase": "wsn"}], "paper_keywords": ["Sensor networks", " Sensor diagnosing", " Testing and debugging", " Sensor failure", " Embedded debugging"], "paper_abstract": "The availability of tools to diagnose Wireless Sensor Network (WSN) failures is a key success factor for this type of networks as already demonstrated by several long-running deployments. By nature, WSNs are resource-constrained, fragile, complex to analyse, and failure-prone. Naturally, with the growing number of installations, it is becoming fundamental to efficiently diagnose failures as soon as possible, in order to deal with the underlying causes. In accordance with this, from 2005 onwards, the offer of diagnostic tools has been increasing, as the other base technologies (e.g. networking, operating system, localisation, synchronisation) become reasonably stable. The purpose of this survey is to provide an overview of existing post-deployment WSN diagnostic tools, by briefly presenting their functionality, architecture and constraints, in order to enable a basic understating of each tool. The survey also includes a multi-dimensional comparative analysis of the various tools, based on a proposed classification scheme and evaluation criteria, as well as an identification of the main open research issues. Although the number of diagnostic tools is high and considerable work has been done in this area, we conclude that there are still several challenges concerning post-deployment WSN diagnostic tools, regarding scope, flexibility, generality, mobility and security. Moreover, there is a need for mature, native diagnostic-oriented functionality in WSN platforms and operating systems.", "paper_title": "Diagnostic Tools for Wireless Sensor Networks: A Comparative Survey", "paper_id": "WOS:000320046100004"}