{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dynamic_system_modelling"}, {"score": 0.004515252649226697, "phrase": "related_models"}, {"score": 0.004214729542986473, "phrase": "web_assets"}, {"score": 0.004176194589991187, "phrase": "extensive_hyperlinking"}, {"score": 0.0039341294012600085, "phrase": "human-model_interface"}, {"score": 0.0036218682585355895, "phrase": "mathematical_model"}, {"score": 0.0034751259234824913, "phrase": "full_semantics"}, {"score": 0.0033037970113095577, "phrase": "source_code_implementation"}, {"score": 0.0028914057633212045, "phrase": "proper_connections"}, {"score": 0.00286493504971388, "phrase": "model_semantics"}, {"score": 0.002786964045867666, "phrase": "multiple_models"}, {"score": 0.002711109302199029, "phrase": "different_aspects"}, {"score": 0.0026011706232569316, "phrase": "right_model_medium"}, {"score": 0.002255431275670053, "phrase": "human_and_model"}, {"score": 0.0021539955106204354, "phrase": "special_focus"}], "paper_keywords": ["integrative modelling", " human-computer interaction", " multimodelling", " aesthetic computing"], "paper_abstract": "Models used in simulation tend to be disconnected from reality and from related models. Ideally, we should like to interact with models as if they were web assets containing extensive hyperlinking and cross-connections. In practice, these inter-connections with respect to the human-model interface are lacking and need to be improved. For example, interacting with a term within a mathematical model is rarely possible. Without such interaction, the full semantics of the term, including its real-world meaning, appearance, and source code implementation, are difficult to identify. The same model may appear in several separate locations: electronic documentation, formula-oriented software, slides, source code. Without the proper connections, model semantics can drift. Also, multiple models are generally required to view different aspects of reality, and to ensure that the right model medium is used for the people that need to understand that model. We introduce the term, hypermodel, to include interaction within models, among models, and between human and model. The discussion of hypermodelling is presented with a special focus on research performed at the University of Florida over the past 20 years. Journal of Simulation (2012) 6, 2-8. doi:10.1057/jos.2011.16; published online 12 August 2011", "paper_title": "Hypermodelling: an integrated approach to dynamic system modelling", "paper_id": "WOS:000313664200002"}