{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "object_alignment"}, {"score": 0.004598933498016774, "phrase": "object_alignment_method"}, {"score": 0.004375789703278455, "phrase": "regression_forests"}, {"score": 0.0038862297330905836, "phrase": "hough_space"}, {"score": 0.003711723285313348, "phrase": "false_positive_votes"}, {"score": 0.003545024951402821, "phrase": "discrete_or_continuous_latent_variable"}, {"score": 0.003372844338742438, "phrase": "latent_variable"}, {"score": 0.0032710562699144814, "phrase": "global_constraints"}, {"score": 0.0030414140732789186, "phrase": "proximity_threshold"}, {"score": 0.0029722900280316216, "phrase": "middle-level_features"}, {"score": 0.002938317647182056, "phrase": "voting_maps"}, {"score": 0.00290473242917264, "phrase": "object_landmark"}, {"score": 0.0027424619603260837, "phrase": "individual_object_landmark"}, {"score": 0.0026596472456182707, "phrase": "subsequent_object_analysis"}, {"score": 0.0026393362602995254, "phrase": "object_recognition"}, {"score": 0.002530359917257626, "phrase": "car_alignment"}, {"score": 0.0025014259919355453, "phrase": "data_sets"}, {"score": 0.0021539955106204354, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "shape_models"}], "paper_keywords": ["Regression forests", " facial feature", " object alignment"], "paper_abstract": "In this paper, we propose a object alignment method that detects the landmarks of an object in 2D images. In the regression forests (RFs) framework, observations (patches) that are extracted at several image locations cast votes for the localization of several landmarks. We propose to refine the votes before accumulating them into the Hough space, by sieving and/or aggregating. In order to filter out false positive votes, we pass them through several sieves, each associated with a discrete or continuous latent variable. The sieves filter out votes that are not consistent with the latent variable in question, something that implicitly enforces global constraints. In order to aggregate the votes when necessary, we adjusts on-the-fly a proximity threshold by applying a classifier on middle-level features extracted from voting maps for the object landmark in question. Moreover, our method is able to predict the unreliability of an individual object landmark. This information can be useful for subsequent object analysis like object recognition. Our contributions are validated for two object alignment tasks, face alignment and car alignment, on data sets with challenging images collected in the wild, i.e., the Labeled Face in the Wild, the Annotated Facial Landmarks in the Wild, and the street scene car data set. We show that with the proposed approach, and without explicitly introducing shape models, we obtain performance superior or close to the state of the art for both tasks.", "paper_title": "Fine-Tuning Regression Forests Votes for Object Alignment in the Wild", "paper_id": "WOS:000354550200010"}