{"auto_keywords": [{"score": 0.047617154407647785, "phrase": "mass_functions"}, {"score": 0.008653286956878819, "phrase": "statistical_properties"}, {"score": 0.00481495049065317, "phrase": "generate_mass_functions."}, {"score": 0.0047588556219929756, "phrase": "dempster-shafer_theory"}, {"score": 0.004675930527604869, "phrase": "different_application_fields"}, {"score": 0.0032697235411641695, "phrase": "proposed_algorithms"}, {"score": 0.0032315723330399375, "phrase": "straightforward_procedures"}, {"score": 0.002540285736232122, "phrase": "possible_mass_functions"}, {"score": 0.002381365139274329, "phrase": "well-known_algorithms"}, {"score": 0.002206290313627494, "phrase": "relatively_simple_algorithms"}, {"score": 0.002142426911242168, "phrase": "efficient_random_generation"}], "paper_keywords": ["Dempster-Shafer theory", " simulation algorithm", " random generation"], "paper_abstract": "As Dempster-Shafer theory spreads in different application fields, and as mass functions are involved in more and more complex systems, the need for algorithms randomly generating mass functions arises. Such algorithms can be used, for instance, to evaluate some statistical properties or to simulate the uncertainty in some systems (e.g., data base content, training sets). As such random generation is often perceived as secondary, most of the proposed algorithms use straightforward procedures whose sample statistical properties can be difficult to characterize. Thus, although such algorithms produce randomly generated mass functions, they do not always produce what could be expected from them (for example, uniform sampling in the set of all possible mass functions). In this paper, we briefly review some well-known algorithms, explaining why their statistical properties are hard to characterize. We then provide relatively simple algorithms and procedures to perform efficient random generation of mass functions whose sampling properties are controlled.", "paper_title": "HOW TO RANDOMLY GENERATE MASS FUNCTIONS", "paper_id": "WOS:000325720900001"}