{"auto_keywords": [{"score": 0.04349768979636084, "phrase": "top-ten_results"}, {"score": 0.009054475537764894, "phrase": "google"}, {"score": 0.008997954673285652, "phrase": "alltheweb"}, {"score": 0.00481495049065317, "phrase": "dynamic_changes"}, {"score": 0.004784909348794283, "phrase": "search_engine_rankings"}, {"score": 0.004452558960552103, "phrase": "top_ten_results"}, {"score": 0.004424768776701965, "phrase": "major_search_engines"}, {"score": 0.004117329555194574, "phrase": "search_engines"}, {"score": 0.004053362743156545, "phrase": "ten_identical_queries"}, {"score": 0.0037834649508375544, "phrase": "first_results_page"}, {"score": 0.0037363522297378777, "phrase": "search_engine"}, {"score": 0.003234806486611361, "phrase": "data_collection_point"}, {"score": 0.0029260602766930065, "phrase": "constant_yet_minor_changes"}, {"score": 0.0028986672783671147, "phrase": "occasional_major_ones"}, {"score": 0.0028091907694771613, "phrase": "dynamic_nature"}, {"score": 0.0027310193758440376, "phrase": "search_engines'_indexes"}, {"score": 0.0026633568650501873, "phrase": "surprisingly_low_overlap"}, {"score": 0.0023939545398857518, "phrase": "ranking_search_results"}, {"score": 0.002371531125700046, "phrase": "extreme_importance"}, {"score": 0.0022767594422780004, "phrase": "search_tools"}, {"score": 0.0021789194955896102, "phrase": "standalone_measure"}, {"score": 0.0021382831203116686, "phrase": "apparent_differences"}, {"score": 0.0021182494144182788, "phrase": "ranking_algorithms"}], "paper_keywords": ["search engines", " data collection", " worldwide web"], "paper_abstract": "Purpose - The objective of this paper is to characterize the changes in the rankings of the top ten results of major search engines over time and to compare the rankings between these engines. Design/methodology/approach - The papers compare rankings of the top-ten results of the search engines Google and AlltheWeb on ten identical queries over a period of three weeks. Only the top-ten results were considered, since users do not normally inspect more than the first results page returned by a search engine. The experiment was repeated twice, in October 2003 and in January 2004, in order to assess changes to the top-ten results of some of the queries during the three months interval. In order to assess the changes in the rankings, three measures were computed for each data collection point and each search engine. Findings - The findings in this paper show that the rankings of AlltheWeb were highly stable over each period, while the rankings of Google underwent constant yet minor changes, with occasional major ones. Changes over time can be explained by the dynamic nature of the web or by fluctuations in the search engines' indexes. The top-ten results of the two search engines had surprisingly low overlap. With such small overlap, the task of comparing the rankings of the two engines becomes extremely challenging. Originality/value - The paper shows that because of the abundance of information on the web, ranking search results is of extreme importance. The paper compares several measures for computing the similarity between rankings of search tools, and shows that none of the measures is fully satisfactory as a standalone measure. It also demonstrates the apparent differences in the ranking algorithms of two widely used search engines.", "paper_title": "Methods for evaluating dynamic changes in search engine rankings: a case study", "paper_id": "WOS:000242052700006"}