{"auto_keywords": [{"score": 0.0490692031182167, "phrase": "wireless_network_coding"}, {"score": 0.015719716506582538, "phrase": "diversity-multiplexing_tradeoff"}, {"score": 0.004763895422211728, "phrase": "cooperative_multicast_system"}, {"score": 0.004516590239106623, "phrase": "efficient_tool"}, {"score": 0.0038079353103469865, "phrase": "wireless_networks"}, {"score": 0.0036100762867678415, "phrase": "performance_analysis"}, {"score": 0.0035527409334589317, "phrase": "multicast_system"}, {"score": 0.0034042682871627296, "phrase": "dmt"}, {"score": 0.0029317463893891306, "phrase": "galois"}, {"score": 0.002794001681064862, "phrase": "dmt_analysis"}, {"score": 0.002497531381123025, "phrase": "network_coding"}, {"score": 0.0024447258861321685, "phrase": "multiplexing_gain"}, {"score": 0.0022324489895237504, "phrase": "lower_region"}, {"score": 0.002196944917134202, "phrase": "higher_region"}, {"score": 0.00217365673896732, "phrase": "monte-carlo"}, {"score": 0.00210499840229361, "phrase": "dmt."}], "paper_keywords": ["Cooperative communications", " diversity-multiplexing tradeoff (DMT)", " wireless multicast systems", " wireless network coding"], "paper_abstract": "Diversity-multiplexing tradeoff (DMT) is an efficient tool to measure the performance of multiple-input and multiple-output (MIMO) systems and cooperative systems. Recently, cooperative multicast system with wireless network coding stretched tremendous interesting due to that it can drastically enhance the throughput of the wireless networks. It is desirable to apply DMT to the performance analysis on the multicast system with wireless network coding. In this paper, DMT is performed at the three proposed wireless network coding protocols, i.e., non-regenerative network coding (NRNC), regenerative complex field network coding (RCNC) and regenerative Galois field network coding (RGNC). The DMT analysis shows that under the same system performance, i.e., the same diversity gain, all the three network coding protocols outperform the traditional transmission scheme without network coding in terms of multiplexing gain. Our DMT analysis also exhibits the trends of the three network coding protocols' performance when multiplexing gain is changing from the lower region to the higher region. Monte-Carlo simulations verify the prediction of DMT.", "paper_title": "On the Diversity-Multiplexing Tradeoff of Cooperative Multicast System with Wireless Network Coding", "paper_id": "WOS:000275029500003"}