{"auto_keywords": [{"score": 0.042454389116130545, "phrase": "soft_tissue_restraint"}, {"score": 0.015253850880399513, "phrase": "total_hip_arthroplasty"}, {"score": 0.00481495049065317, "phrase": "motion_restriction"}, {"score": 0.004742290714667451, "phrase": "hip_joint"}, {"score": 0.00457696724030363, "phrase": "impingement_free_range"}, {"score": 0.004530794611704416, "phrase": "motion_requirement"}, {"score": 0.0044624036486300865, "phrase": "complex_task"}, {"score": 0.003793876828939456, "phrase": "motion_benchmark"}, {"score": 0.003462704420080129, "phrase": "soft_tissue"}, {"score": 0.0031125795874844438, "phrase": "impingement_and_soft_tissue_restraint"}, {"score": 0.0023066199295447686, "phrase": "osseous_impingement"}, {"score": 0.002203509076886664, "phrase": "maximum_likely_damage"}, {"score": 0.002159170788765385, "phrase": "femoroacetabular_impingement"}, {"score": 0.0021049977753042253, "phrase": "prosthetic_impingement"}], "paper_keywords": ["Total hip arthroplasty (THA)", " Biomechanics", " Femoroacetabular impingement", " Range of motion"], "paper_abstract": "In total hip arthroplasty, determining the impingement free range of motion requirement is a complex task. This is because in the native hip, motion is restricted by both impingement as well as soft tissue restraint. The aim of this study is to determine a range of motion benchmark which can identify motions which are at risk from impingement and those which are constrained due to soft tissue. Two experimental methodologies were used to determine motions which were limited by impingement and those motions which were limited by both impingement and soft tissue restraint. By comparing these two experimental results, motions which were limited by impingement were able to be separated from those motions which were limited by soft tissue restraint. The results show motions in extension as well as flexion combined with adduction are limited by soft tissue restraint. Motions in flexion, flexion combined with abduction and adduction are at risk from osseous impingement. Consequently, these motions represent where the maximum likely damage will occur in femoroacetabular impingement or at most risk of prosthetic impingement in total hip arthroplasty.", "paper_title": "Evaluation of range of motion restriction within the hip joint", "paper_id": "WOS:000316118900011"}