{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "modified_cluster_assumption"}, {"score": 0.04967710401179305, "phrase": "cluster_assumption"}, {"score": 0.04888338488077779, "phrase": "similar_instances"}, {"score": 0.04745938608113117, "phrase": "semi-supervised_classification_learning"}, {"score": 0.004577440795549049, "phrase": "basic_assumption"}, {"score": 0.004242868712089958, "phrase": "implicit_assumption"}, {"score": 0.004160177106153782, "phrase": "crisp_class_label_assignment"}, {"score": 0.004125230994378402, "phrase": "real_applications"}, {"score": 0.0036759314172445934, "phrase": "similar_label_memberships"}, {"score": 0.0036144035798673967, "phrase": "crisp_label_assignment"}, {"score": 0.003584025547693836, "phrase": "\"_label_memberships"}, {"score": 0.003312486229143855, "phrase": "concerned_instance"}, {"score": 0.0031577303835881964, "phrase": "new_semi-supervised_classification_method"}, {"score": 0.0030614565460256897, "phrase": "class_membership"}, {"score": 0.002959765109527493, "phrase": "decision_function"}, {"score": 0.002943147037670826, "phrase": "adequate_label_memberships"}, {"score": 0.0027663761953861336, "phrase": "lwm"}, {"score": 0.002743105561254975, "phrase": "robust_image"}, {"score": 0.0026744596572861093, "phrase": "weighted_mean"}, {"score": 0.002600194073758015, "phrase": "unified_objective_function"}, {"score": 0.0025279855026434416, "phrase": "square_loss_function"}, {"score": 0.0024926348205500715, "phrase": "alternating_iterative_strategy"}, {"score": 0.002416589459425828, "phrase": "closed-form_solution"}, {"score": 0.0023166075278110237, "phrase": "label_membership_function"}, {"score": 0.0021348627335303016, "phrase": "ssccm"}, {"score": 0.0021228663458966813, "phrase": "encouraging_results"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_semi-supervised_classification_methods"}], "paper_keywords": ["Cluster assumption", " iteration", " label membership function", " local weighted mean", " semi-supervised classification"], "paper_abstract": "The cluster assumption, which assumes that \"similar instances should share the same label,\" is a basic assumption in semi-supervised classification learning, and has been found very useful in many successful semi-supervised classification methods. It is rarely noticed that when the cluster assumption is adopted, there is an implicit assumption that every instance should have a crisp class label assignment. In real applications, however, there are cases where it is difficult to tell that an instance definitely belongs to one class and does not belong to other neighboring classes. In such cases, it is more adequate to assume that \" similar instances should share similar label memberships\" rather than sharing a crisp label assignment. Here \" label memberships\" can be represented as a vector, where each element corresponds to a class, and the value at the element expresses the likelihood of the concerned instance belonging to the class. By adopting this modified cluster assumption, in this paper we propose a new semi-supervised classification method, that is, semi-supervised classification based on class membership (SSCCM). Specifically, we try to solve the decision function and adequate label memberships for instances simultaneously, and constrain that an instance and its \" local weighted mean\" (LWM) share the same label membership vector, where the LWM is a robust image of the instance, constructed by calculating the weighted mean of its neighboring instances. We formulate the problem in a unified objective function for the labeled, unlabeled data and their LWMs based on the square loss function, and take an alternating iterative strategy to solve it, in which each step generates a closed-form solution, and the convergence is guaranteed. The solution will provide both the decision function and the label membership function for classification, their classification results can verify each other, and the reliability of semi-supervised classification learning might be enhanced by checking the consistency between those two predictions. Experiments show that SSCCM obtains encouraging results compared to state-of-the-art semi-supervised classification methods.", "paper_title": "New Semi-Supervised Classification Method Based on Modified Cluster Assumption", "paper_id": "WOS:000303507000001"}