{"auto_keywords": [{"score": 0.049495288917568735, "phrase": "visual_performance"}, {"score": 0.038948090958912586, "phrase": "significantly_enhanced_visual_performance"}, {"score": 0.015838697976554215, "phrase": "bending_curvature"}, {"score": 0.010612387000973441, "phrase": "ambient_illuminance"}, {"score": 0.007599471860808466, "phrase": "significantly_different_visual_performance"}, {"score": 0.007090310936496126, "phrase": "significant_effects"}, {"score": 0.006806779701229929, "phrase": "elderly_participants"}, {"score": 0.005997467872874311, "phrase": "elderly_users"}, {"score": 0.004717485406306594, "phrase": "young_and_elderly_participants"}, {"score": 0.00467905143301368, "phrase": "simulated_electronic_paper_displays"}, {"score": 0.00447316895126645, "phrase": "simulated_e-paper_displays"}, {"score": 0.004021689117050817, "phrase": "young_and_elderly_users"}, {"score": 0.003988901168289797, "phrase": "simulated_electronic-paper_displays"}, {"score": 0.003736004578001584, "phrase": "young_users"}, {"score": 0.003145609726536791, "phrase": "young_participants"}, {"score": 0.0030193416820392554, "phrase": "simulated_e_ink_e-paper_display"}, {"score": 0.002459902948098627, "phrase": "curvature_settings"}, {"score": 0.0022849068677290836, "phrase": "simulated_e-paper"}, {"score": 0.002184137736856711, "phrase": "ambient_illuminance_settings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Electronic paper", " Elderly", " Bending curvature", " Ambient illuminance", " Visual performance"], "paper_abstract": "This study investigated the effects of bending curvature of simulated e-paper displays (-10 cm, plane and 10 cm) and ambient illuminance (50, 500, 6000 and 12,000 lx) on the visual performance of young and elderly users for simulated electronic-paper displays. In total, 24 people comprising 12 young and 12 elderly users participated in this study. Young users demonstrated significantly enhanced visual performance using the simulated electrophoretic ink (E ink) e-paper display with ambient illuminance set at 50 and 500 lx: however, participants did not demonstrate significantly different visual performance using the 2 simulated e-paper displays with ambient illuminance set at 6000 and 12,000 lx. The bending curvature did not exhibit significant effects on the visual performance of young participants under various ambient illuminances. The elderly participants exhibited significantly enhanced visual performance using the simulated E ink e-paper display only when ambient illuminance was set at 50 lx; however, participants did not exhibit significantly different visual performance using the two simulated e-paper displays with ambient illuminance set at other levels. Elderly users exhibited significantly enhanced visual performance when the bending curvature was set at 10 cm, with ambient illuminance set at 50 lx. Elderly users also demonstrated significantly enhanced visual performance under bending curvature settings of 10 cm and plane, with ambient illuminance set at 500 lx. However, the bending curvature of the simulated e-paper did not exhibit significant effects on the visual performance of elderly participants under ambient illuminance settings of 6000 and 12,000 lx. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Effects of bending curvature and ambient illuminance on the visual performance of young and elderly participants using simulated electronic paper displays", "paper_id": "WOS:000301701800006"}