{"auto_keywords": [{"score": 0.04858132305104682, "phrase": "time_series_prediction"}, {"score": 0.015555892074578494, "phrase": "complex_network_topologies"}, {"score": 0.00481495049065317, "phrase": "self-organizing_maps"}, {"score": 0.004590820632326585, "phrase": "self-organizing_map"}, {"score": 0.004447201233380302, "phrase": "competitive_learning_neural_network_architecture"}, {"score": 0.004262643556463569, "phrase": "classificatory_neurons"}, {"score": 0.004064117897000019, "phrase": "input_patterns"}, {"score": 0.0034299649219748513, "phrase": "vqtam_model"}, {"score": 0.0033937776228549557, "phrase": "function_prediction"}, {"score": 0.0030847461428168614, "phrase": "casom_algorithm"}, {"score": 0.0027303606813078255, "phrase": "prediction_problems"}, {"score": 0.0027015344365793016, "phrase": "classical_som."}, {"score": 0.0021050129792329728, "phrase": "som"}], "paper_keywords": ["Time series prediction", " Self-organizing maps (SOM)", " Complex networks", " Coalitions"], "paper_abstract": "A Self-organizing Map (SOM) is a competitive learning neural network architecture that make available a certain amount of classificatory neurons, which self-organize spatially based on input patterns. In this paper we explore the use of complex network topologies, like small-world, scale-free or random networks; for connecting the neurons within a SOM, and apply them for Time Series Prediction. We follow the VQTAM model for function prediction, and consider several benchmarks to evaluate the quality of the predictions. Afterwards, we introduce the CASOM algorithm (Coalitions and SOM) that uses coalitions to temporarily extend the neighborhood of a neuron, and to provide more accuracy in prediction problems than classical SOM. The results presented in this work suggest that the most regular the network topology is, the better results it provides in prediction. Besides, we have found that not updating all the neurons at the same time provides much better results. Finally, we describe how the use of coalitions can enhance the capability of SOM for Time Series Prediction.", "paper_title": "Using self-organizing maps with complex network topologies and coalitions for time series prediction", "paper_id": "WOS:000333030800008"}