{"auto_keywords": [{"score": 0.009005644263684281, "phrase": "scalar_test_equation"}, {"score": 0.007790386937253694, "phrase": "schrodinger_equation"}, {"score": 0.00481495049065317, "phrase": "hybrid_high_algebraic_order"}, {"score": 0.004667149874736771, "phrase": "vanished_phase-lag"}, {"score": 0.0037321585095070483, "phrase": "specific_proposed_hybrid_two-step_method"}, {"score": 0.0031928040608991543, "phrase": "new_method"}, {"score": 0.0028178463431115562, "phrase": "obtained_method"}, {"score": 0.0026061419474030633, "phrase": "phase-lag_analysis"}, {"score": 0.002473895542219933, "phrase": "new_produced_method"}, {"score": 0.0024103044278902916, "phrase": "resonance_problem"}, {"score": 0.0022175679453857473, "phrase": "numerical_solution"}, {"score": 0.0021605514226546497, "phrase": "related_initial-value"}], "paper_keywords": [""], "paper_abstract": "A new two-step high algebraic order (tenth order) two-step hybrid (Runge-Kutta type) method is developed in this paper. For this new method we require the vanishing of its phase-lag and its first and second derivatives. We will study the effects of the vanishing of the phase-lag and its first and second derivatives of the specific proposed hybrid two-step method on the efficiency of the method. In more details in this paper we will investigate the following: the development of the method the local truncation error of the new method and its comparison with other methods in the literature (comparative local truncation error analysis) the stability (interval of periodicity) of the obtained method using frequency for the scalar test equation different than the frequency used in the scalar test equation for phase-lag analysis (stability analysis). the efficiency of the new produced method applying it on the resonance problem of the Schrodinger equation We will prove that this kind of methods are efficient for the numerical solution of the Schrodinger equation and related initial-value or boundary-value problems with periodic and/or oscillating solutions.", "paper_title": "Hybrid High Algebraic Order Two-Step Method with Vanished Phase-Lag and Its First and Second Derivatives", "paper_id": "WOS:000355887000002"}