{"auto_keywords": [{"score": 0.04338090654248663, "phrase": "semantic_labels"}, {"score": 0.03794384973700695, "phrase": "semantic_classification_task"}, {"score": 0.00481495049065317, "phrase": "context-aware_rule-based_classifier"}, {"score": 0.004710489616113198, "phrase": "disease-specific_classification"}, {"score": 0.004676173016967478, "phrase": "textual_clinical_discharge_summaries"}, {"score": 0.004625164125506718, "phrase": "great_importance"}, {"score": 0.004591466267316524, "phrase": "human_life_science"}, {"score": 0.004459101239560164, "phrase": "medical_studies"}, {"score": 0.0044104497301196794, "phrase": "statistically_relevant_data"}, {"score": 0.004175006647851034, "phrase": "discharge_summaries"}, {"score": 0.0036731870109004993, "phrase": "classification_technique"}, {"score": 0.0035025108234594668, "phrase": "context-aware_rule-based_semantic_classification_technique"}, {"score": 0.0033397385936467204, "phrase": "subsequent_steps"}, {"score": 0.003279160988534828, "phrase": "misleading_parts"}, {"score": 0.0029813748433158032, "phrase": "appropriate_semantic_labels"}, {"score": 0.0024106932919085097, "phrase": "intuitive_tasks"}, {"score": 0.0023756164484983874, "phrase": "second_place"}, {"score": 0.0023496433751182162, "phrase": "textual_and_first_place"}, {"score": 0.002323953608863511, "phrase": "intuitive_subtasks"}, {"score": 0.0021996478802839316, "phrase": "simple_rule-based_classifier"}, {"score": 0.002136087390959268, "phrase": "machine_learning_techniques"}, {"score": 0.0021049977753042253, "phrase": "training_data"}], "paper_keywords": [""], "paper_abstract": "Objective: Automated and disease-specific classification of textual clinical discharge summaries is of great importance in human life science, as it helps physicians to make medical studies by providing statistically relevant data for analysis. This can be further facilitated if, at the labeling of discharge summaries, semantic labels are also extracted from text, such as whether a given disease is present, absent, questionable in a patient, or is unmentioned in the document. The authors present a classification technique that successfully solves the semantic classification task. Design: The authors introduce a context-aware rule-based semantic classification technique for use on clinical discharge summaries. The classification is performed in subsequent steps. First, some misleading parts are removed from the text; then the text is partitioned into positive, negative, and uncertain context segments, then a sequence of binary classifiers is applied to assign the appropriate semantic labels. Measurement: For evaluation the authors used the documents of the i2b2 Obesity Challenge and adopted its evaluation measures: F(1)-macro and F(1)-micro for measurements. Results: On the two subtasks of the Obesity Challenge (textual and intuitive classification) the system performed very well, and achieved a F(1)-macro = 0.80 for the textual and F(1)-macro = 0.67 for the intuitive tasks, and obtained second place at the textual and first place at the intuitive subtasks of the challenge. Conclusions: The authors show in the paper that a simple rule-based classifier can tackle the semantic classification task more successfully than machine learning techniques, if the training data are limited and some semantic labels are very sparse.", "paper_title": "Semantic Classification of Diseases in Discharge Summaries Using a Context-aware Rule-based Classifier", "paper_id": "WOS:000267995500020"}