{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reliable_dissemination"}, {"score": 0.004682917599491709, "phrase": "reliable_broadcast"}, {"score": 0.004627441072541506, "phrase": "basic_service"}, {"score": 0.004290969772225093, "phrase": "scalable_reliable_broadcast"}, {"score": 0.004257000695796238, "phrase": "ad_hoc_networks"}, {"score": 0.003823791479971016, "phrase": "new_protocol"}, {"score": 0.003036040409062437, "phrase": "single_method"}, {"score": 0.002882980094838904, "phrase": "combined_protocol"}, {"score": 0.002662393295121998, "phrase": "rapid_protocol"}, {"score": 0.0026203386550421558, "phrase": "local_computations"}, {"score": 0.002488183412451029, "phrase": "even_selfish_behavior"}, {"score": 0.0022977342663599042, "phrase": "detailed_performance_evaluation"}, {"score": 0.002208035721125305, "phrase": "higher_reliability"}, {"score": 0.002190519728921395, "phrase": "low_latency"}, {"score": 0.0021049977753042253, "phrase": "individual_methods"}], "paper_keywords": ["Reliable broadcast", " probabilistic broadcast", " fault tolerance", " ad hoc networks"], "paper_abstract": "Reliable broadcast is a basic service for many collaborative applications as it provides reliable dissemination of the same information to many recipients. This paper studies three common approaches for achieving scalable reliable broadcast in ad hoc networks, namely probabilistic flooding, counter-based broadcast, and lazy gossip. The strength and weaknesses of each scheme are analyzed, and a new protocol that combines these three techniques, called RAPID, is developed. Specifically, the analysis in this paper focuses on the trade-offs between reliability (percentage of nodes that receive each message), latency, and the message overhead of the protocol. Each of these methods excel in some of these parameters, but no single method wins in all of them. This motivates the need for a combined protocol that benefits from all of these methods and allows to trade between them smoothly. Interestingly, since the RAPID protocol only relies on local computations and probability, it is highly resilient to mobility and failures and even selfish behavior. By adding authentication, it can even be made malicious tolerant. Additionally, the paper includes a detailed performance evaluation by simulation. The simulations confirm that RAPID obtains higher reliability with low latency and good communication overhead compared with each of the individual methods.", "paper_title": "On Reliable Dissemination in Wireless Ad Hoc Networks", "paper_id": "WOS:000294783800007"}