{"auto_keywords": [{"score": 0.0043144799365586375, "phrase": "first_projection_approach"}, {"score": 0.004044645056447888, "phrase": "oblique_projection"}, {"score": 0.003967021436047945, "phrase": "spectral_data"}, {"score": 0.0038409323908446297, "phrase": "useful_information"}, {"score": 0.003742941972172613, "phrase": "detrimental_information"}, {"score": 0.003647442345566347, "phrase": "corrected_spectra"}, {"score": 0.003353521531649663, "phrase": "second_projection_approach"}, {"score": 0.0032468685934998335, "phrase": "regression_vector"}, {"score": 0.0031435968684569112, "phrase": "orthogonal_projection"}, {"score": 0.0030832123624449028, "phrase": "reference_values"}, {"score": 0.00247460024299964, "phrase": "spectroscopic_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Model", " Projection", " Calibration", " Direct", " Regression", " Pretreatment"], "paper_abstract": "A general model is proposed for the explanation of several linear methods used for quantification. A first projection approach concerns pretreatments and calibrations. It consists of an oblique projection of the spectral data onto a subspace containing useful information for calibrations or detrimental information for pretreatments. Corrected spectra and scores are obtained for pretreatments and calibrations, respectively. A second projection approach concerns only calibrations. The regression vector is deduced after an orthogonal projection of the reference values onto the scores previously obtained. Several pretreatments, and direct and indirect (inverse) calibrations also called regressions are reviewed according to this model. The methods described are focused on spectroscopic applications. Some are very specific to spectroscopy; however, most of them also can be applied in other situations. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A simple, projection-based geometric model for several linear pretreatment and calibration methods", "paper_id": "WOS:000343961200006"}