{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "real-time_information"}, {"score": 0.0044968982227349625, "phrase": "crisis_and_emergency_scenarios_intertwines"}, {"score": 0.004173743791750695, "phrase": "data_acquisition"}, {"score": 0.0039221899471111, "phrase": "cognitive_processes"}, {"score": 0.0038737214010638745, "phrase": "information_and_communications_technologies"}, {"score": 0.0036857412768922827, "phrase": "effective_situational_awareness"}, {"score": 0.003640183972131238, "phrase": "response_capability"}, {"score": 0.0031549249117721946, "phrase": "potential_torrents"}, {"score": 0.0028737647829311587, "phrase": "human_cognitive_capacity"}, {"score": 0.0027857115172243226, "phrase": "technological_mediation"}, {"score": 0.0027172101552870973, "phrase": "rter"}, {"score": 0.002633941112839883, "phrase": "research_challenges"}, {"score": 0.002585206414738808, "phrase": "real-time_collection"}], "paper_keywords": ["Safety", " Emergency services", " Video sharing"], "paper_abstract": "The decision-making process during crisis and emergency scenarios intertwines human intelligence with infocommunications. In such scenarios, the tasks of data acquisition, manipulation, and analysis involve a combination of cognitive processes and information and communications technologies, all of which are vital to effective situational awareness and response capability. To support such capabilities, we describe our real time emergency response (rtER) system, implemented with the intention of helping to manage the potential torrents of data that are available during a crisis, and that could easily overwhelm human cognitive capacity in the absence of technological mediation. Specifically, rtER seeks to address the research challenges surrounding the real-time collection of relevant data, especially live video, making this information rapidly available to a team of humans, and giving them the tools to manipulate, tag, and filter the most critical information of relevance to the situation.", "paper_title": "Real-time emergency response: improved management of real-time information during crisis situations", "paper_id": "WOS:000337754000006"}