{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "facial_surfaces"}, {"score": 0.004507760907425495, "phrase": "intrinsic_difficulties"}, {"score": 0.004448705308279165, "phrase": "conventional_face_recognition"}, {"score": 0.00416478405812793, "phrase": "novel_strategy"}, {"score": 0.0028276174348291923, "phrase": "pose_invariant_local_mean_curvature"}, {"score": 0.002623669616798891, "phrase": "eigenface_algorithm"}, {"score": 0.002600661525224505, "phrase": "attribute_image_recognition"}, {"score": 0.002499591321035161, "phrase": "frgc"}, {"score": 0.002339771435910601, "phrase": "proposed_approach"}, {"score": 0.0021613897794439227, "phrase": "face_recognition"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graph algorithms", " 3D face recognition", " Feature extraction", " Discrete conformal mapping"], "paper_abstract": "The increasing availability of 3D facial data offers the potential to overcome the intrinsic difficulties faced by conventional face recognition using 2D images. Instead of extending 2D recognition algorithms for 3D purpose, this letter proposes a novel strategy for 3D face recognition from the perspective of representing each 3D facial surface with a 2D attribute image and taking the advantage of the advances in 2D face recognition. In our approach, each 3D facial surface is mapped homeomorphically onto a 2D lattice, where the value at each site is an attribute that represents the local 3D geometrical or textural properties on the surface, therefore invariant to pose changes. This lattice is then interpolated to generate a 2D attribute image. 3D face recognition can be achieved by applying the traditional 2D face recognition techniques to obtained attribute images. In this study, we chose the pose invariant local mean curvature calculated at each vertex on the 3D facial surface to construct the 2D attribute image and adopted the eigenface algorithm for attribute image recognition. We compared our approach to state-of-the-art 3D face recognition algorithms in the FRGC (Version 2.0), GavabDB and NPU3D database. Our results show that the proposed approach has improved the robustness to head pose variation and can produce more accurate 3D multi-pose face recognition. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "2D representation of facial surfaces for multi-pose 3D face recognition", "paper_id": "WOS:000301212400006"}