{"auto_keywords": [{"score": 0.004204904449336037, "phrase": "effective_network"}, {"score": 0.0038242899532391914, "phrase": "formal_selection_procedure"}, {"score": 0.003755782496223915, "phrase": "'relational_environment"}, {"score": 0.003415681637907093, "phrase": "theoretically_well-grounded_framework"}, {"score": 0.0033393377529146893, "phrase": "comprehensive_and_up-to-date_empirical_analysis"}, {"score": 0.003134503353065008, "phrase": "seven_core_entrepreneurship_journals"}, {"score": 0.0027741761880779535, "phrase": "increasing_visibility"}, {"score": 0.0025456716198597627, "phrase": "rather_dense_formal_links"}, {"score": 0.0024220634963019114, "phrase": "reasonably_solid_network"}, {"score": 0.002400241288973103, "phrase": "informal_relations"}, {"score": 0.0022836785412390544, "phrase": "highly_influential_scholars"}, {"score": 0.002252880693912436, "phrase": "limited_internationalization"}, {"score": 0.00222249726328354, "phrase": "entrepreneurship_community"}, {"score": 0.0021727640931660038, "phrase": "almost_total_absence"}, {"score": 0.0021049977753042253, "phrase": "major_quest"}], "paper_keywords": ["Bibliometrics", " Entrepreneurship", " Invisible college"], "paper_abstract": "Despite the vitality and dynamism that the field of entrepreneurship has experienced in the last decade, the issue of whether it comprises an effective network of (in)formal communication linkages among the most influential scholars within the area has yet to be examined in depth. This study follows a formal selection procedure to delimit the 'relational environment' of the field of entrepreneurship and to analyze the existence and characterization of (in)visible college(s) based on a theoretically well-grounded framework, thus offering a comprehensive and up-to-date empirical analysis of entrepreneurship research. Based on more than a 1,000 papers published between 2005 and 2010 in seven core entrepreneurship journals and the corresponding (85,000) citations, we found that entrepreneurship is an (increasingly) autonomous, legitimate and cohesive (in)visible college, fine tuned through the increasing visibility of certain subject specialties (e.g., family business, innovation, technology and policy). Moreover, the rather dense formal links that characterize the entrepreneurship (in)visible college are accompanied by a reasonably solid network of informal relations maintained and sustained by the mobility of 'stars' and highly influential scholars. The limited internationalization of the entrepreneurship community, reflected in the almost total absence of non-English-speaking authors/studies/outlets, stands as a major quest for the field.", "paper_title": "Mapping the (in)visible college(s) in the field of entrepreneurship", "paper_id": "WOS:000294839200001"}