{"auto_keywords": [{"score": 0.038143211264035526, "phrase": "sn_p_systems"}, {"score": 0.00481495049065317, "phrase": "sequential_spiking_neural_p_systems"}, {"score": 0.004757643419056999, "phrase": "neural_p_systems"}, {"score": 0.004571478018964363, "phrase": "distributed_parallel_computing_devices"}, {"score": 0.003789137457228946, "phrase": "computation_step"}, {"score": 0.003684634192576662, "phrase": "biological_inspiration"}, {"score": 0.0030904433394138963, "phrase": "enabled_rules"}, {"score": 0.003005151718290603, "phrase": "chosen_rule"}, {"score": 0.002945669860541221, "phrase": "exhaustive_manner"}, {"score": 0.00288736193515505, "phrase": "local_parallelism"}, {"score": 0.002623111480310373, "phrase": "global_view"}, {"score": 0.0025918235228843444, "phrase": "whole_network"}, {"score": 0.0022622413725964727, "phrase": "turing"}, {"score": 0.0022352169832099153, "phrase": "number-generating_computation_devices"}, {"score": 0.0021049977753042253, "phrase": "computation_power"}], "paper_keywords": [""], "paper_abstract": "Spiking neural P systems (SN P systems) are a class of distributed parallel computing devices inspired by the way neurons communicate by means of spikes; neurons work in parallel in the sense that each neuron that can fire should fire, but the work in each neuron is sequential in the sense that at most one rule can be applied at each computation step. In this work, with biological inspiration, we consider SN P systems with the restriction that at each step, one of the neurons (i.e., sequential mode) or all neurons (i.e., pseudo-sequential mode) with the maximum (or minimum) number of spikes among the neurons that are active (can spike) will fire. If an active neuron has more than one enabled rule, it nondeterministically chooses one of the enabled rules to be applied, and the chosen rule is applied in an exhaustive manner (a kind of local parallelism): the rule is used as many times as possible. This strategy makes the system sequential or pseudo-sequential from the global view of the whole network and locally parallel at the level of neurons. We obtain four types of SN P systems: maximum/minimum spike number induced sequential/pseudo-sequential SN P systems with exhaustive use of rules. We prove that SN P systems of these four types are all Turing universal as number-generating computation devices. These results illustrate that the restriction of sequentiality may have little effect on the computation power of SN P systems.", "paper_title": "On Some Classes of Sequential Spiking Neural P Systems", "paper_id": "WOS:000334027800006"}