{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "computational_models"}, {"score": 0.009363244378767989, "phrase": "predictive_power"}, {"score": 0.004766388573192505, "phrase": "mechanoregulated_stem_cell_differentiation"}, {"score": 0.004530804371923794, "phrase": "jacobs"}, {"score": 0.004485112329503943, "phrase": "kelly"}, {"score": 0.004328689762198895, "phrase": "tissue_engineering"}, {"score": 0.003587924960158317, "phrase": "mechanoregulation_theories"}, {"score": 0.003445174898115646, "phrase": "first_place"}, {"score": 0.0032251796659158696, "phrase": "tissue_differentiation"}, {"score": 0.0025663181430010686, "phrase": "week_theories"}], "paper_keywords": ["corroboration", " mechanobiology", " K.R. Popper", " computer model"], "paper_abstract": "Do computational models contribute to progress in mechanobiology? Jacobs and Kelly (in Advances on Modelling in Tissue Engineering, p. 1-14, 2011) suggest that they do, but at the same time propose a limitation in the form of the 'paradox of validation', whereby the information needed to validate mechanoregulation theories obviates the need for them in the first place. In this article, the corroboration of theories describing mechanoregulation of tissue differentiation is reviewed. Considering the falsifiability of computational models derived using the theories as a measure of their predictive power, it is shown that the predictive power of some theories is poor and that models based on these theories fall into the 'paradox of validation'. Week theories for any phenomenon would succumb to such a paradox. We argue that mechanobiology needs theories that can have more potentially falsifying experiments and that perhaps the discipline does suffer from theories that are a priori designed to minimise falsifiability. However, several theories do have predictive power beyond the data used to validate them, so a paradox of validation should disappear as the subject develops.", "paper_title": "Corroboration of computational models for mechanoregulated stem cell differentiation", "paper_id": "WOS:000343244000002"}