{"auto_keywords": [{"score": 0.0412825255374171, "phrase": "forwarding_nodes"}, {"score": 0.013856805950986397, "phrase": "liu_et_al"}, {"score": 0.012982248350383212, "phrase": "minimum_number"}, {"score": 0.009915556514327501, "phrase": "worst_case"}, {"score": 0.00481495049065317, "phrase": "efficient_broadcasting"}, {"score": 0.004489952932659799, "phrase": "first_part"}, {"score": 0.004362564831572539, "phrase": "sender-based_broadcasting_algorithms"}, {"score": 0.004101579688745222, "phrase": "sender-based_broadcasting_algorithm"}, {"score": 0.004034649282040889, "phrase": "local_optimality"}, {"score": 0.00388800655625083, "phrase": "lowest_computational_time"}, {"score": 0.0035079364710988627, "phrase": "sender-based_algorithms"}, {"score": 0.0034364867143322304, "phrase": "efficient_sender-based_broadcasting_algorithm"}, {"score": 0.0033115124244647736, "phrase": "time_complexity"}, {"score": 0.003177958355586418, "phrase": ".'s_algorithm"}, {"score": 0.0028086649378423357, "phrase": "second_part"}, {"score": 0.0027176309244222, "phrase": "simple_and_highly_efficient_receiver-based_broadcasting_algorithm"}, {"score": 0.0021488235554917128, "phrase": "best_known_approximations"}, {"score": 0.0021049977753042253, "phrase": "required_broadcasts"}], "paper_keywords": ["Wireless ad hoc networks", " flooding", " broadcasting", " localized algorithms"], "paper_abstract": "This paper presents two efficient broadcasting algorithms based on 1-hop neighbor information. In the first part of the paper, we consider sender-based broadcasting algorithms, specifically the algorithm proposed by Liu et al. In their paper, Liu et al. proposed a sender-based broadcasting algorithm that can achieve local optimality by selecting the minimum number of forwarding nodes in the lowest computational time complexity O(n logn), where n is the number of neighbors. We show that this optimality only holds for a subclass of sender-based algorithms. We propose an efficient sender-based broadcasting algorithm based on 1-hop neighbor information that reduces the time complexity of computing forwarding nodes to O(n). In Liu et al.'s algorithm, n nodes are selected to forward the message in the worst case, whereas in our proposed algorithm, the number of forwarding nodes in the worst case is 11. In the second part of the paper, we propose a simple and highly efficient receiver-based broadcasting algorithm. When nodes are uniformly distributed, we prove that the probability of two neighbor nodes broadcasting the same message exponentially decreases when the distance between them decreases or when the node density increases. Using simulation, we confirm these results and show that the number of broadcasts in our proposed receiver-based broadcasting algorithm can be even less than one of the best known approximations for the minimum number of required broadcasts.", "paper_title": "Efficient Broadcasting in Mobile Ad Hoc Networks", "paper_id": "WOS:000261768600007"}