{"auto_keywords": [{"score": 0.03283730237488887, "phrase": "linp"}, {"score": 0.00481495049065317, "phrase": "identical_neighborly_partitions"}, {"score": 0.004771672073078768, "phrase": "efficient_high-dimensional_similarity_search"}, {"score": 0.004728780808284175, "phrase": "unstructured_peer-to-peer_systems"}, {"score": 0.004499647408293102, "phrase": "great_deal"}, {"score": 0.004459190343665408, "phrase": "research_attention"}, {"score": 0.004320421465896323, "phrase": "large_number"}, {"score": 0.00389404213807752, "phrase": "content-based_search"}, {"score": 0.003738847528809348, "phrase": "high-dimensional_feature_vectors"}, {"score": 0.0035898158129721003, "phrase": "efficient_and_effective_indexing_mechanism"}, {"score": 0.0035414658322295515, "phrase": "high-dimensional_similarity_query"}, {"score": 0.0031917146566068245, "phrase": "index_technique"}, {"score": 0.002889444701599236, "phrase": "promising_peers"}, {"score": 0.0028248293967214947, "phrase": "desired_data"}, {"score": 0.0027741761880779535, "phrase": "proposed_scheme"}, {"score": 0.002522738549524317, "phrase": "routing_indices"}, {"score": 0.0024440836179156593, "phrase": "system_performance"}, {"score": 0.0024220634963019114, "phrase": "peer_updates"}, {"score": 0.002202469129781332, "phrase": "relevant_peers"}], "paper_keywords": ["Unstructured P2P system", " High-dimensional data", " Similarity search", " Routing index", " Space partition"], "paper_abstract": "Peer-to-Peer (P2P) computing has recently attracted a great deal of research attention. In a P2P system, a large number of nodes can potentially be pooled together to share their resources, information, and services. However, existing unstructured P2P systems lack support for content-based search over data objects which are generally represented by high-dimensional feature vectors. In this paper, we propose an efficient and effective indexing mechanism to facilitate high-dimensional similarity query in unstructured P2P systems, named Linking Identical Neighborly Partitions (LINP), which combines both space partitioning technique and routing index technique. With the aid of LINP, each peer can not only process similarity query efficiently over its local data, but also can route the query to the promising peers which may contain the desired data. In the proposed scheme, each peer summarizes its local data using the space partitioning technique, and exchanges the summarized index with its neighboring peers to construct routing indices. Furthermore, to improve the system performance with peer updates, we propose an extension of the LINP, named LINP+, where each peer can reconfigure its neighboring peers to keep relevant peers nearby. The performance of our proposed scheme is evaluated over both synthetic and real-life high-dimensional datasets, and experimental results show the superiority of our proposed scheme.", "paper_title": "Linking identical neighborly partitions for efficient high-dimensional similarity search in unstructured peer-to-peer systems", "paper_id": "WOS:000271025800004"}