{"auto_keywords": [{"score": 0.03984961577718066, "phrase": "stability_region"}, {"score": 0.010612387000973441, "phrase": "n-model_systems"}, {"score": 0.010465667873476416, "phrase": "static_priority_rule"}, {"score": 0.003957477564354679, "phrase": "standard_fluid_models"}, {"score": 0.0037069087922811488, "phrase": "static_priority_policies"}, {"score": 0.0035376693476114733, "phrase": "general_approach"}, {"score": 0.003472149546470424, "phrase": "fluid_model_equations"}, {"score": 0.0034238045290210534, "phrase": "induced_markov_chains"}, {"score": 0.0033603864623013733, "phrase": "new_approach"}, {"score": 0.0030461580449080553, "phrase": "phase-type_distributions"}, {"score": 0.002787181295054319, "phrase": "interarrival_times"}, {"score": 0.002562123444678208, "phrase": "threshold_value"}, {"score": 0.002311525062244175, "phrase": "service_times"}, {"score": 0.0021247934141234988, "phrase": "server_systems"}, {"score": 0.0021049977753042253, "phrase": "general_service_time_distributions"}], "paper_keywords": ["Parallel queueing systems", " Stability", " Fluid models", " Static priority"], "paper_abstract": "We consider the stability of N-model systems that consist of two customer classes and two server pools. Servers in one of the pools can serve both classes, but those in the other pool can serve only one of the classes. The standard fluid models in general are not sufficient to establish the stability region of these systems under static priority policies. Therefore, we use a novel and a general approach to augment the fluid model equations based on induced Markov chains. Using this new approach, we establish the stability region of these systems under a static priority rule with thresholds when the service and interarrival times have phase-type distributions. We show that, in certain cases, the stability region depends on the distributions of the service and interarrival times (beyond their mean), on the number of servers in the system, and on the threshold value. We also show that it is possible to expand the stability region in these systems by increasing the variability of the service times (without changing their mean) while keeping the other parameters fixed. The extension of our results to parallel server systems and general service time distributions is also discussed.", "paper_title": "Stability analysis of N-model systems under a static priority rule", "paper_id": "WOS:000314300300001"}