{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multihop_device-to-device_communication"}, {"score": 0.004531637625717547, "phrase": "local_area"}, {"score": 0.0044634416051962545, "phrase": "popular_content_sharing_services"}, {"score": 0.0041374874583908535, "phrase": "next-generation_cellular_networks"}, {"score": 0.003923532450854754, "phrase": "hop_gains"}, {"score": 0.0038062581748678245, "phrase": "system_capacity"}, {"score": 0.0032951702142329357, "phrase": "new_paradigm"}, {"score": 0.0029182434479165884, "phrase": "dynamic_graph_optimization_framework"}, {"score": 0.002788257824525862, "phrase": "large-scale_systems"}, {"score": 0.0027048247303526583, "phrase": "node_mobility_patterns"}, {"score": 0.0025843206540392184, "phrase": "main_technological_problems"}, {"score": 0.002413531395475291, "phrase": "theoretical_performance_limits"}, {"score": 0.0023412849215629986, "phrase": "optimal_system_design"}, {"score": 0.002254003531073337, "phrase": "achievable_benefits"}], "paper_keywords": [""], "paper_abstract": "With emerging demands for local area and popular content sharing services, multihop device-to-device communication is conceived as a vital component of next-generation cellular networks to improve spectral reuse, bring hop gains, and enhance system capacity. Ripening these benefits depends on fundamentally understanding its potential performance impacts and efficiently solving several main technical problems. Aiming to establish a new paradigm for the analysis and design of multihop D2D communications, in this article, we propose a dynamic graph optimization framework that enables the modeling of large-scale systems with multiple D2D pairs and node mobility patterns. By inherently modeling the main technological problems for multihop D2D communications, this framework benefits investigation of theoretical performance limits and studying the optimal system design. Furthermore, these achievable benefits are demonstrated by examples of simulations under a realistic multihop D2D communication underlaying cellular network.", "paper_title": "A DYNAMIC GRAPH OPTIMIZATION FRAMEWORK FOR MULTIHOP DEVICE-TO-DEVICE COMMUNICATION UNDERLAYING CELLULAR NETWORKS", "paper_id": "WOS:000344988400009"}