{"auto_keywords": [{"score": 0.04824341868882559, "phrase": "new_approach"}, {"score": 0.004141093507753515, "phrase": "resulting_membership_function"}, {"score": 0.0038510053729959074, "phrase": "design_flexibility"}, {"score": 0.0036621225944272256, "phrase": "membership_functions"}, {"score": 0.0033301694494391612, "phrase": "functional_form"}, {"score": 0.0030282147475402736, "phrase": "desired_discontinuity"}, {"score": 0.0027382040767844093, "phrase": "mackey-glass_time_series_prediction"}, {"score": 0.002574788013427524, "phrase": "nonlinear_system"}, {"score": 0.0025461386232786356, "phrase": "dead_zone"}, {"score": 0.0025178072071268534, "phrase": "uncertain_system_parameters"}, {"score": 0.002475898613632249, "phrase": "simulation_results"}, {"score": 0.0022013916728990564, "phrase": "parameter_changes"}, {"score": 0.002176887956041267, "phrase": "noisy_inputs"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Type-2 fuzzy logic systems", " Type-2 membership functions", " Footprint of uncertainty", " Fuzzy granule", " Granular type-2 membership functions"], "paper_abstract": "In this study, a new approach for the formation of type-2 membership functions is introduced. The footprint of uncertainty is formed by using rectangular type-2 fuzzy granules and the resulting membership function is named as granular type-2 membership function. This new approach provides more degrees of freedom and design flexibility in type-2 fuzzy logic systems. Uncertainties on the grades of membership functions can be represented independently for any region in the universe of discourse and free of any functional form. So, the designer could produce nonlinear, discontinuous or hybrid membership functions in granular formation and therefore could model any desired discontinuity and nonlinearity. The effectiveness of the proposed granular type-2 membership functions is firstly demonstrated by simulations done on noise corrupted Mackey-Glass time series prediction. Secondly, flexible design feature of granular type-2 membership functions is illustrated by modeling a nonlinear system having dead zone with uncertain system parameters. The simulation results show that type-2 fuzzy logic systems formed by granular type-2 membership functions have more modeling capabilities than the systems using conventional type-2 membership functions and they are more robust to system parameter changes and noisy inputs. (C) 2013 Elsevier B. V. All rights reserved.", "paper_title": "Granular type-2 membership functions: A new approach to formation of footprint of uncertainty in type-2 fuzzy sets", "paper_id": "WOS:000321494200026"}