{"auto_keywords": [{"score": 0.015584374765208468, "phrase": "wireless_sensor_networks"}, {"score": 0.015383509757808153, "phrase": "geographic_routing"}, {"score": 0.015185216056689228, "phrase": "gpsr"}, {"score": 0.010412755200503391, "phrase": "hvc_chart"}, {"score": 0.00481495049065317, "phrase": "hexagonal_virtual_coordinates"}, {"score": 0.0038862297330905836, "phrase": "overloaded_nodes"}, {"score": 0.003703611021999795, "phrase": "distributed_protocol"}, {"score": 0.0036553070575015344, "phrase": "hexagonal_virtual_coordinate"}, {"score": 0.003529543381704363, "phrase": "virtual_coordinate_system"}, {"score": 0.003468307771895994, "phrase": "hvc"}, {"score": 0.0032621183241997777, "phrase": "relative_coordinates"}, {"score": 0.003068166587650604, "phrase": "source_node"}, {"score": 0.0030148941188459987, "phrase": "auxiliary_routing_path"}, {"score": 0.0027863537694678094, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["geographic routing", " localization", " sensor networks"], "paper_abstract": "Using geographic routing, like GPSR, is efficient for ad hoc and wireless sensor networks, but it requires that nodes be aware of their physical positions. However, if there are holes in the network, routing across them using GPSR will lead to a lot of overloaded nodes on their boundaries. In this paper, we propose a distributed protocol, named hexagonal virtual coordinate (HVC), for constructing a virtual coordinate system. After the HVC is constructed, the nodes in the network will be aware of the relative coordinates among the landmarks through the HVC chart. Based on the HVC chart, a source node can find an auxiliary routing path (ARP) to indicate the direction of the journey from the source to the destination. Simulation results show that our protocol can support geographic routing efficiently, and the landmarks found by our protocol are uniformly located in the network even if some holes exist within it. In addition, our protocol is resilient to various network shapes and can find a load balancing routing path to the destination even if this path comes across holes in the network. Copyright (C) 2008 John Wiley & Sons, Ltd.", "paper_title": "Routing with hexagonal virtual coordinates in wireless sensor networks", "paper_id": "WOS:000269571000005"}