{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ict"}, {"score": 0.02306015116563921, "phrase": "school_purposes"}, {"score": 0.004556901872357751, "phrase": "enthusiastic_and_wholehearted_users"}, {"score": 0.004392565073466714, "phrase": "today's_schools"}, {"score": 0.004265354774450696, "phrase": "high_ict_access"}, {"score": 0.004234129588974058, "phrase": "low_use"}, {"score": 0.004096409451697279, "phrase": "student_attitudes"}, {"score": 0.003876719738482442, "phrase": "school_ict_use"}, {"score": 0.0038483286199081, "phrase": "underlying_perceptions"}, {"score": 0.003778253716938922, "phrase": "teacher's_role"}, {"score": 0.00373682045166829, "phrase": "desired_role"}, {"score": 0.002985988377995789, "phrase": "\"unimportant\"_assignments"}, {"score": 0.0029532175351058864, "phrase": "routine_homework"}, {"score": 0.0026446021865907197, "phrase": "schooling's_information-focused_agenda"}, {"score": 0.00241214634516517, "phrase": "apparent_disconnect"}, {"score": 0.0021520139248317333, "phrase": "knowledge_age"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Student-school disconnect", " Internet use", " Perceptions", " Schooling"], "paper_abstract": "Today's students are often portrayed in the literature as enthusiastic and wholehearted users of the Internet for school purposes, in contrast with today's schools, in which the situation is of high ICT access and low use. Via interviews with 25 post-primary students, this study examined student attitudes toward using the Internet for school purposes, revealing the reasoning behind patterns of after school ICT use and underlying perceptions of learning, the teacher's role and the desired role of ICT in schooling. Students were revealed to be ambivalent: they considered the Internet to be easy to use, reducing workload and \"fun\", but at the same time \"unreliable\", not \"serious\" enough, and not containing what they \"need to know\". Thus, they primarily used it for \"unimportant\" assignments such as routine homework. Students described their learning goal as getting required \"material\" into their heads and saw the teachers as an (almost) exclusive authority regarding this required body of information, in line with schooling's information-focused agenda and teacher-centered practices. They were also less than enthusiastic about the integration of ICT into their curriculum. Although there is no apparent disconnect between school and students, it is argued that school should change in order to capitalize on the affordances of ICT and to better prepare students for life in the knowledge age. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Using ICT for school purposes: Is there a student-school disconnect?", "paper_id": "WOS:000306582400006"}