{"auto_keywords": [{"score": 0.03410486464978696, "phrase": "flooding_protocol"}, {"score": 0.03180235962804797, "phrase": "reachability_threshold"}, {"score": 0.015719716506582538, "phrase": "dynamic_graphs"}, {"score": 0.012859943996736858, "phrase": "tight_bounds"}, {"score": 0.004783566236686538, "phrase": "edge-markovian_process"}, {"score": 0.004762756586252216, "phrase": "birth-rate_p"}, {"score": 0.004742037031399416, "phrase": "death-rate_q"}, {"score": 0.00419694341099978, "phrase": "probability_p"}, {"score": 0.003991573004760709, "phrase": "probability_q."}, {"score": 0.0038714978747718776, "phrase": "edge-markovian_graphs"}, {"score": 0.003821145000771815, "phrase": "basic_mechanism"}, {"score": 0.003586820212195076, "phrase": "previous_results"}, {"score": 0.0035634123517796746, "phrase": "clementi_et_al"}, {"score": 0.0034411173859735995, "phrase": "parsimonious_manner"}, {"score": 0.0031327834636704376, "phrase": "k_time_steps"}, {"score": 0.003038463765396354, "phrase": "first_time"}, {"score": 0.0029663459595885514, "phrase": "smallest_integer_k"}, {"score": 0.002858233829445778, "phrase": "k-active_flooding_protocol"}, {"score": 0.0027004376341701886, "phrase": "large_spectrum"}, {"score": 0.002601991568435386, "phrase": "flooding_time"}, {"score": 0.002373848491610552, "phrase": "multiplicative_constant"}, {"score": 0.0023327111167847463, "phrase": "optimal_time"}, {"score": 0.0022038636392166253, "phrase": "practical_and_efficient_manner"}, {"score": 0.002175152729495803, "phrase": "main_ingredient"}, {"score": 0.002137451256056503, "phrase": "reduction_lemma"}, {"score": 0.0021142196949781914, "phrase": "time_dependencies"}, {"score": 0.0021049977753042253, "phrase": "edge-markovian_dynamic_graphs"}], "paper_keywords": [""], "paper_abstract": "An edge-Markovian process with birth-rate p and death-rate q generates infinite sequences of graphs (G(0), G(1), G(2),...) with the same node set [n] such that G(t) is obtained from G(t-1) as follows: if e is not an element of E(G(t-1)) then e is an element of E(G(t)) with probability p, and if e is an element of E(G(t-1)) then e is not an element of E(G(t)) with probability q. In this paper, we establish tight bounds on the complexity of flooding in edge-Markovian graphs, where flooding is the basic mechanism in which every node becoming aware of an information at step t forwards this information to all its neighbors at all forthcoming steps t' > t. These bounds complete previous results obtained by Clementi et al. Moreover, we also show that flooding in dynamic graphs can be implemented in a parsimonious manner, so that to save bandwidth, yet preserving efficiency in term of simplicity and completion time. For a positive integer k, we say that the flooding protocol is k-active if each node forwards an information only during the k time steps immediately following the step at which the node receives that information for the first time. We define the reachability threshold for the flooding protocol as the smallest integer k such that, for any source s is an element of [n], the k-active flooding protocol from s completes (i.e., reaches all nodes), and we establish tight bounds for this parameter. We show that, for a large spectrum of parameters p and q, the reachability threshold is by several orders of magnitude smaller than the flooding time. In particular, we show that it is even constant whenever the ratio p/(p+q) exceeds log n/n. Moreover, we also show that being active for a number of steps equal to the reachability threshold (up to a multiplicative constant) allows the flooding protocol to complete in optimal time, i.e., in asymptotically the same number of steps as when being perpetually active. These results demonstrate that flooding can be implemented in a practical and efficient manner in dynamic graphs. The main ingredient in the proofs of our results is a reduction lemma enabling to overcome the time dependencies in edge-Markovian dynamic graphs.", "paper_title": "Parsimonious flooding in dynamic graphs", "paper_id": "WOS:000294683100004"}