{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_participation"}, {"score": 0.012232475799261044, "phrase": "system_success"}, {"score": 0.0073061454818560525, "phrase": "software_development"}, {"score": 0.006976161327842632, "phrase": "human_aspects"}, {"score": 0.00692262128415383, "phrase": "software_engineering"}, {"score": 0.004405779372462873, "phrase": "successful_software_system"}, {"score": 0.004206236029936448, "phrase": "information_systems"}, {"score": 0.0034672240102960644, "phrase": "systematic_mapping_study"}, {"score": 0.0034008496666026585, "phrase": "systematic_search"}, {"score": 0.0031968441980848436, "phrase": "first_author"}, {"score": 0.0031356295480964927, "phrase": "exclusion_criteria"}, {"score": 0.0030994630902300133, "phrase": "second_author"}, {"score": 0.002913483929932102, "phrase": "corresponding_papers"}, {"score": 0.0028798723050615788, "phrase": "sample_base"}, {"score": 0.0026043035241045394, "phrase": "empirical_evidence"}, {"score": 0.002486147565139633, "phrase": "structural_equation_models"}, {"score": 0.002410363090950055, "phrase": "positive_correlations"}, {"score": 0.002373339527491525, "phrase": "development_processes"}, {"score": 0.002292097733181405, "phrase": "user_involvement"}, {"score": 0.0022136307563123256, "phrase": "proposed_solutions"}, {"score": 0.00218807532188779, "phrase": "method_papers"}, {"score": 0.0021628142746829187, "phrase": "wide_variety"}], "paper_keywords": ["User participation", " User involvement", " Software development", " Systematic mapping study", " Literature review", " Meta analysis"], "paper_abstract": "User participation and involvement in software development are considered to be essential for a successful software system. Three research areas, human aspects of software engineering, requirements engineering, and information systems, study these topics from various perspectives. We think it is important to analyze user participation and involvement in software engineering comprehensively to encourage further research in this area. We investigate the evidence on effects of user participation and involvement on system success and we explore which methods are available in literature. A systematic mapping study was conducted. The systematic search yielded 3,698 hits, from which we identified 289 unique papers. These papers were reviewed by the first author based on inclusion and exclusion criteria. The second author validated the selection of papers by reviewing the reasons for exclusion and inclusion and the corresponding papers on a sample base. 58 of the 289 papers were selected (22 statistical survey and meta-study papers and 36 methods papers). Based on the empirical evidence of the surveys and meta-studies, we developed a meta-analysis of structural equation models. This overview demonstrates that most papers showed positive correlations between aspects of development processes (including user participation) and human aspects (including user involvement) and system success. The analysis of the proposed solutions from the method papers revealed a wide variety of user participation and involvement practices for most activities within software development.", "paper_title": "Understanding the Influence of User Participation and Involvement on System Success - a Systematic Mapping Study", "paper_id": "WOS:000348381800002"}