{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "neural_networks"}, {"score": 0.044111484437312214, "phrase": "time_series"}, {"score": 0.004777569299319633, "phrase": "non-uniform_embedding"}, {"score": 0.004648995193787914, "phrase": "granger_causality"}, {"score": 0.004594951819987416, "phrase": "challenging_problem"}, {"score": 0.004523865550323285, "phrase": "dynamical_system"}, {"score": 0.004250302819248558, "phrase": "dynamical_influences"}, {"score": 0.004087756756529841, "phrase": "model-free_one"}, {"score": 0.00390087996701589, "phrase": "granger"}, {"score": 0.0036505565334886227, "phrase": "relevant_features"}, {"score": 0.0034700069041302003, "phrase": "neural_network_approach"}, {"score": 0.0031721009574803127, "phrase": "model-free_and_model-based_approaches"}, {"score": 0.0027995677499976406, "phrase": "non-uniform_embedding_framework"}, {"score": 0.00243237365704391, "phrase": "traditional_granger_causality"}, {"score": 0.0024040357029838774, "phrase": "redundant_variables"}, {"score": 0.0021803388613879896, "phrase": "data_sets"}, {"score": 0.0021049977753042253, "phrase": "training_phase"}], "paper_keywords": ["Neural networks", " Granger causality", " Non-uniform embedding"], "paper_abstract": "A challenging problem when studying a dynamical system is to find the interdependencies among its individual components. Several algorithms have been proposed to detect directed dynamical influences between time series. Two of the most used approaches are a model-free one (transfer entropy) and a model-based one (Granger causality). Several pitfalls are related to the presence or absence of assumptions in modeling the relevant features of the data. We tried to overcome those pitfalls using a neural network approach in which a model is built without any a priori assumptions. In this sense this method can be seen as a bridge between model-free and model-based approaches. The experiments performed will show that the method presented in this work can detect the correct dynamical information flows occurring in a system of time series. Additionally we adopt a non-uniform embedding framework according to which only the past states that actually help the prediction are entered into the model, improving the prediction and avoiding the risk of overfitting. This method also leads to a further improvement with respect to traditional Granger causality approaches when redundant variables (i.e. variables sharing the same information about the future of the system) are involved. Neural networks are also able to recognize dynamics in data sets completely different from the ones used during the training phase. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Neural networks with non-uniform embedding and explicit validation phase to assess Granger causality", "paper_id": "WOS:000364160900015"}