{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "physical_experiment"}, {"score": 0.04331790253451432, "phrase": "physical_systems"}, {"score": 0.03968926893211486, "phrase": "experimental_procedures"}, {"score": 0.03712204009103205, "phrase": "turing_machines"}, {"score": 0.004473552224535518, "phrase": "physical_measurements"}, {"score": 0.0038115535592184438, "phrase": "algorithmic_nature"}, {"score": 0.0033471722682967046, "phrase": "experimental_oracles"}, {"score": 0.0031230216871739776, "phrase": "physical_experiments"}, {"score": 0.002939202022371694, "phrase": "newtonian_dynamics"}, {"score": 0.002718627370925435, "phrase": "computational_power"}, {"score": 0.0026951616152303373, "phrase": "polynomial_time_turing_machines"}, {"score": 0.0026603411931700556, "phrase": "experimental_oracle"}, {"score": 0.002637377202509382, "phrase": "non-uniform_complexity_classes"}, {"score": 0.0025145641652082164, "phrase": "experimental_procedure"}, {"score": 0.002315719347244451, "phrase": "new_form"}, {"score": 0.0022957232752482196, "phrase": "uncertainty_principle"}, {"score": 0.0022562464662197867, "phrase": "physical_quantities"}, {"score": 0.002227083991228041, "phrase": "simple_physical_experiments"}, {"score": 0.0021049977753042253, "phrase": "huge_class"}], "paper_keywords": [""], "paper_abstract": "We pose the following question: If a physical experiment were to be completely controlled by an algorithm, what effect would the algorithm have on the physical measurements made possible by the experiment? In a programme to study the nature of computation possible by physical systems, and by algorithms coupled with physical systems, we have begun to analyse: (i) the algorithmic nature of experimental procedures; and (ii) the idea of using a physical experiment as an oracle to Turing Machines. To answer the question, we will extend our theory of experimental oracles so that we can use Turing machines to model the experimental procedures that govern the conduct of physical experiments. First, we specify an experiment that measures mass via collisions in Newtonian dynamics and examine its properties in preparation for its use as an oracle. We begin the classification of the computational power of polynomial time Turing machines with this experimental oracle using non-uniform complexity classes. Second, we show that modelling an experimenter and experimental procedure algorithmically imposes a limit on what can be measured using equipment. Indeed, the theorems suggest a new form of uncertainty principle for our knowledge of physical quantities measured in simple physical experiments. We argue that the results established here are representative of a huge class of experiments.", "paper_title": "Limits to measurement in experiments governed by algorithms", "paper_id": "WOS:000284045100004"}