{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "label_cut"}, {"score": 0.014557807447864514, "phrase": "input_graph"}, {"score": 0.010602482151718308, "phrase": "label_cut_problem"}, {"score": 0.004642292792558686, "phrase": "natural_combinatorial_optimization_problem"}, {"score": 0.00429558848734449, "phrase": "sink_t"}, {"score": 0.004122604238556912, "phrase": "different_categories"}, {"score": 0.0036776458116294986, "phrase": "minimum_cardinality"}, {"score": 0.0036275736378775757, "phrase": "minimum_total_weight"}, {"score": 0.003433987036569199, "phrase": "labels_disconnects"}, {"score": 0.003325852346387272, "phrase": "first_non-trivial_approximation"}, {"score": 0.002821665457532259, "phrase": "np"}, {"score": 0.0025744696954056404, "phrase": "input_length"}, {"score": 0.0021049977753042253, "phrase": "incomparable_due_to_different_complexity_assumptions"}], "paper_keywords": ["Label cut", " Approximation algorithms", " Approximation hardness", " Combinatorial optimization"], "paper_abstract": "We investigate a natural combinatorial optimization problem called the Label Cut problem. Given an input graph G with a source s and a sink t, the edges of G are classified into different categories, represented by a set of labels. The labels may also have weights. We want to pick a subset of labels of minimum cardinality (or minimum total weight), such that the removal of all edges with these labels disconnects s and t. We give the first non-trivial approximation and hardness results for the Label Cut problem. Firstly, we present an O(root m)-approximation algorithm for the Label Cut problem, where m is the number of edges in the input graph. Secondly, we show that it is NP-hard to approximate Label Cut within 2(log1-1/loglogcnn) for any constant c < 1/2, where n is the input length of the problem. Thirdly, our techniques can be applied to other previously considered optimization problems. In particular we show that the Minimum Label Path problem has the same approximation hardness as that of Label Cut, simultaneously improving and unifying two known hardness results for this problem which were previously the best (but incomparable due to different complexity assumptions).", "paper_title": "Approximation and hardness results for label cut and related problems", "paper_id": "WOS:000286680700003"}