{"auto_keywords": [{"score": 0.04777539582166082, "phrase": "singapore"}, {"score": 0.00481495049065317, "phrase": "image_problem"}, {"score": 0.004760518730536645, "phrase": "hi-tech_libraries"}, {"score": 0.004248782702870078, "phrase": "information_profession"}, {"score": 0.004153207234462926, "phrase": "public_image"}, {"score": 0.004121826934975274, "phrase": "library_professionals"}, {"score": 0.0040444053843446326, "phrase": "extensive_use"}, {"score": 0.0036924762294207633, "phrase": "social_status"}, {"score": 0.0036645642553325215, "phrase": "education_level"}, {"score": 0.0036368625017975343, "phrase": "employment_opportunities"}, {"score": 0.0036093693971289754, "phrase": "income_level"}, {"score": 0.0034881908940439213, "phrase": "pre-tested_questionnaire"}, {"score": 0.003435643372146385, "phrase": "data_collection"}, {"score": 0.0031127970604842375, "phrase": "library_users"}, {"score": 0.0030311679447397725, "phrase": "flattering_image"}, {"score": 0.002798865807872575, "phrase": "library_work"}, {"score": 0.0027566738323014, "phrase": "higher_education"}, {"score": 0.0021049977753042253, "phrase": "information_professionals"}], "paper_keywords": ["librarians", " perception", " personality", " prejudice", " Singapore"], "paper_abstract": "Purpose - The objective of this paper is to investigate perceptions and stereotypes associated with the library and information profession and to determine whether the public image of library professionals has improved with the extensive use of ICT. Design/methodology/approach - The areas covered in this study include: perceptions of the nature of work performed by librarians, their personality traits, social status, education level, employment opportunities, income level, and contributions made to society. A pre-tested questionnaire was used for data collection. The data were collected at three academic and three public libraries in Singapore. A total of 214 individuals participated in this study. Findings - It was found that library users in Singapore do not have a flattering image of librarianship and perceived the status of librarians to be low as compared to certain other professions. They also believed that library work does not require higher education and is routine-based, easy, and boring work. On the one hand, the personality of a librarian was described as helpful, friendly, orderly, and polite; on the other hand, it was perceived to be a person who is bookish, boring, quiet, and conservatively dressed. Originality/value - The paper offers some suggestions for improving the image of library and information professionals in society.", "paper_title": "Image problem even haunts hi-tech libraries - Stereotypes associated with library and information professionals in Singapore", "paper_id": "WOS:000258536800004"}