{"auto_keywords": [{"score": 0.048443579436868375, "phrase": "program_schemes"}, {"score": 0.04808720830362055, "phrase": "npsb"}, {"score": 0.005164203052079423, "phrase": "asymptotic_probability"}, {"score": 0.00481495049065317, "phrase": "restricted_access"}, {"score": 0.004778166224008841, "phrase": "arrays"}, {"score": 0.004491678520807451, "phrase": "basic_assignments"}, {"score": 0.0035761182400032487, "phrase": "vectorized_lindstrom_logic"}, {"score": 0.0031599739264865554, "phrase": "ordered_structures"}, {"score": 0.0029589086332593674, "phrase": "finite_structures"}, {"score": 0.002913483929932102, "phrase": "complexity-theoretic_question"}, {"score": 0.00288010714380628, "phrase": "np"}, {"score": 0.0028576984332494386, "phrase": "pspace"}, {"score": 0.002707033618304716, "phrase": "equivalent_statements"}, {"score": 0.002429090371567499, "phrase": "infinite_hierarchy"}, {"score": 0.0022136307563123256, "phrase": "resulting_hierarchy"}, {"score": 0.00218807532188779, "phrase": "complexity_classes"}], "paper_keywords": ["Finite model theory", " descriptive complexity", " program schemes"], "paper_abstract": "We study a class of program schemes, NPSB, in which, aside from basic assignments, non-deterministic guessing and while loops, we have access to arrays; but where these arrays are binary write-once in that they are initialized to 'zero' and can only ever be set to 'one'. We show, amongst other results, that: NPSB can be realized as a vectorized Lindstrom logic; there are problems accepted by program schemes of NPSB that are not definable in the bounded-variable infinitary logic L(infinity omega)(omega); all problems accepted by the program schemes of NPSB have asymptotic probability 1 and on ordered structures, NPSB captures the complexity class L(NP). We give equivalences (on the class of all finite structures) of the complexity-theoretic question 'Does NP equal PSPACE?', where the logics and classes of program schemes involved in the equivalent statements define or accept only problems with asymptotic probability 0 or 1 and so do not cover many computationally trivial problems. The class of program schemes NPSB is actually the union of an infinite hierarchy of classes of program schemes. Finally, when we amend the semantics of our program schemes slightly, we find that the classes of the resulting hierarchy capture the complexity classes Sigma(p)(i) (where i >= 2) of the Polynomial Hierarchy PH.", "paper_title": "Logical and Complexity-theoretic Aspects of Models of Computation with Restricted Access to Arrays", "paper_id": "WOS:000262721500014"}