{"auto_keywords": [{"score": 0.044267980341416414, "phrase": "benchmark_data_sets"}, {"score": 0.014846770381303971, "phrase": "spatial_statistics"}, {"score": 0.00481495049065317, "phrase": "benchmark_data"}, {"score": 0.004667541072056214, "phrase": "virtual_screening_methods"}, {"score": 0.004484596684703308, "phrase": "common_finding"}, {"score": 0.004405596416783185, "phrase": "ligand-based_virtual_screening_methods"}, {"score": 0.004048860957751714, "phrase": "specific_effects"}, {"score": 0.003770869401884267, "phrase": "data_sets"}, {"score": 0.0036390887584943723, "phrase": "data_sets'_representation"}, {"score": 0.0031006232333900055, "phrase": "arbitrary_distributions"}, {"score": 0.003073154478201771, "phrase": "descriptor_values"}, {"score": 0.0029133627624098064, "phrase": "virtual_screening_performance"}, {"score": 0.0028875481626754696, "phrase": "different_data_sets"}, {"score": 0.0027495914857929584, "phrase": "better_virtual_screening_performance"}, {"score": 0.002123831297790248, "phrase": "future_design"}, {"score": 0.0021049977753042253, "phrase": "unbiased_benchmark_data_sets"}], "paper_keywords": [""], "paper_abstract": "A common finding of many reports evaluating ligand-based virtual screening methods is that validation results vary considerably with changing benchmark data sets. It is widely assumed that these data set specific effects are caused by the redundancy, self- similarity, and cluster structure inherent to those data sets. These phenomena manifest themselves in the data sets' representation in descriptor space, which is termed the data set topology. A methodology for the characterization of data set topology based on spatial statistics is introduced. The method is nonparametric and can deal with arbitrary distributions of descriptor values. With this methodology it is possible to associate differences in virtual screening performance on different data sets with differences in data set topology. Moreover, the better virtual screening performance of certain descriptors can be explained by their ability of representing the benchmark data sets by a more favorable topology. Finally it is shown, that the composition of some benchmark data sets causes topologies that lead to overoptimistic validation results even in very \"simple\" descriptor spaces. Spatial statistics analysis as proposed here facilitates the detection of such biased data sets and may provide a tool for the future design of unbiased benchmark data sets.", "paper_title": "Impact of benchmark data set topology on the validation of virtual screening methods: Exploration and quantification by spatial statistics", "paper_id": "WOS:000255448400002"}