{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bias"}, {"score": 0.004740126725341152, "phrase": "evaluation_systems"}, {"score": 0.004630055463858585, "phrase": "real_life"}, {"score": 0.004469700997700534, "phrase": "online_evaluation"}, {"score": 0.0044002186469797476, "phrase": "important_feature"}, {"score": 0.0039122637074546895, "phrase": "evaluation_settings"}, {"score": 0.0036457672198249333, "phrase": "evaluation_analysis"}, {"score": 0.003561017335579207, "phrase": "fair_reviews"}, {"score": 0.0032539388572032563, "phrase": "potential_\"bias"}, {"score": 0.0031907572162427978, "phrase": "\"controversy\"of_objects"}, {"score": 0.0031534367609709233, "phrase": "statistical_approach"}, {"score": 0.0029384777371425862, "phrase": "equal_weight"}, {"score": 0.002622465142275264, "phrase": "varying_bias"}, {"score": 0.0021049977753042253, "phrase": "real-life_and_synthetic_data_sets"}], "paper_keywords": ["bias", " controversy", " evaluation", " rating", " link analysis", " social network mining"], "paper_abstract": "Evaluation is prevalent in real life. With the advent of Web 2.0, online evaluation has become an important feature in many applications that involve information (e. g., video, photo, and audio) sharing and social networking (e. g., blogging). In these evaluation settings, a set of reviewers assign scores to a set of objects. As part of the evaluation analysis, we want to obtain fair reviews for all the given objects. However, the reality is that reviewers may deviate in their scores assigned to the same object, due to the potential \"bias\" of reviewers or \"controversy\"of objects. The statistical approach of averaging deviations to determine bias and controversy assumes that all reviewers and objects should be given equal weight. In this paper, we look beyond this assumption and propose an approach based on the following observations: 1) evaluation is \"subjective,\"as reviewers and objects have varying bias and controversy, respectively, and 2) bias and controversy are mutually dependent. These observations underlie our proposed reinforcement-based model to determine bias and controversy simultaneously. Our approach also quantifies \"evidence,\"which reveals the degree of confidence with which bias and controversy have been derived. This model is shown to be effective by experiments on real-life and synthetic data sets.", "paper_title": "Bias and controversy in evaluation systems", "paper_id": "WOS:000259259600004"}