{"auto_keywords": [{"score": 0.049655608595442415, "phrase": "web_sites"}, {"score": 0.00481495049065317, "phrase": "mps'_use"}, {"score": 0.004066898031169739, "phrase": "extensive_review"}, {"score": 0.004013025478863664, "phrase": "relevant_literature"}, {"score": 0.003754140294151593, "phrase": "web_site"}, {"score": 0.003389136094439662, "phrase": "liberal_democrats'_web_sites"}, {"score": 0.0032852337992126564, "phrase": "main_reason"}, {"score": 0.0028366012006726896, "phrase": "growing_interest"}, {"score": 0.002811464848641341, "phrase": "interactive_web_sites"}, {"score": 0.002438219695507928, "phrase": "mps"}, {"score": 0.002321665383971456, "phrase": "mps'_web_sites"}, {"score": 0.0021049977753042253, "phrase": "latest_such_survey"}], "paper_keywords": ["Worldwide web", " Parliament", " Internet", " Politics", " United Kingdom"], "paper_abstract": "Purpose - The purpose of this paper is to evaluate the content and usability of a sample of 50 UK MPs' web sites. Design/methodology/approach - Score sheets were developed for the evaluation of web sites based on an extensive review of the relevant literature. In addition, a questionnaire was sent to all MPs who had a web site at the time of the research. Findings - The web sites in general scored poorly in terms of content and usability. Liberal Democrats' web sites scored the highest overall. The main reason why MPs set up web sites was to improve communications with their constituents. However, many MPs had problems finding the time and funds to set up and maintain their web sites. There is a growing interest in interactive web sites. Research limitations/implications - Not every MP's web site was evaluated, nor was every MP approached regarding their attitude to web sites. Practical implications - A series of recommendations on how MPs can improve their web sites is provided. It is clear that MPs' web sites are a long way from being ideal. Funding is-Lies need to be addressed. Originality/value - This is the latest such survey for a number of years.", "paper_title": "MPs online: an evaluative study of MPs' use of web sites", "paper_id": "WOS:000206467300006"}