{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "conjugated_trees"}, {"score": 0.015404416953417363, "phrase": "sixth-minimal_energies"}, {"score": 0.004882280490267727, "phrase": "total_ordering"}, {"score": 0.004653339900995785, "phrase": "simple_graph_g"}, {"score": 0.004466519142879166, "phrase": "absolute_values"}, {"score": 0.004346139434813299, "phrase": "conjugated_tree"}, {"score": 0.004243460284890507, "phrase": "perfect_matching"}, {"score": 0.0040869663676860535, "phrase": "minimal_and_second-minimal_energies"}, {"score": 0.004031580094588335, "phrase": "zhang"}, {"score": 0.004004251315207803, "phrase": "li"}, {"score": 0.0038563438670516127, "phrase": "third-_and_fourth-minimal_energies"}, {"score": 0.003516417950483685, "phrase": "s._li"}, {"score": 0.0034924598001567944, "phrase": "n._li"}, {"score": 0.0025848074189353397, "phrase": "common_used_method"}, {"score": 0.002497862210672172, "phrase": "concerned_tree"}, {"score": 0.0021049977753042253, "phrase": "well-known_coulson_integral_formula"}], "paper_keywords": [""], "paper_abstract": "For a simple graph G, the energy E(G) is defined as the sum of the absolute values of all eigenvalues of its adjacency matrix. A conjugated tree is a tree that has a perfect matching. The conjugated trees F(n) and B(n) with the minimal and second-minimal energies were determined by Zhang and Li. They also figured out that the conjugated trees with the third- and fourth-minimal energies are L(n) or M(n) However, they could not determine which is the third, and the other is the fourth. Recently, S. Li and N. Li further investigated the conjugated trees with the third-, through the sixth-minimal energies. As a result, they figured out that these trees must be among the trees L(n), M(n), I(n) and W(n/2)*. They then showed that the energy of M(n) is smaller than that of I(n), and the energy of L(n) is smaller than that of W(n/2)*, but they could not give a total ordering of the 4 trees. For comparing of the energies, a common used method is to compare the number of k-matchings in each concerned tree, but it is often invalid for further comparing. This paper is aimed at solving the above unsolved problems by giving the energies of the 4 trees a total ordering, that is, completely determining the conjugated trees with the third-, forth-, fifth- and sixth-minimal energies. Our method uses the well-known Coulson integral formula.", "paper_title": "Determining the Conjugated Trees with the Third- through the Sixth-Minimal Energies", "paper_id": "WOS:000289039800017"}