{"auto_keywords": [{"score": 0.044166789866793905, "phrase": "lcc"}, {"score": 0.004517210371632577, "phrase": "docking_calculations"}, {"score": 0.004313643010028869, "phrase": "outer_vestibule"}, {"score": 0.004267978415344142, "phrase": "selective_filter"}, {"score": 0.004163290958633733, "phrase": "professor_lipkind"}, {"score": 0.004075596668736259, "phrase": "transmembrane_segments"}, {"score": 0.0031901665168365357, "phrase": "probably_could_be_lcc_blockers"}, {"score": 0.003089807081149136, "phrase": "glutamic_acid_residues"}, {"score": 0.0028984332556216946, "phrase": "lcc_selectivity_region"}, {"score": 0.00257775722777195, "phrase": "theoretically_calculated_dissociation_constants"}, {"score": 0.0021049977753042253, "phrase": "lcc_blockers"}], "paper_keywords": ["L-type protein Ca2+ channel", " Docking", " Epilepsy", " Isoindolines", " alpha-Amino acids"], "paper_abstract": "Two series of isoindolines 1(a-g) and 2(a-g) were found by docking calculations to be possible L-type Ca2+ channel (LCC) blockers. The theoretical 3-D model of the outer vestibule and the selective filter of the LCC was provided by Professor Lipkind; this model consists of transmembrane segments S5 and S6 and P-loops contributed by each of four repeats (I, II, III, and IV) of Ca-v 1.2. Therefore, two well-known LCC blockers, nifedipine 3 and (R)-ethosuccinimide 4 were also evaluated, and their binding sites on the LCC were identified and compared with those obtained for 1(a-g) and 2(a-g). Analysis of the results shows that the target compounds tested probably could be LCC blockers, since they interact with or near the glutamic acid residues Glu393, Glu736, Glu1145 and Glu1446 (the EEEE locus), which belong to the LCC selectivity region. The Delta G values for all of the Ca2+ channel ligands are between-10.78 and -3.67 (kcal mol(-1)), showing that LCC-1b, -1e and -1f complexes are more stable than the other compounds tested. Therefore, theoretically calculated dissociation constants K-d (mu M) were obtained for all compounds. Comparing these values reveals that compounds 1b (0.0244 mu M), le (0.0176 mu M) and 1f (0.0125 mu M) exhibit more affinity for the LCC than the other compounds. This screening shows that the two series of isoindolines probably could act as LCC blockers.", "paper_title": "Molecular modeling study of isoindolines as L-type Ca2+ channel blockers by docking calculations", "paper_id": "WOS:000280345500008"}