{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "video_images"}, {"score": 0.03214451849838985, "phrase": "feature_space"}, {"score": 0.004559270778306828, "phrase": "moving_object"}, {"score": 0.004300310127339099, "phrase": "fourier_descriptors"}, {"score": 0.004200874581076468, "phrase": "smooth_features"}, {"score": 0.004152018764100109, "phrase": "resulting_image"}, {"score": 0.003993216345115755, "phrase": "f-n"}, {"score": 0.003870541730075597, "phrase": "different_orientations"}, {"score": 0.003693533648584145, "phrase": "local_lie_group"}, {"score": 0.0031351720217878917, "phrase": "smooth_injection"}, {"score": 0.002702887319160534, "phrase": "rigid_objects"}, {"score": 0.0024610448251906453, "phrase": "different_views"}, {"score": 0.0024040357029838774, "phrase": "naive_interpolations"}, {"score": 0.002357535807803925, "phrase": "erroneous_results"}, {"score": 0.0021049977753042253, "phrase": "synthetic_images"}], "paper_keywords": ["image analysis", " curves in images", " manifolds", " lie groups"], "paper_abstract": "Suppose we take a set of images obtained from videophotography of a moving object in three dimensions, such as an aeroplane, and that we compute moments or fourier descriptors, or some other set of smooth features of the resulting image, to get a vector in a feature space F-n which describes the image. Then the different orientations and positions of the object in space are generated by a local Lie group, a neighbourhood of the identity in the group SE(3), and provided we compute enough moments or other descriptors, i.e. provided n is big enough, and provided the object is not symmetric, the result is to give a smooth injection of this group of transformations into the feature space. The value of n which is 'big enough' is almost always 2d + 1, where d is the dimension of the group, which for rigid objects under translation and rotation is six. This result has applications to object recognition in video images and to the problem of interpolating between different views of an object, as naive interpolations in the Feature space give erroneous results. It extends to moving objects with more degrees of freedom such as robots. In this paper we state and prove the above result formally and illustrate it with synthetic images of a 'robot'.", "paper_title": "Lie group transformations of objects in video images", "paper_id": "WOS:000242326600006"}