{"auto_keywords": [{"score": 0.03854928587050201, "phrase": "directstream"}, {"score": 0.03242091413086263, "phrase": "amdirectory_service"}, {"score": 0.00481495049065317, "phrase": "challenging_task"}, {"score": 0.004772137871562584, "phrase": "recent_works"}, {"score": 0.00470862827326028, "phrase": "peer-to-peer_networking"}, {"score": 0.004543352284098364, "phrase": "scalability_issues"}, {"score": 0.004403480614319231, "phrase": "peer-to-peer_video_streaming"}, {"score": 0.0033376244286643176, "phrase": "video-on-demand_service"}, {"score": 0.003163212007747804, "phrase": "application-level_multicast_based_directory_service"}, {"score": 0.002957919048133256, "phrase": "system_performance"}, {"score": 0.0028795712616923462, "phrase": "proposed_scheme"}, {"score": 0.002778317177178732, "phrase": "origin_server"}, {"score": 0.002574788013427524, "phrase": "participating_clients"}, {"score": 0.002364865100579589, "phrase": "large_number"}, {"score": 0.0023437863565921053, "phrase": "concurrent_users"}, {"score": 0.0022613292987262177, "phrase": "basic_vcr_operations"}, {"score": 0.002221192647477371, "phrase": "continuous_playback"}, {"score": 0.002162316557411786, "phrase": "users'_early_departures"}], "paper_keywords": ["peer-to-peer", " video-on-demand service", " VCR operation"], "paper_abstract": "Providing video streaming service over the Internet is a challenging task. Recent works show that peer-to-peer networking is a promising technique to address the scalability issues faced by video streaming service. Peer-to-peer video streaming allows users distributed across the Internet to collaborate and bring computation and storage resources into the system, hence reducing the workload placed on the server and increasing the number of clients served. In this paper, we propose DirectStream, a directory-based peer-to-peer video streaming service that efficiently and cost-effectively provides video-on-demand service with VCR operation support. In addition, we develop an application-level multicast based directory service tailored for DirectStream, known as AMDirectory service. We analytically and experimentally examine the system performance, and show that the proposed scheme significantly reduces the workload posed on the origin server, and that it scales extremely well as the popularity of the video increases even if participating clients behave non-cooperatively. Furthermore, AMDirectory service allows DirectStream to perform well in the face of a large number of concurrent users. We also discuss how DirectStream supports basic VCR operations, and provides continuous playback in the presence of the users' early departures and bandwidth starvation. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "DirectStream: A directory-based peer-to-peer video streaming service", "paper_id": "WOS:000258464100008"}