{"auto_keywords": [{"score": 0.049571431541439726, "phrase": "real-world_resources"}, {"score": 0.00481495049065317, "phrase": "multi-attribute_resource_discovery"}, {"score": 0.0043511221096418475, "phrase": "cloud_computing"}, {"score": 0.0042820680211904235, "phrase": "resource_discovery"}, {"score": 0.004147216579100177, "phrase": "aggregate_groups"}, {"score": 0.0038487848937121204, "phrase": "specific_characteristics"}, {"score": 0.0031255543155487234, "phrase": "fundamental_design_choices"}, {"score": 0.002824005136794786, "phrase": "uniform_queries"}, {"score": 0.002794001681064862, "phrase": "real-world_queries"}, {"score": 0.0024842242921857705, "phrase": "available_attributes"}, {"score": 0.0024578219177450876, "phrase": "large_ranges"}, {"score": 0.002431699464104896, "phrase": "attribute_values"}, {"score": 0.00232995025271599, "phrase": "significant_load_balancing_issues"}, {"score": 0.0021049977753042253, "phrase": "rd_solutions"}], "paper_keywords": ["Design", " Measurement", " Performance", " Multi-attribute queries", " multi-attribute resources", " peer-to-peer", " resource discovery", " simulation"], "paper_abstract": "Collaborative peer-to-peer (P2P), grid, and cloud computing rely on resource discovery (RD) solutions to aggregate groups of multi-attribute, dynamic, and distributed resources. However, specific characteristics of real-world resources and queries, and their impact on P2P-based RD, are largely unknown. We analyze the characteristics of resources and queries using data from four real-world systems. These characteristics are then used to qualitatively and quantitatively evaluate the fundamental design choices for P2P-based multi-attribute RD. The datasets exhibit several noteworthy features that affect the performance. For example, compared to uniform queries, real-world queries are relatively easier to resolve using unstructured, superpeer, and single-attribute-dominated query-based structured P2P solutions, as queries mostly specify only a small subset of the available attributes and large ranges of attribute values. However, all the solutions are prone to significant load balancing issues, as the resources and queries are highly skewed and correlated. The implications of our findings for improving RD solutions are also discussed.", "paper_title": "P2P-Based, Multi-Attribute Resource Discovery under Real-World Resources and Queries", "paper_id": "WOS:000351020400005"}