{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_synthesis"}, {"score": 0.04897776997473009, "phrase": "supervisory_policies"}, {"score": 0.03233379446302989, "phrase": "minimally_restrictive_lesp"}, {"score": 0.00475924837336259, "phrase": "minimally_restrictive_liveness"}, {"score": 0.004569293780076254, "phrase": "general_petri_net_models"}, {"score": 0.004114787982556699, "phrase": "petri_net"}, {"score": 0.003950453462399077, "phrase": "automated_manufacturing_systems"}, {"score": 0.003129317057177867, "phrase": "larger_marking"}, {"score": 0.002536926192232391, "phrase": "unique_minimally_restrictive_lesp"}, {"score": 0.0023792975669318615, "phrase": "relevant_theory"}, {"score": 0.0022974765563692776, "phrase": "implementation_details"}, {"score": 0.0021049977753042253, "phrase": "aforementioned_class"}], "paper_keywords": ["Automated manufacturing systems", " Service enterprise systems", " Petri nets", " Supervisory control"], "paper_abstract": "We consider liveness enforcing supervisory policies (LESPs) for a class of Petri net (PN) structures that model automated manufacturing systems that are prone to livelocks. This class is identified by the property that the existence of an LESP for an instance initialized with a marking implies the existence of an LESP when the same instance is initialized with a larger marking. If a minimally restrictive LESP prevents the occurrence of a transition at some marking for an instance, then every LESP for the instance should prevent the occurrence of the transition for the same marking. There is a unique minimally restrictive LESP for a PN that has an LESP. After reviewing the relevant theory, this paper describes the implementation details of a procedure for the automatic synthesis of the minimally restrictive LESP for any instance from the aforementioned class.", "paper_title": "A software tool for the automatic synthesis of minimally restrictive liveness enforcing supervisory policies for a class of general Petri net models of manufacturing- and service-systems", "paper_id": "WOS:000361486200010"}