{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "user_perspectives"}, {"score": 0.004740476936977635, "phrase": "message_design"}, {"score": 0.004703671193348433, "phrase": "software_update_messages"}, {"score": 0.004559270778306828, "phrase": "software_updates"}, {"score": 0.004523865550323285, "phrase": "recent_bug_fixes"}, {"score": 0.004384960761826366, "phrase": "recommended_actions"}, {"score": 0.0038255128976509545, "phrase": "prior_study"}, {"score": 0.00373701482510911, "phrase": "users_opinions"}, {"score": 0.0035383712891119937, "phrase": "software_update_message_design_features"}, {"score": 0.0032220148724914867, "phrase": "user_study"}, {"score": 0.003015143226706584, "phrase": "online_survey"}, {"score": 0.0027995677499976406, "phrase": "perceived_importance"}, {"score": 0.0026299995767138304, "phrase": "multiple_themes"}, {"score": 0.0025292620341476283, "phrase": "inductive_coding"}, {"score": 0.002470676601347937, "phrase": "underlying_themes"}, {"score": 0.0024418934977061876, "phrase": "multiple_iterations"}, {"score": 0.002422890839801611, "phrase": "positive_comments"}, {"score": 0.0022939396079753463, "phrase": "negative_comments"}, {"score": 0.0021049977753042253, "phrase": "design_features"}], "paper_keywords": ["Update message design", " Affective-cognitive design", " User opinions", " User experiences"], "paper_abstract": "Software update messages are commonly used to inform users about software updates, recent bug fixes, and various system vulnerabilities, and to suggest recommended actions (e.g., updating software). While various design features (e.g., update options, message layout, update message presentation) of these messages can influence the actions taken by users, no prior study can be found that investigated users opinions regarding various design alternatives. To address this void, this paper focuses on identifying software update message design features (e.g., layout, color, content) that may affect users positively or negatively. Toward that, we conducted a user study where users are shown 13 software update messages along with 1 virus warning message. We collect responses from 155 users through an online survey. Participants gave a total of 809 positive comments and 866 negative comments along with ranking of each image in terms of perceived importance, noticeability, annoyance and confusion. As many of the comments are repetitive and often contain multiple themes, we manually analyzed and performed a bottom-up, inductive coding to identify and refine the underlying themes. Over multiple iterations, positive comments were grouped into 52 categories which were subsequently grouped under four themes. Similarly, negative comments were first grouped into 38 categories which were subsequently grouped under four themes. Based on our analysis, we present the list of design features that are found to be highly correlated to confusion, annoyance, noticeability, and importance, either positively or negatively.", "paper_title": "How does this message make you feel? A study of user perspectives on software update/warning message design", "paper_id": "WOS:000370182300002"}