{"auto_keywords": [{"score": 0.04983229325348715, "phrase": "mobile_awareness_systems"}, {"score": 0.00481495049065317, "phrase": "mobile_awareness_cues"}, {"score": 0.0046081792329894, "phrase": "group_practices"}, {"score": 0.004549063619065006, "phrase": "social_interaction"}, {"score": 0.004297795905522757, "phrase": "remote_person"}, {"score": 0.004220782530243866, "phrase": "everyday_social_interactions"}, {"score": 0.0041773934798743405, "phrase": "a-b_intervention_research_methodology"}, {"score": 0.004102528738941734, "phrase": "teenager_groups"}, {"score": 0.003936389070602614, "phrase": "slightly_different_variation"}, {"score": 0.003916098498242888, "phrase": "contextcontacts"}, {"score": 0.003595956414995911, "phrase": "surprisingly_large_variety"}, {"score": 0.0034951469511975346, "phrase": "expected_\"place"}, {"score": 0.003234299589505403, "phrase": "user's_preknowledge"}, {"score": 0.0031762825024008994, "phrase": "interpersonal_uses"}, {"score": 0.0030083825666563898, "phrase": "compensatory_coordination"}, {"score": 0.002954405982925685, "phrase": "other's_current_state"}, {"score": 0.0026639833720047126, "phrase": "positive_effect"}, {"score": 0.002643386043540555, "phrase": "success_rate"}, {"score": 0.0026297428083782875, "phrase": "communication_attempts"}, {"score": 0.0025035845415603904, "phrase": "user-controlled_text_field"}, {"score": 0.002471400498582011, "phrase": "additional_cue"}, {"score": 0.002328588996633081, "phrase": "automatic_cues"}, {"score": 0.002251542790734307, "phrase": "presence_inferences"}, {"score": 0.002165798731600657, "phrase": "group_members"}, {"score": 0.0021434891524381196, "phrase": "mediated_connectedness"}], "paper_keywords": [""], "paper_abstract": "Mobile awareness systems provide user-controlled and automatic, sensor-derived cues of other users' situations and in that way attempt to facilitate group practices and provide opportunities for social interaction. We are interested in investigating how users interpret these cues as a situation, action, or intention of a remote person and then act on them in everyday social interactions. Three field trials utilizing A-B intervention research methodology were conducted with three types of teenager groups (N = 15, total days = 243). Each trial had a slightly different variation of ContextContacts-a smartphone-based multicue mobile awareness system. We report on several analyses on how the cues were accessed, viewed, monitored, inferred, and acted on. A surprisingly large variety of inferences was enabled by the cues, transcending the expected \"place,\" \"availability,\" and \"activity.\" The findings indicate that inferences are based mainly on 1 to 3 cues at a time and draw heavily on the user's preknowledge about the other person. Three kinds of interpersonal uses are argued. First, the inferences participate in the coordination of mobility and communication, typically between two users. Compensatory coordination is supported by inferences of the other's current state or situation (e.g., not being available due to attendance at a class) and anticipatory coordination by inferences of intentions and plans. The participants looked at the cues just before placing a call, and a positive effect on the success rate of communication attempts was observed in one user group. The cues also facilitate various ad hoc opportunities and informal encounters. Second, when a user-controlled text field was introduced as an additional cue, the use of the system evolved from coordination toward discussion, chatting, and expressions of emotions. The use of automatic cues evolved in parallel, emphasizing those cues that support availability and the presence inferences needed in the coordination of conversations. Third, the cues support companionship among group members: feelings of mediated connectedness, closeness, and communality. Several recurring issues in the design of mobile awareness systems are addressed in the light of the findings.", "paper_title": "Interpreting and acting on mobile awareness cues", "paper_id": "WOS:000247246700004"}