{"auto_keywords": [{"score": 0.04810529694345783, "phrase": "wavelength_conversion"}, {"score": 0.04706032489289727, "phrase": "all-_optical_routing"}, {"score": 0.0367698002611785, "phrase": "wavelength_conversions"}, {"score": 0.00481495049065317, "phrase": "constraint-aware_adaptive_routing"}, {"score": 0.004778405811919196, "phrase": "wdm"}, {"score": 0.004652016085325825, "phrase": "negative_impact"}, {"score": 0.003991774582021095, "phrase": "noise_deterioration"}, {"score": 0.0038862297330905836, "phrase": "signal_quality"}, {"score": 0.003683407561208816, "phrase": "original_data"}, {"score": 0.0035997452281985465, "phrase": "upper_bound"}, {"score": 0.0030530895634491343, "phrase": "previous_performance_evaluation_studies"}, {"score": 0.002938317647182056, "phrase": "static_and_dynamic_routing_and_wavelength-_assignment_algorithms"}, {"score": 0.00283870598459543, "phrase": "cascading_constraints"}, {"score": 0.002290291401956985, "phrase": "proposed_algorithms"}, {"score": 0.0021539955106204354, "phrase": "full_and_sparse_wavelength_conversion"}, {"score": 0.0021049977753042253, "phrase": "optical_society_of_america"}], "paper_keywords": [""], "paper_abstract": "We examine the negative impact of wavelength conversion cascading on the performance of all- optical routing. When data in a circuit- switched connection are routed all optically from source to destination, each wavelength conversion performed along the lightpath of the connection causes some signal- to-noise deterioration. If the distortion of the signal quality becomes significant enough, the receiver would not be able to recover the original data. There is therefore an upper bound ( threshold) on the number of wavelength conversions that a signal can go through when it is switched optically from its source to its destination. This constraint, which we refer to as the conversion cascading constraint, has largely been ignored by previous performance evaluation studies on all- optical routing. We proceed to show that existing static and dynamic routing and wavelength- assignment algorithms largely fail in the presence of the conversion cascading constraints. We then propose two constraint-aware dynamic algorithms: The first, greedy constraint- aware routing algorithm, minimizes the number of wavelength conversions for each connection establishing, and the second, weighted adaptive constraint- aware routing ( W- ACAR) algorithm, considers the distribution of free wavelengths, the length of each route, and the conversion cascading constraints, jointly. The results conclusively demonstrate that the proposed algorithms, especially W- ACAR, can achieve much better blocking performance in the environment of full and sparse wavelength conversion. (C) 2007 Optical Society of America.", "paper_title": "Conversion cascading constraint-aware adaptive routing for WDM optical networks", "paper_id": "WOS:000249044200003"}