{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_play"}, {"score": 0.04927465911141675, "phrase": "digital_games"}, {"score": 0.01045741233683218, "phrase": "social_setting"}, {"score": 0.004499334809770281, "phrase": "multi-player_settings"}, {"score": 0.004012751049253625, "phrase": "key_components"}, {"score": 0.0039620308501590795, "phrase": "gaming_experience"}, {"score": 0.003928572641266562, "phrase": "existing_literature"}, {"score": 0.0034886660821793576, "phrase": "social_situation"}, {"score": 0.002821685815956478, "phrase": "co-located_person"}, {"score": 0.002526780881314497, "phrase": "significant_difference"}, {"score": 0.0023708445073819277, "phrase": "previous_claims"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Digital games", " Immersion", " Social play", " Social presence", " Gaming experience"], "paper_abstract": "The majority of digital games available today offer a variety of multi-player settings including co-located and mediated play between opponents. Immersion, the sense of being \"in the game,\" is one of the key components of the gaming experience but existing literature suggests that social play. provides more fun but less immersion. There is however little empirical support for this. This paper therefore addresses the question: how does playing digital games in a social situation alter the sense of immersion felt by the individuals playing? This paper presents three experiments that test the relationship between social setting and immersion. The three experiments aim to manipulate the social setting in which players play, be it against a computer, against a person online or against a co-located person. Overall the three experiments show that players are more immersed when playing against another person rather than playing against a computer but there is no significant difference in immersion whether the other person is online or in the same room. This refutes previous claims about social play reducing immersion and indeed that social play enhances the sense of being in the game where interaction is through the game. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Who but not where: The effect of social play on immersion in digital games", "paper_id": "WOS:000326210500005"}