{"auto_keywords": [{"score": 0.04917227522621455, "phrase": "traitor_tracing"}, {"score": 0.04437825901136091, "phrase": "score_system"}, {"score": 0.033019874669474196, "phrase": "interleaving_attack"}, {"score": 0.00481495049065317, "phrase": "collusion_resistant_watermarking"}, {"score": 0.004652016085325825, "phrase": "bias-based_traitor_tracing_codes"}, {"score": 0.004581421266968065, "phrase": "tardos"}, {"score": 0.004477407179841716, "phrase": "ongoing_effort"}, {"score": 0.004426308135681733, "phrase": "efficient_high-performance_decoders"}, {"score": 0.004195418010131832, "phrase": "hypothesis_test"}, {"score": 0.003916098498242888, "phrase": "previous_work"}, {"score": 0.003797978200741566, "phrase": "code_matrix"}, {"score": 0.0036553070575015344, "phrase": "simple_decoders"}, {"score": 0.003627425005023122, "phrase": "neyman-pearson"}, {"score": 0.0035179764329354877, "phrase": "single_user"}, {"score": 0.003398780792129312, "phrase": "neyman-pearson_score"}, {"score": 0.003334309053314909, "phrase": "attack_strategy"}, {"score": 0.003006654007926993, "phrase": "bias-based_traitor_tracing"}, {"score": 0.0024258721867522707, "phrase": "symbol_tallies"}, {"score": 0.002316788811533867, "phrase": "false_positive_probability"}, {"score": 0.002290291401956985, "phrase": "receiver_operating_characteristic_curves"}, {"score": 0.0022211005680689666, "phrase": "probability_distribution"}], "paper_keywords": ["Traitor tracing", " Tardos code", " collusion", " watermarking", " group testing"], "paper_abstract": "The topic of this paper is collusion resistant watermarking, also known as traitor tracing, in particular bias-based traitor tracing codes as introduced by Tardos. The past years have seen an ongoing effort to construct efficient high-performance decoders for these codes. In this paper we construct a score system from the Neyman-Pearson hypothesis test (which is known to be the most powerful test possible) into which we feed more evidence than in previous work, in particular the symbol tallies for all columns of the code matrix. As far as we know, until now simple decoders using Neyman-Pearson have taken into consideration only the codeword of a single user, namely the user under scrutiny. The Neyman-Pearson score needs as input the attack strategy of the colluders, which typically is not known to the tracer. We insert the interleaving attack, which plays a very special role in the theory of bias-based traitor tracing by virtue of being part of the asymptotic (i.e., large coalition size) saddle-point solution. The score system obtained in this way is universal: effective not only against the interleaving attack, but against all other attack strategies as well. Our score function for one user depends on the other users' codewords in a very simple way through the symbol tallies, which are easily computed. We present bounds on the false positive probability and show receiver operating characteristic curves obtained from simulations. We investigate the probability distribution of the score. Finally, we apply our construction to the area of (medical) group testing, which is related to traitor tracing.", "paper_title": "Tally-Based Simple Decoders for Traitor Tracing and Group Testing", "paper_id": "WOS:000353901400002"}