{"auto_keywords": [{"score": 0.048824896279579914, "phrase": "data_heterogeneity"}, {"score": 0.00481495049065317, "phrase": "information_integration"}, {"score": 0.004720043307726269, "phrase": "earth_models"}, {"score": 0.004642377903273107, "phrase": "major_difficulty"}, {"score": 0.004520750567829338, "phrase": "different_geologists'_views"}, {"score": 0.004286931271697226, "phrase": "geological_models"}, {"score": 0.004258563634666145, "phrase": "distinct_modeling_languages"}, {"score": 0.004024863549087511, "phrase": "geological_information"}, {"score": 0.003906357144047631, "phrase": "major_claim"}, {"score": 0.0035834075184488826, "phrase": "ontology"}, {"score": 0.0034545974376846687, "phrase": "different_choices"}, {"score": 0.003319569552937513, "phrase": "particular_set"}, {"score": 0.003264872488939969, "phrase": "large_number"}, {"score": 0.0030246125031350903, "phrase": "ontological_nature"}, {"score": 0.002974760986688745, "phrase": "geological_entity"}, {"score": 0.0029160193808720016, "phrase": "ontological_notions"}, {"score": 0.0027284410545226306, "phrase": "modeling_languages"}, {"score": 0.002318180580715058, "phrase": "good_models"}, {"score": 0.0022723746977318642, "phrase": "common_misuse"}, {"score": 0.0022573076362326114, "phrase": "hierarchical_and_partonomy_relationships"}, {"score": 0.0022053535889915914, "phrase": "current_available_representation_languages"}, {"score": 0.0021049977753042253, "phrase": "concrete_example"}], "paper_keywords": ["Information heterogeneity", " Geological data integration", " Ontology", " Foundational ontology", " Semantic interoperability"], "paper_abstract": "When building earth models, data heterogeneity is a major difficulty. Heterogeneity can be a consequence of different geologists' views or goals when capturing the data, or can be a result of representing the geological models through distinct modeling languages. We analyze here how each one of these causes affect the way in which the geological information is captured into models and systems. The major claim of this paper is that many problems related to these heterogeneities can be solved or at least simplified by analyzing the models through the view of Ontology. We assume that heterogeneity is originally related to the different choices that a geologist makes, when she/he decides to consider a particular set of qualities among the large number of qualities that are attached to the entities that she/he intends to model. Considering this, for deciding which attributes hold the ontological nature of a given category of geological entity, one can apply the ontological notions of identity, rigidity, essentiality and unity. This allows solving the difficulties due to the heterogeneity of modeling languages by identifying, among the many entities and properties considered by the geologists, those that are eligible for being mapped from one model to another, not considering the name that they bear or the format in which they are represented. This paper also discusses how to build good models for further integration, avoiding some common misuse of hierarchical and partonomy relationships, and the limitations of the current available representation languages. Finally, we examine as a case study the \" Petroleum system\", providing a concrete example for explaining how some issues related to data heterogeneity can be dealt with in practice.", "paper_title": "Ontological analysis for information integration in geomodeling", "paper_id": "WOS:000351444100003"}