{"auto_keywords": [{"score": 0.049623091759094524, "phrase": "pediatric_intensive_care_unit"}, {"score": 0.04445572579789276, "phrase": "drug_library"}, {"score": 0.00481495049065317, "phrase": "smart_pump_technology"}, {"score": 0.004575354958479747, "phrase": "cost_effectiveness"}, {"score": 0.0045317702763072445, "phrase": "smart_infusion_pump_technology"}, {"score": 0.004417554571046256, "phrase": "material_and_methods"}, {"score": 0.003950631096355195, "phrase": "data_processing_program_guardrails"}, {"score": 0.003838729434721053, "phrase": "intercepted_errors"}, {"score": 0.003694423910900128, "phrase": "adverse_effect"}, {"score": 0.003670906218443349, "phrase": "pae"}, {"score": 0.0035555237584957455, "phrase": "estimated_cost"}, {"score": 0.0035216195857272403, "phrase": "preventable_adverse_effect"}, {"score": 0.0033461647738159826, "phrase": "implementation_process"}, {"score": 0.0032100439293541085, "phrase": "study_period"}, {"score": 0.0028429935010577975, "phrase": "high_percentage"}, {"score": 0.0028068790615886755, "phrase": "safety_software"}, {"score": 0.0026584273498059295, "phrase": "potential_impact"}, {"score": 0.002599600404892265, "phrase": "clinical_judgment"}, {"score": 0.002493822186308091, "phrase": "ae"}, {"score": 0.002438581238635582, "phrase": "indirect_and_intangible_costs"}, {"score": 0.002187356046251648, "phrase": "potentially_serious_medication_errors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Smart pumps", " Cost-effectiveness", " Programming errors", " Safety", " Pediatric intensive care"], "paper_abstract": "Objective: To analyze the cost effectiveness of implementing smart infusion pump technology in a pediatric intensive care unit (PICU). Material and methods: An observational, prospective, intervention study with analytical components was carried out. A drug library was developed and integrated into the Carefusion Alaris Guardrails (R) infusion systems. A systematic analysis of all the data stored on the devices during use was performed by the data processing program Guardrails (R) CQI v4.1 Event Reporter. Intercepted errors were classified in terms of their potential severity and probability of causing an adverse effect (PAE) had they reached the patient. Knowing the estimated cost of a preventable adverse effect (AE), we analyzed costs saved and the profit/cost ratio resulting from the implementation process. Results: Compliance with the drug library was 92% and during the study period 92 infusion-related programming errors were intercepted, leading to a saving of 172,279 euros by preventing AEs. This means that 2.15 euros would be obtained for each euro invested in hiring a pharmacist to implement this technology. Discussion: The high percentage of use of safety software in our study compared to others allowed for the interception of 92 errors. The estimation of the potential impact of these errors is based on clinical judgment. The cost saved might be underestimated because the cost of an AE is usually higher in pediatrics, indirect and intangible costs were not considered and pharmacists involved do not spend the whole day on this task. Conclusions: Smart pumps have shown to be profitable in a PICU because they have the ability to intercept potentially serious medication errors and reduce costs associated with such errors. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Implementing smart pump technology in a pediatric intensive care unit: A cost-effective approach", "paper_id": "WOS:000329458600002"}