{"auto_keywords": [{"score": 0.048367234995737016, "phrase": "academic_performance"}, {"score": 0.015719716506582538, "phrase": "internet_literacy"}, {"score": 0.014627243569992574, "phrase": "internet_addiction_symptoms"}, {"score": 0.011527041213352235, "phrase": "sns"}, {"score": 0.00444439983637316, "phrase": "internet_activities"}, {"score": 0.004285489630701221, "phrase": "probability_sample"}, {"score": 0.004132237700479874, "phrase": "hong_kong"}, {"score": 0.0040873354289955605, "phrase": "face-to-face_interviews"}, {"score": 0.003998983496539902, "phrase": "adolescent_internet_addicts"}, {"score": 0.003898307690037192, "phrase": "low-income_families"}, {"score": 0.003704467870496114, "phrase": "multiple_resources"}, {"score": 0.0035459819741057836, "phrase": "social_networking_sites"}, {"score": 0.003481957226813911, "phrase": "online_games"}, {"score": 0.003260860308644701, "phrase": "-not_decreases"}, {"score": 0.0029444248503861167, "phrase": "internet_addiction"}, {"score": 0.0028183634079717136, "phrase": "leisure-oriented_internet_activities"}, {"score": 0.0026201089205321704, "phrase": "higher_subjects"}, {"score": 0.0025727581823022268, "phrase": "social-structural_literacy"}, {"score": 0.0024092539025697014, "phrase": "significant_predictors"}, {"score": 0.002272641094287882, "phrase": "different_information_resources"}, {"score": 0.002128169201317242, "phrase": "overall_grades"}, {"score": 0.0021049977753042253, "phrase": "academic_competence"}], "paper_keywords": ["academic performance", " adolescents and children", " Internet activities", " Internet addiction symptoms", " Internet literacy"], "paper_abstract": "This study examines the interrelationships among Internet literacy, Internet addiction symptoms, Internet activities, and academic performance. Data were gathered from a probability sample of 718 children and adolescents, aged 9-19, in Hong Kong, using face-to-face interviews. Regression results show that adolescent Internet addicts tended to be male, in low-income families, and not confident in locating, browsing, and accessing information from multiple resources, but that they were technologically savvy and frequent users of social networking sites (SNS) and online games for leisure. Contrary to what was hypothesized, Internet literacy, especially in publishing and technology, increases-not decreases-the likelihood of someone getting addicted to the Internet. As expected, Internet activities, especially SNS and online games, were significantly and positively linked to Internet addiction as well as to all Internet addiction symptoms. This finding suggests that leisure-oriented Internet activities can be much more addictive than other applications such as communicating by e-mail or browsing webpages. Furthermore, the higher subjects scored on tool and social-structural literacy, the better their academic performance would be; however, technical literacy skills, such as publishing and technology literacy, were not significant predictors for academic performance. This indicates that adolescents who can locate, browse, and access different information resources and who are knowledgable about the context under which the information was created performed better both in overall grades and in academic competence.", "paper_title": "Impact of Internet Literacy, Internet Addiction Symptoms, and Internet Activities on Academic Performance", "paper_id": "WOS:000309478100001"}