{"auto_keywords": [{"score": 0.04487700616034956, "phrase": "general_systemic_yoyo_model"}, {"score": 0.00481495049065317, "phrase": "systemic_yoyos"}, {"score": 0.0038749521906474593, "phrase": "calculus-based_methods"}, {"score": 0.003496994062890991, "phrase": "known_laboratory_observations"}, {"score": 0.0034550163444256386, "phrase": "relevant_studies"}, {"score": 0.003332072426367186, "phrase": "electromagnetic_theory"}, {"score": 0.003080449000295983, "phrase": "new_understandings"}, {"score": 0.002899861600151726, "phrase": "well-known_facts"}, {"score": 0.002600995957987461, "phrase": "general_systems"}, {"score": 0.002318799760022913, "phrase": "field_intensities"}, {"score": 0.0021565293818406554, "phrase": "yoyo_dipoles"}, {"score": 0.0021049977753042253, "phrase": "external_systems"}], "paper_keywords": ["Cybernetics", " Gaussian processes", " Flux", " Electromagnetism"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the structure of the fields of the general systemic yoyo model and how these fields interact with each other. Design/methodology/approach - Qualitative analysis and figurative reasoning, combined with calculus-based methods, are employed to enrich the analysis of how spinning yoyos interact with each other. Known laboratory observations in relevant studies, such as those in electromagnetic theory, are employed as the basis of the investigation, while brand new understandings of these observations are derived. Findings - Some well-known facts of magnetism are shown to hold true with the general systemic yoyo model. Originality/value - It is shown that general systems also satisfy such important properties of magnets and electricity as the following: like poles attract and opposite poles repel; field intensities can be superpositioned over each other; systems can potentially become yoyo dipoles when influenced by external systems; etc.", "paper_title": "The fields and their structures around systemic yoyos", "paper_id": "WOS:000277539100005"}