{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "generic_information_loss_measures"}, {"score": 0.015557955264077659, "phrase": "cluster-specific_ones"}, {"score": 0.004593591780245872, "phrase": "data_bases"}, {"score": 0.004405348628112645, "phrase": "original_data_file"}, {"score": 0.004314127287770832, "phrase": "new_file"}, {"score": 0.004202741104973709, "phrase": "data_respondents"}, {"score": 0.0041589926969138585, "phrase": "information_loss_measures"}, {"score": 0.003946960862020283, "phrase": "masked_file"}, {"score": 0.0038651944848734133, "phrase": "corresponding_original_file"}, {"score": 0.0035176353680157367, "phrase": "intended_data_use"}, {"score": 0.003373334961160647, "phrase": "standard_measures"}, {"score": 0.002450602177683068, "phrase": "original_data"}, {"score": 0.0022772115643656153, "phrase": "extensive_comparison"}, {"score": 0.0021609076467365247, "phrase": "generic_measures"}, {"score": 0.0021049977753042253, "phrase": "information_loss"}], "paper_keywords": [""], "paper_abstract": "Masking methods are to protect data bases prior to their public release. They mask an original data file so that the new file ensures the privacy of data respondents. Information loss measures have been developed to evaluate in which extent the masked file diverges from the corresponding original file, and in what extent the same analyses on both files lead to the same results. Generic information loss measures ignore the intended data use of the file. These are the standard measures when data has to be released (e.g. published in the web) and there is no control on what kind of analyses users would perform. In this paper we study generic information loss measures, and we compare such measures with respect to cluster-specific ones. That is, measures specifically defined for the case in which the user will do clustering with the original data. To do so, we define such measures and then we do an extensive comparison of the two measures. The paper shows that the generic measures can cope with the information loss related to clustering.", "paper_title": "On the comparison of generic information loss measures and cluster-specific ones", "paper_id": "WOS:000256307600008"}