{"auto_keywords": [{"score": 0.04376620559471428, "phrase": "pl"}, {"score": 0.015521219797325727, "phrase": "electronic_health_records"}, {"score": 0.01336661928911105, "phrase": "meaningful_use"}, {"score": 0.011362355620841822, "phrase": "general_sct_concepts"}, {"score": 0.010826709573395443, "phrase": "primitive_concepts"}, {"score": 0.010689950720405544, "phrase": "modeling_errors"}, {"score": 0.009779339033721867, "phrase": "pl_concepts"}, {"score": 0.00880991496533284, "phrase": "structural_indicator"}, {"score": 0.00481495049065317, "phrase": "snomed_problem_list_concepts"}, {"score": 0.0045982799222088235, "phrase": "usa's_standard"}, {"score": 0.004574812666721017, "phrase": "encoding_diagnoses"}, {"score": 0.004551464628410896, "phrase": "problem_lists"}, {"score": 0.00436890075128947, "phrase": "\"sct_clinical_observations_recording"}, {"score": 0.004302335022969018, "phrase": "\"veterans_health_administration_and_kaiser_permanente\"_problem_lists"}, {"score": 0.003933703160581259, "phrase": "sct"}, {"score": 0.003624239237602897, "phrase": "sct_concepts"}, {"score": 0.003196767658539796, "phrase": "simple_structural_indicator"}, {"score": 0.003092050325032172, "phrase": "high_likelihood_inconsistencies"}, {"score": 0.003076246334234077, "phrase": "hierarchical_relationships"}, {"score": 0.0029001870731706113, "phrase": "respective_sct_hierarchies"}, {"score": 0.0028632631982186915, "phrase": "quality_measure"}, {"score": 0.0027411931329252614, "phrase": "pl_sample"}, {"score": 0.0027062880030675014, "phrase": "control_sample"}, {"score": 0.00256446225384403, "phrase": "higher_likelihood"}, {"score": 0.0025188541214907685, "phrase": "absolute_number"}, {"score": 0.002344371143603623, "phrase": "chi-squared_analyses"}, {"score": 0.0022559132878182155, "phrase": "slightly_lesser_extent"}, {"score": 0.0021212558813405356, "phrase": "potentially_problematic_concepts"}, {"score": 0.0021049977753042253, "phrase": "qa_efforts"}], "paper_keywords": ["SNOMED CT", " Problem list", " Electronic Health Record", " Meaningful use", " Quality assurance"], "paper_abstract": "Objective: By 2015, SNOMED CT (SCT) will become the USA's standard for encoding diagnoses and problem lists in electronic health records (EHRs). To facilitate this effort, the National Library of Medicine has published the \"SCT Clinical Observations Recording and Encoding\" and the \"Veterans Health Administration and Kaiser Permanente\" problem lists (collectively, the \"PL\"). The PL is studied in regard to its readiness to support meaningful use of EHRs. In particular, we wish to determine if inconsistencies appearing in SCT, in general, occur as frequently in the PL, and whether further quality-assurance (QA) efforts on the PL are required. Methods and materials: A study is conducted where two random samples of SCT concepts are compared. The first consists of concepts strictly from the PL and the second contains general SCT concepts distributed proportionally to the PL's in terms of their hierarchies. Each sample is analyzed for its percentage of primitive concepts and for frequency of modeling errors of various severity levels as quality measures. A simple structural indicator, namely, the number of parents, is suggested to locate high likelihood inconsistencies in hierarchical relationships. The effectiveness of this indicator is evaluated. Results: PL concepts are found to be slightly better than other concepts in the respective SCT hierarchies with regards to the quality measure of the percentage of primitive concepts and the frequency of modeling errors. There were 58% primitive concepts in the PL sample versus 62% in the control sample. The structural indicator of number of parents is shown to be statistically significant in its ability to identify concepts having a higher likelihood of inconsistencies in their hierarchical relationships. The absolute number of errors in the group of concepts having 1-3 parents was shown to be significantly lower than that for concepts with 4-6 parents and those with 7 or more parents based on Chi-squared analyses. Conclusion: PL concepts suffer from the same issues as general SCT concepts, although to a slightly lesser extent, and do require further QA efforts to promote meaningful use of EHRs. To support such efforts, a structural indicator is shown to effectively ferret out potentially problematic concepts where those QA efforts should be focused. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "The readiness of SNOMED problem list concepts for meaningful use of electronic health records", "paper_id": "WOS:000320351800001"}