{"auto_keywords": [{"score": 0.03992659287798476, "phrase": "linear_straight-line_context-free_tree_grammar"}, {"score": 0.00481495049065317, "phrase": "grammar-compressed_trees"}, {"score": 0.004581505405526037, "phrase": "linear_straight-line_context-free_tree_grammars"}, {"score": 0.004441359373498799, "phrase": "straight-line_context-free_string_grammars"}, {"score": 0.004071249707923223, "phrase": "compressed_structures"}, {"score": 0.003996027647611435, "phrase": "prior_decompression"}, {"score": 0.0034206776096452015, "phrase": "tree_grammar"}, {"score": 0.003115908199991072, "phrase": "polynomial_time_algorithms"}, {"score": 0.0025059724686541263, "phrase": "tree_grammars"}, {"score": 0.002226357953581725, "phrase": "exponential_blow-up"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Straight-line programs", " Tree compression", " Tree automata", " Context-free tree grammars"], "paper_abstract": "Trees can be conveniently compressed with linear straight-line context-free tree grammars. Such grammars generalize straight-line context-free string grammars which are widely used in the development of algorithms that execute directly on compressed structures (without prior decompression). It is shown that every linear straight-line context-free tree grammar can be transformed in polynomial time into a monadic (and linear) one. A tree grammar is monadic if each nonterminal uses at most one context parameter. Based on this result, polynomial time algorithms are presented for testing whether a given (i) nondeterministic tree automaton or (ii) nondeterministic tree automaton with sibling-constraints or (iii) nondeterministic tree walking automaton, accepts a tree represented by a linear straight-line context-free tree grammar. It is also shown that if tree grammars are nondeterministic or non-linear, then reducing their numbers of parameters cannot be done without an exponential blow-up in grammar size. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Parameter reduction and automata evaluation for grammar-compressed trees", "paper_id": "WOS:000305312300024"}