{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "domain_knowledge"}, {"score": 0.006927376927823112, "phrase": "elicitation_process"}, {"score": 0.0046192222897398685, "phrase": "requirements_elicitation"}, {"score": 0.004567230180529598, "phrase": "first_activity"}, {"score": 0.0045158206186680224, "phrase": "requirements_engineering_process"}, {"score": 0.0042351951710402425, "phrase": "developed_system"}, {"score": 0.004047628461126961, "phrase": "different_stakeholders"}, {"score": 0.0037109446302945903, "phrase": "positive_effects"}, {"score": 0.0036830211726031946, "phrase": "requirements_engineering_processes"}, {"score": 0.003415047118340286, "phrase": "minor_extent"}, {"score": 0.0033765627434550432, "phrase": "negative_effects"}, {"score": 0.003251376167695528, "phrase": "empirical_study"}, {"score": 0.0032026066791743866, "phrase": "perceived_and_actual_effects_of_prior_domain_knowledge_on_requirements_elicitation"}, {"score": 0.0025819015229390663, "phrase": "actual_effect"}, {"score": 0.0023313149689465386, "phrase": "analysis_teams"}, {"score": 0.002287646331988365, "phrase": "different_contributions"}, {"score": 0.0022194677375148063, "phrase": "different_levels"}, {"score": 0.0021861425611350857, "phrase": "requirements_analysis_teams"}, {"score": 0.0021049977753042253, "phrase": "heterogeneous_teams"}], "paper_keywords": ["Requirements elicitation", " Interview", " Domain knowledge", " Empirical study"], "paper_abstract": "Requirements elicitation is the first activity in the requirements engineering process. It includes learning, surfacing, and discovering the requirements of the stakeholders of the developed system. Various elicitation techniques exist to help analysts elicit the requirements from the different stakeholders; the most commonly used technique is the interview. Analysts may have domain knowledge prior to the elicitation process. Such knowledge is commonly assumed to have positive effects on requirements engineering processes, in that it fosters communication, and a mutual understanding of the needs. However, to a minor extent, some negative effects have also been reported. This paper presents an empirical study in which the perceived and actual effects of prior domain knowledge on requirements elicitation via interviews were examined. The results indicate that domain knowledge affects elicitation via interview in two main aspects: communication with the customers and understanding their needs. The findings provide insights as to both the positive and negative effects of domain knowledge on requirements elicitation via interview, as perceived by participants with and without domain knowledge, and show the existence of an actual effect on the course of the interviews. Furthermore, these insights can be utilized in practice to support analysts in the elicitation process and to form requirements analysis teams. They highlight the different contributions that can be provided by analysts with different levels of domain knowledge in requirements analysis teams and the synergy that can be gained by forming heterogeneous teams of analysts.", "paper_title": "The role of domain knowledge in requirements elicitation via interviews: an exploratory study", "paper_id": "WOS:000336054400002"}