{"auto_keywords": [{"score": 0.04571345706034806, "phrase": "edge_clique"}, {"score": 0.04097400628137601, "phrase": "fixed-parameter_tractability"}, {"score": 0.039434146520232694, "phrase": "fuzzy_graphs"}, {"score": 0.014493208165046338, "phrase": "editing_cost"}, {"score": 0.00984795043710622, "phrase": "minimum_number"}, {"score": 0.00966798936588726, "phrase": "undecided_edges"}, {"score": 0.00481495049065317, "phrase": "partial_information"}, {"score": 0.004776853267973129, "phrase": "correlation_clustering_problem"}, {"score": 0.004701556483912018, "phrase": "cluster_editing_problem"}, {"score": 0.004494570360108983, "phrase": "vertex-disjoint_cliques"}, {"score": 0.004365498117804683, "phrase": "partitioning_problem"}, {"score": 0.0042513652732187115, "phrase": "edge-disjoint_cliques"}, {"score": 0.004064945482996471, "phrase": "np"}, {"score": 0.0037139103792217143, "phrase": "input_graphs"}, {"score": 0.003503497128638099, "phrase": "input_graph"}, {"score": 0.0034299649219748513, "phrase": "correlation_clustering"}, {"score": 0.003270092550315648, "phrase": "parameterized_algorithms"}, {"score": 0.0028715299874549245, "phrase": "polynomial-time_reduction"}, {"score": 0.002766825211876417, "phrase": "analogous_result"}, {"score": 0.002468450551616404, "phrase": "polynomial-time_kernelization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graphs", " Parameterized algorithms", " Cluster editing", " Kernels"], "paper_abstract": "The CORRELATION CLUSTERING problem, also known as the CLUSTER EDITING problem, seeks to edit a given graph by adding and deleting edges to obtain a collection of vertex-disjoint cliques, such that the editing cost is minimized. The EDGE CLIQUE PARTITIONING problem seeks to partition the edges of a given graph into edge-disjoint cliques, such that the number of cliques is minimized. Both problems are known to be NP-hard, and they have been previously studied with respect to approximation and fixed-parameter tractability. In this paper we study these two problems in a more general setting that we term fuzzy graphs, where the input graphs may have missing information, meaning that whether or not there is an edge between some pairs of vertices of the input graph can be undecided. For fuzzy graphs the CORRELATION CLUSTERING and EDGE CLIQUE PARTITIONING problems have previously been studied only with respect to approximation. Here we give parameterized algorithms based on kernelization for both problems. We prove that the CORRELATION CLUSTERING problem is fixed-parameter tractable on fuzzy graphs when parameterized by (k, r), where k is the editing cost and r is the minimum number of vertices required to cover the undecided edges. In particular we show that it has a polynomial-time reduction to a problem kernel on O(k(2) + r) vertices. We provide an analogous result for the EDGE CLIQUE PARTITIONING problem on fuzzy graphs. Using (k, r) as parameters, where k bounds the size of the partition, and r is the minimum number of vertices required to cover the undecided edges, we describe a polynomial-time kernelization to a problem kernel on O(k(4).3(r)) vertices. This implies fixed-parameter tractability for this parameterization. Furthermore we also show that parameterizing only by the number of cliques k, is not enough to obtain fixed-parameter tractability. The problem remains, in fact, NP-hard for each fixed k > 2. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Clustering with partial information", "paper_id": "WOS:000274886700023"}