{"auto_keywords": [{"score": 0.04862717445897774, "phrase": "spatiotemporal_entities"}, {"score": 0.00481495049065317, "phrase": "formal_theories"}, {"score": 0.004504193207111593, "phrase": "important_advances"}, {"score": 0.004390060342250211, "phrase": "natural_language"}, {"score": 0.0043452175611323335, "phrase": "naive_geography"}, {"score": 0.004300830853119242, "phrase": "computer_vision"}, {"score": 0.00421340730888561, "phrase": "broad_range"}, {"score": 0.0037632749713937637, "phrase": "unsolvable_problems"}, {"score": 0.0036490529923833884, "phrase": "representation_space"}, {"score": 0.002585906251354904, "phrase": "previous_studies"}, {"score": 0.002193447487477984, "phrase": "alternative_theory"}, {"score": 0.0021049977753042253, "phrase": "new_mathematical_tools"}], "paper_keywords": ["boundary", " contact", " continuity", " mereotopology", " locology"], "paper_abstract": "Mereotopology is a class of formal theories devoted to the analysis of spatiotemporal entities and their interactions. It has produced important advances in the analysis of natural language, naive geography and computer vision, illustrating a broad range of applications. However, it has been shown that the modelling of interactions between spatiotemporal entities with mereotopology can lead to unsolvable problems, including disconnectedness of the representation space as well as a mix-up of the relationships of contact and overlap. The origin of these problems, which fundamentally limit the usefulness of mereotopology, has not been fully identified. In this paper, we first formally demonstrate that these problems originate from the incompatibility of the concepts of boundary, continuity and contact within the framework of mereotopology, as suggested by previous studies. Secondly, we prove that this incompatibility stems from the formalization of these concepts through topology. We show that a solution can be found by substituting for topology an alternative theory, known as locology, which provides new mathematical tools for the modelling of spatiotemporal entities.", "paper_title": "A new approach to the concepts of boundary and contact: Toward an alternative to mereotopology", "paper_id": "WOS:000248645300002"}