{"auto_keywords": [{"score": 0.0367698002611785, "phrase": "unlabeled_data"}, {"score": 0.018668889680174036, "phrase": "sa-ssccm"}, {"score": 0.017780413978849392, "phrase": "ssccm"}, {"score": 0.00481495049065317, "phrase": "semi-supervised_classification_learning"}, {"score": 0.004680851157467745, "phrase": "semi-supervised_classification_methods"}, {"score": 0.004439354841093929, "phrase": "real_applications"}, {"score": 0.004397434604967695, "phrase": "ls-svm"}, {"score": 0.004285289574869884, "phrase": "safe_semi-supervised_classification_method"}, {"score": 0.004180622964109706, "phrase": "supervised_counterparts"}, {"score": 0.0039648318122148555, "phrase": "safe_semi"}, {"score": 0.0037336520904376687, "phrase": "safety-control_mechanism"}, {"score": 0.003629557750546267, "phrase": "adaptive_tradeoff"}, {"score": 0.0033698643928647726, "phrase": "classification_method"}, {"score": 0.003334309053314909, "phrase": "class_memberships"}, {"score": 0.003241312187060814, "phrase": "safety-aware_ssccm"}, {"score": 0.002219790619936024, "phrase": "alternating_iterative_strategy"}, {"score": 0.0021885820862000962, "phrase": "iteration_convergence"}, {"score": 0.0021049977753042253, "phrase": "promising_performance"}], "paper_keywords": ["Alternating iterative strategy", " least-square support vector machine (LS-SVM)", " semi-supervised classification", " semi-supervised classification based on class memberships (SSCCM)"], "paper_abstract": "Though semi-supervised classification learning has attracted great attention over past decades, semi-supervised classification methods may show worse performance than their supervised counterparts in some cases, consequently reducing their confidence in real applications. Naturally, it is desired to develop a safe semi-supervised classification method that never performs worse than the supervised counterparts. However, to the best of our knowledge, few researches have been devoted to safe semi-supervised classification. To address this problem, in this paper, we invent a safety-control mechanism for safe semi-supervised classification by adaptive tradeoff between semi-supervised and supervised classification in terms of unlabeled data. In implementation, based on our recent semi-supervised classification method based on class memberships (SSCCM), we develop a safety-aware SSCCM (SA-SSCCM). SA-SSCCM, on the one hand, exploits the unlabeled data to help learning (as SSCCM does) under the assumption that unlabeled data can help learning, and on the other hand, restricts its prediction to approach that of its supervised counterpart least-square support vector machine (LS-SVM) under the assumption that unlabeled data can hurt learning. Therefore, prediction by SA-SSCCM becomes a tradeoff between those by semi-supervised SSCCM and supervised LS-SVM, respectively, in terms of the unlabeled data. As in SSCCM, the optimization problem in SA-SSCCM can be efficiently solved by the alternating iterative strategy, and the iteration convergence can theoretically be guaranteed. Experiments over several real datasets show the promising performance of SA-SSCCM compared with LS-SVM, SSCCM, and off-the-shelf safe semi-supervised classification methods.", "paper_title": "Safety-Aware Semi-Supervised Classification", "paper_id": "WOS:000325981800005"}