{"auto_keywords": [{"score": 0.043088061205824806, "phrase": "libraryfind"}, {"score": 0.02842188081222247, "phrase": "search_engines"}, {"score": 0.00481495049065317, "phrase": "academic_metasearch_system"}, {"score": 0.004748740786945996, "phrase": "off-the-shelf_search_technology"}, {"score": 0.0045765783794477505, "phrase": "library_resources"}, {"score": 0.004309968592440261, "phrase": "academic_library_setting"}, {"score": 0.003947884118204803, "phrase": "usability_experiment"}, {"score": 0.0038577428353448596, "phrase": "osu_libraries_web"}, {"score": 0.0037872783514857535, "phrase": "google"}, {"score": 0.003616108223034427, "phrase": "controlled_setting"}, {"score": 0.003389557201018519, "phrase": "search_system"}, {"score": 0.0030056887638095883, "phrase": "qualitative_and_quantitative_analysis"}, {"score": 0.00288317238346065, "phrase": "commercial_web_search_engines"}, {"score": 0.002843450389745497, "phrase": "important_factor"}, {"score": 0.0026284507395498897, "phrase": "similar_performance"}, {"score": 0.002418453525649304, "phrase": "spell_checker"}, {"score": 0.0021843879253500894, "phrase": "participants'_prior_experience"}, {"score": 0.002164264600379492, "phrase": "academic_search_systems"}, {"score": 0.0021049977753042253, "phrase": "new_system"}], "paper_keywords": [""], "paper_abstract": "Using off-the-shelf search technology provides a single point of access into library resources, but we found that such commercial systems are not entirely satisfactory for the academic library setting. In response to this, Oregon State University (OSU) Libraries designed and deployed LibraryFind, a metasearch system. We conducted a usability experiment comparing LibraryFind, the OSU Libraries Web site, and Google Scholar. Each participant used all three search systems in a controlled setting, and we recorded their behavior to determine the effectiveness and efficiency of each search system. In this article, we focus on understanding what factors are important to undergraduates in choosing their primary academic search system for class assignments. Based on a qualitative and quantitative analysis of the results, we found that mimicking commercial Web search engines is an important factor to attract undergraduates; however, when undergraduates use these kinds of search engines, they expect similar performance to Web search engines, including factors such as relevance, speed, and the availability of a spell checker. They also expected to be able to find out what kinds of content and materials are available in a system. Participants' prior experience using academic search systems also affected their expectations of a new system.", "paper_title": "LibraryFind: System design and usability testing of academic metasearch system", "paper_id": "WOS:000252821600003"}