{"auto_keywords": [{"score": 0.04866418815051641, "phrase": "key_developers"}, {"score": 0.006195783612412172, "phrase": "technical_core"}, {"score": 0.00481495049065317, "phrase": "evolving_the_system's_core"}, {"score": 0.0046472613070408795, "phrase": "apache_ant._software_systems"}, {"score": 0.0045968436745655004, "phrase": "limited_number"}, {"score": 0.004571839402666666, "phrase": "important_classes"}, {"score": 0.004534586620266173, "phrase": "large_number"}, {"score": 0.0043766186644841575, "phrase": "software_system"}, {"score": 0.004224130367280183, "phrase": "inappropriate_changes"}, {"score": 0.004166900000605202, "phrase": "ripple_effects"}, {"score": 0.004043696733749226, "phrase": "open_source_software"}, {"score": 0.003924121879214595, "phrase": "small_set"}, {"score": 0.0035763463424188457, "phrase": "longevity_likelihood"}, {"score": 0.003423487658905686, "phrase": "social_skills"}, {"score": 0.0032950876643710087, "phrase": "case_study"}, {"score": 0.0032682040993565675, "phrase": "apache_ant_project"}, {"score": 0.0029540781456015215, "phrase": "main_target"}, {"score": 0.002906055228525945, "phrase": "communication_networks"}, {"score": 0.002882336475814422, "phrase": "list_data"}, {"score": 0.002641039622371712, "phrase": "almost_everyone"}, {"score": 0.002507414655298049, "phrase": "mailing_list"}, {"score": 0.0024733853322652637, "phrase": "key_developers'_contributions"}, {"score": 0.002335421238406041, "phrase": "peripheral_portions"}, {"score": 0.0022111720236287547, "phrase": "top_committers"}, {"score": 0.0021456694236935783, "phrase": "key_developers'_profiles"}, {"score": 0.0021049977753042253, "phrase": "contribution_characteristics"}], "paper_keywords": ["Key developers", " core developers", " free/libre open source software", " socio-technical analysis", " mining software repositories", " case study", " apache ant"], "paper_abstract": "Software systems usually include a limited number of important classes that a large number of other classes depend upon. These files comprise the technical core of a software system. Evolving this core is naturally difficult and requires caution, since inappropriate changes may induce side and ripple effects. Indeed, despite the rhetoric about openness in free/libre open source software, modifications to the technical core are usually accomplished by a small set of contributors known as key developers. Automatically identifying key developers is relevant for a number of reasons, such as supporting the recruitment of specialists, assigning tutors to newcomers, and estimating the longevity likelihood of projects. Moreover, little is known about how key developers evolve and about the social skills that support them in their technical tasks. In this paper, we describe a case study involving the Apache Ant project. Our goal was to identify key developers and characterize them in terms of their social activity and contributions. We conceived, implemented, and applied a method to identify key developers. Such method identified four individuals, who were the main target of our investigation. We built communication networks from mailing list data and a coordination requirements network from their development traces. The analysis of these two networks indicated that three key developers socialized more than the others. They acted as bridges connecting other developers and communicated with almost everyone they were supposed to. The other key developer showed a very distinct behavior, as he participated very rarely in the mailing list. We also analyzed key developers' contributions and found some patterns. Core commits and non-core commits were often interleaved and key developers also contributed to peripheral portions of the system. Finally, we observed that the set of key developers was indistinguishable from the set of top committers. We expect this characterization to foster the definition of key developers' profiles that take into account their social activities and contribution characteristics.", "paper_title": "EVOLVING THE SYSTEM'S CORE: A CASE STUDY ON THE IDENTIFICATION AND CHARACTERIZATION OF KEY DEVELOPERS IN APACHE ANT", "paper_id": "WOS:000362929500007"}