{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "managerial_web-based_facilitation"}, {"score": 0.004424768776701965, "phrase": "complex_and_dynamic_arrangements"}, {"score": 0.004342430078306461, "phrase": "potential_and_actual_knowledge_sharing"}, {"score": 0.003771631577951067, "phrase": "affirmative_managerial_action"}, {"score": 0.0036667768092524576, "phrase": "necessary_collection"}, {"score": 0.003038237581227068, "phrase": "organizational_agreement"}, {"score": 0.0025892330566358503, "phrase": "challenging_and_pervasive_market_conditions"}, {"score": 0.002447101794397243, "phrase": "network_formulation"}, {"score": 0.0023346234464901978, "phrase": "empirical_analyses"}, {"score": 0.0022273034991008326, "phrase": "automobile_distributors"}, {"score": 0.0021652891317252994, "phrase": "large_usa_city"}], "paper_keywords": ["knowledge", " sharing", " web", " facilitation"], "paper_abstract": "The research in this paper considers the complex and dynamic arrangements for potential and actual knowledge sharing in interorganizational networks. The essence of this stance is that knowledge relates to affirmative managerial action beyond the necessary collection of information facilitated through technology. The issue is to determine the nature and extent of the degree of organizational agreement that may be achieved as competitors either cooperate or continue to compete in the face of challenging and pervasive market conditions. The theory relating to network formulation is reviewed, findings from empirical analyses from the experiences from automobile distributors in a large USA city, and one scientific collaborators network are presented. A framework is proposed identifying the factors necessary to initially construct the network and then to further sustain it over time. A number of lessons learned are developed, which are believed to be of value to researchers and practitioners engaged in these processes.", "paper_title": "Constructing and Sustaining Competitive Interorganizational Knowledge Networks: An Analysis of Managerial Web-Based Facilitation", "paper_id": "WOS:000260459000007"}