{"auto_keywords": [{"score": 0.024811089589810934, "phrase": "uav"}, {"score": 0.010989284009043114, "phrase": "nbo"}, {"score": 0.00481495049065317, "phrase": "decentralized_guidance_control_of"}, {"score": 0.004764859786310636, "phrase": "explicit_optimization"}, {"score": 0.00464998919563789, "phrase": "decentralized_guidance_control_method"}, {"score": 0.0046176782475198085, "phrase": "autonomous_unmanned_aerial_vehicles"}, {"score": 0.004537875262684779, "phrase": "multiple_targets"}, {"score": 0.004459445258869177, "phrase": "guidance_control_problem"}, {"score": 0.004413036532585712, "phrase": "decentralized_partially_observable_markov_decision_process"}, {"score": 0.0042617859335771615, "phrase": "partially_observable_markov_decision_process"}, {"score": 0.003988487841970088, "phrase": "pomdp_approximation_method"}, {"score": 0.0036553070575015344, "phrase": "objective_function"}, {"score": 0.003444732262403694, "phrase": "network_level"}, {"score": 0.0033969686698961743, "phrase": "kinematic_control_commands"}, {"score": 0.002842840150239715, "phrase": "empirical_study"}, {"score": 0.0027741761880779535, "phrase": "performance_metrics"}, {"score": 0.0027452574218375593, "phrase": "scalar_parameter"}, {"score": 0.0027166392914444023, "phrase": "nbo_method"}, {"score": 0.0024807547991927137, "phrase": "greedy_approach"}, {"score": 0.0021646872269755067, "phrase": "fixed_communication_scheme"}], "paper_keywords": ["Decentralized partially observable Markov decision process", " UAV guidance control", " Decentralized control", " Target tracking"], "paper_abstract": "We design a decentralized guidance control method for autonomous unmanned aerial vehicles (UAVs) tracking multiple targets. We formulate this guidance control problem as a decentralized partially observable Markov decision process (Dec-POMDP). As in the case of partially observable Markov decision process (POMDP), it is intractable to solve a Dec-POMDP exactly. So, we extend a POMDP approximation method called nominal belief-state optimization (NBO) to solve our control problem posed as a Dec-POMDP. We incorporate the cost of communication into the objective function of the Dec-POMDP, i.e., we explicitly optimize the communication among the UAVs at the network level along with the kinematic control commands for the UAVs. We measure the performance of our method with the following metrics: 1) average target-location error, and 2) average communication cost. The goal to maximize the performance with respect to each of the above metrics conflict with each other, and we show through empirical study how to trade off between these performance metrics using a scalar parameter. The NBO method induces coordination among the UAVs even though the system is decentralized. To demonstrate the effectiveness of this coordination, we compare our Dec-POMDP approach with a greedy approach (a noncooperative approach), where the UAVs do not communicate with each other and each UAV optimizes only its local kinematic controls. Furthermore, we compare the performance of our approach of optimizing the communication between the UAVs with a fixed communication scheme-where only the UAV kinematic controls are optimized with an underlying fixed (non-optimized) communication scheme.", "paper_title": "Decentralized Guidance Control of UAVs with Explicit Optimization of Communication", "paper_id": "WOS:000329629400052"}