{"auto_keywords": [{"score": 0.038521130357784865, "phrase": "search_agent"}, {"score": 0.012313182328817755, "phrase": "n_search_agents"}, {"score": 0.007871680269152626, "phrase": "search_agents"}, {"score": 0.00481495049065317, "phrase": "big_networks"}, {"score": 0.004089556946377719, "phrase": "general_setting"}, {"score": 0.004021954624114115, "phrase": "average_amount"}, {"score": 0.0038513524381387364, "phrase": "infinitely_large_search_space"}, {"score": 0.0032489004068215407, "phrase": "mild_conditions"}, {"score": 0.0029394074636168435, "phrase": "search_space"}, {"score": 0.002842920225545139, "phrase": "average_search_time"}, {"score": 0.0028145947051539354, "phrase": "average_energy"}, {"score": 0.0025806029313384504, "phrase": "search_time"}, {"score": 0.0024545413637350765, "phrase": "approximate_formula"}, {"score": 0.00216923754570397, "phrase": "data_object"}], "paper_keywords": [""], "paper_abstract": "Searching the Internet for some object characterized by its attributes in the form of data, such as a hotel in a certain city whose price is lower than some amount, is one of our most common activities when we access the web. We discuss this problem in a general setting, and compute the average amount of time and energy it takes to find an object in an infinitely large search space. We consider the use of N search agents that act concurrently in both the case where the search agent knows which way it needs to go to find the object, and the case where the search agent is completely ignorant and may even head away from the object being sought. We show that under mild conditions regarding the randomness of the search and the use of a time-out, the search agent will always find the object in spite of the fact that the search space is infinite. We obtain a formula for the average search time and the average energy expended by N search agents acting concurrently and independent of each other. We see that the time-out itself can be used to minimize the search time and the amount of energy that is consumed to find an object. An approximate formula is derived for the number of search agents that can help us guarantee that an object is found in a given time, and we discuss how the competition between search agents and other agents that try to hide the data object can be used by opposing parties to guarantee their own success.", "paper_title": "Search in the Universe of Big Networks and Data", "paper_id": "WOS:000345579100005"}